[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Guys is this genuine? Like seriously 1 rupees? ",
  "likely a phishing page, open a new tab type \"store.lenovo.com\" manually and make sure it's still in your cart there",
  "Proceed with caution. For that price, I'd say to just go ahead and buy it and see what happens, considering you're on [store.lenovo.com](http://store.lenovo.com), but I'm still very suspicious about it. There's no reason they'd actually sell anything for that price, unless it was a mistake on the website. However, if it is a mistake and it lets you place the order, it's possible that they might still honor the purchase and just eat the loss as a result of their mistake and still send it to you. It looks like the actual Lenovo website. Look closely at the URL, and type in the Lenovo website URL manually and navigate there directly to make sure you're at the right place. If you still see it there, maybe try and see if it lets you order.",
  "Try and find . Pay 1 rupee",
  "If this is real some intern finna be fired",
  "Could be an accident. \n\nI found an issue on HPs website once and got some accessory stuff for Penny's on the dollar.",
  "Already seen that on the Lenovo Page. They released a new device and instead of 2000€ it said 200€ the Order got canceled. Might be mistakes or Intention to get intention",
  "Looks like a scam",
  "Whenever I Google the Indian version of Lenovo's website, it takes me to lenovo.com/in/.\n\nFeels like a scam. If you have a prepaid debit/credit card, it may be worth trying. I wouldn't give any information linked to my bank if I were you.",
  "I have orderd 2 of them at 2 rupees , lets see what happens,  haha",
  "Show us the whole url.\n\nIf that's phishing, all they needed were your payment credentials.",
  "Well Rupees are a fictional currency from The Legend of Zelda video game series so I’d say it isn’t genuine.",
  "Next time just order it and don't post it on places like this",
  "they brought the store down since",
  "Do you think it can be true?",
  "Happened to me. Threatened them with commerce commission and they gave it to me",
  "Its a phishing site, just went to it myself, its pure fishy. Also look at the copyright in the bottom",
  "Just got a new pc! For some reason, every time I try to launch steam, it keeps giving me the error message \"Glory to the CCP.\" Any fixes?",
  "Go for it, the worst that can happen is you lose 1 rupee, the best outcome, you effectively get a free laptop, just make sure to use a single use card number (like zip pay single use card, or something similar)",
  "Use a throw away card from Walmart",
  "Check the website, yours might be fake.",
  "Make sure it's the actual site 1st and not just some phishing website to take your credentials and payment information",
  "How?\n\n**Edit:** I found the same bug. Placed an order. Few minutes later some guys from the store called and said they cannot sell it for ₹1 and cancelled the order.",
  "1 rupee and you still asking \"is this genuine\" how old are u boy?",
  "i think OP has done inspect element   \nhe just wanted some attention",
  "This is a scam for sure  it’s just a copy site and it’s even in html 🙃\n\nOfficial site : https://www.lenovo.com/in/en/laptops/",
  "Guys here is the url \nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Run it with PayPal and just see",
  "Bhai 2 4 mere liye karde paise deta mein",
  "Buy 2.",
  "Tip\nIf its too good to be true, its fucking scam.",
  "try to trace and get the complete URL and look for signs the website might be a phishing site.\n\nor you just found a pricing error and started chaos",
  "Checked. Website is genuine, having Google sign in option as well. The item looks like a wrong entry.. They will correct it and cancel orders before shipping.",
  "I haven't seen any malware that attacks android phones and modify the webpage content / hosts file to redirect you to a phishing page. Looks like a real website, but the pricing is definitely a glitch, which they would either honor it as another redditor mentioned, or cancel the order if you place it. Yet - the company has all rights to cancel an order at anytime and refund you the money. \n\n  \nI'd go for it and see what happens if I were you, no harm in losing a rupee. Virtual cards are best, I remember SBI had this feature at least 10 years ago but not sure now. Proceed with due diligence.",
  "It's only 1 ruppee... Plus shipping maybe? Not the worse scam I've ever seen. Because that's barely a profit",
  "Try and see if it actually arrives",
  "Make a rando paypal, add one dulla to it, disconnect your all your stuff form it, buy.",
  "It is just a glitch, but with a credit card and make sure they charge 1 r",
  "I'll take 8000. I can't figure out how to get the page OP is on though.",
  "hold on i gotta place that order",
  "Scam Alert ❗❗❗",
  "Why is that website so sketchy?  Visiting from the US and it still gives me info as if I'm in India?",
  "First you should paste the link so that other users go try it out. \nSecond you buy it and choose the shipping method as STORE PICKUP. \nLastly DON'T GIVE ANY BANK DETAILS EVEN IT'S FREE (they surely want consumers to prepay it).",
  "Not too sure but could of just been a fuck up on their end when pricing. Had it happen a few times on websites, once at JD sports with some AF1 marked down to $20 instead of $200 but they ended up refunding everyone lol and once with a skate deck that was FREE, again they just emailed me saying lol no 😂",
  "Rupees? Yeah totally legit. No scams ever.",
  "I have bad vision but it can’t be this bad to see 1 rupee",
  "It seriously went out of stock lmao",
  "What's the harm in trying bro",
  "Make sure that's really the store site (security certificate and all that).  It might be bait to get you to enter your credit card details.",
  "I guess not..",
  "For me it shows 137k",
  "I think it depends on your country's law system. For example, in Mexico, we have a consumer protection enforcer, which forces the seller to honor their stated price, even in case of human error or similar snafus. This has led to several incredible bargain stories over the years.",
  "Share us the laptop link",
  "I checked it. does show just 1 but currently out of stock. Update us OP",
  "[deleted]",
  "This happened with me too and then they cancelled the order after 2 days",
  "Looks like someone turned friendly fire on.",
  "Back end website error. Some one pushed a change to the store front and really fucked up. Lucky for you. Hope they don't catch it before it ships. Ive worked on retail websites and seen this happen.",
  "[store.lenovo.com](http://store.lenovo.com) its a malicious site nor official one, don't fall for it.",
  "It happened in my country once, and they honored the purchase. Mistakes happen sometimes.",
  "Think you cut out the banner there that should apply to you right?!\n\n[imgur](https://imgur.com/a/04Bwbtx)",
  "Aaw a similar thing for legion go for 90quid didn't trust it as the reservation counter always update over and over again.",
  "Go for it, but you might want to use a virtual credit card using for example Revolut. So you won't leak ur credit card info if this turns out to be fake :)",
  "Any updates?",
  "That's probably a colored cardboard brother...",
  "At best you get an almost free Thinkpad, at worst you're on a spoofed website that's collecting your credit card details. What could go wrong?",
  "Did you buy it or not?",
  "https://privacy.com\n\nNo reason to not give it a go. Use a burner card from above. First twelve each month are free.",
  "It’s an obvious scam jfc",
  "It's out of stock now 😭",
  "Better order 10 more",
  "Keep us updated OP!",
  "Bro at least sign in \nThen check the price",
  "That website looks suspicious to me.Your card might get blocked or u might get scammed.Lenovo website is secured website while the website you are showing is not secured.I would not make the payment.",
  "Credit card sir",
  "Please update us if it actually comes through",
  "You should not have posted this. You should have tried first. .\nExpect the order to be cancelled",
  "I am really interested to know if you really got it",
  "Just buy it whats the worst that can happen",
  "Order it but make sure you're at a public place and not near/at your house",
  "Link ?",
  "Pay with a throwaway account or if none make a virtual debit card from your banking app, set the lowest possible limit on it so it can't be used for scam, use it, purchase, receive and then delete that card.",
  "I would definitely take the bait",
  "Phishing or error.\nEither you get scammed or you get refunded",
  "So any update?",
  "In Germany it's a different shop. https://www.lenovo.com/de/de/d/sale/\n\nI would be careful",
  "They just want your bank details. Check at the end of website is it really lenovo website or a fake one",
  "i often buy mispriced products on aliexpress, and about 30% of the time i actually get them.",
  "Update us if it gets delivered",
  "They didn’t honour their error in my experience. I purchased a machine on a fantastic sale. The website said that they had it in stock. They in fact did not have it in stock. I only learned this after a month of waiting for it to arrive and it being in the ready to ship stage, still showing that they had stock. When the error was discovered they offered to cancel my order and find a machine that “fit” my needs at whatever price they were selling it at. No, I wanted a machine with the closest specifications at the price that I ordered and paid for the first one that you said you had in stock. They didn’t budge at all. I ordered a machine at $250, the next one that had the closest specifications was $750. The original price of the machine I ordered was $950. Some brands are better than others when it comes to errors. Lenovo isn’t one of them.",
  "i dont remember lenovo's official site looking like this. There was no green color, all the accents were black or red in my memory",
  "I had the same bug on the HP website, €1 for a computer that is worth €1,400, I paid but after a few hours my order was cancelled. They'll probably do the same to you, it must be a bug in the site.",
  "Order it I guess but pay with PayPal or something",
  "Could be a pricing error too. Order it",
  "Which store was it?",
  "Get one for me 😜",
  "If the website is legitimate I'd fuck around and find out 😂",
  "Is store.Lenovo.com strictly for India? I’m in Canada and it’s showing me rupees",
  "What do you fucking think?",
  "Well probably a key logger that want's your card details.",
  "Just create an internet bank account, deposit a small amount of money and purchase it. Simple, end of story.",
  "Yeah, genuinely stealing your personal information.",
  "Could be a price mistake. If you want try it out with a safe payment method",
  "link??",
  "any update what hapeend ,i am curious......................:;:::::",
  "obviously not legit. \n\nThe real website link is lenovo.com\n\nnot site.lenovo.com",
  "Plot twist...\n\nOP made this site so people go and buy/log in and THEY are now stealing your info. This seems way to scummy/scammy. \n\nWeblink isn't true. Copied page.",
  "Be careful could be a wrong Site or sometimes Like Amazon a Price Tag was wrong I could buy it but often the offer was then canceld",
  "Seems like that one incident where the gas prices were mistaken at a station and one comma was off (10 times cheaper price).\n\nAnd some dude was filling like the back of his truck with gasoline. Not sure how specific the action was, but basically they were taking advantage of the situation.",
  "RUN",
  "SCAM!!!!",
  "Purchasing a product at the advertised price isn't illegal. Not selling you a product for the advertised price is illegal in a lot of places. Hopefully in your country too.",
  "Use a burner card if you can. Doesn't hurt to try it.",
  "Is like one of those amazon errors where some products are like 1 dollar",
  "Send me the full link pls",
  "Well this is because the prices are set by the individual store owners. Something like that happened with me too. A laptop I wanted to buy was showing for 50% less at only one lenovo store. It was hella skeptical. I contacted that store and they clarified that is not the correct price and will be changed that morning. ",
  "Why is it when I go to [store.lenovo.com](http://store.lenovo.com) that it instantly sends me over to India?  I live in NY, USA.  That seems suspicious.",
  "cod karwa le",
  "https://ibb.co/7xSwZjMb\nhttps://ibb.co/Pz17nqVC\n\nCheck these links store .Lenovo.com seems to be a fake site. The actual one is Lenovo.com",
  "Try without keeping more than 5 rupees in your account. If it goes you are super lucky !",
  "Shouldn't have posted it on Reddit",
  "Make a wallet like family pay and pay 1 rupee with that and never use it again",
  "Use a prepaid one use Revolut card",
  "Store.Lenovo isn’t owned by Lenovo.",
  "Website copyright 2021 - Almost real. Its a scam don't fall for it.",
  "that is the Shipping price",
  "Hmm low risk...",
  "Never heard the phrase if it’s to good to be true it’s not?",
  "Is it's in India, everything is a scam, they even spread to other countries",
  "Link ?",
  "Link ?\n\nIf possible let us know if order",
  "Well, it's been 3 days, have you purchased it already? If so then no problem but if you're still planning to, then I would say they likely have corrected this mistake by now, or even earlier, like 10 hours after you saw it",
  "Might as well give it a shot lol",
  "Link shared by OP seems to be individual local store link and they are free to set their prices so someone probably made a typo. Ordering it will likely result in the local store cancelling it as 'Out of Stock' and 1 Rs. refund.\n\nHere's the online store link: https://store.lenovo.com/in/en/nb-yg-slim-7-14ill10-u7-32g-1t-11s-83jx001min-2191.html",
  "It's sketchy my malwarebytes browser protection on an android phone blocked it when I turned the protection off the page loaded. It's a phishing page.",
  "Any updates on what happened?",
  "It's a scam, check the cert\nThe main page is a wild card, the store subdomain is a free SSL cert from last week. Someone has poisoned the DNS most likely and stolen the sub domain? Lenovo has a year long cert from a different company and wouldn't be using a free public cert from last week.",
  "Naah.\nPricing issue maybe",
  "Naah, pricing issue maybe",
  "Browser inspect element go brr",
  "bro found the deal every parent is haggling for",
  "prolly not but 1 inr, might as well",
  "how to avail this offer, bro😭",
  "soon as you make an account or log in... it's likely gonna change the price. that shit happens all the time with aliexpress too",
  "Paid for my laptop 2 years ago\nAll fine, still have it\nIf tis official website youll be fine",
  "Buy it and see why happens!",
  "Had something similar happen with HPs website a few years ago - sadly my order got cancelled :(",
  "Pay with a gift card",
  "From my understanding, it seems that this site is acting as a marketplace where the verified Lenovo stores are adding their inventory and setting their prices based on their offers/etc. So, it might be that this particular seller listed this product at a mistake price.",
  "Any update?",
  "If it looks like a scam and sounds like a scam.....",
  "I guess he didn't get it.",
  "Use a through away virtual card with a limite and get it",
  "Did you ever get it",
  "Intern: oh shit i'm in danger",
  "This looks like either a pricing glitch or a placeholder/test price. Big brands don’t just sell ₹1.8 lakh laptops for ₹1 unless it’s some promo for employees or a contest. If it actually lets you check out and ship, you’re extremely lucky — but 99% of the time the order gets cancelled or refunded",
  "100% legit. Good deal",
  "probably phishing website \ntry to copy past the URL into different word processing apps like notepad and more > check carefully for discrepancies like ś that might pop out.",
  "Do it.\nWhat's the worst that could happen?",
  "do it bro",
  "[Real link.](https://store.lenovo.com/in/en/nb-yg-7-2-in-1-14ill10-u7-32g-1t-11s-83jq000nin-1525.html) \n\nPrice is showing up as ₹137,490.00 for me\n\nI would scan your shit for anything malicious",
  "scam, there ain't no fucking way lenovo giving out cheap ass price's, let alone a laptop.",
  "Obviously not",
  "In Brazil we have a saying that roughly translates to \"When the offering is too good even the saint gets suspicious\"",
  "Thats literally a fake single page , go to original lenovo website and compare with it . Don't be dumb Nothin ever gonna be free",
  "Too good to be true",
  "scam.",
  "A general life lesson is:  if it seems too good to be true, it probably is.",
  "Is it even logged in brother? It still shows sign in option . I suppose u can't order without signing in . Or u can ??",
  "[deleted]",
  "No",
  "100% scam. \n\nDone very convincingly but it's not the official lenovo India. \n\nLike someone else said the official lenovo site doesn't start with store in the url.",
  "Lenovo's store is not [store.lenovo.com](http://store.lenovo.com)\n\nThe whole website is a scam\n\nLenovo's actual store website is [https://www.lenovo.com/gb/en/d/sale](https://www.lenovo.com/gb/en/d/sale)\n\nGo to [lenovo.com](http://lenovo.com) | Click \"Products\" and look at the URL\n\nWhole website seems to be a scam, the only thing different should be the location and Language after [**lenovo.com/**LOCATION/LANGUAGE](http://lenovo.com/LOCATION/LANGUAGE)",
  "What do you think bro?",
  "Bro that's not official lenovo website",
  "It's still there lmao 😭.",
  "Did you got the laptop",
  "Wait... I just went to [store.lenovo.com](http://store.lenovo.com) from the USA and I'm getting a bunch of ads talking about how many INR (Indian Rupee?) discount I'll get.\n\nWTF?",
  "They're not gonna eat the loss just because it's their mistake.",
  "uppercase i and lower case L look alike so they might have switched them to make it look like the official Lenovo website while it's actually ienovo website :b",
  "Lenovos webshop has been notorious for having odd bugs, my father purchased a laptop years ago and for some reason the payment failed so he got pissed off and went to a store and bought one. Like 2 weeks later he got 2 laptops from Lenovo and a reminder in his email that his laptop is waiting for payment to be shipped out.",
  "From just the image I can't see the whole link. It looks like a / at the end indeed, so it might be safe. But it's also possible the website can look like this: \"store.lenovo.com_custom_link.net\" be careful about these kind of links. I encountered one like this saying they are airbnb.",
  "You cannot see if they are on store.lenovo.com - they could be on store.lenovo.communityscams.in",
  "Lenovo sold me a defective laptop and then refused to replace it, instead offering a refund and a discount on future purchases that was less than the discount I'd bought the defective laptop with \n\nThey don't care about honouring shit",
  "Happend to my brother on an other site for idk which item, and they did not honor the purchase",
  "I once found a mistake where they sold a 4tb m.2 ssd for like 50 bucks. I bought 2 and 2 days later got an email that the order was canceled due to pricing mistake.\n\nLuckily for them the ssd was not in stock for about 1 week so they had time to fix it. But if they sent it then I'm pretty sure they would have to eat the loss.",
  "it could be a pharming scam so it even has the same URL but is in reality a different site, scan your pc for malware",
  "Sacaría todo lo q pueda de la tarjeta registrada (dejando solo un poco de dinero) o la cambiaría para luego comprar   \nCuestión de no perder en caso de reclamos.  \n  \n(Escribo en español)",
  "could be a risk, whole account might be swiped clean",
  "Well I ig thy already did cause it isn't showing now",
  "If an intern even had the access needed to do such a thing its not the intern that needs to be fired",
  "Ohh lucky you!",
  "Same, had an infinite amount of 50€ off vouchers, vot a backpack, mouses, speaker, storage with it",
  "lucky guy. My order got cancelled.",
  "Excuse me here, but how the hell can a subdomain of a **genuine** lenovo site be a scam?",
  "That's a legit site and ig the product entry was incorrect I don't think they'll shop it but if they do let me know brother and congrats if that happens ",
  "Really? Did it say \"Only 3 left\" when you ordered them?",
  "any updates?u got laptop?",
  "How did you guys order",
  "https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F\nWell I barely have around 150 in my bank account 😅",
  "Real talk: My brain immediately thinks of Zelda instead of India when I hear “Rupees”",
  "[deleted]",
  "U ain't tuff my guy!",
  "I loaded it myself earlier and saw the same thing.",
  "Nah it was real and a tech-error",
  "I don't have PayPal",
  "Also shows copyright from 2021. while other lenovo domains like psref.lenovo.com have it at 2025.",
  "Really?",
  "!RemindMe 1 week",
  "No",
  "It didn't allow me to make the payment",
  "This is exclusive store site",
  "I didn't buy",
  "Here is the url-\nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Here's the link or if u find this sus u can google lenovo official store new bel road and try  https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Somebody needs to learn how domain names work.",
  "LoL there is a thing called dns you should learn it",
  "Are u dumb?\nIt's a Fcking subdomain of lenove. It can't be a scam unless someone has Fcking access to the Lenovo domain or is doing. Mitm attack on opm",
  "What makes you think so? Like this is from official website! Unless it might be some glitch or smtg",
  "Well it's from lenovo exclusive store website and search for the branch new bel road",
  "You don't know how subdomains work.",
  "[deleted]",
  "The site has enough reputation to show up in google searches for \"store lenovo\". It wouldn't be the first time someone both hijacked a subdomain and also got it into a google search.\n\nThe cert is signed by Lets Encrypt instead of Lenovo's cert which is just what a scam site would do.\n\n*edit* store.lenovo.com/in/en has been in use since 2023. \n\nhttps://web.archive.org/web/20230314012913/https://store.lenovo.com/in/en/",
  "Entirely true : entered the url store.lenovo.com and arrived on an Indian version while living in Europe.\nVery few redirection links working. \nProbably a scam to steal credit card informations.",
  "But u can find the same from lenovo exclusive store website and search for new bel road branch",
  "[deleted]",
  "Seems like they've taken down their online store, when I just visited there was no way to buy online",
  "They may not even catch it. The order is probably processed by a computer and then packed and shipped automatically.",
  "They are many reasons they might eat it, particularly because it may be too much work to undo.\n\n*EDIT* If 1000 people start ordering it, they'll notice and cancel them all. OP you blew it by telling the rest of us.",
  "A little bit unrelated. I went to buy some expensive craft beer at a local shop and it was extremely cheap for some reason, like the whole thing cost less than the bottle. Cashier called the manager about it and they clearly stated that it is not what it suppossed to be, they can't do anything about it and they let me buy all of them for that very low price. Felt like winning the lottery.",
  "Had the same thing happened to me, they just sent a follow up email saying the price was a mistake on their end and they won't process the order.",
  "You can go to consumer court. They have to honor the purchase. You can’t just back out of contracts when the contract becomes a loss for you.",
  "Loss?",
  "The margins on these things are insane, my company buys their devices and they pay 20% of the public retail price. They make billions, it's probably not worth making the customer unhappy",
  "Most of the time they will, my boys in a telegram group where they post all types of these website bugs where the price is stupid low, all the guys on that telegram including my mate all buy and resell the shit they bulk buy off these websites and they pretty much all clear and get delivered",
  "It has happened before. I remember when a code was floating around for free Razer stuff, including laptops, and they said it was their mistake and honoured the orders.",
  "in eu they are required to sell it to you at the price its posted, i bought a portable AC from a site in slovenia because some fked up and instead of 450€ it was posted for 45€ and i got it for 45",
  "Sennheiser did when HD 600 were selling for 50$ instead of 500$",
  "One time I caught designer jeans they missed a 0 on. They sent it and fixed the price after. ",
  "Lenovo while not being an American company does a lot of business here, and one of their dual hqs are here, so legally, if they fucked up, they have to eat the loss, if any corp sends you something you didn’t order or they wayyy undersold it to you(like this case) legally you can view it as a gift and are under no obligation to return it, it happens with apple all the time where someone orders an iPhone and they get 5 instead of",
  "In germany if they send it out to you before realizing the mistake it's yours for that price so worth trying i guess",
  "Have you ever worked retail?",
  "Social media clout init",
  "Yes they will. I got a 3k laptop for under 300 dollars because they ate the loss. I did have to speak to someone on the phone, but I was polite and assertive about it. All in all, less than twenty minutes.",
  "Depending on region, ie. Quebec, they're legally required to honor the list price and eat the loss. Even outside of Quebec the amount of times I've gotten something better than what I actually ordered on Amazon is impressive Amazon always ate the loss. There's a good chance Lenovo just eats the loss.",
  "Second this. Currently dealing with Lenovo trying to return a laptop I bought that was advertised as having a feature I wanted, and shock horror, it doesn't. Their only response has been 'we know it can be upsetting to not get what you expected'. Can confirm they will refuse to eat the loss of their mistakes.",
  "They have to....",
  "They will, if you order from the EU. The fine they would pay otherwise due to consumer protection laws will be devastating.",
  "You can't have uppercase urls.",
  "That's a good idea. You could get like a visa gift card and order it with that.\n\nI'm writing in English.",
  "but the website is legit [store.lenovo.com](http://store.lenovo.com) \n\nu/Inevitable-Owl-550  you should log in with the same account in another device and then pay and see what happens",
  "People still keep all their money in an account linked to a card???\n\nMy pay goes into a secondary account with no cards linked to it, if I want to spend money, I manually transfer it, if someone steals my wallet, or a phishing site gets my card number, the most they'll get out of me is about $50 (which is all I keep in there for convenience)",
  "google pay then or single use card.",
  "Keep 2 rs in the account",
  "Upi lite se karo payment",
  "Bro your should have just ordered it, and if they didn't honour the purchase you can easily file a case against them",
  "I’m curious whether this was a scam link (My personal knowledge says that’s not possible coz store.lenovo.com seems legit, and doesn’t make sense to be a scam in terms of how DNS works) or the real store but someone messed up prices",
  "Did you buy it?",
  "Dude next time just go for it. Don’t let Reddit talk you out of a good deal. It’s the legit Lenovo website you scored yourself an absolute steal.",
  "Yeah but that's not how the corporate world works unfortunately",
  "Check the URL Certificate attributes and certificate chain. It will or should have Issued to as Lenovo.",
  "Domain takeovers exist, and through some VPN, Proxy, Public WiFi, really anything between you and the server can redirect to a scam server instead of loading the real page.",
  "[DNS Hijack, for example](https://www.imperva.com/learn/application-security/dns-hijacking-redirection/)",
  "they didnt confirm the order, looks like incorrect entry.",
  "u/U_GET_ME yes now its only one left, but order is not showing in **my order** sections",
  "No , it was just an entry mistake by a store owner in Karnataka. Order was cancelled by their side",
  "If I'm you, I'd probably buy it using my virtual card and limit the transaction to 1 rupee then lock the card and generate a new one after purchase.",
  "It isn't working now.\n\nDid you order it?",
  "Yeah no shit lol",
  "Does Indian credit cards have protection against fraud or are you out the money if your card gets stolen",
  "I will be messaging you in 7 days on [**2025-08-29 06:58:15 UTC**](http://www.wolframalpha.com/input/?i=2025-08-29%2006:58:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/laptops/comments/1mwcbkj/guys_is_this_genuine_like_seriously_1_rupees/na17fd3/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Flaptops%2Fcomments%2F1mwcbkj%2Fguys_is_this_genuine_like_seriously_1_rupees%2Fna17fd3%2F%5D%0A%0ARemindMe%21%202025-08-29%2006%3A58%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201mwcbkj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
  "Unfortunately it's not, no green color is used on the checkout page for me anyways",
  "Im unable to open the website so probably a scam",
  "... yes, it's right there.",
  "Please explain",
  "[deleted]",
  "This isn't helpful.",
  "Go ahead and try it then I guess 🤷‍♂️",
  "Yeah some people can be quite rude and dismissive in here",
  "Please explain",
  "Provide a link for that please.",
  "But it's a phone",
  "I see the same product using my Macbook.",
  "OP is clearly on a phone though",
  "Bruh unless it’s modifying webpages locally, it’s still a price served from Lenovo server.",
  "uppercase letters aren't allowed in domains",
  "Yeah I'm sure that's much more likely than a simple pricing mistake that happens all the time and would never ship",
  "This is what I'm thinking. Not that they'd do it intentionally, but the order would probably just get entered into their automated system to process it and the request to package and ship the laptop would be passed into their fulfillment/shipping department and someone there might ship it, not knowing or caring what people paid for anything.",
  "Yea, like my dad saw a wrong price on jbls site, 0 euro soundbar, and he ordered one, but then he ordered 15 more. Im pretty sure thats the reason that they catched it. A while ago i saw a wrong price on jbls site, 25 euros for a flip 4 camo. I ordered one and actually recieved it",
  "Most likely true. I work at a very large company and work in picking and shipping orders, and it's generally the same for every company. If a product is in stock and is purchased, the order is automatically added to the queue and dropped in the next wave of orders for the warehouse workers to pick and ship it. \n\nMany times the packlist/order receipt will show the total price of the order, but nobody really pays attention and even if a warehouse grunt sees it, they will assume nothing and still send it out. No managers or financial workers will see the order until well after it is shipped and delivered in most cases",
  "I have worked at a popular grocery store for over a decade. In the U.S. if a store has a price sign in front of a product that indicates an incorrect price, we have to honor it. Otherwise it’s called bait and switch. I have no idea how this is handled online or internationally however.",
  "They don’t. Law undergraduate here. This falls under contract law. A website listing or product is considered as an **invitation to treat**, and not an **offer**. To define an offer, I will quote it from the case of Preston Corpn Sdn Bhd v Edward Leong: An offer is an intimation of willingness by an offeror to enter into a legally binding contract. Its terms either expressly or impliedly must **indicate** that it is to **become binding on the offeror** (buyer) assoon as it has been **accepted by the offeree** (seller).\n\nEven if the customer were to send an offer (by checking out), a **binding contract** is not yet formed because Lenovo has yet to accept that offer and they can choose to back out as there is no **legally enforceable agreement** yet. (A confirmation email is also not signifying of acceptance of order!)\n\nA similar example to this would be Chwee Kin Keong v Digiland Mall Pte Ltd. TLDR is that an employee keyed in a pricing for a product at $66 instead of $3,854 (MSRP) and the company obviously didn’t want to fulfil orders that were made and got taken to court. Court ruled in the company’s favour.\n\nIn consumer court, courts do consistently rule in favour of the seller during obvious pricing mistakes like a $1 phone etc. because they take the view of a **reasonable person in consideration and apply the objectivity test**. \n\nFor example, in this case, the court said:\n“I find ... that the plaintiffs, given each of their backgrounds, would in any event, each have separately realised and appreciated, before placing their purchase orders,that a manifest mistake had occurred – even if no communications on the error had taken place between them. Further, the character of the mistake was such that **any reasonable person** similarly circumstanced as each of the plaintiffs would have had every reason to believe that a manifest error had occurred.” . \n\nOtherwise, the court would also simply treat it as a **clerical or unilateral mistake** and not punish the seller. Similarly in this case, Lenovo would win.\n\nIf there’s any Law graduates reading this and want to improve on my stand, please do! I’m still studying and open to improvement",
  "Nope where it's clearly a mistake and you know it, they don't need to honour it",
  "They are not and three seconds of googling will support that. Just because you once managed to slip one through doesn’t mean that’s the law.\n\nImagine a computer store mislabelling a €4000 laptop at €1 and a large amount of units are ordered overnight while nobody’s at work. Your argument is that EU law now effectively forces this company into bankruptcy by being required to honor these sales that were clearly made exploiting an error in pricing?",
  "No....",
  "Depends on the Ts and Cs",
  "Yeah.... depends on if that's enforceable to a website in another country.... Much like the GDPR fines the EU charges.... a US website isn't subject to that....  even if they decide to keep data on you... because they're not breaking THEIR laws.",
  "had this happen in the us with a 5000 dollar tv listed for 5.\n\n  \nthey cancelled the order and gave us a 20 dollar off of 100 or more coupon.\n\n  \nthis was on Samsungs website a few years back.\n\n  \nmaybe the uk is protected against this somehow but I’m almost positive there’s some loophole that companies could take advantage of to cancel it. regardless, it’s worth a try if it’s from the legit website",
  "Well it's the same in other accounts too",
  "This is the way to do it imo.",
  "I don't think that's how it works. Especially considering that OP is checking it on a phone. Like imagine if disc.google.com could be swapped by something malicious? \n\nCorrect me if I'm wrong, but aren't sites check response and then send info about a site, judging from 1) the subdomain, 2) the page (/in) and then parse arguments passed in the url if there are any? It's server-client thing – client sends response (get/post etc.), site's backend transfers specific data to the client (rendering the page if needed and so on). Done.",
  "you really think that there is a malware that will only affect lenovo's website dns? Most stupid way to snatch someone's credit card infos.",
  "Yup as expected ",
  "Bro i also paid but it shows incorrect entry and it got cancelled 🤣",
  "overthinking final boss",
  "[deleted]",
  "And look at the Lenovo logo, the padding is absolutely way off",
  "It took me about 30 seconds to load.\n\nThe first time it came up I had the same 1 rupee deal. I reloaded and it's gone. They may have just found it.",
  "Can u google lenovo official store new bel road and check?",
  "store.lenovo.com is a subdomain of lenovo.com, which is Lenovo's parent public domain.\n\n*anything*.lenovo.com is legitimate Lenovo.\n\nDomains are ordered right-to-left. \".com\" being the top level, \".lenovo.com\" being Lenovo, and anything else is just a host or subdomain belonging to Lenovo.\n\nWhat you need to watch out for is what is *after* the \"company\" up until the first \"/\". So for instance;\n\n- https://store.lenovo.com is the store at Lenovo.com.\n- https://lenovo.estore.net is \"Lenovo\" at eStore.net.\n\nAnything after the \"/\" is just a path to a file on the host. So;\n\n- https://store.lenovo.com/in is the \"in\" folder on whatever resoirce store.lenovo.com points to. In this case, it contains the India version of the store pages.",
  "Cant say about the India site but yeah, Lenovis site in general is pretty garbage.",
  "Well yeah if you're wrong. Learn about DNS.",
  "[deleted]",
  "Android run on a version of Unix, which contains a hosts file that can technically be edited to redirect specific URLs to a specific IP address.\n\nThis is technically a way you could target someone, but would be a weird angle of attack honestly \nThere are better ways to fake a website.",
  "They gave out a free $350 tablet when I bought a $400 phone last month so they might just be trying to dump old inventory and they don't care about taking a loss.",
  "Completely understandable. My situation was a bit different though, the product had the correct price sign and it became extremely cheap when it got scanned by the cashier.",
  "I’m fairly certain we have the same rules here in the Netherlands (from the law classes I’ve had during my first year of business admin)",
  "Depende del país y de muchas cosas q poco importa lo que cites",
  "I didn't read the wall of text, but I meant if they accept the order and send a confirmation email then they have to honor it. Obviously if they don't accept the order they don't have to to honor it.",
  "Not just that, but if you know that it's an error and you accept it, they can claim it's theft because you should've known that the price was an error.\n\nAn example often give is when someone sets the gas pump price accidentally to $0.32 USD when it should've been $3.20/gal USD.... if you fill up at $0.32/gal, you can technically be charged with theft.",
  "bamkrupcy? because of a couple ten thousand dollars ? bro you have no idea how companies finances work",
  "Well.. retail eats cost for mistakes all the time. If we have an outdated sign that didn’t get removed for a sale and a customer complains or seems upset we give it to them instantly no questions asked. Especially customer service oriented retail.",
  "Not really, you can't sign your rights away. At least in the EU.",
  "Not true. It's a common misconception. I",
  "u/Inevitable-Owl-550 i have ordered 2 of them, if i actually get , i will send you one",
  "the certificate is the first thing that is being validated, after opening a tcp connection to https, even before sending commands to the web server.",
  "Trust chain will be broken in that case. This validation happens even before the API call could be made, as a callback. There is no way to bypass it other than manually adding the root certificate to trusted root authority which I did not do, in every other case it will not qualify as HTTPS. Even if I manually add it, even then it will be not a real HTTPS and a warning will be displayed when I open the site for HTTPS containing a self signed certificate. \n\nPS : I work in security domain.",
  "I'd imagine if you do this type of attack you'd likely try to redirect as many possible large sites as you can (banks, large companies, big retailers, etc), so it wouldn't have to be this one specifically, but it is plausible if they failed to hijack more",
  "Are you aware of jokes? Jesus Christ lol",
  "I googled it and it works so this must be a phishing website",
  "Oh, I see. Thanks for the explanation.",
  "Thats such an unlikely attack vector lol. Why would you even suggest this?",
  "is it rooted",
  "Only modifying the hosts file would show dire HTTPS warnings in the browser because the site certificate wouldn't match.",
  "Bro be quiet it is 100% a glitch on the website, since it is on offical lenovo website he should buy it and if it charges full price then just refund lmaoo",
  "Or it can configure private dns to do the same thing. No root required.",
  "Good lord, I very much doubt the guy has such a threat model someone is going to do that.",
  "Keeping said inventory is probably losing them more money",
  "Oh yeah, that’s a weird one! Lucky purchase!",
  "We don't. Webshops have to honor the order, unless the error they made was big enough for the buyer to know beforehand that is was a typo. So in this case, yes, they would not have to honor it, but they have to honor the agreement generally when you purchase something on their website.",
  "True, but I was just giving an example to explain. However, if we look at it in layman terms, the universal legal principle will be the same. You simply cannot reasonably expect to enforce a contract based on a price that is **obviously an error**. So in any jurisdiction, I’m highly confident that Lenovo would win should this be taken to court. \n\nIf you search up similar topics, you will find that across common law (Singapore, UK, US) and civil law (France, Germany, EU), the courts follow the same reasoning:\n1.\tObvious pricing errors = no binding contract.\n2.\tBuyers cannot exploit a mistake they recognize.\n3.\tThe worst that happens to the retailer is refunding the money.\n\nHowever, if we are referring to say, a $599 MSRP laptop being listed erroneously at $499, the court may order the seller to honor some of the orders, which has happened in many jurisdictions before, since borderline errors (e.g., 10–25% off normal price) can be interpreted as a discount/promotion and would lead a reasonable person to believe that there is no mistake in pricing.\n\nIn this case though, it’s a laptop for $1. So it’s pretty obvious and no court would side with the buyer.",
  "Incorrect.\nTL;DR Lenovo (and most other companies) explicitly states that a confirmation email does **NOT** signify acceptance of the order. **No acceptance = No contract.** (This clause is commonplace for every business) Consumer will lose if he tries to go to court, even if he has the best lawyer. Below, I will cite Lenovo.\n\n**Full explanation:**\n\nA confirmation email, if you dig deep into any businesses’s Terms and Conditions (the thing that everyone ignores), has built in protective clauses in their Terms of Sale, and they’re not obliged to provide the consumer with any goods or service with a confirmation email alone. **Confirmation email ≠ acceptance.** A confirmation email only signifies that they have **received** the order.\n\nHere, I will specifically cite for this case, Lenovo. Under their T&Cs, it clearly states that **a confirmation of Lenovo receiving and/or processing your order does not constitute acceptance of the order.** (1.2)\n\nSource: https://www.lenovo.com/au/en/legal/new-products-and-warranty-services/?srsltid=AfmBOop9YcXqtlgbWWSEtLd4WCy7paTFtCMABKIs8xZmfYyPvIBRyTbc&ut\n\nIt also states under 1.1 that:\n\n1.1) **No contract** for the purchase of Products or Services will be formed until Lenovo accepts your Order by **one of the following**:\n\n**(a)** shipping the hardware Product and sending you a shipment confirmation email; or\n\n**(b)** making the software Product available to you; or\n\n**(c)** providing the Service to you.\n\nTherefore, that confirmation email is **not a binding acceptance** and is more of an acknowledgment that they’ve received your order and are processing it. Until shipping occurs (or software is delivered, etc.), Lenovo **reserves the right** to cancel or adjust your order **even if** you’ve already received a confirmation email or any other form of confirmation.\n\nI personally think that TV shows these days make the law seem very shallow to the average person, like; “Little guy sues company and wins!”. \n\nThe reality is, that every business has multiple built in protective and failsafe clauses layered into their contracts etc. to make sure that real consumers **will never win against them** in court. I feel like the average person should read more into the T&Cs so they know what they’re getting themselves into, but we don’t, so companies take advantage of that; and that is why we have lawyers :)",
  "Do enlighten me. 99% of companies in the EU are labeled “micro scale”. And also, way to deflect from the question about legislation ;)\n\n“A couple ten thousand dollars” in this case would be 5-10 laptops sold at the wrong price. You can see from this topic that ppl flock to these things like moths to a flame.\n\nMy most commonly used online computer store typically has a stock of about 50 of each gaming laptop, do the math on a say 5 of those products being mislabeled overnight and each those selling out at a €3999 discount. That’s about a million euro lost on a clear database error. “Just suck it up, it’s the law”, yeah not so much bro.",
  "Perfectly legal to have Ts and Cs that reserve the right to cancel orders where there has been made an obvious mistake",
  "Give an update if the order actually gets processed. Unlike what others said, the website itself is not a scam for sure. The items listed by that seller is controlled by them afaik, so either it is their mistake and they will simply not process the order, or, if you're lucky, there must be some kind of flash sale for a few units and they might actually give it.",
  "How were you able to order it ?\n\nDo you have a link for the page ?",
  "Update if you get it",
  "Mind helping me out as well?👀",
  "did u get em",
  "See dm",
  "[removed]",
  "what’d they say",
  "They wouldn’t dare go through the Ardennes /j",
  "Have to redeem themselves when they were wrong the first time lol",
  "I agree, but like... The laptop is not one rupee..",
  "Wow. Someone here finally has some common sense.",
  "[deleted]",
  "you dont know where im from, my country has 2 million pop.. the site in question gets about 5 thousand people traffic everyday.. and the amount of people looking for acs is like 100 every day, there were only 30 of those acs in stock..thats 12 grand and yes statistics matter and not every error is amillion loss dude, get over yourself",
  "this is how Samsung weaseled out of a similar pricing mistake a few years back. both us and eu orders were cancelled ( this was around 10 years ago tho)",
  "Depending on place it might be even law. In Poland for example it's literally in civil code.",
  "Website might be a scam. The copyright is linked to 2021.",
  "It's over bro , was a technical error",
  "See dm",
  "happy cake da",
  "[deleted]",
  "LOL he deleted it?! He legit thought I was serious when I was saying Rupees are a fictional currency from Legend of Zelda and when I said no shit he still thought I was being serious. Social IQ of a dead tree I guess.",
  "twice",
  "exactly, like nobody cares about this bla bla bla rooted phone host files like man he tried other things and it was was the same, it's just a damn glitch.",
  "to be correct: a non rooted phone also has a hosts file \\^\\^",
  "We’re not talking about that specific site though, are we? Nor are we talking about your country. You brought up EU law and some fantasy story that they have to sell it at the shown price no matter what it is. Apparently you’re more interested in arguing than taking a minute to check the applicable rules, have fun with that and have a good night.",
  "Did they say it's been cancelled or that they'd honor it lol?",
  "I don't see ur DM",
  "dm me",
  "People on reddit\n\n50% chance it's a scam\n49.99% chance you're the target of elite state sponsored cyber attack. \n\n0.01% chance it's a genuine error / mistake. \n\nPeople have lost all sense of logic nowadays!",
  "Exactly I 100% agree with you, the dead internet theory is real.",
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "New Lenovo Chromebook Plus 14 Review: The laptop for most people This is my review of the new Lenovo Chromebook Plus 14, which has been hyped up as the “supreme being” of Chromebooks thanks to the new MediaTek Kompanio Ultra chip. I’m just a regular tech nerd who loves Chromebooks but can still look at things objectively, especially when something costs close to $800. This is an honest review, no marketing fluff of just reading the specs. I do reviews as a hobby because I genuinely love tech and enjoy spreading the gospel.\n\nWhile I was overall impressed, I think this machine is overhyped, mainly because of the chip. It’s not quite ready for the big leagues in some areas. I’m coming from using devices like my Galaxy Tab S9+ with the Snapdragon 8 Gen 2, which **EATS UP** anything I throw at it (AI, photo/video editing, multi tasking, video calls). That’s my dream: give me that level of power from a Galaxy Tab S series in a Chromebook with a great keyboard with zero compromises.\n\nSo here’s my category breakdown after using the Lenovo Chromebook Plus 14 for a week, alongside my trusty daily driver, the [HP Chromebook x360 14c](https://www.aboutchromebooks.com/hp-chromebook-x360-14c-first-impressions-great-build-quality-in-a-smallish-high-performing-package/) (i3/8GB RAM), which is still a beast since 2021.\n\n**-----------------**\n\n# 🔧 Build & Design\n\nThe Lenovo is thin and light, but solid. It gives off premium MacBook vibes in build quality, especially when typing. It's so light, it almost feels like a dummy unit, but clearly isn’t. It definitely feels like the next generation of Chromebook hardware.\n\nOnly downside? The bottom is plastic, so it lacks that full premium unibody feel. But unless you’re carrying it around a lot, it’s a non-issue. People mentioned keyboard flex but I didn’t experience any in daily use. And I’m a weightlifter and former lineman with 10.5-inch bear paws. I only got flex when I intentionally tried to flex the keyboard by pressing hard.\n\nThe hinge is firm, you can’t open it with one hand, but once open, it holds its position perfectly.\n\nCompared to the HP 14c, the Lenovo is a little longer and wider but way thinner and lighter. My HP is a full aluminum tank, it’s been a champ for years. The Lenovo feels like it’ll hold up, but its lighter build will need to prove itself over time.\n\nhttps://preview.redd.it/7cx1remd5ugf1.jpg?width=3946&format=pjpg&auto=webp&s=88fc512c4967fd3d9b6ea3b537f575ffb690dff4\n\nhttps://preview.redd.it/8m1a8ard5ugf1.jpg?width=3924&format=pjpg&auto=webp&s=efab4b1846b64e7727b72556ddd716a9c3daaf11\n\nhttps://preview.redd.it/cdn5xkwd5ugf1.jpg?width=4000&format=pjpg&auto=webp&s=665327d55e809b4a4685834ce4593af80b4fe985\n\n**Build Grade: A**\n\n**-----------------------------------**\n\n# 🔋 Battery Life\n\nLet’s be real: I never got anywhere near the advertised 17 hours. But that’s OK, because I still got a solid 9–10.5 hours under heavy, real-world use:\n\n* 20–30 tabs open\n* Zoom app + Teams (web)\n* YouTube music streaming\n* Constant typing\n* Screen at \\~70%\n\nCompared to my aging HP, which lasts about 4–5 hours now, this is a major win. For comparison, the [HP Dragonfly Pro ](https://www.aboutchromebooks.com/hp-dragonfly-pro-chromebook-review-the-pixelbook-of-2023/)from 2023 with an i5 is the worst battery life I ever had on a high powered Chromebook that gave me a max of 3 hours. That thing didn’t last the weekend before it went back.\n\n**Battery Grade: A+**\n\n**-------------------------------------------**\n\n# ⌨️ Keyboard, Trackpad & Fingerprint Reader\n\nTyping on this was a breeze, even with my bear paws. No real keyboard flex during regular use. The keys feel a little shallower than on the HP 14c, but once I got into a groove, I had no complaints.\n\nTrackpad is large, smooth, and accurate, feels close to a MacBook in responsiveness. No lag, no misclicks.\n\nThe fingerprint reader? 🔥 One of the best I’ve used on a Chromebook or any computer. I tried to fake it out with weird angles and different parts of my finger, but nope, still unlocked instantly.\n\n**Grade: A**\n\n**----------------------------**\n\n# 🔊 Sound & Speakers\n\nThe Dolby-branded speakers had me hopeful, but they’re great for a Chromebook, but average overall. My HP PC from 2013 would blow these out of the water, so it's nothing special there. They do have more depth than 99% of all Chromebooks and are a little louder overall, it's still Chromebook speakers, so they are decent in a small room.\n\nThe HP DragonFly Pro was also hyped up to have amazing speakers, but again, good for a chrombook, but in real-world usage, they are just ok.\n\n**Grade: C overall | B+ for a Chromebook**\n\n**--------------------------------------------------**\n\n# ⚡ Chip & Performance: Kompanio Ultra 910\n\nHere’s where the hype train slows down.\n\nIn benchmarks (Jetstream, Speedometer), this chip was twice as fast as my HP’s i3. In real-world use? Not really. It’s only slightly faster, like a 0.5-1 second lead in page loads, even for heavy sites like ESPN and data heavy Google Sheets.\n\nYes, it wins technically.... but it was often a photo finish.\n\nhttps://preview.redd.it/erj1q9w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=e9612c64acde7e2224c924ad258d9bfc6a111dcc\n\nhttps://preview.redd.it/u0brf8w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=0cad7a55498ced4378d570f2a42a10285385f394\n\nI **ran into consistent problems** using Teams in the browser. Video calls would freeze, the screen would stutter, and it even blinked to black unless I turned off the camera. Reddit confirms I’m not alone on this. Zoom (via app) worked fine, but Teams was rough. No such issues on my HP.\n\nBut, the Mediatek chip does allow you to download ALL of THE APPS in the Play Store, which opens up the full world of Android on your Chromebook. The i3 in my HP doesnt allow that, and each day more and more apps that I could download are no longer supported, so that gives it the edge to usher in the full Android Laptop experience, as some of the apps would be better on a full-screen computer with a keyboard compared to the phone.\n\nI tried video editing on the Lenovo using my favorite video editing app on Android called [InShot](https://inshot.com/), and it temporarily presented a dream come true, to have InShot on a laptop, not a tablet with an added on keyboard, where I could edit videos comfortably on my lap. But then I tried to edit together 4 different 15-second 4k files, and that's when it went to crap fast. As soon as I added in a transition, it became super laggy and jittery, and adding in more transitions and text almost made the computer quit. So video editing on the Lenovo is not ideal.\n\n**Video editing on this is about as good as a groundhog trying to make a beaver dam; it looks like it should work, and has the same shape and characteristics, but no, it won't do at all.**\n\nAI features like background blur or object removal? Not there yet. Definitely nowhere near Galaxy S phones or tablets.\n\nMy last point about the chip is, why not use past (1-2 year old) true flagship chips that can do it all, like the Qualcomm Snapdragon 8 Gen 2 (from the Galaxy Tab S9 series)? If they are going to charge such a premium price and say it's because of the chip, bring in a true elite chip that can handle everything like AI, multitasking, video editing, and more, all at the same time, and then Chrome OS would be a monster.\n\n**Grade: B**\n\n**--------------------------------**\n\n# 📺 Screen & Camera\n\nhttps://preview.redd.it/8ualptw55ugf1.jpg?width=4000&format=pjpg&auto=webp&s=23693f067cae0fa1665c752c8052afbdcf8eb7f5\n\n\n\nNow this screen, WOW. It’s a 2K OLED panel that’s absolutely beautiful. I watched an [8K Planet Earth video on Youtube](https://www.youtube.com/watch?v=6JWxHy0C_pI&list=RD6JWxHy0C_pI&start_radio=1) and it felt like I could reach into the screen and touch it. The best screen I’ve ever seen on a Chromebook. Also, they list the Lenovo at 400 nits, but it feels much brighter than 400. I kept the screen constantly at 60-70% and that was perfect for me in all of my use cases.\n\nBUT… a few things:\n\n* Some images/web pages looked oversaturated\n* No screen tuning or adjustment in ChromeOS\n\nThe camera is also surprisingly good. Not Galaxy Ultra good, but very usable for video calls even in tricky lighting.\n\n**Grade: A**\n\n**------------------------------------**\n\n# Final Thoughts\n\nThis is a great machine and a peek into the future of Chromebooks, especially with ARM chips. The design is sleek (though I wish they offered a deep gray or navy blue), the screen is stellar, battery is excellent, and it handles most tasks with ease.\n\nFor most users who use nothing but web apps (Google Docs, Office, email, YouTube) this is more than enough. People spending $2,000 for email machines should seriously consider this and Chrome OS as an alternative.\n\nBUT… looking at the complete picture of the Lenovo Chromebook Plus 14, this would be the no-brainer recommendation of the year (for any laptop, especially a Chromebook) at $500, as $750 feels like a reach when you can get a MacBook Air for $850. If Best Buy does their normal act of putting this on deep discount after a couple of months, and this goes down to $450-550 for a new one, **run**, don't walk to get one if you need a new laptop. At that price, this is the no-brainer Chromebook of the decade.\n\n**Overall Grade: B+**\n\nMe and my bear paws are off to test the next device.",
  "This is cool, but for $800, it better deliver without hiccups. Why risk it when you can grab a MacBook Air for a bit more?",
  "I have found my LCP14 to be fast, but I think the glowing performance reviews may be a bit overstated. I get some freezing/non-loading tabs with maybe 7-10 open (some of them being Google Docs or Gmail), which was unexpected. I also noticed it can't handle 16k (4320p) videos with 60fps on YouTube—not that this is a dealbreaker by any means, but I was still surprised. I typically use that as a test for a machine's horsepower.\n\nI assume all this has to do with the ARM processor and the extended battery life, which may come at a cost. The above tasks would never challenge my HP Elite Dragonfly Chromebook, but that machine had historically bad battery life. Overall, I'm happy with the LCP14 so far, but I thought I'd add this context.",
  "This is the review I've been looking for and have been going back and forth with a MacBook Air for the exact reason on price. I don't want to switch my ecosystem so I'll wait for a sale. Thanks for your hard work!",
  "Great review, thanks a lot. Very well written and exactly what I was looking for.\n\nEdit: I have one more question. How well or poorly does the touch display respond? And were you able to test Android games on it? Did they run better or worse than on Intel devices?\n\nTwo questions. Those were two questions. Sorry.",
  "Thanks for the insightful review! One question though, as I couldn't find this information anywhere. How far does the screen open? Maybe show pictures of maximum opening angle or a value in degrees would be fantastic :)",
  "[deleted]",
  "Well for those of us who love Chrome OS, its an alternative to Windows that faster and lighter, but as you mentioned for this price, it needs to be flawless, or we can grab a MacBook \n\nLike I said, for around $500 this is great, at its current price and chip flaws I see why people are taking it back (I have seen this a lot on here)",
  "See, you are a person who has actually used the machine and not just had one tab open and is hyping the machine up.   The Lenovo is fast, but the jitters and lag it has when doing real-world stuff are unacceptable for me at that price.  As I said, comparing it to my HP Chrombook with an i3 from 2021, they are neck and neck in real-world speed tests, but the i3 never stutters with 20 tabs open, playing 4k videos, and video calling at the same time. \n\nYes, the battery life is not great on my older HP, but I never experienced any hiccups like I did on the Lenovo, just doing what we have come to consider basic things, like video calling, when the Lenovo about aborted on me. \n\nI think the Mediatek chip is ok, but it's not as powerful as they make it seem.  As I said in my review, they need to take older top of the line chips like thise from a Galaxy s tab and put it into the Chromebook so that it cna do EVERYTHING with ease, and then it will be perfect.",
  "So which one are you going to get, the MacBook or the Lenovo?",
  "Thanks, I appreciate you!!\nThe touch screen is amazing, no issues the at all and it was good to use at times for certain things but it does leave a lot of smudges on the screen. \n\nGaming I don't do, but there's a video by Lon Sibon on YouTube that he talks about gaming.  Again I'm not sure how it will hold up because the chip is not as strong as they make it seem, you can download all the apps yes, but raw power is questionable in real world use cases as I mentioned.",
  "It goes all the way flat, or 180 degrees and the hinge is very firm  \nThis is not a convertible.  But, Acer is launching a 514 chrombook plus with this chip in it next month that will be a convertible and I think they will have he chip tuned better than I experinced on this Lenovo",
  "I agree with you, and the fact that the chip was struggling with certain task makes it even worse \n\n$450-500 it's a steal, but anything above $550 is a no",
  "I'm leaning Lenovo because of the ecosystem, but the m3 or m4 MacBook Air is on sale for ~$800 and seems like it would have better longevity than what the Lenovo may have (both based on past experience). I have a Lenovo duet 5 now which I love but the snapdragon is feeling a little long in the tooth when I have more than a few tabs open.\n\nI guess my heart says Lenovo but brain said MacBook Air.",
  "Thanks a lot for the feedback! 180 degrees would be perfect for me. I got a Acer Spin 513 (the one with the previous top ARM model) which is a convertible, but it turned out I hardly use it as a tablet. 95% only as a laptop. Having good speakers is a great bonus for the Lenovo for me, as well as a bright screen. Don't need maximum power as for heavy workload I want to rely on remote desktops.",
  "Check your local best buys, in my area (SE Michigan) the Lenovo is on BB as a used excellent for $530 which is the right price point. So see if you can find one in your area for that price",
  "Unfortunately not near me but I'll keep an eye out.\n\nWhat do you think the chances of the kompanio lasting close to apple silicon?",
  "Not sure, thats a ChatGPT quesiton lol \n\nHappy hunting, hopefully you can find one soon.   I hear that they are high-end Chromebooks with Spandragon x Elite processors coming; I'm hoping they are here just before the holiday season.",
  "Ended up with the m4 MacBook air. It went on sale on Amazon for 750(!) and I can't find the Lenovo near me. Also mixed in the surface laptop for fun but the air just seems too good. Thanks again for your help!",
  "Lenovo Ideapad slim 3 gen 10 AMD 14\" So i bought this laptop for £469 in the UK for university and i have had it for about a week now and I have not seen any reviews so i thought i would leave a review. It has a ryzen 5 8640hs with integrated radeon graphics, 16gb ram dual channel and a 60wh battery\n\nBuild quality: This laptop is made of sturdy plastic, the finish feels very nice but it is nothing to boast about, it is good enough for the price. I like how it is very lightweight and is really easy to carry around.\n\nDisplay: The anti-glare coating is great for this and really helps when it is sunny outside and the sun is very bright. 1920x1200 is very sharp but other than that its a regular 60hz IPS panel but it definitely gets the job done.\n\nKeyboard: This one does not come with a full size keyboard but I am not too bothered by this personally as I dont usually use the rest of the other keys. Sometimes I do press the wrong keys but once you get used to it, its a solid keyboard.\n\nPerformance: The CPU in this is very fast, whatever I do happens in an instant whether im video editing, watching videos, playing games or in a meeting. The 16gb ram also plays a huge role in this. What surprised me the most was the performance of the GPU considering its only 15W. I dont play very heavy games but this GPU was able to run forza horizon 4, fortnite, GTA, battlefield 1 and hollow Knight at good fps(these are the games I usually play). I also did some wii u emulation and it was flawless. One thing I will mention is that the laptop can be quite noisy when gaming on extreme performance mode but is very quiet when not being pushed.\n\nBattery: The battery on this is great for what it is. I was able to achieve around 7-8 hours from 100 percent to 20 whilst just doing my assignments(on battery saver). I got around 5-6 hours on netflix. When gaming the max i got was around 3 hours of battery life which is not too bad.",
  "wow thanks for this review! I was thinking of getting this laptops but couldn't find a lot of reviews so thanks <3",
  "Nice review, I just bought the version with AMD Ryzen 7 8840HS with dual RAM of 8 GB each. I hope I don't regret it, but the price of €630 seemed very advantageous to me honestly",
  "How good an idea is it to get this same version but with 24GB of RAM for $800? Considering that I live in Chile and our prices tend to be higher than those in first-world countries.",
  "Hi! Thanks for the review. Do you think it's worth getting the Ryzen 78840HS version for 40€ more?? I'm gonna be using it for university work. Music production software and other music related software and some gaming",
  "Hi, I am interested of this Laptop, i.e. the 8840HS variant, supports DP alt mode 1.4 on the USB-C port.",
  "I know it's an old post but how is the laptop holding up so far ?",
  "Hi I’ve had this laptop for over a month now and it’s been pretty good thus far but have a few issues/concerns and wanted to see if others are having! 1. The trackpad is not good my fingers dont move on it well and it doesn’t feel sturdy it feels pretty cheap. 2. I might of banged it at some stage but I noticed with the display when it shows black things the pixels are blue in a certain spot only a little you can barely notice it but it bothers me.",
  "No problem its a great laptop for its price, still going strong right now",
  "How is the battery?",
  "As far as I'm aware the \"24GB\" version doesn't exist, it can just support up to 24GB, as in you need to buy extra memory and install it yourself. If that's 800USD that's a disgusting price. Are Apple products also more expensive there? Personally I'd be looking into an Air M4 for that price.",
  "Dont get it, its not worth it at that price point",
  "Absolutely, that ryzen 7 is quite a bit faster and will be better for running multiple tasks, the igpu on it is slightly faster than the ryzen 5 one by about 10%. For €40 more yeah i would say its worth it",
  "Cant really say but its most likely similar to this one but with a stronger gpu and cpu",
  "Its holding up great the battery and performance is still good",
  "In reality it has yet to arrive, they're taking a long time to ship and maybe I'm changing my mind, opting for a thinkpad for €100 more though",
  "Hi, this I assume. Does your model support DP Alt Mode 1.4?",
  "I can buy the slim 3, witht he ryzen 7 only 16gb ram and 60Wh battery for £466, worth ?",
  "ciao, potresti fare un aggiornamento? quale PC hai preso alla fine? a che thinkpad stavi pensando? ti trovi bene?",
  "Whats that",
  "Yeah thats worth it",
  "This is the standard describing how video signals are sent over the USB-C port. ",
  "Is Lenovo IdeaPad Slim 3 15IRH10 (83K100FKPB) a good laptop? I've been looking for a laptop that's suitable mostly for programming and light-gaming (I occasionally do other stuff like light video or photo editing as a hobby, also planning on becoming an fl studio stan in the future). Quick note: although I've been in the PC sphere for quite some time, I'm still not really knowledgeable on most of this stuff (I found out about CPU generations only a week or two ago). I mostly want a laptop that has reasonable price and good enough specs that don't eat up much of the battery (which is why I kinda avoided discrete GPUs and high Gz models, especially considering that this stuff is kinda out of my field in general)\n\nIn general this laptop's specs seem good enough for me, but the fact that there's barely any reviews on it as of now somewhat worries me. I'm not dead-set on buying this specific one, but so far it's been the only one that actually has satisfying flavour, at least in theory. If there's anyone who's already bought the laptop and's been using it for some time already, is it good or should I look for different options?",
  "For lenovo I insist on Think series machines. I was given a free IdeaPad years back and despite being fairly new it was like trash.",
  "Thoughts on Lenovo IdeaPad Slim 5 AMD Ryzen 5 7535HS 13.3 inch (33.7cm) WUXGA IPS Laptop (16GB RAM/512GB SSD I saw good reviews for its higher model (AMD Ryzen 7 AI) but it was much costlier at around Rs. 80k. Saw this version at amazon and the spec looks good and at under 60k, it feels like a good buy considering I have only office use+ video streaming. Bt there are less reviews available so is it actually good on use?",
  "Need a laptop for work! Deciding between Acer Aspire 5, Lenovo Ideapad Slim 3 and Samsung Galaxy Book4 Edge I work mostly from home and I have an iMac which I use 90% of the time. I had an iMac air (from 2016) which I took to meetings, did presentations with and worked on whenever I wasn’t at my desk. My laptop recently died and I want to replace it. I don’t have the budget to replace it with another iMac laptop, so I’m looking at different options. I need it to use Microsoft Office, Teams calls, OneDrive, downloading and uploading videos, occasional photo or video editing (I do most of this on my desktop compute but it would be nice to have a backup), presentations, AirTable. ChatGPT recommends Acer Aspire 5 for the price, but in worried it would be too bulky for me. Since I use it on the go I would prefer something more portable. I found these around the same price range. Any insight or feedback? The price in the images are in Canadian dollars.",
  "i know you don’t want the acer, but its the best out of all. even though its bulky, its the most powerful. so, i advise the acer.",
  "The Snapdragon is actually the best option here assuming you don't use anything that doesn't run on ARM. \n\nIt really depends on what you're doing.\n\nThe Snapdragon won't run video games super well, so really depends on your use case. \n\nI would need to look at benchmarks to know the difference between the Intel and the AMD in this case, but I generally lean towards ryzen.",
  "Do not buy any Snapdragon laptops. They do not support software. So avoid the Samsung.\n\nThe Lenovo has a little old CPU. It's definitely not worth 650.\n\nThe Acer is the best option here. You get a powerful CPU, and RAM is a minimum amount for the laptop to run well as multitask.",
  "If you need it for work, forget these 3 and look for a used Lenovo Thinkpad T-series for this price.",
  "Big fan of the Aspire. I got a cheaper model and upgraded to 16 gb ram and it runs as well as my work MacBook pro for everyday tasks.",
  "Asus Vivobook 14 vs Lenovo IdeaPad Slim 3 Hi all, my wife is looking for a simple laptop to use for Web browsing, watching YouTube, some doc editing and video calls. We can get the Asus Vivobook 14 for 399 euros or Lenovo IdeaPad Slim 3 for 499 euros. Second one looks a little bit more beefy but I don't know if it is worth it for the extra price. Anyone have any experience with these laptops? I find it surprisingly hard to find any helpful reviews online. ",
  "💻 [Help] First-year CSE student — ₹50k budget — Which laptop is best for coding + light editing? (Lenovo IdeaPad Slim 3 / Samsung Galaxy Book4 / Acer Aspire) Hey everyone 👋 I’m Nethraa, a first-year B.E CSE student, and I really need help picking my first laptop! 😅\nBudget: around ₹50,000\n\nI’ll mainly be using it for:\n💻 Coding – Python, C, C++, Java\n🎨 Light editing – videos & photos (just a hobby)\n📚 College use – long classes, portability, notes, and multitasking\n\nI’m looking for a laptop that:\n✨ Has 16GB RAM (or upgradable) and 512GB SSD (preferably NVMe)\n🔋 Offers long battery life for college days\n⌨️ Has a comfortable keyboard for coding\n🖥️ Decent display quality (for editing & eye comfort)\n⚙️ Good build quality and reliability\n🔁 Can be exchanged/resold easily later\n🧩 And ideally lasts 6–10 years without major issues\n\n💡 My shortlisted models:\n1️⃣ Lenovo IdeaPad Slim 3 (Ryzen 5 5625U, 16GB/512GB SSD)\n2️⃣ Samsung Galaxy Book4 (16GB/512GB SSD – beautiful screen & battery)\n3️⃣ Acer Aspire (Ryzen 3 – budget-friendly)\n4️⃣ Acer Aspire Lite (Ryzen 7 7730U – powerful option under 50–55k)\n\n\n🤔 What I’d love to know from actual users or tech folks:\n1. Real-world 🔋 battery backup during coding/editing?\n2. 💻 Keyboard & trackpad comfort for long hours?\n3. 🌡️ How are thermals/fan noise under load?\n4. 🎨 Display quality for light creative work?\n5. 🐧 Any Linux/driver issues for developers?\n6. 💸 Resale/exchange value after 1–2 years? (Cashify / Flipkart / Amazon etc.)\n7. Which one would you personally pick as a CSE student for coding + editing + longevity?\n\n🙏 Would really appreciate honest reviews, pros/cons, and your experiences!\nThanks in advance, you tech legends ❤️",
  "Lenovo IdeaPad Gaming 3 15ACH6 – A review and upgrade path First, I’ll tell you about myself. Mainly because it could help you decide on getting the same or a similar laptop if you have similar needs to me. I’m a mechanical engineering student. Currently, I use CAD somewhat frequently for college and \\*very\\* frequently for personal use, so a dedicated GPU was pretty much necessary. A decently Good CPU was also needed for simulation work and \\*very\\* amateurish programming. Video and image editing are also hobbies of mine, but I don’t do anything extravagant so they weren’t really a deciding factor. I also love to be dramatic and firmly believe I am a professional writer. I’m not, so if you don’t like that kind of writing, I’ll leave a TL;DR at the end of this post.\n\nSo, the laptop. The IdeaPad 3 Gaming I bought comes with a wired RGB mouse I will probably not use (it’s still in its sealed bag), some very disappointing manuals and guides (I just downloaded the actual ones from Lenovo’s site) and a 135W AC charger. Internally, it has a Ryzen 5 5600H, a single 8 GB DDR4 SO-DIMM RAM clocked at 3200 MHz, one 512 GB M.2 Samsung NVMe Gen3x4 SSD (model is MZ-ALQ512B), a Nvidia RTX 3050 4GB and finally a 15.6” 1080p 120 Hz display.\n\nI actually wanted to do this just because of this next section: Upgrades. I’ve always been a sucker for high-capacity drives, so the tiny 512 GB of space made me feel uneasy every single time I thought about my locally stored movies, TV shows, comics, games… Point is: I wanted to upgrade. Problem was: I read online that only the 2242 M.2 slot (the one with the stock SSD) could reach Gen4 speeds.\n\nI’ve also read only that this thing would NOT work with a higher than 512 GB drive on the 2242 slot. I just ignored that and got a 2 TB Crucial P310 Gen4 drive. FUCK. YEAH.\n\nI found it on Micro Center for sale at $149.99 USD too. This is important because my third-world mind was already going crazy inside that celestial store. I felt like I was dreaming in that GPU aisle. The custom keyboards too???? I loved every single plack-time I spent in there. My dad (we were on a business trip btw) was searching for a USB to VGA cable and they had it. WHAT. Who even needs that? Truly, an ascending and heavenly experience.\n\nAnyways. I was very worried it wouldn’t work. I already have a fully functional 2 TB NVMe and a 1 TB SATA drive on my PC, so if this didn’t work I just wasted half my salary in something I would 100% not be able to sell at that same price. Not to mention, I still needed an adapter. This thing is 2230, and if you remember correctly, the slot only fits 2242 drives. So…\n\nI’ll go over how good it performs now:\n\n* Gaming\n\nIn the very few games I tested, it was a very good experience. I mostly play only old games, so this might not mean much to you, but Bayonetta, Sonic X Shadow Generations and Rocket League ran perfectly fine. In Bayonetta’s case, it ran even better than on my desktop -$1200- gaming PC, which honestly doesn’t mean much since it barely counts as running in that system.\n\n* CAD\n\nThe most important thing to me. It runs flawlessly. And now, we go back to the Crucial drive! I designed the adapters using Inventor 2025 on the base laptop (as in “stock configuration”). The only problem I could name is that, for some reason, it takes Inventor like a whole minute to load the first project. Be it a fully finished model or just a blank file. It’s very weird.\n\nAfter finishing the model and getting it printed, I was ready to see if my dumb ass would be enjoying two whole terabytes of data on his new laptop.\n\n \n\nIt. Worked.\n\n \n\nI was so stupidly happy. And you know what? I haven’t mentioned that I also installed two 16 GB 3200 MHz sticks. EVERYTHING WORKED WITH NO ISSUES. It felt amazing. The trip to Micro Center, the fact that I was actually upgrading a laptop, the excitement I felt going into the Amazon Locker to retrieve my shiny new 32 gigs of RAM… Truly a wonderful experience.\n\nAfter I installed Windows I decided to check both drive’s speeds, just to be sure. Another big discovery for us; 15ACH6 owners. Turns out that if you only have ONE M.2 drive installed, the drive will run at full Gen3x4 speeds. The damn manual says it runs at Gen3x2, but that is almost a complete lie. Thing is, if you install TWO NVMe drives, the speeds get halved, effectively functioning as two Gen3x2 slots. I’ll add the CrystalDiskMark results as pictures if you want to check them.\n\nTL;DR\n\nI’m really enjoying this laptop. It’s a very capable device. I can confirm that it supports up to 32 GB and a 2 TB NVMe drive and would recommend having just one of those installed to maximize speeds.",
  "hey man, wanted to say I appreciated this review. It made me decide its not for me, but wanted to thank you for the input.",
  "yo may i ask if u did something for the 32gb ram to work? \n\ni tried changing mine from 24gb to 32gb but it seems to have a problem. i always get a blue screen or sudden restarts.",
  "Nothing at all.\n\nDid you enter the BIOS at any point? There might be some setting there.\n\nYou could also change the RAM slots, clean the contacts and try using only one of the two sticks at s time to verify if they work.",
  "what brand are your rams?",
  "Crucial. It's always my brand of choice, though it shouldn't matter if you use any other brand at all as long as it fits the requirements.",
  "Title: 7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Says It’s a Game Changer in 2025 🎮 Hey everyone,\n\nI just read this review titled *“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025”* and thought it’d be worth sharing/discussing. (Link included below.)  \nHere’s a quick breakdown + my take — would love to hear what you all think:\n\n# 🔍 Key Highlights from the Review\n\n1. **Top-tier graphics & processing** – It leans on Intel + latest RTX (5000 series) hardware for serious gaming punch.\n2. **Stunning OLED 240 Hz display** – Crisp visuals, high refresh, rich colors.\n3. **Performance & cooling optimized** – Good thermal design (especially on a stand) helps sustain heavy loads.\n4. **Strong build quality & premium feel** – Materials and finish got good praise.\n5. **Quiet / balance modes are effective** – You don’t always have to blast full power.\n6. **Decent audio & ports** – For a gaming laptop, it doesn’t skimp too much.\n7. **Some compromises & trade-offs** – Battery life is underwhelming, smudge-prone surfaces, and the new port layout (sides vs back) isn’t ideal for everyone.\n\n# My Thoughts & Questions\n\n* This looks like a beast if you mostly use it plugged in — for gaming, video, creative work. But if you're mobile and need long unplugged sessions, the battery life sounds weak (which echoed in other reviews too).\n* The OLED + 240 Hz combo is tempting, but in bright environments, reflections may kill the vibe.\n* Side instead of rear ports is a controversial change — ergonomics over aesthetics?\n* I’m curious: for folks who’ve tried it, how is it in real-world use (noise, heat, battery wear)?\n\n**Link to full review (for reference):**  \n“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025” [mesnbot.com](https://mesnbot.com/7-powerful-reasons-the-lenovo-legion-pro-7i-gen-10-review-proves-its-a-game-changer-in-2025/?utm_source=chatgpt.com)",
  "ChatGPT review lol",
  "Lenovo Slim 7i Aura 15.3\" vs Surface Laptop 13.8\" Hello everyone, I'm in need for a university laptop. I am in Germany and these are my two options as of now:\n\nLenovo Slim 7i Aura Edition\nLunar Lake 258V\n32GB Ram\n1TB Storage\n15.3\"\nPrice: 1199,- € \n\nMicrosoft Surface Laptop 7th Edition \nSnapdragon Plus\n16GB Ram\n256GB Storage\n13.8\"\nPrice: 999,- €\n\nI can't decide which one to go with.\n\nThe Surface Laptop has a more premium build quality and it's Microsoft, a brand I know that is reliable. It also has a haptic touchpad, which is nice. Performance and battery life is good too, only downside would be the compatibility issues, which I don't think would affect me either way. \nIt also has the \"Microsoft Tax\", which is why it's so expensive... 999,- € for those specs. \n\nThe Lenovo Yoga Slim 7i Aura Edition has a good build quality, but it's Lenovo. I never had a Lenovo device in my life. The reviews of their support for online purchases SUCK! 1,3 stars, everyone is complaining. So IF I HAPPEN to have a problem with the laptop im basically done for. Stats are all better than the Surface Laptop. Battery life isn't as good but still okay. No compatibility issues. No haptic touchpad. Higher resolution. \n\nI was about to pull the trigger on the Lenovo one, but reading through reviews of the keyboard failing (some keys just stop working) and then having an ABYSMAL support experience, made me reconsider it. That's when I looked at the Surface, which seems like the premium device for windows. Microsoft support is alright, but it wouldn't really be needed as I barely heard of problems. It's currently my preferred option. \n\nMy father has a Surface Laptop 13.8\" and he says he didn't encounter any issues. Everything works flawlessly.  \n\nI want to hear your take, which one should I go with and why? Thanks in advance! \n",
  "Planning to buy a lenovo ideapad 3 slim ryzen 7 5000 series, laptop Thoughts in this? \n\nFull specs in the pic\n\nSomehow I can't find any reviews on this specific model. I think it's because it's in my region/country only(?). \n\nTo clarify, my purpose of buying this is for light gaming, studies, programming, & multitasking. I'm fine with ram being soldered. Will use this 4 years minimum. \n\nIn general, can anyone who uses/used lenovo ideapad 3 (any models, or this in particular) share their experience and if there are any issues? any reviews or feedbacks? 🙏\n\nQuestions:\n- Can this last for 4 years? \n- How many hours does battery last based on ur experience? \n- Any heating issues? Is it recommended to buy a cooling pad right away? \n- Can it handle minor damages?\n\nOr if you better recommendations pls feel free to do so. Though, don't recommend me thinkpads, i know it's good, but i have a budget and need cheaper like this. Thank you 🙏\n\n\n\n",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy courses that require Windows-specific tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on what you’re studying and whether your coursework leans heavily on Windows-only dev environments.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8), so no dedicated GPU. it’s fine for light gaming or basic rendering, but it’s not gonna handle anything GPU-heavy. also unlike something like an M4 or M3 Mac, which has dedicated media/GPU cores optimized for ML tasks, this is just CPU + iGPU.\n\nas for reliability — IdeaPad 3’s are budget-tier machines. they work, but don’t expect amazing build quality. plastic chassis, average screens, and thermals can get loud under load.\nit’ll probably get you through 4 years if you take care of it, but it’s not something you’ll want to hold onto long after that.",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy coursework that needs Windows-only tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on your major and what your dev tools require.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8) — no dedicated GPU. it’s totally fine for light gaming or basic workloads, but don’t expect any heavy lifting. also, unlike something like an M2 or M4 Mac, there’s no real media or AI-optimized GPU cores.\n\nas for reliability — IdeaPad 3 is entry-level. they work, but they’re built cheap: plastic chassis, basic thermals, and screens that are just okay. it’ll likely last you 4 years if you take care of it, but it’s not really something you’d want to hang on to after graduation.\n\nhonestly speaking, you should give your laptop a bigger budget — this is something you’ll use thousands of hours over the next few years. it’s worth investing a bit more into something that won’t annoy you with throttling, battery issues, or cheap build after a year.",
  "+ Does the audio sounds good and loud enough? ",
  "pls be honest if u did anything that made ur laptop had issues (like overheating it for a long period, opening sites that has malware, accidentally dropping a heavy object on the laptop, and such) 🙏 , im very careful with my devices so if it's the kind of laptop that just malfunction/become faulty all of a sudden, pls let me knoww tysm",
  "Based on 47Whr battery, it will last you prob 5hrs at best when you do a battery saver setting.\n\n\nBut that's what should have been with budget laptop.\n\n\nIf by light gaming you mean games that can be played with iGPU, then it's no problem.\n\n\nAbout heating issues, as long as the fan is working, it won't be a problem. Cooling pad is recommended tho.\n\n\nCan this last 4 years , depends on how you use it. And probably the first problem that you will have within 4 years is not enough storage.",
  "Wdym by that? Is 16/512 combo not enough for a non working professional student?",
  "system already takes 44GB, and the storage won't be 512 , probably less when you have the laptop.\n\nso, imagine you install games that take at least 20GB , and then some videos and photos, overtime it will be filled.\n\nmine already have less than 700GB already from total 950GB in 6 months.",
  "I dont play games....well mine does have an ssd port so ig i can add more storage in the future if i need",
  "Most Honest Review of the Lenovo Yoga 7i – Only 3 days in*  \n\nKeep in mind I’m only three days into my new purchase of the Lenovo Yoga 7i 14, but so far I’m really impressed. After returning my M2 Macbook Air Last October, I had been in the market for a new laptop for quite some time, and the Yoga was always something I was considering. The no touchscreen on the Macbook Air simply wasn’t cutting it for me, which is why I ended up returning it despite my relative investment in the Apple ecosystem (ipad pro m1, iphone 12 pro, airpods pro)\n\nMy model: i7 1255U, 16GB DDR5 Memory, 512GB SSD\n\n**Performance:** So far, the performance has been great. Not sure if it’s the marketing gimmick, but the evo certified i7 CPU is quick and extremely responsive in ways that my desktop isn’t. For quick tasks such as opening your apps from the taskbar or simply interacting with the Windows UI, it’s a very snappy chip that has yet to disappoint whatsoever. The 16GB of DDR5 memory is also impressive here, and I’m able to keep dozens of tabs open on Microsoft Edge without any hassle. Definitely think the upgrade was worth it in this sense, 8GB just never seems to cut it these days.\n\n**Display**: One of the best features of this laptop, and is Dolby Vision certified. It has a really nice looking and glossy 2K resolution that looks great from writing documents to watching Netflix–you can definitely notice the upgraded resolution in this sense. I’ve heard some complaints about the display being too glossy, but I prefer it over a matte finish because it feels nicer to navigate on when in touch mode (although it *can* become a fingerprint magnet at times). \n\n**Keyboard:** Keeping this section short and simple. The BEST laptop keyboard I’ve ever typed on. When I first tried it, I was shocked at the switches’ tactility and it was honestly a bit harsh but I’m getting more used to it. \n\n**Trackpad:** Not the best. One of the few downsides of this laptop. The material feels nice, but its touch sensitivity could be improved. \n\n**Battery Life:** Also, not the worst but could be better. I’ve been using battery savings mode on Windows 11 which has seemed to mitigate some of the battery life issues I was initially having. I believe Lenovo advertises over 10 hours and I’m just not sure that’s accurate for my workflow.\n\nOVERALL: Great laptop, 2 in 1 functionality is awesome and feels really polished with Windows 11. Stone Blue color is also awesome and would recommend it!! 4.5/5 overall.",
  "Just got a Yoga 9i myself, also came from a MacBook. \n\nHaven't even had it for more than 24 hours yet, but so far, really can echo a lot of the points you made. Amazing screen, build quality, and speakers. The stylus support is an added bonus as I markup PDFs quite frequently for work.\n\nIf I had to pick a complaint, would be around battery and efficiency. It's not bad but not great either. Expected a bit more battery life and less heat/fan noise. Its early on, so hard to put a great gauge on it. \n\nGreat 2 in 1 all around though, pretty satisfied.",
  "Really nice to hear what you had to say. I just ordered the 14\".  I customized to go 16G RAM. My first (new) Lenovo. I fell in love with a refurbished Flex 7i but it was buggy.\n\nMy brother is an Apple use (phone, pc, etc.) and this is the first time he's not talking smack about my choice.\n\nI'm over here with fingers crossed.",
  "How is it holding up now?",
  "Danke für deine Erfahrungen. Ich wünschte ich könnte auch die Erfahrungen über mein Geräte teilen aber dieses kam nie an und seitdem ärgere ich mich über den Kundendienst rum.\n\n**Meine Erfahrungen zum Lenovo-Service:**  \nIch habe vor über 8 Wochen bei Lenovo eine Bestellung aufgegeben, bestehend aus einer Laptop-Tasche und einem Tablet. Das Paket wurde zwar geliefert, jedoch war nur die Laptop-Tasche enthalten – das Tablet, das auf dem Lieferschein ebenfalls ausgewiesen war, fehlte.\n\nSeitdem habe ich mehrfach den Kundensupport kontaktiert, um das Problem zu klären, und wurde jedes Mal mit standardisierten Antworten abgespeist, die offensichtlich nicht auf meinen spezifischen Fall eingehen. Es wurde mir wiederholt geraten, bei Nachbarn nachzufragen, obwohl ich von Anfang an erklärt habe, dass das Paket bei mir angekommen ist, aber unvollständig war.\n\nNach wochenlangem Hin und Her bekam ich schließlich die Anweisung, einen Polizeibericht zu erstellen, damit eine Rückerstattung oder Ersatzlieferung erfolgen kann. Diese Forderung ist vollkommen unangemessen, da es sich hier nicht um einen Diebstahl oder Verlust handelt, sondern um ein Versäumnis seitens Lenovo.\n\nLaut geltendem Recht trägt der Verkäufer bei Verbrauchsgüterkäufen das Risiko für die Lieferung – es liegt also in der Verantwortung von Lenovo, die vollständige Lieferung der Ware sicherzustellen.\n\n**Fehlender Kundenservice:**\n\nDer Kundensupport scheint automatisierte Antworten zu geben, ohne auf den individuellen Fall einzugehen. Trotz klarer Schilderung des Problems wurde ich immer wieder mit unsinnigen Vorschlägen abgespeist.\n\n**Unangemessene Forderungen:**\n\nDie Forderung, dass ich als Kunde einen Polizeibericht erstellen soll, ist nicht nur rechtlich fragwürdig, sondern auch eine Zumutung. Es ist nicht meine Aufgabe, die Fehler von Lenovo zu korrigieren.\n\n**Verzögerungen:**\n\nSeit fast acht Wochen warte ich auf eine Lösung. Statt den Fehler umgehend zu beheben, werde ich mit bürokratischen Anforderungen hingehalten.\n\n**Mangelhafte Kommunikation:**\n\nEs gibt keinerlei proaktive Updates oder klare Lösungswege. Stattdessen muss ich als Kunde ständig nachhaken, nur um erneut enttäuscht zu werden.\n\n**Vertrauensverlust:**\n\nNach dieser Erfahrung bin ich nicht nur enttäuscht, sondern habe das Vertrauen in Lenovo als Unternehmen verloren. Ein solches Verhalten ist weder kundenorientiert noch akzeptabel für ein Unternehmen dieser Größe.\n\n**Fazit:**\n\nIch habe das Gerät vor 8 Wochen bezahlt und warte seitdem auf die Lieferung des Tablets oder eine Rückerstattung meines Geldes. Der Kundenservice gibt sein Bestes, mich immer wieder abzuwimmeln.\n\nDieser Umgang mit Kunden ist schlicht inakzeptabel.\n\nIch kann Lenovo nach dieser Erfahrung niemandem empfehlen und werde selbst in Zukunft keine Produkte mehr bei diesem Unternehmen kaufen.",
  "Any update for me? I have a question",
  "I got the 9i and love it. The sound is amazing and the graphics are good. I like how slim it is. I don't regret getting it.",
  "I think I got the same thing with 1tb SSD all for $499+tax for Black Friday. I’m hoping this thing can handle music production.",
  "I have the same laptop. I got the Ultra 7-155U 1TB 16' model. Really lovin' what Lenovo's done here.",
  "I just got my Lenovo Yoga 2 in 1 16 inch yesterday and I notice the touch screen does not always respond. Does it have anything to do with the settings? Did anyone else have this issue? Please share",
  "MacBook Air",
  "I am using the yoga 7i intel 12th gen i5 and the only downside for me is the battery life. This thing is brand new and i have it on battery saving mode at all times with the power settings set to conservative. In 2 hours the battery goes to nothing with me only doing light tasks like web browsing or YouTube. Outside of that I type and do office tasks. Had this laptop for 5 months. I'm worrying about battery bloat since I charge it so often. Its a shame that nothing can come close to the Macbook battery life.",
  "How is the bloatware? Does it have MS Edge, Bing, and a bunch of other stuff that can't be deleted?",
  "Can these computers be upgraded like more gpu, ram?",
  "Anybody with yoga 7i 8th gen (2023) facing issues with hinge ? How is it holding up ?",
  "How long does the battery usually last for you? Because I need one for school and thought of looking at this laptop.",
  "Any issues with freezing? Mine is brand new and no errors but completely freezes up. I hit the power and it restart fine. All tests etc come back good... very frustrating idk if I should return before the 2 weeks is up.",
  "Just bought one last night. I haven't taken it out of the box yet because it was kind of a last-minute purchase due to my old laptop (Toshiba Satellite A660 circa 2010) finally kicking the curb, and I wanted to make sure the specs and reviews line up with my needs. So far, so good!",
  "Thanks for sharing about the PDF markup. That's exactly why I've been considering this laptop.",
  "I’d love to hear your experience after two years. I’m starting a PhD and looking for a reliable laptop to last 4–5 years.",
  "How much battery life we talking here ? Running nothing crazy , one software program working without a charged ?",
  "How do you think it compares to the Flex 7i? Making the decision literally right now. My three options are: MacBook Air M1-226 gb, Lenovo Flex 7i- 1 TB and Lenovo Yoga 7 -512 gb. Yoga is $50 more then the other two, but if it’s a better laptop that’s no big deal. I’m hesitant on the Mac cause I’ve never used MacOS. But I’m trying to figure the difference on Yoga vs Flex",
  "I have an 82yn and when the laptop is working it has been great. HOWEVER, mine has so many problems with it. I consitently run into driver issues with the touchpad and speakers. I have to constantly reinistall drivers mutliple times a day to ge the speakers working probably and for my touchpad to work at all. It fucking sucks. Also, Lenevo support fucking sucks. I sent the laptop to them all they did is factory reset my machine and then sent it back with exterior damage to the chasis. I have a very big dent on the front left of the laptop. I spent hours on support for them to finally say they were going to fix the damage for free and I had before and after pics, then they fucking blue balled me right at the end and said they were not doing it for free and going to charge me like 530 bucks to fix the chasis and hinge, which were both damaged in tranist or during the initial repair. This laptop could have been great but I will never be buying a lenovo product again.",
  "Heyy, how's the hinge and hardware holding on?",
  "how is it going? looking into buying one",
  "Still feel this way 2 months later? Looking to get one",
  "Technically you can't delete MS Edge on any Windows machine without any command prompt workarounds - so yes, to answer your question. Regarding \"bloatware,\" the only thing that comes stock with the yoga is the Lenovo vantage which you can easily remove.",
  "yes, they all are there, but the debloat apps exists and work to some extent.. if your workflow does not require windows, stick to mac. I have my Yoga 7i with every cell of my body. Absolute garbage in terms of battery life.",
  "RAM, Hard Drive space? Yes.\n\nGPU? No. Most laptops are designed for their very specific components. While an M.2 and RAM chip are the same size, most laptop GPUs vary and one won't fit in the same physical space as another.",
  "And I'm curious about the battery, is it better?",
  "I got a 16” 2023 (2k screen 400nits, i7 1360p, 16 gb ram, 1tb ssd) because I found a great deal on it and I’ve been using it for a week. I just came back from the library after a 8 hour session (10 AM - 5:45 PM) and still had 25% battery by the end. I was running the screen around 75% of the screen brightness and had 2 desktops with 2 separate edge windows, 6-7 edge tabs open, MS word and OneNote. I run both the intelligent cooling mode on Vantage and balanced performance mode on windows but I do limit the maximum CPU in windows power plan to 50%. For my use case of note taking, browsing, writing papers it does not slow down or lags. Sorry for long review lol but I was trying to find an objective review before I bought it and I couldn’t find any, hope this helps tho. \n\nI love my 16” 2023, the pencil is a plus for me to take notes and screen is a beauty to use. I’m upgrading from a base 2020 M1 MBP, I sold it already and I also sold my 2020 iPad Pro since I can just carry around my Yoga 7i instead of both laptop and iPad. Glad to be out of the apple ecosystem!",
  "Return it, mine does not freeze at all.",
  "I have a Toshiba satellite P50-C bought around the same time as yours and I''m considering this one as a replacement (I know my Toshiba won't last good too much longer). What's your impression on the Lenovo?",
  "Funny I came here looking for things to watch out for on my new yoga I finally treated myself to after more than a decade which was a Toshiba Satellite as well haha. So far I'm really loving mine this past few days, but then again I'm coming from an ancient machine hahaha  I just got open box for 200 so I'm leary if it has issues I just have not personally found yet.  For the price, I am going to ride it our regardless as it is in warranty, and most likely extend the warranty on it just to be sure because I really like it a lot.  I accidentally left it in the bag turned on in my car in blistering heat while I was at work and it survived that I guess lol",
  "I really loved the Flex - it was just used & buggy. After looking at a ton of reviews and videos & articles, I'm hearing that the  Yoga 9i is the cream of the crop. My fingers are crossed.\n\nMy *uneducated* wager would be on the Yoga 9i. I will try to come back and let you know when I get it (estimated to be on the 25th). But go over and look at both. When looking at specs, you can go all the way to the bottom and there will be a link for \"full specs\" for whichever build number you are considering. I saw an exhaustive PDF on the Yoga I got.[ for the Yoga I got.](https://psref.lenovo.com/syspool/Sys/PDF/Yoga/Yoga_9_14IRP8/Yoga_9_14IRP8_Spec.pdf)\n\nIf it helps, see if you qualify for LifeMart (through insurance or employer or veteran, etc). I saved almost $300 because my United Healthcare Insurance offers a LifeMart membership, Never even heard of it before now!",
  "Really well! And I tend to go from tenting to notebook to full tablet mode quite often.",
  "Loving mine",
  "To my knowledge, the ram on the 7i cannot be upgraded",
  "Woahhh coming from a gaming laptop 8 hours is insane. I can barely get 2 hours just watching YouTube on my $1,400 laptop.",
  "is still good? how are the hinges holding up? do you have the link of the laptop?",
  "Hi. Is this the 2 in 1 convertible you’re talking about? If yes how is the hinge on that? Also any additional points you’d add to this review ?",
  "Hasn't been anymore not sure if it was from an update I did to bios or what",
  "I really like it!",
  "I still have never had an issue (knock on wood). Hope you enjoy yours!",
  "I ended up going with the Lenovo Yoga 7i, the rep for Lenovo told me good things about both told me they were pretty similar but I got a really good deal on the Yoga 7i. Thanks for the help tho!",
  "Yes it's the 2 in 1 convertible. Hinge has been fine and absolutely no issues, it is sturdy and doesn't wobble a lot. \n\nNothing new to report, just that battery has been consistent to about 7-8 hours each day and that is more than enough for me to go to class, take notes and then review at the library until 6 PM. It's a little heavier than my old 13\" M1 MBP and the battery does not last nearly as long that (I would need to charge it every other day - newer MacBook laptops are crazy for battery life), but the bigger screen, the USB-A ports, nicer keyboard and pen support is what makes it 100% worth it for me. And also for a fraction of the price for the Apple equivalent.",
  "Thanks! That’s so good to hear!!",
  "I'm looking at reviews of the 7i now. How do you like yours?",
  "Just echoing the person below in wanting to say thank you for responding! Really appreciate it",
  "That’s great to hear. Just found out my classes don’t even allow laptops… and i can use laptops in the school even if mine ends up dying. Not ideal but yeah.",
  "Thank you for the review and feedback of the laptop, ill be a commuter and my uni is 1hr and 30mins so i was a bit worried about the battery life and the weight of the laptop. Specially if it makes any loud sounds like fan noise ect.",
  "any update a year later lol. looming for a new laptop for uni",
  "Thank You for taking the time to answer my questions",
  "I’m loving it man, looking to get a pen soon to start really taking advantage of the touch screen but it’s been great",
  "Awesome, I just bought it! Ordered a stylus for it also. Thanks!",
  "Dm me if you use the Lenovo IdeaPad Slim 3 Hey guys so I'm currently looking at laptops around the 60k INR range and I've really been interested on the Lenovo IdeaPad slim 3, i5 13th gen H variant. if Any of you guys have been using the lenovo IdeaPad slim 3 please send me a private message on your experience with it and if you would recommend it. If any of you guys have a better laptop suggestion for my price range, please do suggest 🙏",
  "Lenovo ideapad duet 3i (windows)review OR any review for a laptop with N200 processor.. I am hoping to get any review of the Lenovo ideapad duet 3i windows version with N200 8GB Soldered LPDDR5-4800 and 256GB SSD M.2 2242 PCIe 4.0x4 NVMe  [Lenovo page](https://psref.lenovo.com/Product/IdeaPad/IdeaPad_Duet_3_11IAN8?tab=spec)\nSpecifically I am concerned about the N200 performance and how much future proof is it? \nMy intended usage is mainly Microsoft excel, web browsing, note taking, YouTube, Netflix and streaming services.. So any N200 review would be great.. Thank you ",
  "huawei matebook d16 or lenovo ideapad slim 3? i'm planning on buying a laptop for college. my budget is only around 34k PHP. these are my current two options.\n\nhuawei is running intel i5-12450h with 16gb ram\nlenovo has the same specs\n\ni'm mainly concerned about build quality and which one will last me longer. i'm planning on playing some gacha games lightly on low settings (honkai star rail, wuthering waves) while using it for minimal college work like documents and such.\n\nwhich one would be the better option?",
  "Hi,\n\nBoth the laptops are very similar in terms of specs except in two departments.\n\nFor Lenovo, I think the laptop that you are looking is this model- 83ER00MJPH. Based on this model no, I am making a comparision. If I'm wrong, then correct me.\n\nHuawei has a larger display and the slim 3 has a slightly smaller display. 16inch vs 15.6inch. Huawei has a 16:10 ratio display so the display will be slightly taller and will be beneficial for coding, documents or web browsing. Lenovo has a 16:9 ratio display ( if I am correct cause it's not mentioned anywhere ) which will be good for movies and gaming etc. ... But both have a good display.\n\nHuawei has a larger battery but I couldn't find the exact capacity. The one you are looking at is either 56Wh or 70Wh. Lenovo has 47Wh battery.\n....\n\n\nBoth the laptops are good imo ( regarding specs ). I think that you should go for Huawei. For me, it looks better and has a better asthetic feel.\n\nDurability wise, it usually depends on how you use it. If you aren't going to keep a device properly, then even a tough device will break at some point. But yes, look for any review in general, sometimes the specific product has a problem. As far as I know, both of them have good build quality. \n\nHope this helps.",
  "Lenovo Thinkpad T16 Gen.3 Do you think the Lenovo Thinkpad T16 Gen. 3 is good for computer science studies? I heard it gets very loud under high loads. Is programming etc. a high load?\"",
  "Where did you hear that? I follow this model closely, and I haven't heard that anywhere. Neither in user comments, nor in reviews on various sites.",
  "Wanted a review of the Lenovo IdeaPad Slim 5 laptop Lenovo IdeaPad Slim 5, AMD Ryzen 7 7730U, 16GB RAM, 1TB SSD, WUXGA OLED, 14\"/35.5cm, Windows 11, MS Office 2021, Grey, 1.46Kg, 82XE007EIN, Backlit KB, Alexa, 3 Month Game Pass Laptop\n\nI need it for my MBA and some video editing. Please help me decide whether this is the right choice for me, or drop in your recommendations.\n\nBudget is upto inr70k",
  "Lenovo IdeaPad gaming 3 Ryzen 7535HS with RTX 2050. If anybody has the same laptop with the same specs, please leave a comment with your review.",
  "Can someone please send me the vbios of this laptop using gpuz",
  "That is an amazingly short review, with incredible lack of details.  :D",
  "I know it's been like 10 days but if you still need a review, here we go.\n\nI bought this laptop around October last year, absolutely beautiful machine. True that RTX2050 will be sort of a bottleneck because it's an entry level RTX. But that doesn't mean it's slow or too outdated. Last laptop I had just had an integrated Intel 520, so good enough upgrade for me.\nNo AAA games on max settings but it goes good enough with medium settings.\n\nHere's general FPS for the games I've played:\n- Cyberpunk (Medium High no ray tracing) - 50/60\n- Spiderman Remastered (High with ray tracing) - 60-90\n- Miles Morales (Medium with ray tracing) - 60-80\n- War Thunder (Movie - highest settings) - 90-110\n- Forza Motorsport 7 (Ultra) - 80\n- Assassin's Creed: Syndicate (High) - 60-100\n\nAMD CPU is amazing, it's powerful but power efficient. I have a dual channel 8GB×2 = 16gb RAM so it keeps the performance good and steady. It's pretty much future proof for me as well because 7000s are 2023 make and HS models mean power efficient performance processors. I plan on some fun pc gaming so it's not like I want a 400FPS gameplay on some heavy 4k graphics. For a student, it's a pretty good budget friendly gaming laptop.\n\nBattery life goes around 4 hours. It's not much but it's good enough for a gaming laptop. Of course you can turn off Nvidia graphic card when not plugged in and switch to 60Hz for better battery, but it's not MacBook Air. Fans would feel loud if you are playing a graphics intensive game in a very quiet environment(like calm winter night) but they keep this baby at good temperature. I've seen it go 65°C max but that's all good good.\n\n\nAll that being said, it's a budget friendly gaming laptop. You can't compare it with high end Legion Pros or Omen laptops. But for this cost, I'll choose it again. Unless I get that Lenovo IdeaPad Gaming Ryzen 5 6600H+3050 for ₹51k again, but that deal just never came around once I missed it.\n\nAnyway, absolutely love this beast, it's beautiful and quite professional looking for a gaming laptop.\nToo bad I can't insert a picture here.",
  "I have the VBios of My HP Victus Rtx 2050 Ryzen 5 7535hs if You want",
  "Sorry, i want a review from someone who has this one, because i want to buy it. Sorry, if I did something wrong.",
  "at what price did you bought it? (current prize is 56k)",
  "Hi, I'm thinking on buy this laptop but I was reading a lot of people talking about the battery, how it drains even if you're playing with the charger plugged. Does it happen to you? Do you recommend the laptop even with that problem? 😕",
  "Thanks a lot, man. Gotta buy it soon, whenever it will be in the stock. Thanks again.",
  "Can you confirm what is the tgp of rtx 2050 ? I can't find it anywhere clearly",
  "Hey bro it's battery is 60whr or 48whr , and one more thing that ryzen 5 6600h with rtx 3050 came for around 51k wow , when It has came bro just for a clearence I am asking",
  "What else do you do on your laptop? Heavily considering getting it but I won't be gaming AS much as the laptop advertises and will be doing mundane research or designing a lot too, do you think the laptop is good for that?",
  "Yeah that would be a life saver. I appreciate it brotha",
  "You can send me the file on here or to my email\n\nJason2006albano5@gmail.com",
  "Ah, you should probably edit your original post and say that.",
  "Did you buy it?",
  "It has 70W TDP, I couldn't find it anywhere online but checking it on my laptop directly under system information I found it to be 70W.",
  "60W battery and yeah, R5 6600H+3050 for 51k but that was because of some really limited time sale and then student discount as well",
  "I code, watch movies and experiment with blender at times. I'd say it's a good laptop for designing and research, but RTX2050 is a little old for anything too new. Unreal Engine 5 wouldn't run too smooth or fast but it will work if you don't mind cutting down cost for a couple more seconds of rendering.\nThat being said, Ryzen inside is pretty much future proof for a couple years so the laptop would be good to go for anything CPU hungry, and dual channel 16gb DDR5 will make sure it does not hang up even a bit",
  "I code, watch movies and experiment with blender at times. I'd say it's a good laptop for designing and research, but RTX2050 is a little old for anything too new. Unreal Engine 5 wouldn't run too smooth or fast but it will work if you don't mind cutting down cost for a couple more seconds of rendering.\nThat being said, Ryzen inside is pretty much future proof for a couple years so the laptop would be good to go for anything CPU hungry, and dual channel 16gb DDR5 will make sure it does not hang up even a bit",
  "New to reddit 😄, just don't know.",
  "No, I bought acer aspire i5-12450H with RTX 2050 for 49k",
  "I'm planning to buy it but cant find any legit information on its tgp, some are claiming it has only 45w,. Thankyou",
  "Ohh thanks for your support, basically I am getting this laptop for around 53k is it a good deal",
  "And bro what's the charger watt of this laptop",
  "Yup, it's fine, just edit it and add that you're looking for reviews so other people know that this isn't a review thread, but instead a request for a review thread.",
  "I have the Lenovo IdeaPad gaming 3 with Ryzen 5 7535Hs, Nvidia RTX 2050 4 GB & 16 GB GDDR5 RAM.\n\nIts build quality is very good and recently I found out the service is also very good for Lenovo.\n\nIt's a good laptop for gaming, only things I hate about it are it's heavy and battery life is less. \n\nSo I will be keeping it in my office room n leave it there so I don't have to move it everyday, I do work and gaming on it.",
  "it has a 70W TGP, i dont think that's max tho, without overclocking ofc",
  "I got it for 51k around holiday season, so yeah sounds pretty good to me",
  "It has a 135W charger with it",
  "Yeah, I just did it.",
  "Hey could do me a favor i had tested my rtx 2050 GPU with Furmark benchmark then my GPU going max up to 57W TDP can you also test for seeing that GPU wattage click Alt+R",
  "Ya bro same it's going max upto 57W TDP but in system setting it is written 70W I can't understand what to do I am really confused",
  "is Lenovo IdeaPad 3 15ABR8 Slim 3 Ryzen 7 7730U good for versatile college tasks hi! I'm an incoming engineering college student and upon checking the curriculum it looks like I'll be doing some 3d rendering work in some of my courses. is this ideapad model good? lmaoooo i saw many local reviews that ideapad 3 models are trash af, especially their build quality\n\nwhat i look for in choosing my laptop are these\n- durability \n- battery longevity\n- versatility \n- can perform heavy 3d rendering and modelling stuff\n- not too heavy (can be brought to schoo)\n\nALSO, HERE ARE MY CHOICES (within budget): \nthe inquired model at the post title is also in here\n\n# Laptop Choices\n\n>>> Performance (all dedicated GPU)\n\n- **ASUS TUF A15 Ryzen 7 7435HS** DDR5 16-512 RTX 2050 48Whr battery  [Mil STD H]\n- **Acer Nitro V 13420H || Ryzen 5 6600H (LF) (2 models, from) DDR5 16-512 RTX 2050 57Whr\n- **Lenovo LOQ 12450HX** DDR5 16-512 Intel Arc A530M 60Whr bat\n\n>>> Efficiency and Battery Longevity (all integrated GPU)\n\n- **ASUS VIVOBOOK 16X 1235U** DDR4 16/24-512 Iris Xe 42Whr [Mil STD H]\n- **ASUS VIVOBOOK Go 15 Ryzen 5 7520U** DDR4 16-12 AMD Radeon 50Whr [Mil STD H]\n- **Lenovo IdeaPad 3 15ABR8 Slim 3 Ryzen 7 7730U** DDR4 16-512 AMD Radeon 47Whr  [MIL STD H]\n- **Lenovo Ideapad 3 151RH8 Slim 3 13420H** DDR5 **16-512 Intel UHD 47Whr [MIL STD H]\n- **Dell Inspiron 5435 Ryzen 7 7730U** DDR4 16-512 AMD Radeon 54Whr \n\nwhich among these is best fit to my standards? thanks!\n\n\n\n\n\n\n",
  "did u get it and how was it",
  "I've had one for 6 months now. It's a great laptop, the AMD Ryzen 7 has enough power to even game. Battery could last longer but it charges super fast. My only complain is the the speaker, it's probably the worst audio I've heard in any of my devices, even my Xiaomi Chinese phone sounds ten times better.",
  "still ok?",
  "Yeah, it's a great laptop, but the speakers are just terrible, like 2/10. Even a $5 dollar Bluetooth speaker sounds waaay better .",
  "Lenovo Yoga Pro 9i 16\" 2023 Personal Review Hi guys, I have used this laptop over one month, therefore want to share some thoughts here (and gain some karma:)). I'm definitely not trying to sell it to you, so I'll talk about its pros and cons.\n\n&#x200B;\n\nPrice: I paid AU$2723 - AU$437.28(cashback) = AU$2285.72 (= US$1553.72)\n\n&#x200B;\n\nSpec:\n\nProcessor : 13th Generation Intel® Core™ i9-13905H Processor (E-cores up to 4.10 GHz P-cores up to 5.40 GHz)\n\nGraphic Card : NVIDIA® GeForce RTX™ 4050 Laptop GPU 6GB GDDR6\n\nMemory : 32 GB LPDDR5X-6400MHz (Soldered)\n\nStorage : 1 TB SSD M.2 2280 PCIe Gen4 TLC\n\nDisplay : 16.0\" 3.2K (3200 x 2000), IPS, Glare, Non-Touch, 100%DCI-P3, 400 nits, 165Hz, Glass\n\n&#x200B;\n\nWhen I opened the box, I was very impressed, it looks as an artwork. I have used Macbook for few years, I think this build quality is even better than MBP, at least similar.\n\nThat night, I used it to play some youtube videos and music, the sound is good, the screen is superb.\n\nhttps://preview.redd.it/iusuog3elheb1.jpg?width=4032&format=pjpg&auto=webp&s=d60e58281ed2c9144f0dadfeec50f7d67081c383\n\nAll right, that's all about the feel and look.\n\n&#x200B;\n\nRegarding to its performance:\n\n1. i9-13905H. According to my research, this is a custom CPU upon 13900 with more power and less space.\n2. 32GB/1TB, notihng special. DDR5 is good, but soldered approach is not extensible. By the way, it can add one more 2280 SSD storage.\n3. RTX4050, well, due to lots of research, I found 4050's performance is similar to 3060. Which is definitely the situation of 3050. If you buy 4060, it will have \\~20% improvement, but at the time of purchaing, it will cost me AUD 300 more, therefore I didn't choose it. When I get it, I played Forza Horizon 5, in 2k solution, I can run it with the second highest setting (forgot the name) and it was very smooth. But I'm not a fan of playing game, so just played 3 days, then never touch it again.\n\n&#x200B;\n\nConclusion\n\nPros:\n\n1. Screen display is amazing.\n2. Very powerful machine, I'm a programmer, I can feel the difference when using docker or starting a heavy application.\n3. It has around 130w power supply in total for CPU and GPU, which unleash the power of both.\n\n&#x200B;\n\nCons (actually that's the valuable part, you can't get it from elsewhere):\n\n1. This is a full sized keyboard, with numpad. I don't like it, I have another 14\" thinkpad, every key is larger than the 16\" full sized one. I prefer the larger keycap, and I doubt numpad is useful for most people.\n2. Heavy? Yes, but not too heavy, you can get the exact weight from Internet, this is a 16\" laptop, the weight is lighter is most similar sized laptops. If you are a student, want to take it to lab or classroom, maybe you should avoid this one, and choose a 14\" laptop.\n3. It comes with a 170w power supply, um... I don't like it. If you buy Yoga pro 9i 14\", it comes with a 140w power supply, and its interface is type-c. which gives your laptop 2 type-c and 2 type-a, that would be perfect. But now I only have 2 type-a and 1 type-c, alought it's thunderbolt 4.\n4. RTX4050: the 6gb VRAM will be the bottleneck in the near future. If you like playing game, buy 4060. It will definitely extent your laptop's lifespan.\n5. Warranty, somehow I got only 1 year warranty, so I purchased 2 more years, it also costs me additional $$$. Most other laptops, even lenovo, comes with 3 years warranty by default.\n\n&#x200B;\n\nRecommendation:\n\nIf you like the powerful spec, I suggest you choose the Yoga Pro 9i 14\" instead of this one.\n\n&#x200B;\n\nFeel free to ask any questions you want to know about this laptop. Also, appreciate so much if you can give me a upvote for my karma growth.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
  "Got the same spec as your for $1700. I really like the screen",
  "1 thing to consider is probably the battery life since I've had it for a bit. I lost about 20% in 1 hour of use. FYI it was at 165hz refresh and balanced mode. I was just doing some web browsing. So that's about 5 hours of use which is pretty good for my needs. It's pretty rare to not find an outlet work somewhere or in college which I think this laptop is aimed towards so probably not a huge issue. It's also understandable because it has a mini led 3.2k screen and AN i9 which is POWER HUNGRY for sure, the 4050 also doesn't help. But I feel it's worth it",
  "I have it and it have high pitch fan noises and came with a broken trackpad..",
  "What about battery life?",
  "Hi could you tell me what brand/model the wifi card is?",
  "The real issue with this laptop that nobody mentions - not even Lenovo - is the actual name of the product : Yoga.\n\nAll Yoga laptops are **convertibles,** aka you can flip the screen 360°.\n\nThis one can't, same for the 14'' version, which loose everything that makes it a Yoga a Yoga. You can flip the screen up to 180° which is kind of useless if you ever wanted to use it as a tablet.\n\nIt simply makes it a laptop with a touch-screen instead of a 2-in-1 laptop, and there are better ones out there.\n\n&#x200B;\n\nCurrently i don't even know if any convertible laptops using a Nvidia RTX GPU (and not an integrated graphics one) are available but the Rog Flow X16. Sadly it doesn't feature a numpad or a finterprint scanner.\n\nI guess the perfect gaming 2-in-1 laptop doesn't exist yet !",
  "Thank you for the review, I got the IPS on the way, seems like all the reviews are for the Mini LED version so happy to hear the IPS display is also nice.",
  "How's the battery life like on a casual usage \nbasis?",
  "Can You please tell me from where you bought it that cheaper?",
  "Here is lot of people who not will buy any notebook without numpad. Mostly programmers.",
  "Yep, the screen is amazing, the best 16” screen as of 2023.",
  "how so cheap ? considering getting this same setup",
  "Hey from where you bought it that cheaper in 1700 ?",
  "Now the laptop has been used less than 2 months, so the battery is in new condition.\n\nI took it to deliver a 2 hours session, with balanced mode. After the session, battery dropped to 55%. During the session, at least 1/2 time I was sharing screen, other time I was talking hence screen went to off automatically. \n\nIf you care about battery life, don't buy this laptop. 14\" laptop without discrete GPU would be much better.",
  "Wi-Fi 6E 2x2 AX & Bluetooth® 5.1 or above",
  "THANK YOU. I knew I wasn't misremembering that Yoga was their convertible lineup.",
  "If you have found a 2-in-1 laptop that can do games and has decent battery life, please let me know. I was excited by the HP Spectre x360 but they updated it to force OLED on the dedicated GPU models...",
  "How are you finding it?",
  "Seems like Costco has a holiday deal right now in north America. Same specs for 1499 USD. Get it before it's gone",
  "It was actually supposed to be 2000 but I got a discount from Costco.",
  "Costco. It was on sale for 1599 but with taxes was 1700",
  "I'm looking for something 14-16\" with very good performance, ideally 64 GB ram, dedicated GPU and good battery life, but it's hard to get the best of both worlds (performance and battery life)",
  "I wonder if before you started the presentation you change the settings to use less power, is this not an option ? I would only use full power settings if connected to an outlet",
  "thanks for the reply. i meant the exact model under device manager -> network adaptor. if that's not too much trouble. thanks",
  "Pretty great, build quality is nice. Don't like Lenovo service though, apparently not allowed to open up the device at all since it voids the warranty. When that's up I'll throw in some extra storage in the vacant m.2 slot. I also wish the mini LED display was available in my country, the IPS looks great, but I reckon the other one would look nicer. Also don't like the numpad, keep mistyping due to the offset. Overall pretty favourable but few nitpicks.\n\nThe massive glass trackpad is the best thing about this device.",
  "Yoga Pro 9i 14” fits your requirements",
  "There are 3 modes: saver, balance, performance. (not exactly the name, but doesn't matter)\n\nUsually I use balance mode, If I really need to use the battery for long time, I will switch it to saver mode, otherwise I prefer balance mode e.g. 2 hours session.",
  "No worries, under device manager -> network adaptor is:\n\nIntel(R) Wi-Fi 6E AX211 160MHz\n\n&#x200B;\n\nVoting up is helpful to me, thanks",
  "Cool. To be honest it seems like the Mini LED sucks up so much power/battery and is v reflective so the IPS sounds really good to me. How is the battery life for you?",
  "great thanks",
  "Sorry, can't comment on that as I use it plugged in 99% of the time. Also will note the IPS screen is very reflective as well.",
  "Review of Lenovo IdeaPad Slim 5 (15in, 16gb, 512gb SSD, AMD Ryzen 5700u) I bought the Lenovo IdeaPad 5 (15in, 16gb, 512gb SSD, AMD Ryzen 5700u) in India. Here is my review about it after using it for about 2 weeks.\n\n**Build:**\n\n* Update after 14 months (16 Oct 2022): Shit quality hinge. Broke twice till now without ever dropping the laptop.\n* Full plastic build. Metal Lid. Matte finish. Feels great and solid.\n* Keyboard and touchpad are great\n\n**General things:**\n\n1. Initially I had some problem with the speakers when they would stop working and I had to restart the laptop to fix. I got a driver update a couple days later, haven't had that same problem since.\n2. The fingerprint can be a hit or miss sometimes due to its design, I then added my fingerprint from multiple angles so mostly works but sometimes have to try again.\n3. My unit had some backlight bleed on the bottom right corner noticeable when in a dimly lit room at above 70% brightness. Not a problem for me since I dim the screen to around 30% in the dark. This will vary by laptop though.\n4. I have a problem with OBS recordings. It seems that OBS is recording at same volume as windows master volume. I haven't been able to find a fix for it. Every program I tried which captures audio from speakers to record/broadcast (OBS, XSlit, Anydesk) have the same issue.  **(EDIT: FIX: Roll Back Realtek (R) Audio drivers so that the manufacturer is Microsoft, Dolby audio will stop working though if you do it. Not recommended.)**\n5. The product description states that it has Bluetooth 5.0 but the device manager says its Bluetooth 5.1.\n\n**Expandability**:\n\nI opened mine up coz of curiosity. The internal design is the same as last years version.\n\n1. The RAM is soldered in dual channel. (Task Manager)\n2. There is one M.2 NVME SSD slot which is already populated with the 512 GB SSD.\n3. There is a space for an HDD but it doesn't come with the SATA cable installed, the SATA cable will need to be purchased separately to install a hard drive within the laptop.\n4. The laptop comes with WI-FI 5 and not WI-FI 6 unlike last years version. The WI-FI card is upgradable if you need WIFI 6.\n5. The internal battery can also be upgraded to 70 Whrs version. However note that if you do upgrade, it will occupy the HDD slot aswell.\n\nLink to Lenovo's Spare parts website of this model. [IdeaPad 5 ALC05 Type 92LN Spare parts](https://pcsupport.lenovo.com/in/en/products/laptops-and-netbooks/5-series/ideapad-5-15alc05/82ln/parts/display/compatible)\n\n**Battery life estimates from 100 percent battery (70% brightness):**\n\n1. Watching movies (Chrome with 5 extensions - 1 tab open, discord, telegram, anydesk, Battery saving mode active from Vantage software, Better battery saving mode in windows.) - 9hrs\n2. Moderate Multi tasking (Listening to music, actually using chrome, discord, qbittorrent (downloading) and a bunch of other background programs, Battery saving mode from Vantage software, Better battery saving mode in windows.) - 6 to 7 hrs\n\n* Note: I use my laptop on conservation mode all the time so it charges only to 60%. The battery life is based on the time it take to drain the laptop from 60% to around 30% and multiplying that by 3.\n* The conservation mode is not customizable. Its either 60% charge or 100% charge.\n* Also, I absolutely love the conservation mode, ~~no other brands have this~~ Asus and Dell also have it according to the internet. My laptop remains on the desk most of the time so I don't have to worry about it remaining on 100% all the time.\n\n**Fans (In an air conditioned room)**\n\n* On Battery- The laptop fans are completely off when watching movies. They may or may not turn on when multi tasking.\n* Plugged in- The fans only turned off when set to Battery Saving Mode in Vantage and doing light tasks.\n* Fans are inaudible (if they do turn on) when doing basic tasks in a room with air conditioner running, only slightly audible with the air conditioner off.\n\n**iGPU**:\n\n* Out of the 16gb ram, 2GB is dedicated for the iGPU, this can be changed in BIOS to 1GB or 512 MB.\n\n**Lenovo Power Management modes:**\n\n* Extreme Performance- TDP is 35 Watts.\n* Intelligent Cooling- TDP is 25 Watts.\n* Battery Saving Mode- TDP is 15 Watts.\n* On Battery, change to best performance (windows) and these modes function the same as plugged in.  I did notice that Battery Saver Mode (Vantage) turns on the fans later than the Intelligent cooling mode which is I guess nice if you're trying to save battery.\n\n**Performance Benchmarks (Plugged in)(Extreme Performance):**\n\n* **Cinnebench R23**\n   * Multi Core **-** 9655 points, 3.65 GHz across all cores, Max: 85 C, Power: 35 W\n   * Single Core **-** 1245 points, 4.3 Ghz single core, Max: 70 C, Power: 10 W\n* **Crystal DiskMark-** 2481 MB/s Read, 1726 MB/s Write\n\n**Performance Benchmarks on battery:**\n\nThe laptop can achieve full performance on battery as well, change from Better Battery mode to Best performance mode in the Windows battery settings.\n\n**Note:** On battery, Better Battery (and Battery Saver) mode locks the CPU at base clock of 1.8 Ghz to get maximum battery life. While using this mode, I did not suffer any hanging when doing casual tasks, (Web browsing, YouTube, Discord etc.)\n\nIf you wanna know something else about it. Please let me know. I'll try to get back to you as soon as possible.\n\n* EDIT #1: Added Benchmarks.\n* EDIT #2: Photo of the internals. [https://imgur.com/a/5WCUKW4](https://imgur.com/a/5WCUKW4)\n   * Disassembly video from YouTube (not the exactly same model): [https://www.youtube.com/watch?v=KzKF\\_9L1qfY](https://www.youtube.com/watch?v=KzKF_9L1qfY)\n* EDIT #3, #4: Added battery benchmarks, then deleted them because I tested them on Better battery mode which locks the clock speed to 1.8Ghz.\n* Edit #5: Cleaned up the post.\n   * Update as of 8 Sept 2021: I have been having some weird touchpad problem. [Details here](https://forums.lenovo.com/t5/Lenovo-IdeaPad-1xx-3xx-5xx-7xx-Edge-LaVie-Z-Flex-Notebooks/Touchpad-sluggish-Latency-Lag/m-p/5095310). This has not been fixed after a touchpad replacement so currently working on it. The issue does seem isolated to just me though.\n* Edit #6: Update as of 16 Oct 2022: The hinge is shit quality, it has broken twice till now in the exact same manner with completely normal use.",
  "I can confirm that the hinge quality is garbage. I use mine almost entirely at home, after 2 years of use I have used it no more than 30 times outside. I very rarely open and close the lid when I use it at home because I can sense right from the beginning the hinge quality is not the best although I did not expect it to be this bad. And yet the hinge broke! Together with the LCD!\n\nI paid RM170 (around 39 USD) just to get the one time on site repair because they said repair at the depot would take around 2 weeks time and I had no spare laptop. The basic, send in to the depot warranty covered the spare parts, luckily. So if you guys are planning to buy this model, **do consider to upgrade to the onsite warranty to 3 or 4 years** (depending on how long you plan to use the device). \n\nThe technician who came even told me this model and the model 3 are plagued with this problem. 7 and thinkpads fair better. I wish I'd known.\n\nPerformance wise, it is amazing. Still running strong after two years. (I open many tabs on Edge daily, at times 30-50 tabs, rarely any hiccup.) i5 11 gen, 16GB RAM, 512GB SSD. Heat management is superb as well. It heats up but never overheat, not once.\n\nCheers,  \nR.",
  "Thank you for the review! This is by far the most comprehensive one I've read about this laptop as it's just been released.\n\nI have a few questions-\n1. Do you notice a significant drop in performance (general multi tasking) when on battery vs plugged in?\n2. Does the 100% screen brightness hold up in well-lit rooms or under the sun?\n3. How was the initial set-up process like? Did you install any specific programs/drivers that helped?",
  "Thankx for the review, based on it I will no more 'struggle' with choosing a new laptop from Lenovo, I got a bit scared haha. I'm gonna carry on with my HP's. They have not failed me yet, and I have been happy with performances so far. :)",
  "**Beware: Major Touchpad Problem**\n\nI bought a Lenovo Ideapad Silm 5 laptop in Aug 23, and I thought all is well until a few months in. My touchpad stopped functioning but thankfully, the onsite warranty allowed me to change my motherboard. A few months down the road, the same issue arose, and I was told by the customer hotline to undergo numerous upgrading of software, restarting of laptop, etc, and the touchpad would mysteriously function after a months/weeks until it breaks down again. This laptop is reaching its 1 year mark, and the same issue still persists. It has been a major inconvenience, especially since a mouse cannot entirely replace the functions of the touchpad (i.e. pinching in/out to enlarge the text). To my dismay, I was told by the onsite warranty engineer that the touchpad issue is rampant in laptops of this particular model. I asked for an upgrade of my laptop or replacement of another model, but I was told that this was not Lenovo's usual practice. Am still monitoring the issue after the engineer has replaced the touchpad (for second time), but if anything, **please do not purchase this model** unless you are willing to forgo its touchpad.\n\nTrust me, their onsite warranty they provide is not worth in exchange for your sanity if you were to constantly experience the same issue. The warranty team somehow does not understand what \"intermittent issue\" mean, and they'll put you through the arduous process of troubleshooting and restarting, only for you to find yourself back to square one.\n\nP.S. My USB ports were also not working, but it's fixed atm.",
  "hey, nice review, i bought same laptop and it seems windows media player is lagging, like not working. it's playing like 1 sec of 1min video and it takes ages to load, i tried rebooting or reinstalling from settings but keeps doing same thing, i cant play audio nor video with media playyer, so now i am using vlc media player, any1 have a fix for that?",
  "Why, kind sir, did you decide on the 15 in version instead of the 14 in? Was there any other reason than personal preference?",
  "Omg, Thank You soo much for posting this review!!\n\n\nI am unable to decide between this Ideapad and the Legion 5 with 4600H as both are very similarly priced. \n\nCould you tell me what price did you buy this at? Cause right now, it is 68k INR. And is it worth the price?\n\n\nHow is the cooling on this laptop? Does it heat up under medium-heavy loads? Especially without air conditioning.\n\n\nDoes it stutter or lag a bit when you launch an app or open a web browser or type? Especially when on battery?\n\n\n\nI tried the Intel model for the Ideapad which apparently uses the same body and parts as the Ryzen 5700U model. I did not find the keyboard and the touchpad as good as I was expecting (but I could be wrong cause I only tried it for a few seconds). \n\n\nIs the battery replaceable/ easily removeable by the user? Or does one have to take it to a service center?\n\nI was also considering the HP laptops with Ryzen 5500U but the 15in (my preferred screen size) has a TN panel while the 14in does have IPS but is glossy (I need antiglare so it doesn't strain my eyes).\n\n\nThe Ideapad 5 and Legion 5 just seem so much better.",
  "Hey OP, can you tell me how much did it cost(INR) and where did you bought it from? Good review BTW!",
  "Bro did you figure out what's the part no for the sata kit? To add sata drive?",
  "Hey OP, where were you able to purchase this from? I'm looking for an offline store to pick it up but just can't find it anywhere. \n\nAlso, now that it's been like 70 days since the post, how's the laptop holding up? I'm really looking forward to picking this up and it seems to be the best at this price point",
  "Hey OP, can you post your battery performance report  over here ?",
  "Hi OP thanks for the review! \n\nHowever I have one doubt (please forgive if it is silly), can we add a sata SSD instead of HDD in the HDD slot?",
  "Is it advisable to buy this laptop now or has similar equally priced new laptops have been released?\n Thanks for the detailed review though",
  "Valuable information my friend, I have a similar laptop but the Pro series. Would I see a major difference in battery drain and temperature, if I turn on Extreme Performance in BIOS but Balanced mode on Windows?\n\nAlso, does it make any sense to do this for gaming purposes? Because if you're going to play while the system is AC wired the TDP would be higher than 25W anyways, am I right?",
  "[deleted]",
  "Thanks for the updates, especially on the hinge issue.",
  "I have a two-months-old Ideapad 5 15ABA7 which has exactly the same design as previous model and I'm worried about the hinge even though it comes with 3yr warranty",
  "Hi,\n\n1. The performance drop is not noticeable doing casual tasks on battery vs plugged in. Tried loading web pages and video playback. 4k60fps video playback is smooth on both. \n2. 100% screen brightness definitely holds up in a well lit room, I cam easily manage at 70% brightness in my room. This is probably the best you'll get in this price range, most competition only offer 250 nit screens while this is a 300 nit screen.\n3. Set-up process is pretty classic for windows. The only bloatware was McAfee which I promptly uninstalled. I found once that Lenovo Voice assistant was using 50% of the CPU (it may be updating), so uninstalled that as well. As for driver updates, Lenovo Vantage software is great, check for system updates and install the updated audio drivers from there.",
  "Please check EDIT #4, there was an error in performance test on battery.",
  "I didn't really have a preference, absolutely wanted to get 16GBs of RAM but the 14 inch version only offers 8Gb of soldered memory. There is only a 200g difference between the two, so didn't make a difference.\n\nPlus the extra HDD slot might be a nice benefit in the future.",
  "Please check EDIT #4, there was an error in performance test on battery.",
  "Please check EDIT #4, there was an error in performance test on battery.",
  "Which model did you buy",
  "68k, local store. Got a complimentary bag with it. Thanks.",
  "Yes",
  "I purchased it from an offline store. If you're unable to find it offline, it often becomes available on amazon for 68k when the seller is Appario retail.\n\nI am having a very weird problem with the touchpad. It randomly gets an input delay when using it.  [Details here.](https://forums.lenovo.com/t5/Lenovo-IdeaPad-1xx-3xx-5xx-7xx-Edge-LaVie-Z-Flex-Notebooks/Touchpad-sluggish-Latency-Lag/m-p/5095310) The issue does seem me to be isolated to just me though. I have already gotten a touchpad replacement but the issue didn't get fixed. So still working on it.\n\nApart from the touchpad issue which I randomly get, everything else is completely fine.",
  "Yes SATA SSD can be used as well. Internal Sata cable doesn't come pre-installed. You'll need to go to service center to purchase and get it installed.",
  "IdeaPad 5 is still a good option for 68k. \n\nApart from this, Asus K15 Oled with 5500U, 8GB seems like a sweet deal at 58k on Flipkart during sale. Downsides would be 8Gb of RAM and a 42Whr battery. The ram is expandable to maximum of 12 or 16 gb idk. If you can look past the smaller battery, it has a freaking Oled. You might be able to get some extra battery life by using dark mode because of the Oled display.",
  "No need to go into BIOS to change performance mode, you can just change them from within windows with Lenovo Vantage. Or press Fn+Q\n\n***About the second question:-***      \nWhile AC is connected windows power modes don't really do much so you can ignore them. Between the three windows power modes there is very little difference in terms of CPU power usage (maybe 1W difference between each mode).\n\nBIOS performance modes behave exactly the same both on battery and AC. Which means TDP limits will be the same on both AC and battery. Which means if the game demands more than 25W sustained power, Intelligent cooling mode will limit performance.\n\n***About the first question:***\n\n**Under low load:-**   \nThe difference in battery life will only be caused by the fact that extreme performance mode likes to enable the fans even under very light load.\n\n**Under moderate load:-**    \nThere should be no difference for battery life and heat output in between the different BIOS power modes or windows power modes.\n\nThe reason why low and moderate load don't cause significant differences in battery life between the different power modes because the CPU only uses as much power as it needs, it is not going to consume more power if the program itself doesn't require it.\n\n**For heavy load:**\n\n**If using better battery mode (windows):**    \nThere should again be no difference in between any of the BIOS power modes.\n\n**If using better performance or best performance mode (windows):**     \nThere will be lesser battery life and greater heat output in Intelligent cooling mode compared to Battery saving mode. The difference would be greater in Extreme performance mode. However, you will also be getting better performance.",
  "Yes, it broke twice in a period of about 15 months without ever dropping the laptop.",
  "14 inches is the length of 0.3263 'Custom Fit Front FloorLiner for Ford F-150s' lined up next to each other",
  "Okay, good for you. Do you know if the 8GB version comes with 4gb soldered + 4 replaceable, or 8 soldered and one empty slot?",
  "Thank You for the detailed review!! :)",
  "Which store did u purchased it? Is it from lenovo official store? Because I also want to purchase this but while I'm seeing online, it's price is 73,900 like that...",
  "Could you paste the part no? I couldn't find it on Lenovo's website",
  "Okay that's awesome to know. Do you mind telling me which offline lenovo store? I could try there then",
  "Perfect, thanks :)",
  "Thanks for the reply. I have kinda settled on the ideapad 5 for now.\n\nOne more question if I may ask, would you recommend the amd 5700U version or the Intel i5 11th gen version? Price more or less being the same?\n\nMight game lil bit of eSports titles but not very frequently or not for all day long.\n\nCheers!",
  "Good bot",
  "The 8gb is completely soldered, no slots",
  "Yes, from a Lenovo Official Store.\n\nAlso its sold out on Flipkart but price is 68k. [Ideapad 5 on flipkart](https://www.flipkart.com/lenovo-ideapad-slim-5-ryzen-7-octa-core-5700u-16-gb-512-gb-ssd-windows-10-home-15alc05-thin-light-laptop/p/itmc7b60a776b514)",
  "5C10S30033\n\nIt's available in the spare parts website link I've given, choose the filter as HDD parts.",
  "It was a Lenovo exclusive store. You can locate the store for your area from their website. https://buyalenovo.com/\n\nThe laptop is currently available on Amazon for 67k and a SBI card discount of Rs 1,750.",
  "5700U is definately better. \n\nFor day to day tasks, both CPUs are gonna be just fine. Both also offer similar frame rate in games. The difference is gonna be when you do heavy CPU focused tasks which can take advantage of the 8 cores of 5700U. \n\nBut if performance isn't a priority and you're able to get other stuff of value such as bigger battery/better build/better screen etc. You can consider i5 viable since you aren't gonna take advantage of the extra cores of 5700u anyway.",
  "Thank you, KKMasterYT, for voting on useles-converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
  "Yup I've seen it, too bad stock is not available...I'll try in lenovo stores if it's available",
  "Thanks man, I'm thinking of getting similar laptop is US.\n\nThanks man",
  "👍🏻",
  "Great 😀. Sure np.",
  "Razer blade 17 vs lenovo yoga/legion vs hp spectre/omen Hi, looking for a new laptop and would love some help. Got a spectre from 2018 and battery been replaced twice... Looking for something new that has the best 4k/UHD resolution ideally, and can be great for AAA games, and also a powerhouse for work/processing bunch of software/tabs/etc... Saw this seemingly great deal but I'm not that sharp about if this is actually a good deal or not... I like the idea of touchscreen and 2 in 1 but not bound to it... Most important is visual quality and processing capability... TIA! ",
  "Not this one a 3070ti is not enough you can find a laptop with a 4080 is you shop around at this cost",
  "I'm not too sure on the US side of things but the laptop you showed in the screenshot seems like a pretty good price. Personally, I stick to Asus for my gaming laptops but if I were to choose another brand, it would 100% be razer",
  "Fuck omen, honestly it's such a pain in the ass. Stick to razer",
  "Ordered the legion on sale at Walmart right now thanks everyone",
  "Thanks, what's the difference?",
  "What's the pain of it?",
  "Which one",
  "50%+ performance is the difference",
  "Much more powerful GPU and can handle up to 4k gaming performance. Its really just overall better and anyway you can imagine. With the current sales going on you can have the 4080 for this cost and maybe cheaper not to mention is it the current generation of GPU until the next new thing come to bare",
  "The usual HP problems- hardware failure, fragile, probably bad thermal performance",
  "Poor cooling, Build quality is lacking, Super loud.  I was never fully comfortable using my omen for the 4 years I had it. It always had something wrong with it",
  "[removed]",
  "Gotcha, yeah wound up getting the legion pro 4070!",
  "Seems like the best deal under 2k right now",
  "I got a legion pro too when my omen kicked the bucket. Its such an awesome laptop!. But word of advice, get a laptop stand so you can lift it a bit since the exhaust can release hot air on your hand from the side. Using a stand completely fixes the issue 👌",
  "Pretty good one",
  "Nice! Yeah already got one, got a 55 ark screen coming too, maybe switch to keyboard and prob put laptop to the side... I'm new to having a good setup lol",
  "The legion pro screen is already super nice. But going that route would be cool as hell too.\n\nEnjoy it !",
  "Acer asAspire 3 or Lenovo V15 G4 I found these 2 on similar price around $800. Which one is a better bang for the buck?\n\nRyzen 7 5700u vs Core i5 13th gen\n32GB vs 24GB Ram\n\n",
  "Will this laptop be good for basic gaming and daily tasks? (Lenovo IdeaPad Gaming 3 15ACH6) The laptop I want to buy for Christmas is a Lenovo IdeaPad Gaming 3 15ACH6 (82K20272RA) Shadow Black.\n\nI'm really bad at laptops and all that stuff...\n\n**Screen**: 1920x1080 Full HD 60 Ghz IPS 250 nit  \n**Price**: 600$ (pretty cheap in my country)  \n**CPU**: Ryzen 5 5500H 4 cores 3,3 (4,2) GHz  \n**RAM**: 8 GB DDR4 3200 GHz  \n**Space**: 512 GB SSD  \n**GPU**: GeForce RTX 2050 4GB Discrete GDDR6  \n**OS**: Windows 10\n\nEvery day I play Minecraft and emulated Nintendo games, sometimes Roblox, and very rarely some basic horror games from Steam. I don't need high graphics, I always play with low.  \nI also watch YouTube and type a lot. Maybe I will need some programs like Excel and MC Access for my college classes.\n\nShould I buy it? It has good reviews",
  "If that price is acceptable to you, it will do what you need it to do just fine. I would suggest you buy another RAM stick, 8 gb, and add that to the system, and you'll be set for a few years. \n\nMake sure that model can add RAM, because if not, it's not worth it. Use Google to check the model of your laptop for this. 8 GB by itself is not enough to multitask without running into annoyances.",
  "i dont know, half of my life I've been using 2gb of ram with very outdated OS and my current laptop has 6gb, it's just old. I always thought that 12, 16 gb etc is too much",
  "you could get by with it before, but Windows 11 really wants you to have more than 8gb to be effective. An 8 gb stick of sodimm ram should be super cheap, no matter where you are - it will greatly improve your ability to keep using this laptop and game on it, study, watch videos etc.",
  "is 8 gb still good for Windows 10? im not sure if I will buy +8gb. And I will only use Windows 10",
  "My budget is 52k And i am thinking to buy lenovo ideapad gaming 3 if anyone is currenty using this laptop or has used This laptop before  ------------------------------------------------------------------------\n\nPlease give my Reviews about this laptop especially  cons and   should i buy this and if any one know a good alternative please let me know \n\nThankyou 🤝",
  "Need suggestion between Lenovo Slim 1 and Slim 3 I have a very tight budget and I want a laptop with at least 16 GB RAM. I want speed at everything I do.\n\nI would mostly work with Excel spreadsheet with Macros and VBA and heavy formulas.\nOccasionally I would watch movies or tv series and YouTube.\n\nAnybody who has had experience with any of the 2 laptop or know more about these please do help.\nI am a non-techie😅\n\nKindly help....\n\nLimited-time deal: Lenovo IdeaPad Slim 1 AMD Ryzen 5 5500U 15.6\" HD Thin and Light Laptop (16GB/512GB SSD/Integrated AMD Graphics/Windows 11 Home/MSO 21/1Yr ADP Free/Cloud Grey/1.61Kg), 82R400ERIN https://amzn.in/d/1bAdikB\n\nLimited-time deal: Lenovo IdeaPad Slim 3 AMD Ryzen 7 5700U(16GB DDR4 RAM /512GB M.2 NVMe SSD/Windows 11 + MS Office 21/Backlit KB /15.6\" FHD 300Nits Anti Glare/1Yr ADP Free/Arctic Grey/1.65Kg), 82KU024GIN https://amzn.in/d/4PvDNYP",
  "which one you choose?",
  "I am planning for slim 1",
  "Is it good? Planning to buy it. Can you share a review about this? ",
  "I bought Thinkbook 16 gen 7, with AMD Ryzen 5 7535H",
  "LENOVO IdeaPad Gaming 3 16\" - Good or Bad? Hey, everyone! If anyone has owned or still owns a LENOVO IdeaPad Gaming 3 16\" laptop, would you be able to give your review on it? \n\nI've attached the specs on the second image.\n\nI just want to know if anyone has had these models or similar and if there are any red-flags or things I should be aware of (problems/issues wise) before finally committing. Any \"poor manufacturing choices\" that are present before I buy?\n\nI plan to use the laptop for Uni, basic Word, Powerpoint and OneNote. Also plan to use it for AutoCAD and Inventor for both 2D and 3D modelling.",
  "Aswell as personal use like gaming: Fall Guys, Rocket League, Grounded, GTA5 and maybe RDR2. Alongside recording with OBS and video editing with Da Vinci. I honestly don't mind the performance of the games I play (simple 30-60fps, 1080p with medium-high settings would do me good).",
  "The RTX 3050 is kind of slow. You're going to get a lot more if you get a higher tier one!",
  "Given my budget being around £500-600, and it being brand-new, still a good deal, right?",
  "Lenovo Ideapad 5 Pro 16\" Review (Comparing to Dell/HP/Samsung) My old HP Envy broke so I purchased 3 consecutive laptops and returned them all. The new HP Envy screen made my eyes hurt, the dell Inspiron 16 had really odd sounding speakers and shut down randomly even after re-installing windows, and the Samsung Galaxy Pro Book was sleek and well built but the screen was very pixelated. All where Ryzen 7 besides the Galaxy which was i7\n\nThe fourth laptop I tried was the  Lenovo Ideapad 5 Pro 16\" QHD Laptop with AMD Core Ryzen 5 5600H / 8GB RAM. I got it on sale for $500 and thought it would be very basic.\n\n1. The build is awesome and has the best keyboard out of all 4 laptops I've tried. Sleek and seems light but sturdy.\n2. Sounds is great and features like face-scan sign in are appreciated.\n3. Start up time is fast fast fast\n4. Also, I accidentally put a lot of my weight on the screen (laptop was shut) when trying to kill a bug on the wall and the screen survived no blemishes.\n\nCon:\n\n1. Matte screen is not super appealing but the more I use it the more I don't mind a matte screen at this price range.\n2. I would not want to pay $900 for this but if you can get it under $600 thats a real deal.\n\nThis is my first Lenovo and I am impressed so far, for $500 total paid this is an A+.",
  "I own the newer model of this with a Ryzen 6800HS RTX3050 and 16/512GB that I got for $1100 and I like it a lot. There is also a Ryzen 6600HS RTX3050 16/512GB for $840. An Intel 11300H MX450 8/512GB model for $530.\n\nThey all have the same display and build quality and its a pretty solid line up to pick out how much horsepower you need in this budget friendly yet premium design.",
  "Having owned the galaxy book pro, it doesn't use Ryzen. It's an Intel based laptop with Intel's evo certification.",
  "They all have the QLED matte screen?",
  "Hey, \nHow good is temperature x fan noise, battery life? \n\nI am thinking of buying the ThinkPad 5 Pro R7 6800HS or Yoga Slim 7 ProX R7 6800H or Zenbook Pro 17 R7 6800H, but I am not sure which one is the best choice :D",
  "Hi, sorry to bother you again, but I bought that laptop as well and I am facing an issue sometimes... when i close the lid and open it after a while, sometimes I can't wake it up. Have you encountered something like that?   \nSeems like a software issue to me, but I don't really want to reinstall it after I signed up into everything and so on :D",
  "That's right, Ill update the post.",
  "QLED? They all have 2.5K QHD 100% sRGB 350nit 16:10 16” matte displays. Some of them are 120Hz too like mine.",
  "Thermals are good since the wattages are low. It’s like 35W CPU and 55W GPU or something like that. Fan noise and surface temps are also good. Cooler and quieter than my brothers G14 but then again his laptop pumps way more wattage to the components.",
  "How about [Ideapad 5 Pro](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-500/ideapad-5-pro-gen-7-(14-inch-amd)/len101i0057) for $850 vs M1 Mac Air with (16+256) for $1,137 and a $150 gift card?\n\nI'm going to use it for my research tasks for example using three browsers and keeping at least 15 tabs in each of them open simultaneously and running one word processor that's it\n\nI can deal with external storage without any issues. What would be the actual battery backup of the 6600HS version? My primary requirement is longevity, that it should at least survive my multiple browser tabs for 5 to 6 years. I have been using one IdeaPad 330S 14\" by Lenovo with 8 GB of RAM and 512 SSD, with one TB hard drive and extremely poor battery life that is for 3.5 hours and I've been using it for a 3 year and 8 months. Do you think if I do not take Apple Care Plus then I should not be touching Mac and I would be better off with one Windows device?\n\nI don't use any Apple products. Fixing Apple with out of pocket is surely scary! But, I just can't find a Windows alternative with similar battery life. While Apple is asking significantly more money for less RAM and storage, but yes I understand that there are things beyond RAM & SSD for which they are doing it. I have been used to cheap Windows machines so much that I am pretty reluctant to pay 850 for a Windows machine. I am building this argument in my head that if I am going to pay above 850, then it shouldn't be a Windows machine. But, then comes the back and forth discussion on what are you getting for your money actually! It is frustrating! I still can't decide.",
  "Yes disable the smart face detection features. In Lenovo Vantage there’s a thing that will automatically sleep when you walk away and auto wake when you come back. It does this by looking from the IR camera. I found turning this off fixes the lid sleep wake issue.",
  "Got it, that’s what I meant sorry. How do you like the matte finish versus the newer shiny alternatives it looks a little retro but I guess it’s easier on the eyes.",
  "Great, thanks! And the battery life? In specs is usually around 9h, but I didn't find any review in English so...",
  "Battery life will be better on the mac and the 16GB RAM will go farther in MacOS than in Windows. The Pro 14 probably gets around 10 hours real world use depending on what you're doing but the M1 Air gets like 15 hours real world use.\n\nMacOS is more efficient with RAM and swap so a 16GB M1 Air will feel more like 24GB in Windows. That is the major downside to the Ideapad Pro line is the soldered RAM. I got 16GB soldered and I am fully aware of the RAM limitation in Windows, and I am fully prepared to run Linux in a few years if I need my RAM to be used more efficiently.\n\nHonestly the only reason I got the Ideapad Pro 16 over a Mac was 1. I like to game while I'm traveling and 2. I wanted a bigger screen. The only big laptop Apple offers is insanely expensive. I get like 80% of the experience for half the cost. But the Ideapad Pro 14 vs the MBA 13, you don't really lose much with the MBA in terms of screen real estate, but you gain so much in battery life and RAM utilization without paying twice as much.\n\nDo you live near a micro center? If so, check if they have any more of these refurb Ideapad Pro 14 in stock. This is a killer deal for $500 for almost the exact same laptop just with a 5600U from last year instead. https://www.microcenter.com/product/648423/lenovo-ideapad-5-pro-14-laptop-computer-refurbished-grey",
  "Great, thanks.\r  \n\r  \nI found these features very interesting, but it makes sense it causes problems. Turned them off, will see tomorrow. \r  \n\r  \nBut so far, great laptop for that price, only 32GB RAM could come handy sometimes. :D",
  "I don’t like glossy. At only 350 bits it’s bright enough but not bright enough to fight a glossy reflection.",
  "Office work in power saver mode I get around 8-10 hours\n\nGaming on iGPU in balance mode around 2-3\n\nGaming on dGPU on performance like 1 maybe 1.5",
  "Here is a review of the AMD model from last year. [https://youtu.be/yDdmVlnA\\_HY](https://youtu.be/yDdmVlnA_HY)\n\nAnd the Intel model. [https://youtu.be/Hu5FHcMMgLc](https://youtu.be/Hu5FHcMMgLc)\n\nThey're both basically the same laptop, just with different internal specs.",
  "This is extremely helpful. Even if I pay around $1140 (for M1 Air 16+256GB) i.e. $250 more (not counting the $150 gift card) than IdeaPad 5 Pro (16+1TB) it would be a good investment, right (even if I am not into the Apple ecosystem)? Again, my priorities are longevity, and good real world use. I am a grad student from literary background, so research and writing is what I do. No gaming or using intense softwares at all!\n\nI am scared to use any refurbished product unless it is a personal source or something like that. Would it still be wise to think about the refurbished one from micro center? I mean the price is really good! Just have to be lucky to not run into troubles.",
  "Lmk if it worked.",
  "Wow, that's great, thanks.",
  "I would say the M1 Air is worth the investment especially for just reading and writing. I’m a scientist and spent most of my PhD reading and writing papers too. If not for gaming, I too would enjoy an M1 Mac. My wife has one. Real world experience is just flawless.\n\nIf you are on a budget though and that micro center option is available I would go and check it out. It’s a Lenovo refurb so it’s from the factory, micro center is just the store front. MC has some of the greatest customer service in the world so if you’re at all interested just go in and ask them about it. Since it’s a factory refurb it likely has a warranty on it.",
  "Get an LG Gram.",
  "seems like it is, so thank you!",
  "After a while I have to say that it still doesn't work as It should.   \nI put it in sleep mode manualy from Windows start, close the lid and the next day I can't wake it up again - but It might be because it still drains battery and in Windows I see \"Screen on 11h\" as the battery drains almost 10%/hour even though it should be in sleep.   \nTried clean install but the issue still continues.\n\nIdk, I will prolly try to contact Lenovo if I won't fix it today, cause it might be hw issue... great.",
  "It took some tweaking to make sure nothing was running on the dGPU when I’m just doing office work. But after about a week of diligently checking the 3050 usage I got it down.",
  "Wonderful! I have dropped a text into your chatbox.",
  "Ah! Too late! Went with the [Lenovo Ideapad 5 pro 14\"](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-500/ideapad-5-pro-gen-7-(14-inch-amd)/len101i0057) for $750 with tax.",
  "Did it ever get resolved?",
  "Hey man, have you been happy with your purchase?\n\nI’m asking because I’m looking for a new laptop for the exactly same usage as you (postdoc researcher), and am considering the same options as you did (Ideapad 5 pro vs M1 Air). Currently leaning towards the Ideapad because it’s on sale for a good price at a local retailer and I don’t have too big of a budget right now. It would be about 400€ cheaper than the Air.",
  "Depends, the issue is audio driver from some reason and they obviously didn't fix it - [https://www.reddit.com/r/Lenovo/comments/xggq44/ideapad\\_5\\_pro\\_wont\\_wake\\_up\\_from\\_sleep/](https://www.reddit.com/r/Lenovo/comments/xggq44/ideapad_5_pro_wont_wake_up_from_sleep/)\n\nSince I downgraded to older realtek driver (I have to do this kinda often, since windows likes to upgrade it back), this issue has been \"resolved\".",
  "I am getting 8-9.5 hours battery from moderate to low use. The screen is fabulous but have to keep the brightness at 70-80 in mid to high lit condition since it's not anti-glare. All the complaints about fan noise is absent for me. I have been using it for almost a month but the fan has never kicked in with high pace, whenever it did, it was very silent. I work at rooms with 4-5 people and mostly at library, no noise at all! The keyboard is a Lenovo chicklet, so sort of standard if you have used Lenovo ideapad series before. No lag till now for my work flow (CPU 30-60%, MEM 50-70%). I don't game, so can't comment on the graphics. Build quality is on the premium side. Tested the speaker by comparing with last year's XPS 15, apart from the bass, it's good for the money. The 1TB SSD has totally doable speed, but no extra slot. Wifi 6 is upto the mark here.\n\nTake M1 if you want more battery, a bit more PPI, a better speaker, be connected to the Apple ecosystem, and do not mind the bezels and are fine with Apple repair costs.\n\nI didn't want to pay $1000+ for the 512GB+16GB M1 version in the hope that it would last me for 5 years without any issues. I decided to pay $750 with the hope that it would last me 4 years and then I can buy another!",
  "Thanks for this. \n\nI was on the point of pulling the trigger on this one last night and suddenly started seeing these warnings people were posting.",
  "Interesting followup on this.\n\n1. As I was waiting for your response, I now see that the laptop I *almost* bought has a 20% discount *today*...but\n- Also why waiting, I discovered a fix for my existing laptop problem and I don't even *need* a new laptop anymore...it's charging again.",
  "Thank you for taking the time to write such a detailed reply! Still going to have to think about it for a bit, but you gave some really useful information.",
  "Lenovo Ideapad Slim 3 (R5 5500U) or Acer Aspire 3 (I3 1215U) ?? Buying a laptop for my father, entry level, fast and good battery, mainly used for minor office and home tasks and media streaming. Laptop is going to be safely used for normal tasks, low to none gaming. IPS Display is a must and okay with both the cpus.\n\n1. **Lenovo IdeaPad Slim 3 R5 5500U 15.6\" IPS LCD (16 GB/512 GB SSD/Win11 Home, MS Office)** *@ 32500INR/380USD* and \n\n2. **Acer Aspire 3 I3 1215U 14\" IPS LCD (8GB/512 SSD/Win11 Home, Backlit)** *@ 27990INR/334USD.*\n\nMainly concerned about the **build quality** and **reliability**. *Cause found conflicting and mixed reviews about acer*. Will Acer be a good deal over Lenovo.\n\n**Will need HELP for quick decision as need to buy asap.**",
  "Lenovo Thinkbook G5 (R3 7330U) or Ideapad Slim 3 (R5 5500U) ?? Buying a laptop for my father, entry level, fast and good battery, mainly used for minor office tasks and media streaming. These two on shortlist                                                                                                                                        1. **Lenovo IdeaPad Slim 3 R5 5500U 15.6\" IPS LCD (16 GB/512 GB SSD/Win11 Home, MS Office)** *@ 32500INR/380USD* and                                                                                                                                                                  2. **Lenovo ThinkBook 15 G5 R3 7330U 15.6\" TN FHD (8GB RAM/512GB SSD/Win11 Home/Fingerprint)** *@ 27000INR/320USD.*\n\nAppreciate great metal body of thinkbook and nicer cpu but deal breaker for me is the awful *TN display* with disaster viewing angles and colors. biggest plus point on ideapad is being *only IPS in range*, rest is better on thinkbook. also going to look at screen all the laptop's life, movies or work so it is kinda major point. But in a dilemma after reading reviews on quality of ideapad. laptop is going to be safely used for normal tasks, low to none gaming, so okay with 5000 series processor.                                                                                                              others on list were *Lenovo IdeaPad Slim 3 Intel Core i3 1215U* and *ASUS Vivobook 15 (2024) Intel Core i3 1215U*\n\nEmphasis on build quality, cpu and display.\n\n**Will need quick decision as need to buy asap.**",
  "Lenovo ideapad 3 15IAU7 Reviews Hi, I'm planning to buy a laptop for school purposes and coding. My budget is Php 20-30k. I'm planning to buy the ideapad 3 15IAU7. Any feedback from current users? TIA.",
  "Lenovo IdeaPad 3 Laptop WOWPC Bundle (40GB RAM | 1TB PCIe SSD) Hey, so I am looking for an affordable laptop for Adobe Illustrator and Photoshop work (for a fashion business that regularly works on 1-6gb AI files). \n\nI came across \"Lenovo IdeaPad 3 Laptop, 15.6\" FHD Touchscreen, Intel Core i5-1155G7 4-Core (Beats i7-1065G7), Intel Iris Xe Graphics, Wi-Fi 6, Long Battery Life, Win11, w/WOWPC Bundle (40GB RAM | 1TB PCIe SSD)\" on amazon for 650$ and dont know how I feel about the 40gb Ram + 1tb SSD package. Does this seem legit? If not, any recommendations for a budget laptop for AI and PS work?",
  "They've got mixed reviews online but it's clear from their Amazon listings they sell WAY more laptops than they get bad reviews. The computers are opened and upgraded from their original specifications possibly voiding the original warranty. \n\nThat said, I just ordered this exact laptop myself, I'll update here in a few days and let you know how it's performing. I'll most likely buy a third-party warranty to be safe regardless (like Asurion).",
  "Update: The Lenovo was the cheapest feeling laptop I think I've every held. I returned it and spent $150 more for an HP, Core i7.",
  "Is \"Lenovo IdeaPad 3 Ryzen 7 5700U 15.6\" FHD Laptop with Windows 11\" good? please someone give me review  I want to buy a laptop but I don't have any knowledge. A friend of mine suggested to buy this laptop so here I am asking if it would be good",
  "Depends on price",
  "After all these years, I finally bought my first gaming laptop, the Lenovo Ideapad gaming 3! ",
  "Nice bro, happy gaming!",
  "Does it have a 1650?  Tried looking it up",
  "nicee",
  "I have the same one",
  "I'm thinking of buying this. Reviews please?",
  "Happy gaming!",
  "It has a 3050",
  "Looks like an rtx sticker on there, so my guess is 30 series, not sure which card",
  "https://youtu.be/yvCxJkReaSU\n\n\nThis is a gaming test done on this model",
  "Been using it for about 2 months, i do light gaming and other stuff. Really good for that. Haven't really installed any AAA games. I only played PUBG, Valorant, Cities: Skylines and Efootball, did really well in these games. If yoiu have the 8gb variant try to get another 8 gb stick and run it in dual channel(alternativly buy 2x8 gb sticks(x8) as the default ones are x16), it will work really well.",
  "Likely a 3050",
  "Lenovo ideapad flex 3 11igl05 RAM/CPU upgrade  Okay, so I picked up the Lenovo ideapad flex 3 11igl05 for £100 on sale; It was a fantastic purchase. But, the lack of decent RAM is starting to hurt for my useage case. Everywhere online is saying it can't be upgraded, but how true is that? Given I was determined enough, is there really no way to beef up the RAM/ CPU?\n\nI don't need advice on how to use it more efficiently.",
  ">is there really no way to beef up the RAM/ CPU?\n\nThere isn't.\n\nRead this review, it might share more information for your device:\n\nhttps://www.notebookcheck.net/Lenovo-IdeaPad-Flex-3-11IGL05-laptop-review-Quiet-efficient-and-slow-convertible.478815.0.html",
  "I have read up on it... I was just hoping that someone knew a way around it. Thanks though.",
  "Yeah these laptops remind me of netbook days. Max 2GB of RAM and small screen with ATOM CPU's.",
  "That does stink. I just have the clamshell Ideapad 5 model, and it can be upgraded. I noticed shopping around it is really hard to get a flex laptop with a ram chamber although I don't really understand why that is.",
  "I should've checked before buying, but at the time it worked good enough. I think its because of the fanless design, anything too powerful would overwhelm it?",
  "Laptop review : Lenovo Flex 5 (16GB/256 GB/Ryzen 5 4500U/Touchscreen) Hi all, \n\nThought of making a detailed review of my laptop. I and my gf both bought this laptop exactly one year ago, and have been using it every single day since (I'm typing this review on my Lenovo Flex). [Here's](https://www.amazon.com/Lenovo-Flex-Touchscreen-Included-Keyboard/dp/B08PK6QKTH/ref=sr_1_1_sspa?dchild=1&keywords=lenovo%2Bflex%2B5%2B14%22%2B2-in-1%2Blaptop&qid=1630698374&sr=8-1-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExWEtXNE5EQ0NBSzhGJmVuY3J5cHRlZElkPUEwNTg5MzEwMThOQjNJVFRWMFUwQyZlbmNyeXB0ZWRBZElkPUEwOTczMjk1MU81UFFaWDVDSEJHWiZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&th=1) an amazon link. We got it for $599 each, unfortunately now it is 100 bucks more. *Btw I am not getting paid to do this. I am a grad student and I wanted to contribute by telling my experience with my gadgets.*\n\nBelow is my experience, and my gf's is exactly same. I am not a programmer or heavy gamer so I won't be reviewing those aspects. I'll try to include all little details in the below lists: \n\n&#x200B;\n\n**Pros:**\n\n*  Great Keyboard! I mean it! The keys just seem to be exactly where my fingers want them to be. No broken, malfunctioning or erratic behaving keys yet.\n* Two levels to keyboard backlight, the higher one is pretty bright.\n*  Great design : slim, light and sturdy build.\n* Great trackpad : smooth, feels very natural to use it.\n* Pen for writing is included in the package. I use my computer for all my research and class work. It's so convenient that have moved all my books, notebooks, documents etc. fully electronically.\n* Good RAM and processor : I multitask with around 15 applications open simultaneously. No problems with this laptop! I have played Halo 3, Halo 4 on highest graphic settings without noticing any lag or frames dropping. \n* Fingerprint sensor and SSD make logging in so quick and easy.\n* Camera has a physical shutter: this one is important for me, I'm one of those people who forget to turn or mic/camera on zoom meetings.\n* Battery is awesome! Easily lasts 5 hours even after 1 year of use. Charges fast, and if used battery saver and not too heavy applications, the battery can last 8 hours for me as of now.\n\n&#x200B;\n\n**Cons:**\n\n* occasionally, once in a month or two, blue screen of death error appears. \n* With Onenote AND zoom/slype open, onenote freezes the computer and then it needs to be restarted using power button.\n* The pen consumes one AAAA battery every 2-3 months, even when not used. \n* Cannot draw well using the pen coz it jitters a bit, it is not as precise as apple pencil; but overall good enough to do college work/ take notes.\n* Fingerprint reader works about 3/4 times, but when it works it is fast.\n\n&#x200B;\n\nThat's all! \n\n&#x200B;\n\nConclusion and TLDR : Overall it's an amazing laptop, with brilliant performance and as few little problems & annoyances as possible. If you're looking for a laptop for everyday use/college, I'd definitely recommend it.",
  "Biggest issue is the lack of DisplayPort on the USB-C imho.\n\nOtherwise it’s a great laptop. The airflow from its fans is incredible allowing it to not be too noisy. Also really nice price on those - shame the laptop manufacturers haven’t until recently started to treat the AMD processors with more respect - I still have an AMD laptop on order with HP since March that they haven’t fulfilled.",
  "[removed]",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Lenovo Flex 5 14\" 2-in-1 Laptop | FHD Touchscreen | 6-Core AMD Ryzen 5 4500U | 16GB DDR4 RAM, 256GB PCIE SSD, | Digital Pen Included | Backlit Keyboard | Bundled with Woov Sleeve | Windows 10, Grey \n\n>**Company**: Visit the Lenovo Store\n\n>**Amazon Product Rating**: 4.8 \n\n>**Fakespot Reviews Grade**: F\n\n>**Adjusted Fakespot Rating**: 0.8\n\n>**Analysis Performed at**: 09-03-2021 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lenovo-flex-5-14-2-in-1-laptop-fhd-touchscreen-6-core-amd-ryzen-5-4500u-16gb-ddr4-ram-256gb-pcie-ssd-digital-pen-included-backlit-keyboard-bundled-with-woov-sleeve-windows-10-grey) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "5-8h of battery sounds pretty mediocre",
  "I have seen other reviewers mention that the pen is very accurate. Do you think it's good enough for digital art? Also lots of people complain about the low color gamut on the display, did you feel like the colors are dull? \nI plan on buying the laptop but the screen makes me wanna reconsider, I plan on getting better at digital art and don't wanna buy a separate tablet so I thought a 2 in 1 would be good, but if the pen isn't good enough for drawing I'm gonna have to change my plans entirely.",
  "How is it so far?",
  "I'm not sure what that is, but I just use an HDMI cable to connect to TV. The fans make almost zero noise, except when charging the laptop.",
  "256 will be fine. the flex also allows you to swap out the ssd to a 512 or bigger i believe.",
  "It used to be 9-10 hrs when I bought it, now has decreased. Still pretty solid compared to my old laptop with 4 hour at best",
  "Idk why are other mentioning that pen is accurate..imo it's not accurate at all, and it consumes one battery every 2-3 months. It's definitely not suitable for digital art. I only have used Wacom intuos for handwriting previously, but wacom's pen is super accurate and non-jittery. This one's is jittery and slow about 60 percent of times that I use it, overall cumbersome to consistently work with, that's why I have switched back to pen and paper mode of note taking. \nAbout the color gamut, I am not sure but I don't have any problems with the display yet.",
  "I'm also a beginner at digital art and I bought the Lenovo Flex 5 (Ryzen 7 4700U, 512GB SSD, 16GB RAM version), and I think that the pen works quite well.\n\nHere is one drawing that I made:\n\nhttps://i.redd.it/cjxyvkwoqit71.png\n\nYes, the drawing is bad, but it is on me. If you focus on the lines, you'll see they're flowing, not jittery. I'm not saying it's perfect, but it's definitely good enough for someone who is just starting out, in my opinion. \n\nThe screen however does have inaccurate colors. It is good enough for every day use and you may not even notice it while using it/drawing, but if you draw an image then show it on another screen with better colors you'll immediately spot the difference. I was actually really surprised how saturated the colors were when I uploaded the drawing above and viewed it on my Galaxy S20. For accurate paintings and color work you'll definitely need a second screen, unfortunately.\n\n**EDIT:** I'll add however that I never used any other pens that are more advanced and I'm a beginner so I may not be aware of any problems it might have. Also the pen seems to bug out and overshoot lines on some software like Clip Studio Paint, but works well on others like Photoshop and Krita.",
  "i switched to apple ecosystem last year but it still working almost like new...except maybe battery is a bit degraded",
  "You can only run one external monitor not 2 (many laptops offer USB-C DisplayPort Alt mode). This laptop doesn’t sadly.",
  "I suppose it depends on what exactly you're doing. \n\n9-10 hours sounds decent but that drop over just a year is a little concerning.",
  "I see, thank you for posting this!",
  "how is both of em so far? and which ones better?",
  "Maybe, but this drop is normal after a year for me, especially coz I forget to disconnect charge in night sometimes. But I have only had 3 laptops yet..",
  "I think my laptop dropped from 64 wH to 55 wH in a year. The design capacity is 60 wH so that's fine. I'm still easily getting 10 hours but it's very task dependent. I'm not running a lot of software in the background.",
  "That's pretty good. Which laptop do you have? I guess my drop is just coz of me overcharging too frequently",
  "Yoga Slim 7 wih the same CPU",
  "LENOVO IdeaPad 3 82RK008FSC / Core i7 1255U, 16GB, 512GB SSD, Iris Xe Graphics, 15.6\" FHD IPS - any good? How good is this notebook?\n\nLENOVO IdeaPad 3 82RK008FSC / Core i7 1255U, 16GB, 512GB SSD, Iris Xe Graphics, 15.6\" FHD IPS\n\nI can buy it for 600€, should I go for it?   \nTnx!",
  "It has a fairly new and decent cpu but only integrated gpu so if you plan on gaming something heavier then roblox or minecraft i would recommend a laptop with dedicated gpu. Otherwise it seems like a good machine",
  "Mainly for work. And maybe some lightroom photo editing and casual video editing in 4K on 4K monitor from time to time.\nThanks",
  "have you bought it?",
  "Yes I did! I'm loving it! I also put 32GB in it! So now I have 40GB RAM :D \n\nAnd also, I've installed an 1TB SSD aside of NVMe.\n\nIt's a beast! Workhorse. Lightroom works perfectly, Premiere also! LEGENDARY!",
  "Thanks for the update, considering getting it but I couldn't find any reviews on it :)",
  "Undecided about which laptop to choose. (HP 255 G10, Lenovo ThinkBook 14, Samsug Galaxy Book 3 or Microsoft Surface Go 3). Hello, I am electrical engineering student, recently I have been offered one laptop of the following:\n\n&#x200B;\n\nHP 255 G10 (AMD Ryzen 5-7530U, 16 Gb ram, 512 Gb ssd)\n\nLenovo ThinkBook 14 (Intel core i5-1135G7, 8 Gb ram, 256 Gb ssd)\n\nSamsug Galaxy Book 3 (Intel core i5-1335U, 8 Gb ram, 256 Gb)\n\nMicrosoft Surface Go 3 (Intel Pentium Gold 6500Y, 8 gb ram) with keyboard\n\n&#x200B;\n\nIt will be used mostly for word and excel, and some light programs psim, femm, lt spice. \n\nIt will be good if it could run Matlab for simple simulations in simulink (for more complex simulations I have a good PC in my house and in the university I can use a remote desktop) and some old games like Morrowind, Hearts of iron 3, Hoi darkest hour, fallout 2... (If anyone could move Hearts of Iron 4 it would be great, but I doubt it) but  it's not a necessity.\n\n   \nI only take into account the surface because with a digital pen can be used to take notes and its portability, because I think the CPU is underpoweret even for use office and edge at the same time.\n\nI think in general the best option is the HP 255 G10 because it has more RAM and ssd storage and the i5-1335U is only a bit better than Ryzen 5-7530U (from what I have seen on the internet) but   \nI've heard people complaining that HP computers are flimsy, especially the ones that aren't high-end and for a laptop that  is going to be used every day outside the home, and I am going to carry it in my backpack with a cover, I am worried that it could be damaged or broken. \n\n I have looked for reviews of the hp, but I have not seen the exact model, so if any of you have used this laptop  and can tell me what the build quality is like or think that one of the other laptop is better    \nI would appreciate the help.\n\n&#x200B;\n\nSorry for my English, I know it's pretty bad, but I'm trying to improve it.",
  "Help choosing a laptop - Lenovo P14s Gen 3 or Dell Precision 5570? Would love if I could get some opinions on a work laptop!  My two options that my company gave me are Lenovo P14s Gen 3 or Dell Precision 5570.  My work involves me handling large excel/csv files, tableau workbooks, powerbi dashboards, reviewing digital creative assets (.psd files, frame, managing dropbox files), workfront.  I don't have a ton of details that were given to me other than the specs provided below for each laptop.  Price isn't an issue either as I wouldn't be paying out of pocket.\n\nSome additional context is that I'm used to Lenovo Thinkpads, but at the same time don't mind switching to a heavier Dell laptop if the specs are THAT much better. Any help on this would be greatly appreciated!    \n\n **Lenovo P14s Gen 3**  \n\n* AMD R7 Pro 6580U CPU \n* 32GB RAM, 6400 MHz \n* 14” (1920x1080) 300 Nits\n* Anti-Glare Touch Screen \n* 512GB SSD Hard Drive \n* 1080p Camera \n* 2 x USB-C/TBolt 4, HDMI, Eth Ports \n* 2.7 lbs\n\n **Dell Precision 5570** \n\n* Intel i7-12800H vPro 4.80 GHz CPU, 14 Core, 20 Threads\n* 32GB RAM, 4800MHz\n* 1TB SSD Hard Drive\n* 15.6\" HDR400, 3840x2400 Touch Screen\n* 1080p Camera\n* NVIDIA RTX A1000, 4GB GPU\n* 2 x USB-C Ports\n* 4.6 lbs",
  "dell",
  "Decision time : Razer Blade 15 vs Lenovo Legion 7i (16”) So I’m down to these two. I’d settled on the Blade 15, but while watching video reviews, I kept on seeing the Legion 7i hitting better numbers in the reviewers’ charts.  \n\nMy daily use:  \n- meetings\n- running web apps like google suite and JIRA. \n\nMy weekly use:  \n- content creation (Unity, Adobe CC, Da Vinci Resolve)\n\nReasons I’ve zeroed in on these two:  \n- both have a USB C thunderbolt port  \n- slotted ram (because I want to keep the option of upgrading open). \n- QHD screens. \n\nMust haves:  \n- reliability is key — I don’t want to be spending time on the phone with CS, I need this to work.  \n\nNice to haves:\n- quiet (I don’t expect Mac quiet, but my XPS’s fans were always going, which was tiresome).   \n\nDon’t care so much:  \n- battery life — I’ll be plugged in 99% of the time.   \n- portability — I mostly work from home.  \n\nLatest laptop I’ve had:  \nI’ve never owned either brand, and my previous laptop was an XPS 15 (i9, 32 gb ram, don’t recall the graphics card). I loved it, BUT for whatever reason I could rarely get it to run Unity and do screen capture without lagging. I meant it worked sometimes, but it was really hit or miss. Finally, my biggest gripe, is that built-in mic was terrible, so I want to move on from Dell.   \n\nThanks for the help folks!",
  "Forgot to mention, this would be last year’s Legion 7i (Gen 6, which with the current rebates comes to about the same price as the blade 15, but features intel i9 and 32gb of ram.)",
  "May I ask which one did you end up choosing? I'm down to the same dilemma after hours of digging online!",
  "I delayed my purchased, but I’m pretty settled on the Legion.",
  "Sounds like a solid choice in terms of performance/price ratio.",
  "Agree ;)",
  "Is lenovo IdeaPad Gaming 3 15ACH6 any good? I wanted to upgrade in a while and saw this. is it good?\n\nSpecs:\n\nRes: 1920x1080 full hd\nRefresh rate: 165 Hz\nCpu: AMD Ryzen 7 5800H\nMemory: 16gb\nStorage: 512gb ssd\nGpu: Rtx 3060 90W",
  "I forgot to mention the price 1149€.\n\nI will be using it for gaming, some newer AAA games, older games and some multiplayer games.\nAnd i want to get into programming.",
  "i havent heard any good reviews about this laptop. probably just skip this one",
  "go for legion\nway too much better than this,display wise,build wise and etc",
  "Trust me LEGION 5 will be a better choice",
  "About to buy Lenovo ideapad gaming 3 advice please !!! hello can anyone help me please? about to order lenovo ideapad gaming 3 . it comes with only 256gb ssd and 8gb memory. Is this an okay deal + are these extra memories + ssd slot compatible with it? thank you.. It will cost a total of 800$ including tax\n\n This is the laptop : [https://www.amazon.com/gp/product/B09RND1LP2/ref=ox\\_sc\\_act\\_title\\_3?smid=A2XZ7JICGUQ1CX&psc=1](https://www.amazon.com/gp/product/B09RND1LP2/ref=ox_sc_act_title_3?smid=A2XZ7JICGUQ1CX&psc=1)  \n\nThis is the extra memory : [https://www.amazon.com/gp/product/B09T9CBQ5V/ref=ox\\_sc\\_act\\_title\\_2?smid=A2XZ7JICGUQ1CX&psc=1](https://www.amazon.com/gp/product/B09T9CBQ5V/ref=ox_sc_act_title_2?smid=A2XZ7JICGUQ1CX&psc=1) \n\nThis is the extra ssd : [https://www.amazon.com/gp/product/B08V7GT6F3/ref=ox\\_sc\\_act\\_title\\_1?smid=A14EEANAI4EN1Q&th=1](https://www.amazon.com/gp/product/B08V7GT6F3/ref=ox_sc_act_title_1?smid=A14EEANAI4EN1Q&th=1) (edited)",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Lenovo - 2022 - IdeaPad Gaming 3 - Essential Gaming Laptop Computer - 15.6\" FHD - 120Hz - AMD Ryzen 5 6600H - 8GB DDR5 RAM - 256GB NVMe Storage - NVIDIA GeForce RTX 3050 Graphics - Windows 11 Home \n\n>**Company**: Visit the Lenovo Store\n\n>**Amazon Product Rating**: 4.6 \n\n>**Fakespot Reviews Grade**: C\n\n>**Adjusted Fakespot Rating**: 3.3\n\n>**Analysis Performed at**: 11-19-2022 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lenovo-2022-ideapad-gaming-3-essential-gaming-laptop-computer-15-6-fhd-120hz-amd-ryzen-5-6600h-8gb-ddr5-ram-256gb-nvme-storage-nvidia-geforce-rtx-3050-graphics-windows-11-home) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "do not get that ram the cl is really bad and i dont think ideapads support ddr5 and its the wrong speed so do not get that ram its trash also its the wrong voltage",
  "I AM NOT FAKE !!!",
  "Lenovo Y740 17\" Review (8750H, 2080 Max-Q) Good afternoon Reddit!\n\nI recently just got in my Lenovo Y740 17” (8750H, 2080 Max-Q, 16GB Dual Channel) and just got done running some benchmarks and so forth in an effort to shed some light on this enigmatic model, as the  15” variant gets \\~95% of the coverage in terms of reviews and user anecdotes.\n\n**Chassis and Physical features**Pictures of all the I/O and interior/exterior found [here](https://imgur.com/a/s0wqMQz).\n\nIt weighs about \\~6 lbs., and is actually pretty thin, just under 1 inch thick (or \\~23mm). The keyboard deck has a bit of flex when pressing down with force, but given its size, it’s still pretty sturdy. Trackpad uses Precision drivers, but is WAY too small given the area Lenovo had to work with. The dedicated mouse buttons are okay; they just get the job done. The exterior has a “butt” that protrudes outward and houses the majority of the I/O and 4 exhaust vents. This does not fit in my 15.6” laptop bag (it is not deep enough, but does fit width-wise).\n\nThe bezels are a bit larger than the 15” brother, but they did move the webcam back to the top, so no more nose-cam! Very happy about that. The screen is a 144Hz IPS G-Sync panel, and gets reasonably bright compared to the competition, \\~300 nits. My unit has very minimal backlight bleed, but that does vary heavily from unit to unit.\n\nKeyboard layout is great, but “feel” is, well, okay. Nothing special, nothing awful. Feels like one of Lenovo’s IdeaPads or something. I wish it felt more like their ThinkPad lineup, but not sure how that would look on a gaming laptop. I did however hit close to my typing speed record on my second try with it (104 WPM)\n\nOverall, I’d give the unit a 7/10 for build quality and design, docking points for wasted space on the keyboard deck, thick-ish bezels and some flex around the unit. I do love the minimalist design otherwise.\n\n**Performance/Thermals and Noise**\n\nNow, this is where this beast really shines. All benchmarks are run with max-fans and -140mV core/cache undervolt.\n\n[UserBenchmark link](https://www.userbenchmark.com/UserRun/18724106)\n\n[Heaven Unigine Benchmark Score](https://imgur.com/Bqs6qqT)\n\n[FireStrike Scores](https://imgur.com/a/ik5Y4DX)\n\nI won’t go into detailed game benchmarks, as I don’t have a full Steam library to do so, but I can tell you all this: the temperatures on this thing are **insane.**\n\nI ran three loops of Heaven’s benchmark with uncapped FPS and **didn’t see above 63C on the CPU and above 60C on the GPU, even with a +100MHz OC.** I have yet to mess with the voltage curve to really maximize the potential of this 2080 max-Q.\n\nCineBench R15 on repeated runs stays in the 1200 range, and the CPU can pull \\~60W when the GPU is not also under load. Highest core temperature was 65C after 3 runs, the rest were 61-63C.\n\nWhile using the laptop with normal tasks, it’s almost completely silent; I can only really hear the whirr of the HDD. Max fans is also much quieter than I anticipated. Notebookcheck’s review shows it maxing around 45-47dB, which is twice as quiet when compared to most 15-inch gaming notebooks with similar or worse specs, which are in the 54-56dB range. (TIL that every 10dB is equivalent to doubling the sound intensity or perceived increase in volume)\n\nSimply put, 10/10. Could not ask for better thermals given its performance output in <1” footprint.\n\n**Misc. (I will add to this to answer questions about things I may have forgotten)**\n\nBattery life with G-Sync enabled is about 2-3 hours. Without, 4-6 hours depending on how aggressive you are.\n\nRunning on BIOS revision 1.07, preserving the ability to max the fans with FN+Q.\n\nFeel free to ask questions and I will try to answer them!",
  "Thanks for taking the time to post this review. It sucks there has been so much focus on the 15\" and not as much on the more powerful 17\" version. \n\nAny chance you could install the free version of 3dmark Firestrike? I would love the see the scores you hit with the undervolt. \n\nI am torn between this and the MSI GS75. I know the GS75 is a sexy beast with a smaller footprint, but I like the style on the Y740 as well. Have you had a chance to check out a GS75? I'd love to know how the build qualities compare.",
  "How are you able to you Max fans as the latest BIOS removed Max fans feature?",
  "Hey everyone! I added my FireStrike score to the post :)",
  "What’s your average clocks on the 2080 and what wattage is the card + what drivers does it run?",
  "where you able to squeeze more performance out of the GPU? Did you OC it with afterburner?",
  "Both have okayish build quality. stiffness is a little weak compared to other brands, but still no real reason to complain.\n\ni would strongly reccomend the Y over the GS tho, its cooling system is simply SO MUCH ahead of any other manufacturers cooling solutions that its downright ridiculous to not chose the Y, no matter what other gaming notebook in this category you compare it with.\n\nI would love to see an overclockable HK processor in this thing, just to see how much you can get out of this baby.",
  "I have the gs75 with the same cpu and gpu. The temps get really high that causes it to thermal throttle 90-95 degrees under load with max fan curve. I did a repast and undervolt now I’m sitting at 75. Y740 has better cooling but the gs75 looks a bit better on design.",
  "I just bought the y740 with a i7-9750H and rtx 2060. I was considering an MSI, but the end decision was more with the thermal and overall quality seemed to be a lot better. MSI is good, don't get me wrong, but the cons seemed less ideal for MSI than Lenovo Legions. Plus I didn't want to be that kid to haul out a loud ass spaceship in class. \nCheck out this review: \n https://www.youtube.com/watch?v=bTUytmEYx6s&feature=share",
  "I purposely disabled automatic updates when I received mine, and it was on BIOS build 1.07, so I still have that ability.\n\nI'm going to update the post to include my BIOS revision.",
  "Without tweaking the voltage curve in Afterburner, I’m in the 1500s usually. It is an 80W variant, but running on max fans allows it to pull 90ish Watts. \n\nI have to get back on the Drivers when I get back home!",
  "Where did you go to turn off auto-updates?\n\nYour post made me decide to go ahead with my purchase. I'll be ordering one this weekend. I downloaded a copy of the 1.08 bios in case I need to revert it from 1.09. I cant seem to find 1.07 anywhere online though.",
  "Nice, its better to avoid that latest BIOS unless Lenovo fixes it",
  "Lenovo Vantage software!",
  "Ordering for Lenovo is a little janky, fyi. They're backlogged on orders rn so you'll have to wait a couple weeks and they're payments won't seem logical, but it should all work out on its own.",
  "Yeah, I did some reading prior to getting the laptop and the first thing I planned to do was prevent a BIOS update if it was older than 1.09, or do a flashback lol",
  "Which laptop would you Buy? Lenovo Legion 5 or Lenovo IdeaPad 3 2021? Both Have \nAMD Ryzen 5 5600H\nNVIDIA GeForce GTX 1650\n\nMy main concern is Battery Life!\n\n[Legion](https://www.walmart.com/ip/seort/749506432?irgwc=1&sourceid=imp_24UTHjXczxyIUovR44wl%3A2o8UkD27QzFR2r6wc0&veh=aff&wmlspartner=imp_1807032&clickid=24UTHjXczxyIUovR44wl%3A2o8UkD27QzFR2r6wc0&sharedid=&affiliates_ad_id=565706&campaign_id=9383)\n\n[IdeaPad 3](https://www.amazon.com/dp/B09BDFTX65?psc=1&ref=ppx_yo2ov_dt_b_product_details)\n\nVery Similar Computers. I already bought the IdeaPad for $550 USD. Should I send it back for the Legion?",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Lenovo IdeaPad 3 Gaming Laptop, 15.6\" FHD (1920 x 1080) Display, AMD Ryzen 5 5600H, NVIDIA GeForce GTX 1650, 8GB DDR4 RAM, 256GB SSD Storage, Windows 11 Home, 82K200UTUS, Shadow Black \n\n>**Company**: Visit the Lenovo Store\n\n>**Amazon Product Rating**: 4.6 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 4.6\n\n>**Analysis Performed at**: 06-10-2022 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lenovo-ideapad-3-gaming-laptop-15-6-fhd-1920-x-1080-display-amd-ryzen-5-5600h-nvidia-geforce-gtx-1650-8gb-ddr4-ram-256gb-ssd-storage-windows-11-home-82k200utus-shadow-black) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "I just bought the idea pad for 1600 aus dollars.\nMine has the ryzen 7 and a 3060 at least.\nMy country has some bullshit prices for electronics.",
  "Looking for opinion of laptop: Lenovo ThinkPad L13 G2 + 3 other devices As it is, this laptop is a strong contender for me and my budget currently. The specs of the configuration I'm looking at currently includes:\n\n* Ryzen 7 5850U processor w/ Vega 8 graphics.\n* 16GB RAM.\n\nAs for my reservations, I'm mainly concerned about two things and am wondering if anybody might be able to explain these things to me. Most of the information I'm referencing is from [NotebookCheck](https://www.notebookcheck.net/Lenovo-ThinkPad-L13-Gen2-AMD-laptop-in-review-Fast-enduring-Ryzen-ultrabook.605249.0.html).\n\n* TDP. NotebookCheck states that the device is \"limited to 15 watt TDP\" which, based on what I've heard about TDP, does not seem like even barely enough to power this system with all its hardware. Is this wattage configurable? Does it actually affect performance that much?\n* Battery life. Despite seemingly long run-times, this device is only equipped with a 43wH battery. This leads me to question how such a small battery can get up to 12 hours of websurfing time. It also makes me question whether the aforementioned TDP is involved and if (shall it be possible) increasing it would lead to significantly worse battery life.\n\nIf both of these end up being major hinderances, I'm wondering if there are any opinions on these laptops as well:\n\n* Dell Latitude 7420 (i7-1185G7)\n* HP ZBook Firefly14 G8 (i7-1185G7)\n* Lenovo ThinkPad E14 (Ryzen 7 5700U)\n* Edit: HP EliteBook 845 G8 (Ryzen 7 5650U)\n\nLargely interested in the performance differences between the Ryzen 7 and Core i7 shall my choices be whittled down to these 4 options.",
  "Would this be a good/long lasting laptop for university? Hi, I’m very new to the laptop world I’ve never owned one and I was wondering whether or not this laptop would last me at least 5-6 years. I don’t game at all I just need something to do research, write papers and practice test taking on, I’m primarily looking for something that has a good battery, will last me ~1 day, a decent screen nothing too fancy and nothing that’s gonna be annoyingly slow or get annoyingly slow over time. Please let me know whether or not this is a good laptop thank you! ",
  "Thinkpad would be better.",
  "8 gb ram on Windows is quite questionable",
  "For your use case, it should be fine. Not sure about battery life, though. And you'll probably need to buy some external storage, because you'll fill that 256GB *very* quickly.",
  "The SSD is upgradeable, but it is a 2242 instead of the more common 2280, and the RAM isn't. You may hit a wall with just 8 Gigabytes of RAM. Honestly, you are better off getting a refurbished business laptop. They are generally better-built and repairable. I assume that you're in Canada based on the ad.  For a little more at a local refurb shop, you can get a P14S with more RAM and diskspace and it's repairable & upgradeable.  [https://thepcroom.com/collections/laptops/products/lenovo-thinkpad-p14s-14-fhd-1920-x-1080-10th-generation-intel%C2%AE-core%E2%84%A2-i7-10610u-up-to-4-9ghz-nvidia-quadro-p520-2gb-16-gb-ram-1tb-nvme-ssd-windows-11-refurbished-grade-a?\\_pos=10&\\_fid=374fef6a9&\\_ss=c](https://thepcroom.com/collections/laptops/products/lenovo-thinkpad-p14s-14-fhd-1920-x-1080-10th-generation-intel%C2%AE-core%E2%84%A2-i7-10610u-up-to-4-9ghz-nvidia-quadro-p520-2gb-16-gb-ram-1tb-nvme-ssd-windows-11-refurbished-grade-a?_pos=10&_fid=374fef6a9&_ss=c)\n\nThis company is in Ottawa, but there similar companies all over the country.",
  "Get a refurbished Thinkpad, better build quality for the same money",
  "If you're expecting to use a bit of Canva or something graphically intensive it's not the good  laptop",
  "8gb of memory is really 2017. Those days are over.  \nIf you can get this with 16gb and you treat it with CARE (it's cheap, so the build quality will be an issue).  \nIf you will only use it for studying you'll be fine, but 256gb is not a lot if you want to put movies and music, games, videos on it.\n\nI also would always fully format and reinstall cheap laptops. In order to keep them cheap they pump them full of software you don't want that makes them REALLY slow.\n\nIf you want a great laptop for the money, go for a 3, 4 year old ex-business laptop. Usually you'll buy a 1500 dollar laptop for 400 dollars that way.",
  "I have this exact laptop. I like it realy ( i study fysiotherapie)",
  "Lenovo has recently been popular for dying motherboards in the long run some happen in 2 years. A Reddit user said the problem is only affecting those that have been \"low temperature soldered \" which Lenovo has used since 2020.\nI think its better to consider other brands like Asus or HP at least theirmotherboardsdon'tdie on you.",
  "Get a MacBook, best money can buy.",
  "I purchased a similar model earlier this year and would not suggest a model with soldered ram that's not expandable/replaceable. You'll find that this machine will be annoyingly slow. I have a few chrome tabs up and they eat up a little over 3GB alone.  You can find something way better for the same price at Best Buy.",
  "If you find anyone with 16gb ram and more storage (at least 512gb) it would be much better, anyways that one isn't bad either, all depends on your budget",
  "Slim 3 and long-lasting in one sentence?? No chance",
  "I would get a IdeaPad or any Lenovo laptop that is either made from actually strong plastic or metal… Or get a used ThinkPad for less",
  "I would not recommend…8gb ram is low, but 256 SSD will get used up fast for any school work. I recommend at least 16/512. \n\nAt $500 you have options…look at places like Costco or wait for Black Friday. I bought my IdeaPad 5 with 16gb/1tb SSD for $600 including tax and shipping this time last year. Even though the one shown is “on sale”, it’s still probably $200 more than I’d pay for it.",
  "I was considering one but they’re a lot more expensive and I’m on a budget tbh 😭😭",
  "What are your thoughts on AMD processors? Best avoid and go for intel? I'm studying medicine and love a nice screen and need to replace my ASUS Notebook",
  "Why is that?",
  "Really? I feel like my other device had 128gb and I’m not even close to filling it up this may sound stupid but would it apply differently to a laptop? thank you sm!",
  "Thank you!! But I’m a little worried on getting something refurbished just for it to have hidden issues that I’ll discover too late and I’ll have wasted my money",
  "How so? Like what specifications should I look for instead?",
  "First of all thank you so much for this in depth response! Also what do you mean by fully format and reinstall? I considered getting a used one but to be honest I’m extremely concerned with issues that may come with that and lack of warranty and potential hidden issues that wouldn’t show until it’s too late",
  "Really?? How long have you had it and how is the battery life and is the computer slow to process things or not?",
  "Ohh I didn’t know! I assumed since so many people around me bought Lenovos that they were better than hp and asus, also I know this may sound stupid, but does the motherboard die due to lack of care or is it like a wear and tear thing I can’t prevent?",
  "I most definitely do not have the budget for a MacBook 😭😭",
  "Ooooh okay thank you sm!!",
  "Okay thank you!!",
  "Oh so is it a series thing? I’ve seen a lot of laptops from this series are they all not long lasting? If so why?",
  "Ohhh okay thank you!!",
  "Oooh alright thank you!",
  "I guess he meant second hand Thinkpad, bc they really are quite expensive new",
  "Either way. As far as I know the intel is good at crunching numbers and amd is good at graphics and other stuff. So if you are going for medical go for amd since you will be able to zoom in to slides and other stuff better then intel",
  "Chrome alone uses 8gb ram",
  "OS, and future updates will take a big chunk, so will all your files and any software you need to use for uni.",
  "Your other device was not a laptop.",
  "I had the same mentality, except you should be fine as long as its a business class laptop (especially a thinkpad), the shop is reputable, and you have a warranty.",
  "At least look for something with 16GB",
  "If you want to erase a hard disk so there's nothing left, you have to format it. It'll actually not erase anything but it'll make the computer think there's nothing in that location. and when it needs space it'll just overwrite it. To you the disk will seem empty.  \nYou will then need to reinstall windows by making a usb stick from the microsoft website (it's free), starting the computer from that stick and then putting windows on it from scratch.  \nIt's not something I recommend you do if you have no experience, but it's usually not that expensive to have it done. Or maybe you have friends who want to do it.   \nI'd do it for you for free but I see the price is in dollars, so you're nowhere near me (Netherlands :D).",
  "Not really due to lack of care. Just recently my friend bought one and said he is returning his Lenovo Legion 5 Pro RTX 5060, i asked why he said the cooling is terrible with watching a YouTube video making the CPU temperature reach 80 Celsius and not going down, then to help him I looked and searched a lot then came across this  post\n\n https://www.reddit.com/r/LenovoLegion/s/fgQ8Q9qou6\n\nI think you should really read it carefully if you plan on buying a Lenovo as it appears the issue is not affecting only one line of brand but all. Just search on Reddit this \" lenovo motherboard \" and it will frighten you.",
  "They are cheaper than ever. You’ll be surprised.",
  "The M4 MacBook Air is now only $750 brand new on Amazon.",
  "They are made of cheap quality plastic.within no time you'll be having problems with hinges and display.so, unless you have strict budget constraints this is not a good choice. Slim 5 models have metal bodies. But still buy a ThinkPad if you can",
  "Yeah I guess so thank you!",
  "Thank you for saying that.  Sorry I forgot to mention that.",
  "Sweet. Thank you!",
  "Really? I have a friend who has a 8gb laptop and I was browsing on chrome on it the other day and it was fine to me? Is there something I may be missing?",
  "It uses a lot but not that much…last I checked mine was using 4.",
  "Ohhhhh okay thank you!",
  "Yeah it wasn’t 😭",
  "All right thank you!",
  "Okay thank you!! But if I can’t find one within my budget, would the 8gb one still function fine?",
  "Thank you so much this is so helpful!! Thank you also for offering but yeah we are pretty far I’d say HAHA",
  "Woah this is really helpful I had no idea thank you so much!!!",
  "Ohhh okay thank you sm!!!",
  "Well you might be fine! Most of time it would work well enough for your use case. I assume when people say \"its not enough ram\" they're taking the safer route.",
  "Then that's no comparison :).   \nThat's like saying 'my motorbike had a one gallon tank and I got everywhere, so my car only needs a 1 gallon tank'.",
  "If you're doing something light like writing in word documents and taking notes, yes",
  "Yup! Find someone who can do it for you. You'll have way more drive space and it'll run much smoother after a reinstall. It's ridiculous but stock installs are just shit.",
  "Oohhhh okay thank you sm!!",
  "LMAOO this made me laugh but I get it now HAHA",
  "Okay thank you so much! Also would you know whether or not it would get slower over time? Or does that just depend on how I take care of it?",
  "If you're someone who use a lot of browser tabs, then you'll start to feel the limitations of 8GB real quick",
  "Depends honestly. Keep your drivers up to date and don't bloat it with useless stuff and you should be oki dorey.\n\n  \n\\+ if you want something that is durable and lightweight, you should look into Linux.",
  "Ohh so would it function fine if I just don’t keep a lot of tabs open?",
  "Oooh alright! I’ll definetly look into it, also what does keeping drivers up bloating it with useless stuff mean lol I’m really lost when it comes to this stuff 😭",
  "Your computers requires drivers to work (See them as some sort of translators for your machine and its components to understand each other) and keeping them up-to-date is something important.\n\nBloating is keeping useless stuff on your computer.",
  "Ohhhhh okay thank you so much for bearing with my lack of knowledge I really appreciate it!!",
  "Lenovo ideapad gaming 3 vs asus tuf a15 Hey, i want to buy a laptop suit for my studying and casual gaming with a tiny budget. I have picked out two products that suit me best from other names but have difficulty choosing among these two (same specs, both are AMD) to use for at least 4 years in university. Any recommend or review about these laptop?\n - I have watch some reviews and what make me confused is the build quality and the thermal system of these two. Here is some information i have collected (not sure if its correct) \n    + Ideapad gaming 3: better thermal system, poorer build (not sure) and i have concern about the screen since the hot air is flowerd directly to it bc of the design\n     + Tuf a15: have thermal system, better build (i've heard that the tuf series had passed some military test or sth)\n  So, the questions is: is the tuf a15's thermal that bad? For me, i want a good built laptop for the next upcoming 4 years so i can sacrifice 4-5 celsius higher in my daily uses as long as the build is superior. And does the hot air flowed directly to the hinge and screen of my laptop effect the life span of my laptop?\nTL;DR: wondering about the thermal system of tuf a15, hot air flowed to the screen and the build quality of lenovo ideapad gaming 3.",
  "look at jarrods techs video on both laptops.",
  "I bought an Asus Tuf a17 in February.  Ignored the reviews that said the current tuf laptops have dull non vibrant colours.  Found out that is true.  I now recommend Acer laptops instead to my clients.  Far better screens.",
  "I've watched it multiple times and barely saw the differences of temperatures between these two, at least without a cooling pad",
  "Just use a stand"
]