[
  "Lenovo legion 5 pro after 1 year, is this normal? I don't use it in dirty environments or in bed often, idk how it got so bad ",
  "Um. I think you do use it in a dirty environment. If years of university have taught me anything, it’s that people are nasty and don’t know it.",
  "[removed]",
  "[deleted]",
  "That's double loads in the dryer heavy.",
  "This photo contradicts what you wrote.",
  "this has to be a joke? right?\n\n1 year living in NON DUSTY enviroment?\n\nbro what you think we believe in Santa Claus as well? 😂🙈",
  "That’s insane. Clean it immediately. I know you said you don’t use it in a dirty environment, but this surely doesn’t happen from a clean environment",
  "Bro this is an insult to me.\n\nJust clean your laptop once per 6 months at least. And your \"environment\" once a week too.",
  "What the fuck",
  "If you don’t know how it got that bad, you are delusional.  You are 100% using it in a nasty environment.  I’m more concerned that you don’t realize that….this doesn’t happen in clean environments.",
  "Clean it immediately please.",
  "vape ?",
  "this must be a troll",
  "That is not normal. Clean it with an air duster, but hold down the fan so it doesn't spin while you are doing it.",
  "disgusting people are usually unaware of how disgusting they are",
  "Do you have pets?",
  "TIL: \"Dirty environments\" and \"bed often\" are very relative terms.",
  "you could build a pillow with all that dust",
  "Not dusty environment my ass",
  "Bruh…\n\nLooks like my ceiling fan if I don’t clean it every month or two… I live in the country where it’s always dusty. My laptop will be 5 years old in January, and just cleaned it for the first time. It wasn’t even a 1/4th that dirty.",
  "How is that fan even turning? Or is it not what the what is that",
  "No way this is a year of use in a clean environment",
  "there's a laptop in your dust",
  "WOW... this is insane for a year of use.\n\nI used my laptop for last 5 years and there is little bit of dust stack to blades of both fans, you can't even see the fan here.",
  "if you are using laptop on your bed then it's nothing to be amazed of how it's got this.",
  "Jesus your computer's life probably got halved with that much dust.",
  "No words",
  "You dirty pig 🤢",
  "Pet dander.",
  "That's mostly fabric, they're usually the ones that can clog, regular dust will just go-in then out the vents easily. It's a combination of how good the intake filter is and how much time do you use your laptop inside you room. 1 year cleaning interval is not normal, you may even consider it as neglect.",
  "The fan determined that’s a lie",
  "It's impossible to have a dust free environment, this is normal and you should definitely keep an eye on it. Ignoring it for too long can cause your computer to overheat. My motherboard was shot from overheating and this is probably why",
  "Does it void the warranty to open the laptop's case?",
  "Fans don't make dust... You do (lots of skin cells in dust). \n\nSo, this has been in a dusty environment this is why it's important to clean out laptops every so often. They will load themselves up with dust quicker than you realize",
  "Absolutely NOT normal, I fix laptops for a living and this is crazy bad for 1 year lol",
  "How often did you use it? For example I have a Asus TUF a16 laptop that got dusty after 3 months of having it and I used it everyday playing games all the time. I don't have a laptop stand so the fans didn't get particularly good airflow so that's why it got dusty",
  "Do you vape? the residue will attract dust.",
  "Have you been using it as a part time laundry drier?",
  "Lol take any cloth you own into a bright room and whip it around. That’s what’s in your laptop",
  "Is it turned on a lot? When the fans are spinning they collect far more dust than if it was turned off. When those fan blades spin at a higher RPM the friction in the air causes the fan blade to build up a electric charge which attracts more dust along the active edge of the blade until you get a sizable mass of it blocking airflow. I would say that looks pretty normal for a laptop that sees heavy use. Laptops don't tend to come with the filters you see in desktop builds so dust has easier time getting caked in there, especially with heavy use.",
  "Stop crying and just clean it",
  "One possible explanation is the fan is somehow spinning when it's in my backpack, but lid closed = sleep so idk how that can happen.\n\nEdit: I overlooked the obvious - my little brother took over my room and now I'm set up in my walk in closet. All the clothes probably release a lot of lint.",
  "No effin way. I’ve had my omen for 2 years, didn’t start using compressed air until 2 months ago, I have THREE dogs and a preteen so needless to say my house isn’t spotless…. Just took my laptop to get cleaned yesterday and got sent the picture of my fans and it still wasn’t this bad…\n\nWild. If this ain’t a troll, I don’t know what is ",
  "Cans of air are your friend.",
  "and pigs can fly too",
  "Maybe he traveled in the desert without your know .it happens",
  "your definition of clean environment seems questionable.",
  "God damn, that's hard to believe that it collected so much dust in 1 year. I have seen different laptops where it has been used for few years and didn't even collect that much dust as yours.",
  "Do you use any kind of cooling pad for your laptop? Where do you use it? Is is dusty there? \n\nBut first of all, just clean it dude...",
  "Just buy compressed air and blow it",
  "My 3 yo gaming laptop doesnt look like that when I 1st open it up. \nYou are living in dirty environment.",
  "Yes, if it is often used in a dusty environment.",
  "Having worked in the medical sector, while it looks clean, it’s likely not.",
  "This would 100% kill the the laptop from overheating over time",
  "I got a laptop early 2020, which I'm still using. I have never cleaned it, and there's maybe 5% of the dust in the fans that's in this picture. You definitely are using it in a dirty environment.",
  "Clean it and everything will be ok.",
  "Hmmmm, I should check my fans…",
  "oh my god no not normal must have been on carpet",
  "If you use your laptop 24/7 and leave it always running then yeah even in a clean environment this would make sense. \n\nI use my laptop occasionally over a few years and there was almost no dust in my fans. \n\nIt's important to vacuum your living space frequently and keep your laptop on a desk. If you have pets, they exponentially increase dust intake. Having this level of dust in one year just points at a high level of dust environment.\n\nI would clean it every 3 months if this is what you gathered over a year. You lost a lot of performance and efficiency overtime, you will gain it back once it's cleaned though.",
  "Very normal, just clean it, ignore the people bashing you for being filthy.",
  "I live in a dirty environment and my shit doesnt get that bad",
  "If you live someplace and you don’t dust and/or bathe often , you live in a dusty environment. Unless you are covering all your skin, you are releasing dust as your skin cells die, what did you think dust was?",
  "Companies fill in dirt pockets designed to burst after a year and clog your fan.\nThat or a dwarf steals your computer when you are asleep and games all night long on your laptop in a construction site.\nOr! You are a lizard and you loose skin flakes like crazy. Must be hard to keep the human disguise.\nNo other explanation is possible. \n\nWell.. could also be that even when you perceive your environment as clean, it's not that much dustfree.\n\n/S\nYes it's normal. Don't let it pile that much, buy a can of compressed air and blow a bit every month. Not a full clean just a few puffs is more than enough to keep it clean.",
  "Gaming laptops are not meant to be used a laptops. They work as a laptop but they're meant to me more of a portable desktop and used on a hard and clean surface while on A/C power. \nThey rapidly charge and discharge which will degrade the battery.\nIf you only have a couple of hours a day where it needs to function as a laptop then that's fine but if you can then plug it in and keep it off of your lap. \nRemember that when you set this laptop on your bed or lap it's going to be like a vacuum. Cat hair, dust, lint, crumbs, and everything else is getting sucked up. \n\nBuy canned air and clean it out every 3 months if this is how it looks after 12.",
  "Do you play right next to your dryer's exhaust? Like a load of lint in there. You should clean your fans and vents at the very least once every 3 months or when it has noticeable dust on it. You clean that up and you will think you got a new computer; it will be running so much better.",
  "You should be dusting it out every month or two",
  "One the plus side od things you can now make a pair of socks",
  "Replace laptop fans",
  "Floating fibers of fabrics in thin air can cause that and other unclean environmental sources..",
  "I've had my Y540 for over two years and only cleaned the fans once, and they were no where near this bad. And I take it to work everyday, and game at home every afternoon.",
  "get canned air and spray out your vents once a month. its called basic maintenance.",
  "If it looks like that after 1 year then trust me, your house is a whole lot dirtier than you think it is.",
  "Lick it",
  "That's dust and you'd likely be surprised how much dust is just in the air around you. One year is also too long to go without cleaning anything, no matter how dirty your environment.",
  "If you vape thc I've seen grimy dust that looks like that on my computer. Doesn't come off easily",
  "What the fuck\n\nYour environment is probably more dirty than you think it is.",
  "That’s honestly an impressive amount of dust. Usually it doesn’t stick to the fan much, it just collects on the heat sync. Definitely clean it, that much weight will hurt the motor",
  "“Lightly used, clean, perfect starter PC, 4500 obo, open to trades, no lowballs.” All jokes aside, your environment isn’t clean, my house produces dust like nobodies business too, just gotta deal with it for now. I’ve opted for a no case PC, so I just reach over and blow that bad boy out every day or 2",
  "Use more lotion..",
  "pets?",
  "Dust in the air isn't really just diet a majority of dust consists of insulation and dead skin cells",
  "Laptops should never be used on soft surfaces. Beds, couches, chairs, blankets, etc.. You said you don't \"often\" which means you do at times.",
  "Your pc can’t breathe",
  "You smoke inside?",
  "Bro dust your house first lol.\n\nDoor trim,  fans, electronics, blinds, picture frames, air vents, change your air filter, change your sheets, vacuum and mop.\n\n\nYou gotta do that stuff once a week or dust goes rampant.   Get a dehumidifier too.  That dust looks caked on like it wouldn't just rub off with a q-tip.",
  "A year? I clean mine every 2 weeks… a year? Explain a non dirty environment? Do you live in said environment? Then it’s dirty. Not saying you are a dirty human, but dry skin flakes off you everyday creating dust just like this. Plus there are things in the air you do not see that are ever present in your abode. Want it clean? Get a dehumidify and air purifier.",
  "Clean once a month or two with compressed air\n\nIts worth buying a cheap 3m air filter that takes A/D/H filters or you can run the furnace fan more often it does a good job cleaning",
  "If you use it in your lap, it’s just sucking lint and dust off you. Lots of factors to consider. Likewise the humidity around you. Seems like vacuuming or just running an air filter would be good, for your own health",
  "now you know why your environment is clean ......",
  "Animals, dust, dead skin, windows open in dusty areas all add this nasty. Change your furnace filter more often.",
  "Close to a heating and cooling vent? I know the desktop was bad for that",
  "Never set a laptop on a carpeted floor while using it, not only will it suffocate it but the dirt collect on the blades just like that.",
  "Pets?",
  "I live in a small town surrounded by farm fields, even though my apartment is kept fairly clean I have to clean my electronics filters frequently just because of the dust in the air.  If you have pets you may want to clean them more frequently.",
  "I've had a legion for about 4 years now. Leave it on 24-7. About 6 months ago I finally cracked it open cleaned it because I noticed dust accumulation on exterior fan intake mesh and it was nowhere near this bad. Granted it's just been sitting on my kitchen table all these years. Maybe that has something to do with the minimal amount of dust. It's literally just sitting there on all the time. Haven't moved it in years.",
  "So this is why you blow out your laptop fans often, doesn't matter what environment you think you're in. \n\nYou can also keep a bowl of water nearby or in the room that will mitigate it but not stop it.",
  "The mental gymnastics some people do on purpose",
  "Uh gonna be honest. You do use it in dirty locations. Thats rediculous",
  "Did you fuckin buy it used maybe? Lmao",
  "Not normal at all.",
  "If you haven't blown it out for 5 years, I would say yeah, expected. I try to blow mine out like 2x a year at least, regardless of conditions.",
  "Its Completely fine dude, you just have some laptop on your dust that's it! you're good to go with the cleanest environment you got!",
  "Mine didn't even get that bad after 4 years..",
  "Hey hombre - these other commenters don't have our machine.  I am an immaculately clean person, and my Legion 5 Pro builds up dust inordinately fast.  That's probably mine if I left it for a year.  I clean mine monthly, so should you.  But yeah, this is completely reasonable for the way this fan works for one year.",
  "Do ya smoke?",
  "Normal? The computer did what a computer does. \n\nYou on the other hand…",
  "Do you have a pet bird?  Those are pretty much living dust manufacturers.",
  "Excuse me wtf\n\nDo you have pets or is your house dusty ?",
  "Dust will always exist and even if you put it on a desk the the computer sucks up all of the junk that's small enough to get into it's vents cause it's impossible to have a 100% clean environment",
  "perfectly fine",
  "Questions;  \n\n\nAre you in a humid environment?  \n\n\nDo you smoke/vape?  \n\n\nDo you have pets?",
  "Liar You are dirty af",
  "Your home is much dirtier than you think it is…",
  "Ok how the hell it didn't take on fire? No ai wanna know 😂💀",
  "It seems that you already got answers, then I'll just add :\n\nWhen you clean it, don't forget to unmount it and check the filter (left of the vent), should be dirty as the rest.",
  "Lenovo is shit, thats prolly why.",
  "This has to be bait.",
  "Fine dust might not be visible to you, but if there is any on the desk, laptop fans will find it. That definitely needs cleaning. I have a Legion 5, and because of how the vent is designed, it's pretty obvious when it sucks up dust. The bottom intakes change color to grey, and that's when I clean mine",
  "X doubt",
  "Forbidden Cocaine",
  "While my fan does not look close to this, I can see through the venting that it does have some dust and debris caked on. What would be the best way to clean this as I’m a total novice when it comes to taking a laptop apart",
  "Take it outside, hold the fan blade from spinning, blast it with compressed air.  Repeat as necessary, maybe every 2-3 months.",
  "You in a nasty environment for sure.  Ignorance is bliss if you think otherwise.  Wtf",
  "Do you shut it down overnight? My 24/7 running dell wyse looks the same after 6 months of uptime. However, my PC and laptop are really clean after two years of normal use (6 hours a day)",
  "Only normal in a dusty environment.",
  "That is mostly dead skin. \n\nHow often do you take a shower? Once a month if you need it or not?",
  "Easy to clean. They still work, just not as well when covered like that, so not super end of world as long as you let it breathe normally. Take a clean toothbrush and turn the fan as you move the bristles along the fins to push the dust, then use some electronics grade canned air for the best results. Other kinds of canned air can cause Static damage to other components if used.",
  "This is exactly what mine looked like the first time I opened it up and I only have it on a desk. A lot of things can get sucked into those fans so just make sure to keep them clean and be a little more aware of where you put it",
  "If in a clean environment, this can happen if the laptop is powered on for long enough. If it's only 1 year old, and if the environment is clean, I believe you almost never turn it off.\n\nIf you do turn it off whenever you're not using it, then I believe your environment is not as clean as you think.\n\nAlso, if you or someone around you vapes, the vapor can cause dust to stick a lot more than it otherwise would. It could also be the case that there were just a few really dusty days and ever since it's been running hot and the fan is always running at top speed, collecting even more dust.",
  "And I thought my bedroom was a dustbowl for having nothing built up on the fan, and the heatsink fins themselves being about 1/4 lightly covered after two years daily driver use",
  "Holy crap that does not look normal. Surprised it hasn't died due to heat damage yet.",
  "How could you possibly say you don’t use it in dirty environments when the fan looks like that? Come on now.",
  "I thought this was a pudding",
  "Well the dust came from somewhere homie, laptops all use basically the same fans lol",
  "Dust is >80% human skin. You are the dust source",
  "I wish my wife were that dirty.....",
  "If that's the fan, I wonder how you lungs look like (0.0)",
  "lol. Just get a duster and get on with it. This is normal if you are in a forced air hvac setting.\n\nIf it's all radiant heat, you might have issues.",
  "How dirty is your place?!\nI didn't clean my laptop fans for almost 3 years and they barely changed color from the dust!",
  "It doesn't matter how clean thr house is, don't use a laptop on the fucking carpet, especially not a gaming laptop.\n\nThis makes me sick, get a board or something to set it on at least, how would you like if every breath you took, was through some dusty old carpet, would probably mess you up too.",
  "You have a cat or dog?",
  "Just think if this is your lungs. Not Good. Recommend cleaning almost every 3-6 months",
  "You'd be surprised about all the sources of dust. Does it sit on a desk? Dust. Does it sit in your lap? Dust. Etc. \n\nI thought my home was pretty dust-free until I got on the air purifier bandwagon. Whether or not the work, that's up for debate. There's no question about them removing dust from the air",
  "Vaping/smoking anything will cause it to condense on almost anything. A bedroom fan will catch a ton of it, and get dirty before a laptop fan. My old roommate vaped and did dabs, then came to me complaining about her fan being junked up. Her room is kept very clean but condensate and natural dust (as well as three cats) did a huge number on the fan and all its parts. Cleaned it out and applied a little wd40, took longer to get really nasty. \n\nBeing clean won't stop the natural accumulation of dust, and places where air moves a lot usually won't accumulate dust like this UNLESS there's moisture in some form. Weather that's from taking the laptop from cool to warm places or vica-versa, vaping nicotine or any plant materiel, taking it to the bathroom even after a shower or during can cause droplets to form on the blade. Even teeny, tiny droplets will pick up ambient dust. \n\nAnd there is dust. Dead skin cells, hairs, residues from cooking and even cleaning chemicals can create or disturb dust, and it'll settle or stick as it must. Best thing to do is clean that puppy as best you can, and do periodic dust checks on any form of electronics. Little old lady homes that are spotless will have PC and TV fans covered in junk from having a human around, and a liberal application of febreeze.",
  "No that much dust is not normal to be in your computer. Please clean it out 2hile you have the case open.",
  "Holy shit man. You have really bad dandruff.",
  "There's dust everywhere even if you don't see it lol...",
  "what the fuck? 😭 i need to go clean my laptop now asap how do i do it lmfao",
  "\"I don't use it in dirty environments.\"\n\n- Your laptop has entered the chat.",
  "This is why I hate these style of fans ! They suck up every speck of dust!",
  "I bet you someone you regularly are around/ live with smokes inside.",
  "It's so bad that it looks beautiful.",
  "Normal? Its so dirty , your laptop is passive cooled at this point",
  "Also depends on the type of environment.\n\nWhile I was in Africa in a shipping container converted to living space while deployed my laptop after 8 months of not being cleaned didn’t have much dust inside.\n\nI get to Fort Bliss for demob and the thing is dusty again within 1 month.\n\nSince I been in Virginia about every 3 months for same build up however much cleaner living space",
  "I was about to say the same thing....",
  "Pets dont mean ppl are dirty but their fur gets literally everywhere.",
  "What does it have to do with you being in a university? Please explain!",
  "probably a cow",
  "Yeah, the vents have done a pretty good job of keeping any dust from actually getting in my Legion laptop. No idea how his fan got caked like that.",
  "If your lint filter looks like this, you're not emptying it often enough, and that's a fire hazard.",
  "HAHAHHAHAHAHA",
  "The equivalent of “I’m not racist…..BUT….”",
  "Wait. Santa isnt real?",
  "OP's definition of \"dirty\" might be a little more gross than what most of us would consider dirty\n\nDon't know how anyone could look at that fan and still think they've been in a clean environment",
  "I don’t get it. Dust = nasty environment?\n\nI don’t have much experience in how much dust build up per year, but like what do you guys think he lives in?\n\nFor example, same location, I experienced a lot more dust from window and the other, I experienced almost no dust cause I was far away from the window.\n\nAlso pets and clothing type affects the amount of dust.\n\nIdk, can you at least help me understand, maybe give a few examples.(maybe I am also nasty)\n\nEdit: I’m reading more comments about how not normal it is. So this is an extreme case, but I honestly still want to know how this can happen.",
  "Just throw it all in a bong",
  "There it is “it was my little brother’s fault”",
  "Windows standby is shit\n\nAlways use hibernate",
  "power it off if you are putting it in your backpack. That still wouldn't explain the dust though. Do you have a lot of pets? Live in an older house?",
  "Do you or anyone smoke or vape?",
  "OP I think you need to pin this comment or else no one will never get to this (I scrolled fast for like a couple of seconds 😅",
  "This might be it. I rarely ever shut it down. Plus that Nvidia instant replay thing prevents it from sleeping for some reason. Thanks.",
  "Could be humidity making dust more sticky",
  "Yo fort bliss was made on dust youre not wrong.",
  "Camp Lemonnier?",
  "As a pet owner. Yes it does. Clean people will make sure their pet and house are clean regardless. I have walked into pet houses that people rarely clean. And they small like piss and shit. The pet can’t clean. The person can. Setting boundaries for which rooms your pet can and can not enter and cleaning the house while bathing the animal regularly is a persons job. And that makes them clean.",
  "Well. In university you often have to live with other people. Like dorms or apartments. I was taught to clean everything spotless every two weeks or more depending on how bad it gets. I noticed everyone I roomed with or talked to. Cleaned about one a semester…. So once every 4 months. Nasty.",
  "qcow2",
  "Boohoo",
  "yeah Timmy \n\nits real\n\neat your veggies now 😂👍",
  " Santa IS real. Don't listen to them.",
  "Totally was in Djibouti humidity definitely was high",
  "Or homie vapes and the residue builds up making the fan sticky.",
  "More like Fort Blister",
  "Yep",
  "erm as a pet owner",
  "You knew people in college that actually cleaned?",
  "dust4laptopfan.qcow2",
  "Nope, a holy cow.",
  "Ah yes \"boohoo\" when your house burns down 💀",
  "Well, that was a weird reaction to that statement but okay.",
  "Some guys have all the luck.",
  "Heh. Djibouti is humid.",
  "I knew the shipping container thing sounded familiar! I’ve been out that way before too.",
  "What were you doing in my booty…",
  "I was there 3d printing barracks and it was so windy and just sand blasty",
  "lol a few. But definitely more people who didn’t.",
  "Cmon guys, Maybe he just smokes a pack or two of cigs a day. Inside.",
  "Lol",
  "Exactly. The El Paso area is just rough in general.",
  "I don’t smoke",
  "I've got my Lenovo Legion 5 15 AMD, any questions? ",
  "Those arrow keys just out doing their own thing.",
  "How are the thermals?",
  "Yes how many hours of sleep do you get per night",
  "What about the portability ? I mean is it too bulky or is the thickness average? And how about the color accuracy of the screen?",
  "What about battery life?",
  "i really wish i was you right now...",
  "It's beautiful man.\n\n\nIt has both an amd and nvidia gpu?",
  "How is the trackpad? Is it precise and smooth?",
  "Glad to hear you like it ordered the same one a few days ago.",
  "Do you think that it can be used for next 6 years? I only use for gaming and coding. Thanks very much!",
  "What’s that software you’re using , looks cool",
  "Are fans totally quiet in daily use apart of gaming (office apps, browser, graphical apps, etc)? And is it comfortable to work holding it on lap? Thanks)",
  "Hi, I just ordered mine!\nCan you tell me if the trackpad is Multitouch? How is the trackpad quality in general? Can I use Windows 10 gesture control?\n\nHope it fits my needs, as I need a semi portable workstation (for moving between my university/girlfriend/parents city for multiple days) in addition to my Desktop PC. I’m a bit concerned about the battery life, as I’m switching from a 2015 MacBook Pro. Hope I can adapt.\n\nThank you!\n\n\nPS: It’s honestly very nice that you do this. There’s zero to nothing hands on information right now in the internet. Had to blind buy purely based on specs.",
  "The real question is: When are Legion 5 AMD Models available with 1660 ti or RTX 2060 ? Than things start to get interesting...I got the 1650 ti one but sent it back because i decided to get some more gpu power available soon.",
  "Looks like a better keyboard layout than Y540, also much better webcam position.",
  "[deleted]",
  "Cost?",
  "I am thinking of getting the 7i - are they super sturdy and durable ?",
  "Oh wow cool, I've been waiting to see someone with one of these! Can I ask a couple of questions?\n\n1) Does the case feel strong? Any noticeable points of failure?\n\n2) How are the trackpad and keyboard? Does it feel good to type on?\n\n3) What battery did you get (there is an 80 whr and 60 whr version) and how is the battery life?\n\nI've been looking into AMD options, and this one looks like it might be a great option, but you're the first I've seen with it!\n\nThank you and enjoy the awesome machine!",
  "How's battery life and build quality? How long do you think this laptop will last you?",
  "I will be using it for work so I need durability and reliability",
  "Why laptop aside from the portable part?\nIt's overpay when you vould asemble a monster desktop",
  "USB C charging?",
  "Is the battery life descent considering the super powerful specs.",
  "how's the 250 nits screen? Can you see in well lit rooms our outside?",
  "I ordered a desktop version of the Legion T730 to be exact. Please run some benchmarks. \n\nAlso what video card it came with. The one I order will have a desktop version of the GTX 2080",
  "Yes. Available in Ireland when?",
  "[deleted]",
  "what about noise?",
  "Not a fan of how the trackpad is off to the side, plus the arrow keys are weird.",
  "[removed]",
  "How different is this legion 5 15 AMD compared to the new Lenovo Legion 5 that comes out this June 21st ?",
  " can you tell me how many fps you’re getting on 1080p, medium settings csgo? and also",
  "How is sound quality and how are the speakers?  I have an 8 year old Lenovo Y580 (GTX 660M for the win) with speakers facing up.  The sound is good for this laptop.  I need an upgrade but I'm hesitant due to speaker placement...\n\nI will be using a laptop stand to prop it off my table, like you.\n\nAlso curious about heat on the keyboard while gaming.  I see the thermals on the gpu/cpu seem fine, but what about with your hands on the keyboard?\n\n  \nThanks.",
  "Did you get a Microsoft Office key with the purchase?",
  "[deleted]",
  "Can you disable the Nvidia GPU in the bios?",
  "Hey, I am thinking of getting the same model and was wondering how much fps I can get on League of Legends. Would you be kind enough to test it out on each setting? And, how are the fan noise? I only play League so I think it won't be much but was just wondering. Finally I can move on from my current Lenovo Y50 haha.",
  "How long did it arrived after you ordered on lenovo SG site?",
  "Hey there! I was wondering how good the CPU works in terms of DPC Latency. I want to get one for Audio Production and Latency is quite important when it comes to real time audio tasks. AMD had some problems with that in the past so I am wondering how the new Ryzen Gen handlest it. Maybe someone has some experience",
  "Hey! Congrats first of all on the upgrade. Can you provide an average fps of the games you have played on it till now? I am not a hardcore gamer but definitely wanted to have a gtx 1660ti but given that that option is not available with AMD,  I am kinda confused if I should go with it or Intel.",
  "Sweet",
  "Does it get too hot to touch while gaming? Like reaching 90 C?",
  "Does it have advanced optimus? Or do only Intel variants have those?",
  "Still waiting for it to come out in Europe. I ordered it two weeks ago, still nothing.",
  "I've got this laptop recently and i have problem with backlight of the keyboard. It can be turned on and off with FN+ space UNTIL i open the lenovo vantage app, from that point, it can be turned on only within the app and the key shortcut doesn't work until i restart the laptop. I even noticed that \"battery saving mode,\" which should charge the battery only to 60% , to prolong battery lifespan, but it still charges up to 100% . Could you please help?",
  "Ay fellow Singaporean here\nHow come ur one with ur full spec is only 1.5~k? Isit lower warranty?\nAlso how's customer support / service for Lenovo?",
  "How many m.2 nvme ssd slots are there?\nAlso, if I get the 8gb ram variant (which is a single stick of 8gb) will there be a big impact on performance as it's single channel?\nDope laptop",
  "Unfortunate it's only a GTX.",
  "I know I am late but hopefully you can still attend to my question. How's the quality of the webcam? I'm planning on getting this one for work where having video calls with my client is a must.",
  "Does it have the tint? Can you add a 2.5' HDD? What's the difference between this and y540?",
  "Can u change the refresh rate of the display to 60Hz? And will the battery last longer then?",
  "Hi, thanks for answering all the questions. How is this AMD version compared to the Y540 of the same price?",
  "Average CPU temps when running GTA V? Or any other CPU demanding game.   \n\n\nCurious to see how AMD chip cooling is vs Intel.",
  "[deleted]",
  "How long did it take to get it delivered??",
  "Do you know if the RAM is upgradable? The max specced. version in my region only comes with 8GB, and I’d like to know if I can increase it to 16GB. It’d be annoying if it’s soldered.",
  "Hey I know this post is old but could you provide an update on battery life? You mentioned you could get up to maybe 6 hours without your webcam, with further use how much life do you get doing regular browsing? Thanks",
  "what panel is that? is it the 120hz? if so, how's the colors? is it really that bad?",
  "Hey man, been planning to buy this laptop, how are the thermals? And I've heard from a few reviewers that the screen may not be enough for gaming, since you use it, is it any good?",
  "Hi, Can you turn on the backlight of your keyboard after closing the lenovo vantage using Fn + Spacebar? thanks",
  "I'm planning to buy this. I'm a Computer Science student. Planning to buy a Ryzen 5 with 1650Ti with 8GB RAM. Would this be good for long term use? I also do gaming and lots of video editing. Thanks!",
  "So the vantage software makes it seem like you can customize the rgb in the keyboard to any color you want, how ever when i try to change it to say yellow, or any other color it doesnt work? I can only use the 3 default ones. Not a huge deal but, am I missing something???",
  "Hey this is probably a stupid question but is this computer good for playing Sims 4??",
  "Thank you !!",
  "does the backlight on the capslock key also glow if you enabled it?",
  "Just ordered the Legion 5 15 AMD for my son with the 120hz, 45% sRGB gamut range. I was a little bummed about that and the 144hz with 100% sRGB was out of my price range. Can you hook up an external monitor that has a wider sRGB gamut range and see more colors at the 120hz rate? Or is this the limitation of the graphics card at 45% is the best you are going to get from this configuration?",
  "How is the screen brightness and color accuracy, and at what brightness percentage are you able to play shooting games?",
  "Can we charge it using Lenovo type-c laptop adapter?",
  "Sir, Please can you tell how much is the response time of the 120Hz panel?",
  "Sir, Can you please tell me the response time of the 120Hz panel of the laptop?",
  "I'm planning to order this in the US and have it shipped to my country, so I have a few questions:\n\n1) Are factory issues prevalent on this model? \n\n2) What's the dimensions of the box it came with?\n\n3) What's the total weight of the product? (box, charger, laptop, everything included)",
  "Hi, I am looking for a laptop for school and some gaming (GTA V, Watch Dogs... But it doesn't really have to be on the highest settings) and this seems like the best choice. There are a few things I want to know before buying it.\n\n- Is the laptop not too heavy and big to put in a backpack to school everyday?\n- How long does it take to charge it / does it charge fast?\n- Did you experience some disadvantages? Which?\n\nThanks in advance for all the effort you put into answering the questions!",
  "Is the OS installed on the SSD or the HDD? Assuming you have that model.",
  "What screen did you get with your model? 60, 120, or 144hz? How is the brightness of the screen? From what I read the 120 hz screen has 250 nits which may be dimmer than what most people are use to.",
  "Hi, i want to buy this laptop, so i have few questions. After almost 2months, are hinges ok and are there any scratches? Because i want to use it for few years, so im curious about build quality. And is there any cons and disadvantages i should be aware of? How's battery life? Best regards.",
  "Do u plan to remove the stickers?",
  "Have you gotten any problem with it? I was thinking on recommending it for a friend who is looking for a laptop for light gaming and college",
  "If they’d have kept the trackpoint I would have been an instant buyer. Bahhhh Lenovo! \n\n(And before anybody thinks it’s just a preference, I’m fighting a neurological problem in my formerly dominant hand. Life is usually one-handed right now. Leaving that one good hand on the keyboard saves a LOT of time and makes some impossible things with a mouse or trackpad, possible.)",
  "does connecting the hdmi 2.0 to a TV uses the dedicated graphics card or the integrated?",
  "Can you change the color of the keyboard?",
  "Hi! I am probably a bit late to the party, but I just bought a Lenovo Legion 5 (AMD) and I wanna see if my touchpad is defective or if all Legion 5's are like that.\n\nWhat happens is that when I try to click at the top area of the touchpad, it doesn't ... well ... click - it feels as if the touchpad is not clickable there. Anywhere else below the top area is clickable . Is this how it is supposed to be ? or do I have a defective unit?\n\nThank you",
  "Hi I am thinking of buying this laptop with a R7 and a GTX as long as it fits my budget with 16 GB ram do you think it will be better or should I just go for  PC with an RTX 30 series because of its price?\n\nBecause I heard laptops dont last as long as Pc's do... And I can get better specs for around the same price. Whats your adivce Laptop or PC ?  \nThanks",
  "Is the 80 WHr pure SSD variant available ?",
  "have you played call of duty warzone? In everything at ultra what temperatures do you get? the cpu is around 80-83 ° C with peaks of 90 ° C. the gpu is always cold. with what do you measure the temperature? I use HWinfo. I have the ryzen 7 model with rtx 2060, I also use a base to lift it without fans",
  "Hi, looking to get this for university which means as well as gaming it also needs to be quiet for word processing in lectures. Don't want any looks from the sheeple on their MacBooks.\n\nCan the fans stay quiet when using basic applications?\n\nEdit: Also, soundcard? is it good? I like my music but could always get a USB DAC if its not.",
  "Weird flex bro 😂",
  "Why?",
  "I’m thinking of getting the same one. how’s it holding up after a year? any major problems?",
  "I have legion 5 Gen 6 ( 5800h, rtx 3060 130w,16gb ram,165 Hz FHD) \n\nI don't know why whenever I use my laptop on battery my screen stutters/ unstable fps on both watching movies and playing games like GTA 5 and ARK.\nIt works amazing when it's plugged in but it's very annoying when I use it on battery.\n\nCan anyone tell me how to fix it?",
  "Hey! I just got my Legion 5 and the touchpad seems a little bulgy and it presses down on the lower left side more as compared to that of the right lower side. Is it normal?",
  "Is it running well after two years of service?",
  "Yeah that's gonna take some time getting used to 😅",
  "I actually prefer that, now it has a full sized numpad unlike the Y540",
  "Thermals are great, but probably because I have it propped up off the table to give the intake better airflow, so far I've run jedi fallen order and gta v on it for multiple hours, maximum the CPU has ever hit was 80C, and the GPU never crossed 66C before",
  "Around 8 why?",
  "Color accuracy for the screen I chose isnt great because I wanted a higher refresh rate, 120hz, so my screen is rated at 45% sRGB, but there is a 60hz option with 100% sRGB if you need it. In terms of portability, not the best considering it is a gaming laptop albeit not the highest end, it comes in at 2.5kgs or around 5.5 pounds I think, in terms of thickness, around 2cm thick when closed, but the thickness does give the laptop a rather robust and sturdy feel to it",
  "Right results are in, so from 100% at 60% brightness the laptop lasts 2 hours and 41 minutes. This is running YouTube, Microsoft word and discord at the same time, I even had my webcam turned on for an hour, so without that itll probably last just about 3 hours",
  "Am about to test it, will update when I've got the results",
  " [https://www.youtube.com/watch?v=xlsJG9X9DdE&t=254s](https://www.youtube.com/watch?v=xlsJG9X9DdE&t=254s) \n\nHere is a review legion 7i. It is in the Chinese language but you can auto-translate in English. In China, it is named as YY9000K. It might give an idea about the laptop.",
  "Why?",
  "It's got an AMD integrated GPU and a nvidia gtx 1650",
  "Yep, trackpad is good, I can very comfortably scroll and browse websites without having to touch my mouse at all",
  "Coding will be no sweat for this machine, the ryzen 7 4800h is more than powerful enough. But gaming... depends on the games you wanna play, for AAA titles I'd say maybe 4 years max, and that's playing games on minimum settings. Because the GPU isnt a high end card for today's standards so 6 years down the line... yeah probably not gonna be too good",
  "Its lenovo vantage, it came pre installed in the laptop",
  "Yep its quiet when not under heavy loads, if you're really worried about noise, the laptop can be set to quiet mode, so the laptop will automatically limit the speed of the cpu and gpu to keep fan noise down. As for using it on my lap, not the most comfortable because of its weight, and the damn numberpad at the side, because it means you cant rest your hands on the laptop in a symmetrical position to ensure the laptop stays balanced on your lap",
  "Trackpad feels good, sensitivity isnt way too low like my friend's laptop, and if you find it too sensitive you can lower it in the settings. Based on settings it does support windows 10 gesture control, it has 3 finger gestures and 4 finger gestures. Battery life is just shy of 3 hours on the balanced mode, but based on another reviewer, when set to the power saving quiet mode, it's just shy of 4 hours, but there are ways to improve the battery life but at the expense of performance of course. \n\nI bought this laptop purely based on specs and my personal faith and preference for lenovo products",
  "I find the gtx 1650 enough for me, I used to play using a nvidia 940mx so what you guys feel is subpar gaming performance to me is amazing gaming performance",
  "Yeah but a downside is that the webcam doesnt support windows Hello face recognition",
  "I disagree, I actually feel the build quality is great and the whole thing feels really sturdy, the hinges too, nothing about this laptop makes me feel the slightest bit of concern",
  "I paid 1556.47 singapore dollars which equates to 1115.75 usd",
  "Intel 10th gen CPUs when compared to AMD 4000 cpus are shit and far behind in performance",
  "I cant say for the 7I but mine certainly feels sturdy",
  "1. Yep it feels really sturdy, probably helped by its extra thickness, I generally disagree with those who say the hinges feel weak because when I opened it, it actually gives me good confidence that this machine will last, but who knows maybe it might weaken over time.\n\n\n2. Trackpad works great, it's really precise, I can comfortably lean back and use 1 hand on the track pad to browse websites, no need to pick up the mouse at all, only gripe is the number pad making the touchpad off centre and it just bugs me. As for keyboard, idk how to review this because I've never used what's objectively deemed a bad or lousy keyboard, but lenovo said they did copy the thinkpad keyboard design so I dont think you'll face any issues or discomfort. I personally find it comfortable.\n\n\n3. I took the 60 whr option as I needed a 1tb hdd to store all my school related stuff, but I'm not sure if the AMD version even has the option of the bigger battery. As for battery life, I'm actually about to test it, I've been running the laptop on battery conservation mode since I got it to prolong the battery lifespan, so I'm getting it to 100% now so I can start testing it, will update you when I got results",
  "Right results are in, so from 100% at 60% brightness the laptop lasts 2 hours and 41 minutes. This is running YouTube, Microsoft word and discord at the same time, I even had my webcam turned on for an hour, so without that itll probably last just about 3 hours",
  "build quality feels really good, the laptop as a whole just feels pretty sturdy. I think this laptop will last no less than 3 years, note im not someone who games on ultra settings, i am content gaming on low settings and lock to 30 fps, so if you have big gaming expectations, no way this will even last 2 years for you. As for battery life, im testing it as im typing this reply, im running on medium power setting, with youtube and microsoft word running at the same time to get a more accurate result",
  "Right results are in, so from 100% at 60% brightness the laptop lasts 2 hours and 41 minutes. This is running YouTube, Microsoft word and discord at the same time, I even had my webcam turned on for an hour, so without that itll probably last just about 3 hours",
  "Because I'm a student and I need a laptop, and having a desktop means I need to deal with constantly transferring files back and forth to get my work done, plus I'm not interested in the pc master race either. I'll probably only switch to desktop when I get a job and need a workstation",
  "Nope, but it can charge your phone using a cable through the usb c port",
  "I'm currently running a test to see how long 100% lasts while on youtube, mc word and discord",
  "In a well lit room I need the brightness at at least 50% to see clearly, I havent tested outdoors because well I'm stuck at home right now",
  "Mine came with a gtx 1650, but it's a laptop version so it cant be compared at all with your desktop",
  "Idk, you should go email lenovo for that",
  "The screen I chose is only 45% sRGB but 120hz. But if you need 100% sRGB for content creation, it is available too, but only 60hz and it needs a additional $10. Build quality wise, it is solid, it feels robust",
  "I cant measure it, I dont have any equipment. But it isnt ridiculously loud even at performance mode, with my game volume at around 50, I can hear my game clearly, or with headphones on, can't hear the fans at all",
  "Same here, I personally never use the number pad and would have much preferred if they used the space to give the keys more space between each other, I'm still regularly hitting the wrong keys because I've always used the touchpad and sides of the keyboard to align my hands",
  "I would say AMD, more cores for lower price, and especially if you top up to get the ryzen 7 4800h, it can match the performance of the latest i9 10980hk",
  "I never heard of a legion 5 coming out on june 21st, is that just the release date for your region?",
  "Speaker sound is abit soft for me because I have it propped up off the table using these little rubber pieces on each of the 4 corners, so the bottom firing speakers arent able to have the sound bounce off the table, but the laptop does come installed with Dolby Atmos for gaming, and in jedi fallen order, there was a 7.1 surround sound option for audio. As for heat, generally most of the heat is towards the centre of the computer, near the hinge and away from the main WASD keys, so no major concern of keys being hot to the touch",
  "Nope, but I already had a permanent subscription on my Microsoft account, so logging in was all I had to do",
  "Unfortunately the option for a gtx 2060 is not available yet, lenovo said it will be coming later in the year, so I dont know anything about how much it would cost",
  "In the bios, there is switchable Graphics. so u can turn it on. In addition, Lenovo vantage allows you to toggle the hybrid mode which means it only activates the dgpu only when gaming or other gpu intensive stuff",
  "Fan noise isnt very much, honestly when I was playing more demanding games like jedi fallen order, having the volume at 50/100 was enough for me to hear all the game audio very clearly over the fan noise, as for the LOL test, I'm not a league of legends player but with how low the requirements to run it are, I'd imagine 120 fps should be no sweat for this laptop",
  "I ordered on 22nd may, UPS delivered it to my door on 3rd June",
  "Uh, any idea on how I could run a test?",
  "Pretty decent, the only benchmark worthy game I have is jedi fallen order, I get a very consistent 80+ fps, occasionally it dips to around 70+ fps. This is on the max settings.",
  "By the way, you can still consider buying the AMD version, lenovo will be adding the option for better GPUs later this year, up to a rtx 2060",
  "Nope, processor has never exceeded 82C ever, and GPU never exceed 66C, this is playing jedi fallen order on epic settings",
  "only intel variants. But in the bios, switchable graphics is available. Hybrid mode on lenovo vantage works similar too",
  "It's not battery saving mode which stops the charging at 60% its conservation mode, in Lenovo vantage there is rapid charging and conservation mode. As for the keyboard backlight, I have the issue too, but honestly it's quite a insignificant problem since the backlight does still work",
  "I ordered with student discount, without it you should be able to get similar spec just that instead of ryzen 7 you can probably only get the ryzen 5.\n\nAs for lenovo customer support, amazing honestly. Every time I've emailed the Singapore lenovo customer support, I get a reply the next business day, some times even just a few hours after I sent the email. Plus there's quite a funny story with how I got my laptop so fast.\n\nThe story is that when I ordered it, the product page says expected to ship within 6-8 weeks, but then the next day it changed to ship within 4 weeks, so I wrote a email to customer support asking to clarify, the rep apologized and said he'd help me email the shipping team to expedite my order and the next thing I knew, my laptop was shipped out in less than a week. Reached my house in 10 days.\n\nIf you want a cheaper option with similar ish specs, L340 Gaming is your best bet, has the same gtx 1650 but only a  i7 9750h",
  "I got mine for SGD$1309+ 93(GST)\nRyzen 7 4800H\n512SSD\nNvidia Geforce GTX 1650\n300nits 144hz screen\n\ni used the coupon code CUPONATION15 to get 15% off. (Shaved off almost 250 off)[Found it by googling lenovo discount code]\n\nOrdered mine on 3rd july tis yr prolly still works>",
  "There are 2 m.2 nvme slots, but you can choose to have a hdd instead if you want cheaper storage, but you can always remove it in the future to install your own nvme ssd. As for the single channel ram, I cant say for sure, since the ram is running at 3200mhz, considerably faster than the intel counterparts, it shouldn't struggle to run anything unless you've got loads of apps running at the same time",
  "Seems really average, just a standard 720p camera you will find in many other laptops",
  "What do you mean by tint? And yes you can add a 2.5 inch HDD, I have one added. Y540 has slower processors, 9th gen i5 and i7 are no match for ryzen 5 4600h or ryzen 7 4800h. Y540 has slower ram, 2666mhz vs 3200mhz, Y540 has smaller battery 52.5wh or 57wh vs 60wh or 80wh. But y540 has gtx 1660ti",
  "You can change the refresh rate and theoretically it should improve battery performance",
  "also... where dat rgb at?",
  "I'll get back to you on the exact numbers because although I've been playing a lot of GTA V recently I never paid too much attention to the temps, but every time I glanced over at the on screen display, it always hovered at around 60-68C, take these numbers with a massive pinch of salt, I dont think me looking at temp reading once every 20 mins or so can be too accurate",
  "Nope, no problems at all",
  "10 days after ordering, it reached my doorstep",
  "No soldered ram at all, 2 empty ram slots. Ryzen supports speed up to 3200mhz for ddr4. You can put up to 32gb ram, I have a 8+8 config",
  "With Hybrid mode on, window battery saving 40% brightness, mine lasted 5hrs [I was using the Lenovo gaming mouse tho so that might had drained battery too]",
  "It's the 120hz, I dont even notice the supposed lack of color, maybe its just me. I've never had high end machines before",
  "Thermals are really good, I've played gta v and jedi fallen order at max settings and CPU never crossed 80C and GPU never crossed 68C. The screen problem is exaggerated. The reviewers need to criticize it and in terms of the specs of the screen it is very easy to bash it because it is inferior to many other laptops out there. But using it as my daily driver, I dont even notice it",
  "Nope, but no big deal for me, I can still click on the battery indicator on the taskbar and just click to on the backlight",
  "Gaming and video editing yes no problem, but if the video editing is like 4k video or very intensive stuff, I'd say upgrade the processor to the ryzen 7. The only concerns would be 8gb might not be enough for you and that a gtx 1650ti cannot run for example rdr2 at max settings at 60fps. But as for things like programming, and running virtual machines, no problem at all, unless you're running say 3 windows 10 virtual machines and all from the same HDD in which case the HDD will bottleneck really hard. I know because I just tried it yesterday, not a nice experience",
  "Uh idk I've never played sims before but I'd imagine it wont have any problems, the CPU crushes virtually everything else available, and the GPU can run pretty graphic intensive games well too",
  "Nope, when I enable caps lock only the small light in the corner lights up, I tried cycling through the backlight modes and indeed, the backlight stays off when I enable caps lock",
  "You definitely can connect an external monitor, that's what the HDMI port is for",
  "Brightness is not the best, only 250 nits. Color accuracy is 45% srgb so horrible for any content creation work but no problem for things like programming. In a well lit room I've found 50% to be okay for programming. But when it comes to like csgo, I push it to 60-70%. I have yet to use 100% brightness yet. As for the color accuracy I really cant tell you, I've never had any high quality screens before, always using budget laptops so honestly it just looks the same to me",
  "Unfortunately no",
  "Unfortunately I have no way to test this",
  "1. The laptop isnt too big for my backpack, but it is bigger than a regular 15.6 inch laptop because there is a area behind the hinges with a lot of IO ports. As for the weight it is rather heavy but there should be no problem putting it in your lap for say, a lecture.\n\n2. As for charge time I cant say, because I havent returned back to campus for lessons yet so ive been running on AC power all this time to reduce battery wear. It does support Lenovo Rapid Charge though, so it cant be slow. I can probably give you a rough estimate when I return to campus next week\n\n3. The only disadvantage I've faced is really only the weight of it. However that is the trade off for really good cooling. Like really good, I've never seen temps cross 80C even when I ran benchmarks. Other than that, probably having to readjust to this new keyboard layout. I've used 14 inch laptops my whole life so now having to ditch my, align hands to the both ends of the laptop when typing, to having to shift to the left as there is the number pad on the right. I find myself hitting the wrong keys alot during the first week of use",
  "It's installed on my SSD, I have a 256GB SSD + 1TB HDD config",
  "I got the 120hz, the 144hz was not available when I ordered it",
  "After 2 months, hinges are still perfectly okay, there are no scratches on my unit yet but there are scuff marks from the other things in my backpack rubbing against it, you could always buy a sleeve if you want to avoid this. As for battery life, I'd done a test before and posted it as replies, basically using chrome, mc word and discord video call, on 60% brightness, it lasted 2h 41mins",
  "Nope, I actually like the stickers and it's my way of flexing on my friends with their shitty intel 4 core CPUs",
  "Nope, no issues at all",
  "If you choose the rgb backlight add on, yes",
  "That's normal, mine does that too",
  "Always go for a PC over a laptop simply because a PC is upgradeable but a laptop is not. Only ever go for a laptop if you're in a situation where you need to travel and bring your work with you alot, example, student",
  "Yep, but out of my personal price range",
  "Sorry I don't play warzone, not enough space on my hard drive",
  "Yep definitely, I've run virtual machines on it and the fans were never at a noticeable volume",
  "I think I can safely say I'm the one of the first in my country to get it, I ordered it first day it went up on the lenovo website and when the website updated the shipping time from 4-6 weeks to 4 weeks, I emailed lenovo asking to clarify. The rep misunderstood me thought I was pissed off and apologized saying he'd expedite my order. Hence it ended up getting shipped just 6 days after ordering and it arrived after just 10 days on 3rd june",
  "Just that there arent many reviews out there yet, so I thought i could answer questions from any prospective buyers",
  "Yep, no issues so far apart from the wifi card not being detected at one point which was fixed with a BIOS update. \n\nNo hinge issues, build quality issues or even temp issues. I haven't cleaned it even once in these 2 years btw. Tho ofc the fan now runs noticeably louder due to that dust build up",
  "Dude these thermals are great. Holy shit.",
  "Yeah the thermals are great.",
  "You said to ask you questions",
  "U serious a 100% sRGB ? What about AdobeRGB?",
  "From the website they also show a better screen as one of the options \n \n15.6\" FHD (1920 x 1080) IPS, anti-glare, 250 nits, 120Hz, 45% CG\n\n15.6\" FHD (1920 x 1080) IPS, anti-glare, 300 nits, 60Hz, 100% sRGB\n\n **15.6\" FHD (1920 x 1080) IPS, anti-glare, 300 nits, 144Hz, 5ms response time, 100% sRGB**",
  "because you have the laptop lmao, the new legion line is a breath of fresh air from the previous one",
  "How do you think about the material of the deck? Is it durable for a long time?",
  "Thanks , I’ll check it out",
  "I already got my laptop.\nI was surprised how premium it feels given the price point. It’s an exceptional laptop for the money I guess, but I will still send it back.\n\nIt’s too heavy for my needs, even if it isn’t really heavy for a gaming laptop. I had to give it a try, and I’m honestly kind of sad as it’s a great device - just not MY device. Guess I’ll have to go back to real office laptops / Macbooks and have to refrain from additional gaming capabilities on the go.",
  "I play on an integrated graphics card, can’t even run roblox at minimum settings, i have been for years, I’m planning to get this next week, I already I’m gonna be happy with it 😂",
  "With shipping? What are your specs?",
  "Not true. For processes like gaming Intel 10rh gen still holds the throne as games are more on single core performance. Ryzen trumps Intel in multicore processes, but it does not outright beat Intel.",
  "I heard about that",
  "Can you please post a short video of you holding it, typing on it snd so we can get a feel. \nThe wait time to order get the 7i is more than 5 weeks here , I winder why ? Also I want it to last me 5 years. Also is it easy to open up the laptop and upgrade ram ? I read the ram is behind a thermal plate.",
  "Amd version has bigger battery 80wh option via double ssd config.",
  "Awesome, thank you again for the detailed feedback! This is really helpful information!",
  "Thanks for this thread.\n\nCould you elaborate on why gaming would reduce the lifespan of the machine ?",
  "Fair enough.but nobody said anything about pc master race.That in itself is an overpriced portable pc.I was talking about saving money",
  "Nice! Send the results please. Thanks!",
  "I'm surprised you don't need it at 100%. Glad to hear that :)",
  "Thx u for the info. I’m still waiting for my Legion T730 to arrive.",
  "The 5I is available but only with i5 processors",
  "I think so.",
  "Yeah I have that in the bios of my current laptop and it saves a decent amount of battery life compared to just using switchable graphics. Thanks for replying :D",
  "Thanks for your answer! LatencyMon is a application that checks if a system running Windows is suitable for processing real-time audio and other tasks. It can be downloaded for free. I attach you a link with the first side I found but there are multiple sources. \n\nhttps://www.youtube.com/watch?v=78S0CMafigM\n\nHere is a Video that explains how to use it (Just the first 3 minutes)\n\nhttps://www.youtube.com/watch?v=78S0CMafigM",
  "Wow it seems Lenovo got the thermals right unlike Dell & Asus. Please share some screenshots if you don't mind.\n\nNow I'm also excited for the Thinkpad E14. Hopefully they will not cripple the cooling system.",
  "I meant that but i have it in slovak so i translated it wrong",
  "Nice thanks for the 12am reply\n\nI'll stick with legion 5 with a ryzen 5 then (when i have more money)\n\nJust curious, whats the % / $ of student discounts (esp for urs)",
  "Damn",
  "Noted on this. Thanks for the response! :)",
  "Thanks for the reply! \n\nNow my options remain:- \nY540-60Hz-250nits-16gb -512gb SSD - i7(9th gen) - 1650 4gb \nAt around 1100 USD where I live (india) \n\nAnd the one you mentioned which might cost around more (+100) I guess..? \n\nI just do programming and run VMS so display is not a dealbreaker..\n\nWhat do you think I should do?\n\nAlso will I see a noticeable differences when running VMS between 9th & 10th gen?",
  "Can you add another SSD instead of the HD?",
  "sRGB 45%, but there are other screen options, a 60hz with 100%sRGB and a 144 hz with 100% sRGB",
  "Haha ok let me know. I have videos if you're curious how the 9th gen i7 (9750h) is in comparison. It throttles quite a lot :(  \n\nI have a cooling pad and I undervolt as well, still hits 95C sometimes. Fucking lenovo they couldn't figure out the new intel chips are a no go for laptops when they had the 8750H in there? nope took another 2 revisions with new intel chips to realize how retarded of an idea that was. fkn lenovo.   \n\n\ni shouldnt complain though, could be much worse. it took them close to a year to fix a software issue with the hotkeys.",
  "I honestly had never had experience with high end machines too, so you're saying I could get past the supposedly bad panel for gaming and watching movies? is it as dim as they say?",
  "Aight, thanks :)",
  "Is the RAM upgradable? Say for 16GB? Also the unit I'm buying has 512SSD, do you think that's enough for a college student? I'm not that informed when it comes to computer hardware sorry about that. I don't really play intensive games too but I think Overwatch is one that I play. I'm just concerned for programs like Adobe applications etc. and some games. We're on online classes too so I'm hoping if this is also a good laptop for work things yoo. Thank you!",
  "Sounds really good. Now i'm used to large 17.3\" laptops with numpad, so the keyboard probably won't be a problem for me. I think i'm gonna buy it. Thanks for the quick response!",
  "Fair enough :)",
  "Oh ok I don't need to bring it around. So I guess I will just go for a PC. Thanks, u/eatenlow",
  "I think you are also one of the first outside of China lol",
  "Hopefully mine will be be shipped as fast as yours, i ordered mine 2 days ago.  Was there an indication when they will ship the xbox one s that they are giving away with this purchase?",
  "Truly appreciate it, but my question was kinda pointing at the machine, why that. As I've been looking to replace my almost 5 year old hp laptop, I've been out of date with what's new and what's worth it given a vast price range. So I was asking why this one, what made you pull the trigger and what's different about it that caught your eye.",
  "Great to hear... I'm welling to buy legion 5 15ith6h",
  "Yeah! What's the ambient?",
  "An extremely underrated comment xD",
  "lol",
  "No idea man, the sRGB percentages were the specs given on the lenovo website while I was customizing the laptop specs, but the 100% sRGB option did require additional $10 top up though",
  "Well it wasnt available on my country's website so, lucky you I guess",
  "I mean it is just a laptop at the end of the day, plus I'm sure in a few months there will be new stuff which will put mine to shame, tech moves way too fast",
  "it really is... if you don't like RGB or playing games on the go...",
  "The surface is plastic, but the inner side with the keyboard, the surface of the plastic has this slight softer, rubber ish feel to it. Id say it makes typing abit more comfortable. But as for long lasting, it seems it will last a good few years, but not if you spill liquids on it",
  "No need to feel too down, take a look at the ideapad flex 5, with the ryzen 7 4700u, the vega 7 integrated gpu isn't really all that bad, it can run GTA V smoothly albeit not at max settings",
  "Shipping was given free by lenovo, my full specs are, ryzen 7 4800h, gtx 1650, 16gb 3200mhz ddr4 ram, 256 m.2 nvme ssd, 1tb 7200rpm hdd, screen is 250 nits, 1080p, 120hz",
  "Yeah, but in my opinion, for gain of just 10fps that too when you are above 60fps it is not value enough for me to leave 20% better CPU performance with AMD.",
  "https://youtu.be/9JgefLqzfsk\n\n\nThe above is a chinese review of the same laptop but with a ryzen 5 instead, only thing is that the laptop is sold under a different name in China, skip to around 10 minutes, it shows the reviewer opening up the laptop to reveal the ram",
  "Gaming isnt what will reduce the lifespan of the machine, rather its your gaming expectations which will. Because ultimately this laptop's maximum GPU at the moment, is a GTX 1650TI, a card which isnt even seen as a high end, or top of the line card by today's standards. As time goes on, games will only get more and more demanding to run as games are all pushing towards or even past 4k 60fps. So if you are someone who wants to play games on the highest graphics settings at all times, then in a pretty short time, you will find that the laptop is no longer powerful enough for your gaming needs. Hence shortening the lifespan",
  "It's just alot of people always tell me, laptops are a waste of money, and that desktops can give way better performance etc but as a student I just need the portability. As for it being overpriced, while true to a extent, I believe spending more now means I wont have to worry about my components becoming hopelessly outdated for quite a few years, especially when I've now got the ryzen 7 4800h. Basically I see it as spend more now so I have to upgrade even less frequently",
  "Right results are in, so from 100% at 60% brightness the laptop lasts 2 hours and 41 minutes. This is running YouTube, Microsoft word and discord at the same time, I even had my webcam turned on for an hour, so without that itll probably last just about 3 hours",
  "sure! :)",
  "Highest measured interrupt to process latency (µs):   387.20\n\nAverage measured interrupt to process latency (µs):   5.369768\n\n&#x200B;\n\nHighest measured interrupt to DPC latency (µs):       382.0\n\nAverage measured interrupt to DPC latency (µs):       1.832043\n\n&#x200B;\n\nsorry for late reply, i just got around to running the test",
  "I'm not sure about exact percent but for my order it was probably just below $200 off, I think around $180+ so probably around 10% off",
  "Personally, I feel that if you're not looking at getting the GTX 1660ti, the legion 5 is the way to go, the ryzen processor is just more powerful and consumes less power so your battery lasts longer too. As for intel 9th and 10th gen, benchmarks have shown that the difference is negligible, they basically are reselling you the same processor with a new sticker and name. Plus if you only want a 512gb ssd, you can get a free battery upgrade for the legion 5 to 80wh from 60wh\n\nI'm a IT student by the way, and I mostly run VMs and programming too, and so far, I've run 4 VMs at the same time, from kali linux to windows 10, and I can switch from one VM to another, with no lag at all, no slowdown noticed",
  "Yep, it has 2 m.2 ssd slots, if you dont want the hdd you then have the space to install 2 ssd instead",
  "RGB on keyboard i meant. did they get rid of that?",
  "Average CPU temps while playing gta online with max settings is 65C, but that's with the laptop propped up to improve air intake, so without that might be around 5C higher",
  "It's only bad for if you ever find yourself using it outdoors and it is sunny, because the screen isnt bright enough for that. But otherwise in a well lit room, 50-60% is all I need to see clearly",
  "Btw you can choose to add on if you want rgb back lighting for the keyboard, otherwise the default is just a plain white backlight",
  "The ram is upgradeable, it has 2 ram slots so you can just buy your own extra 8gb stick in the future if down the line you find 8gb to be too little. As for the storage, my opinion is that always have at least 1tb, so you got sufficient space for any games and that your storage will definitely last you a few years before you need to worry about cleaning up your files. But the legion 5 15 comes with 2 m.2 nvme slots, so once your 512 gb stick is full, you can buy another one, install it and boom more storage space. And if you're running things like photoshop and premiere pro, I'd recommend 16gb ram, especially now with online classes you probably have another video calling app open at the same time which will take up ram. As for if it's a good laptop for work? Absolutely, I'm using for my school work, no issues at all, only that it's on the heavier side. But id rather it be a little heavier than it catch on fire when I play games",
  "Fun fact, my laptop shipped out on 28th may and the sticker says manufactured date is 27th may, so you could say my laptop came super fresh",
  "I dont think I qualify because they only put up the banner on the website mentioning the free xbox was after I ordered mine so",
  "What got me was mainly the ryzen 7 4800h processor, I was actually intending to buy the Lenovo L340 gaming instead initially until this appeared on the lenovo store, the 8 cores the ryzen 7 4800h has allows me to do a lot of multi tasking work smoothly. Plus it comes with a gtx 1650 which would allow me to play the few games that interest me and also allow me to continue playing games quite a few years down the line even as games get more demanding, as I dont have high expectations or requirements for graphics. Finally was the price, in my country, this legion 5 15 cost the same as the L340 gaming when both are customized to equivalent specs, and the fact the ryzen 7 4800h has 8 cores vs the 6 cores in the i7 9750h, and can support faster ram, 3200mhz vs 2666mhz, and also sports the latest intel wifi 6 card which allows for maximum wifi speeds, something the L340 gaming didnt have. \n\n\nOf course this does beg the question of why didnt I look at say ASUS who also had laptops carrying the new ryzen 4000 series processors, that's because the ASUS TUF series firstly has cooling issues, and according to the asus rep in my country, isn't gonna be in stock for the foreseeable future. Plus other companies like Dell with the new xps laptops, sell at a very steep mark up in my country, therefore making it no longer value for money.\n\nSo in conclusion, I bought it because based on everything available I felt it gave me the best performance per dollar, and was within my budget",
  "If op is from Malaysia, it must be around 25-30 room temp (celcius)",
  "Lmao",
  "Ok",
  "I know, but compared to my aging Acer E5-475G, that thing is a daydream and it'll be a while for me to afford something like that",
  "Ngl man that's pretty expensive for the specs, paid just as much as I did for the A15. I bought an Asus and I'm allowed to mod it to solve heating issues but I can still return it. Wdyt?",
  "I mean for the money yes 100%. Just that everybody seems to think Intel is getting it's ass handed to it. Indeed it is, but it's able to compete with AMD for a reason.",
  "Awesome \nThank you\nWhat are your thoughts on durability etc and using it for business. Do it look professional.",
  "Okay that makes a lot of sense. Thanks for explaining and also for taking the time for this thread. Definitely helps buying decisions.",
  "As for the brand.How do you compare lenovo to let's say Asus?and what do you think about the slim versions zenpads etc.I'm more into multimedia,working on stuff etc.",
  "Nice! Pretty good considering the specs!",
  "Hey, no worries! Thank you so much for the efford! Unfortunately I am not to sure what to make out of the result. Did you leave it running for 10-15 minutes? I Found a post of someone else on Reddit who checked his Legion 5 with latency moon (unfurtunatly with rather bad audio results). I leave you a link to the screenshots of the test he did:\n\nhttps://onedrive.live.com/?authkey=%21APyCACszmM3KlG8&cid=620A128F8C369EA2&id=620A128F8C369EA2%215333&parId=620A128F8C369EA2%21103&o=OneUp\n\nDid yours look anyhting like this? For the sake of comparation I also attach the link to a screenshot a user did on his Rog Zephyrus G14 (with proved to be good for audio rendering). \n\nhttps://imgur.com/a/J042sd9\n\nYou can see that latency moon provides a text eather highlighted in red or green stating if the system is capable of handling real-time audio. Would you mind run another test and screenshot the results? Would be much appreciated. It is a critical bench for audio production and almost no reviews run it.",
  "Damn",
  "hold up i'm in sg too thinking of buying this, the student discount only takes off $85 on a 1699sgd config. the code has 10 in it so i thought it would take off 10% as well but they doesn't seem to be the case?¿ did you do anything special or should i just email lenovo?",
  "Damn that's nice! If I can get the battery upgrade version in india it will be a instant click I don't need that much amount of memory anyway. Txt files brr. \n\nAnd thanks bro I've to run Kali & other VMS as well. \n\nAs for the i7 (9 & 10) yes that's stupid really. \nGuess will wait for the legion 5 to come to India. \n\nJust 3 last questions:- \n1. Does the 5 come with 1650-4gb only?\n2. Does the default one is 80wh or you have to upgrade on the website? \n3.The base model refresh rate..?\n\nOne video showed that legion 5 has less pipes and more free space in the back as compared to y540 does it affect thermals?\n\nhttps://www.amazon.in/Lenovo-82B5001YUS-Legion-5-Y550-15ARH/dp/B0862Y2C9K\n\n(One which will be available in india)",
  "You have a choice, they had a 4 zone rgb backlit keyboard or a plain white backlit one",
  "Does elevating the laptop improve temps? I just want to play Valorant & Apex Legends without throttling.",
  "Cool that you never get past 60 indoors! Thanks for this thread, really helps with decisions. Bless you man",
  "Nah, my country's Lenovo store doesn't allow customizing, what you see is what you get. Which is slightly disappointing, but hey you get the new\n Ryzen 4000 series  ¯\\_(ツ)_/¯",
  "Okay thanks I'm more confident in buying it. It really has a business vibe to it yet it can be for gaming too. I'll probably upgrade the RAM and the storage in the future. Thank you!",
  "Cool, I want to buy the same model when I get back to China but don't know how long until that happens.. :(",
  "Good choice man. The similarly spec'd tuf a15 is a design disaster.",
  "Lenovo better have a job lined up for you for all the publicity you've given out. Cuz you bet I'll be looking into buying something off their lineup. Greatly appreciate the explanation, hope it lives up to it's hype.",
  "I just placed my order for the legion 5 AMD 4600H version  :). I feel like we had the exact same process regarding choosing this over the L340. plus this one has 2 ram slots, where as the L340 and the newer Lenovo 3i series have only one ram slot (which is really stupid because those laptops are doing everything else right).\n\nI was able to get a Father’s Day deal and combined it with a student discount. Basically worked out to ~15% off from Lenovo.com (Canada).\n\nCan’t wait to test it out!",
  "Pretty good then",
  "[deleted]",
  "Problem is that I emailed asus asking about the A15 and the zephyrus G14, but the rep said that neither will be in stock in my country for the foreseeable future, plus in my country, computers in general are sold at marked up prices compared to in the usa so paying the price I did is actually considered a massive steal in my country",
  "What kind of modifications were you talking about?",
  "Yes, they are trying to compete ,that's why they are still better in single core performance.",
  "It feels sturdy and robust, but it is on the heavy side too. As for using it for business, definitely possible, it is much more subtle and quiet looking from the outside compared to the likes of asus where its flooded with flashing lights and RGB. All it has is a iridescent Legion logo and that's it, other than that just pure black",
  "Personally I just dont like asus, because every time I go to a tech fair, asus always charges more than lenovo for similarly spec laptops, if you're interested in a slim laptop, you can take a look at the lenovo ideapad 5 AMD version, it sports the new AMD 4000 series processors, but a low power version so you get much better battery life, but it is capable of boosting its speed when under load so no need to worry about lack of performance, and it is relatively cheap, only thing is it doesnt have any dedicated GPU",
  "Which listing did you click on in the lenovo store, theres the regular legion 5 15 and a legion 5 15 build it yourself or sth like that, choose the regular one, for some reason the listing which is meant for complete customization gives me a higher price for my exact same configuration",
  "The legion 5 at the moment only has up to a GTX 1650ti, but Lenovo said that they will have up to RTX 2060 coming later in the year\n\nThe default is 60wh, you must make sure to choose that you do not want a HDD, the legion 5 has 2 drives, so choose your 512 gb SSD, then choose no hard drive for the second and the battery will automatically change to a 80wh battery\n\nDont let the pipes fool you, the thermals for the legion 5 is amazing, I've run jedi fallen order on it on epic settings, and the cpu never exceeded 80C and GPU never exceeded 68C, but that is with the laptop propped up off the table which does improve the airflow to the intake vents",
  "Generally yes, propping up the laptop will improve temps slightly. That's because most laptops' rubber feel simply dont lift the laptop high enough to allow good airflow through the intake vent at the bottom. So usually the restricted intake does have an effect on high temps",
  "Nice, how much was the total cost after the discount?\nI was actually about to just have the ryzen 5 4600h but after applying the student discount, suddenly now my budget could allow for the cpu upgrade so I went for it",
  "why you got it?",
  "Same. I bought from a reseller of Asus because the price from official here is so insane lmao. Hope you enjoy your new laptop!",
  "Hi, don't get the A15. Capacitor fried itself after a few days in service..I returned it and bought a Lenovo Y540.",
  "Fantastic !\nI want it to last me for at least 5 years without worrying about anything. \nAlso it takes more than 5 weeks to arrive - that's like an eternity in the computer business.",
  "Thanks.I had a friend who worked for Lenovo,they are pretty solid.And probably the cheapest",
  "only the build it yourself option shows up for me. talking to the service rep, he said they're only offering a 5% student discount on that product at this time. \n\ni ended up getting a sgd1709 config (after -90 for student) because they're also running a free xbox one s offer if you spend >1500 on legion? random ass offer but i figure i can recoup some cash by selling that thing.\n\nanyway thanks for the info, this thread helped me make my purchase decision!",
  "Thanks. \n\nI checked again unfortunately the only legion 5 that will be available in india is non upgradable with 60wh battery fixed I can add a HDD though. \n\nSo now it's the same almost just that it will be amd (which is great!) And y540 was Intel. \n\nAlso no option to upgrade screen as well so the same 60hz -250 nits display which should be good.",
  "Will something like [this](https://i.imgur.com/zvKmAiv.jpg) do the trick? I don't like to use cooling pads, I feel they are a rip off.",
  "Thanks. I wasn't planning to. I hate a design that deliberately bottlenecks the performance. It's fraudulent.",
  "I was lucky enough to receive mine after just 10 days",
  "Yeah the xbox is probably not happening, the thing has been going on since late may, and it said only first 60 orders",
  "Yep of course",
  "Ikr. Also Asus apparently put a voltage limit that caps the Ryzen at 20W. Not worth it at all.",
  "Awesome !\nI would love to order it now and get in 10 days and be done with my constant pursuit,frankly I am getting tired of waiting.",
  "oh fr? the guy i spoke to said there were still 7 left in stock for this month. if i don't get it i'll probably send the laptop back because that's a shady ass business scheme.",
  "Legion 5, even with the lower end GPU, is the best choice for me, primarily because I will be using it in an office environment. I need a good screen and good CPU+cooling.",
  "My Portable Game station setup Lenovo Legion Pro 7 Razer blade 18 ",
  "This man is hitting three cartridges while gaming on two laptops",
  "Why two laptops?",
  "How do you like the Legion's OLED screen? I'm kinda hesitant to get one because of the reflections.",
  "looks good!",
  "Yezzir 🤟🏽",
  "Kinda out of the blue but has your Zephyrus been reliable and performed well with no issues ? Im asking a lot of Zephyrus owners to get a better picture with so with so many horror stories such as liquid metal leakages, coil whine etc Im trying to find the good in all the negativity since I need a portable MacBook like device but with gaming capabilities so has it been reliable and easy reformer well ? ",
  "lol why not",
  "its a 10/10 G colors just pop! HDR and 1000 true black is so satisfying to see",
  "sorry my guy thats a different brand i dont own a asus grand laptop, but the legion pro not to expensive as the other brands and performance and thermals are great for longevity",
  "No coil whine and I don't believe this one has liquid metal, so no leakage issues there. Overall, it's been great. The build quality is pretty solid, but it's not as good as the MacBook or the Razer Blade I had. However, Razer got rid of the glass on their displays, which has led to them feeling lower quality to me, and lesser in comparison to the Macs that still use glass. The bottom panel is a cheap plastic one which again, feels lesser in quality vs those other two, but it's not something I notice in my regular usage because it's either docked or on a desk and then going in and out of a bag. \n\nIt has a minor issue on the trackpad, but it's still very usable, just annoying. Since I rarely use the trackpad and use external M&K when at home, or a mouse and the built-in keyboard while traveling, it's not a big deal. \n\nPerformance-wise, I'm still able to max out all of my games on absolutely Ultra settings including Path Tracing on Cyberpunk 2077 and Alan Wake 2 with good frame rates on my external 34\" Ultrawide. When playing on the 2560x1600 internal display, performance is obviously even better. \n\nI bought this because I needed the absolute most power possible in the lightest, most portable package possible. I traveled for work weekly for the past few years, and I travel regularly, so having this has been a godsend. I remember playing Warzone in LaGuardia at one of the bars when my flight got delayed and blowing off steam was great. I took this to QuakeCon for 3 years now, and the ability to pack more power than my desktop into something that fits in my backpack is amazing.  \n\nComing from a Mac, probably your biggest hurdle is going to be battery life, but the latest CPUs are supposedly much better in that regard (though we hear that every generation so YMMV).",
  "ever considered add a monitor with a bigger screen?",
  "Cost, managing files and games between two computers, weight for transporting them, etc. etc. etc.",
  "I have an OLED TV so I know how great OLED looks. My question is more about how reflective the display is, because no matter how good it looks, it doesn't matter if you can't see shit because you're staring at a mirror.",
  "Why do u call it true black or whatever? the pixels are literally off..",
  "I was replying to the other guy who has a Zephyrus not you but thanks for the reply! ",
  "i got asus oled dual mode 4k.240hz 1080.440 hz back home its fire thinking bought shipping it to where im at now",
  "i travel for work all over the place can u imagine shipping a expensive desktop on the plane having people toss around yo setup like its a bag of candy or just shipping a pc state to state lol so i put my laptops in my backpack hop on a plane an call it a day.",
  "5k for the razer 2.7k for legion, weight probley 9pounds with chargers and got 3tb in legion 2tb in razer",
  "well i wear transition lenses so i dont have those problems but no crZy glare i see",
  ">i travel for work all over the place \n\nGreat. So do I. I also travel frequently around the US and internationally for pleasure. I took my laptop to Europe for 5 weeks earlier this year, to QuakeCon in August. I took my Razer Blade around the world for 9 months. \n\nThat doesn't clarify the two laptops angle. \n\n>can u imagine shipping a expensive desktop on the plane\n\nHaving shipped my desktop for a family member, yes. Again, what's the point of this? It has literally no relevance to the question on why you want *two* laptops. \n\n>so i put my laptops in my backpack\n\nI'm going to give you the benefit of the doubt and assume English isn't your first language and there's a language barrier here. ***Nobody*** is asking why traveling with a laptop is easier than a desktop. The question is why you have *two* high performance laptops instead of *one* high performance laptop and maybe a good external screen.",
  "bro i got multiple cars multiple vapes multiple everything what else u want to hear 😂 thats just me i guess",
  "I get having multiple laptops, I have 3 that I use regularly but more then one gaming laptop seems a bit unnecessary.  I like having non-gaming laptops because they are really cheap and durable so I don't have to worry.  But I guess if money isn't an issue I can see it.",
  "Sudden weird bubble on the laptop frame any idea how? Should I be worried (Lenovo Legion 5 2021) It was just there no idea how",
  "Did you take apart the laptop at all?\n\nI'm guessing it's from a too-long screw reinstalled into the bottom.",
  "[deleted]",
  "Screw",
  "Yes, I was a Dell tech for 5 1/2 years, and yes, that screw was too long and is poking its way up through the palmrest\n\nDamage is done.",
  "Definitely over tightened screw, recently had a Lenovo legion come in for repair, with exactly the same lump.",
  "Wrong screw (too long). This happened to my laptop after I changed the RAM.",
  "LSD (Long Screw Damage)",
  "Definitely too long of a screw put in on the reverse side.",
  "long screw in a short hole. sigh",
  "Don't worry. Your laptop is going through puberty.",
  "It comes with the new bios update, helping to leave a distance to keyboard and screen",
  "Looks like your laptop hit puberty and just got its first acne. Take it to a dermatologist.",
  "semen, clean your laptop after youre done with your kinky stuff",
  "Most likely a long screw in a short hole.  If this legion is like my legion 5 there are supposed to be small screws running along the front bottom.\n\nAnother question I have is if OP were to remove all the screws and make sure only small ones are in the holes along the front could you just push this bubble back down and be fine or is this permanent damage?",
  "I did the same for my legion 5 looool. I opened it, saw it, knew right away lol",
  "Just a loo long of a screw put there at one point. Won't do anything. Purely cosmetic.",
  "Level 1 technician replace the screw in a wrong location. #wrongsize",
  "This happened to me exactly there but i put a too long screw",
  "Long screw in a short hole😂",
  "It's the screw poking through, someone put it in the wrong place.\n\nI did this with my old ASUS laptop, it's the kind of mistake you only make one time, I'm super careful to separate the screws now when I take it apart so I know which goes where when I put them back.",
  "Too long screw in the wrong hole, why do they make the screws different lengths anyways and why don’t they just make it metal?",
  "pimple",
  "As mentioned in other comments, the \"\"technician\"\" put the wrong screws in the wrong holes. He damaged the case, basically.",
  "You should be worried. Your laptop just hit puberty. It will probably start acting up and turn into a drama queen soon, so be prepared.",
  "Just a pimple your laptop is getting older no worries",
  "I think it’s aroused 😳",
  "It’s going through puberty",
  "Has it ever been disassembled? If so you or whoever took it apart put the wrong screw in that location on the underside and it's pushing out.",
  "Just bang another sticker over the top of it",
  "did this on my own laptop but accident. turns out one if the screws is ever so slightly longer. would call the repair place and ask for compensation for a new panel",
  "If it was an ASUS they would void the warranty, rich because they are the ones who usually do that to units we send for warranty.",
  "Relax guys it's just a pimple. It'll go away in a day or two.",
  "Yeah I recognize those are",
  "I believe you have opened the case of your laptop then you've misplaced a screw that's longer for that place.",
  "I didn't but the battery was replaced maybe the technician",
  "This is an over tighten screw, I seen it a bunch.",
  "Repair technician here.  This is the correct answer.  They put a shorter screw under the trackpad, whoever worked on this mixed the screws up.  Easy fix.",
  "Ha I did this. I wasn't paying attention and didn't realize all 3 track pad screws were different sizes. Let's just say I now have 2 dot friends above my track pad.",
  "[deleted]",
  "Doesn't even need that.  Plastic can be pressed back into place after the screw is swapped.  Purely cosmetic.",
  "It was lenovo's on site warranty guy also contacted them regarding this",
  "Remove the screw aand replace it with the shorter one the tech was suppose dto have used, then you can take a Bic lighter and heat the spot up and press it down once the plastice is pliable, should only take a few sconds of flame to heat it up enough, then use the sloped side of the lighter to pres the plastic down. It won't be perfect but it's an easy fix.",
  "That's my guess aswell.",
  "Only form of LSD i don't like",
  "🤨",
  "1) weird comment\n\n2) in what world is jacking off considered kinky??",
  "I have tried that on a few devices, I would say it's permanent because the laptop is white. On a darker colored one, you could carefully heat it up until you can push it back, but white plastic is likely to be marked by the heat",
  "There you go.",
  "Ah yup they put a screw that was too long in the wrong place. I would take it back to the person who did the battery repair.",
  "That tech had to be a noob. Remove the screw, find the short one at either the midway or back side, and swap them, then roll over the spot with the round part of a spoon and some force, and you can usually get it very nearly back to normal.",
  "[removed]",
  "Euhh no!",
  "[deleted]",
  "Or you can just simply pretend that it isn't there,don't you?",
  "When it’s on a laptop",
  "Not necessarily. Did a Lenovo the other day and it turned out the plastic on the bottom cover had broken for two screws, so they went in further than they should have and formed similar bubbles. Not sure why the plastic broke in that particular manner, didn’t even notice it was gone until it happened. Poor molding, maybe?",
  "This is 100% what happened. I've seen it done before on many a HP computer.",
  "It was lenovos very own on site technician so will need to contact them",
  "It could be worse. I handed a laptop off to another tech after finishing diagnostics for battery replacement. When I walked by they ended up cracking hinges on both sides.",
  "So close yet so far. It looks like he was confused and combined it",
  "Classic redditor",
  "You know your mum doesnt love you?",
  "I brought this laptop while I lived in a city now my job forces me work in a very rural area am happy I got my battery fixed honestly this toh is minor aesthetic damage will live with it :)",
  "Portablegamingdevicesexual or PGDsexual for short",
  "Poor everything. It's a Lenovo.",
  "Was it at least one of those cheap grey plastic HPs? lmao I hate that.",
  "Or, English isn’t their first language?",
  "Yea but the redditors have to correct them and make fun of them , so they can feel better",
  "After my 7yo Asus laptop borked on me, I finally got a new boy last night! Lenovo Legion 5 (AMD) ",
  "How much did this cost?",
  "Before you ask about the config I have, here it is, and no it's not customized online because my mom has trust issues when it comes to buying laptops online. My brother-in-law bought this for me because he knows that I wanted a new laptop for like 5 years... I originally wanted a Ryzen 5 4600H version but too bad no stock for it so I ended up with Ryzen 7 4800H variant instead.\n\n&#x200B;\n\nSpecs of this laptop (only top model sold locally in Malaysia):\n\nCPU: AMD Ryzen 7 4800H @ 2.90 GHz (8C/16T)\n\nGPU: Integrated AMD Radeon graphics + discrete NVIDIA GeForce GTX 1650\n\nRAM: 8GB of DDR4-3200\n\nStorage: 512GB M.2 NVMe SSD\n\nDisplay: 15.6 inch FHD 1080p IPS with 120Hz refresh rate and 45% NTSC (250 nits)\n\nBattery: 60Wh\n\nPrice: RM3999 (approximately \\~USD$960, \\~SGD$1312, INR14.05M, \\~₹71362,)",
  "Nice wallpaper",
  "Imagine holding a presentszion and then accidently getting onto ur desktop and the whole class seed that background lmao",
  "i didn't know your laptop was a dog🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔",
  "hey my brother just got that one!",
  "You know, that company has lost all creditibilty when a few years ago they had installed rootkits (trojans) with their default Windows installation.\n\nI would never buy a Lenovo laptop for this reason.\n\nThey had a good reputation and they chose to ruin it to steal data from your laptop and use your laptop for whatever unknown purposes.\n\nLenovo is not a trustworthy company since that incident.",
  "Based on the pricing i assume you’re a malaysian too! How long did it take for it to arrive? And is it custom built. ;-; been dreading to get one due to the 6-8 weeks of delivery",
  "You can turn that watermark in the bottom left corner off if you want",
  "Just got this same one probably around the same price. Good laptop. Second Lenovo laptop since the first one is still holding up nicely",
  "Amd hype! So much for the money.",
  "Hello a fellow Xiaomi user! (Checked the watermark lol)\nAlso nice laptop",
  "Hey I have the same laptop! I love your wallpaper too 😊",
  "Aaaaand there it is, Microsoft Edge, the pesky damn thing!",
  "Planning to get this boi",
  "Is it better than hp omen 15?",
  "[removed]",
  "I'm looking at  the pic of your Legion 5 on my Legion 5",
  "Your wallpaper please!!",
  "I've retired my PC into this laptop, and really surprised with the advancements in the laptop world nowadays Mine is upgraded to 32GB 3200Mhz ram, and two 512 NVMEs. Damn crazy laptop this one is.",
  "Man i wish they released this in India :/",
  "I see, a cultured honkai player",
  "Hi there! What’s the battery life so far?",
  "Hey i heard that the 250 nits display isnt bright enough,  have you faced any issues with the screen brightness while using it at home?",
  "How’re the thermals? Planning to buy this exact one 😌",
  "how is it now? after about 22 days? i’m planning on getting this one",
  "the keyboard is only white, or is rgb?",
  "Kinda late but how’s the build? Any issues that you’ve seen?",
  "Anyone worried about backdoors on Lenovo laptops? I mean they're not Huawei but they're still a big company with headquarters in Beijing ...\n\nObviously OC doesn't have to worry since he/she's in China anyway (and uses a Xiaomi phone)",
  "Costs RM3999 (approximately USD$960) for a 4800H and GTX 1650 variant with 120Hz panel which is not the greatest deal since my brother-in-law bought this for me which is nice of him.",
  "How do you like the weight? Wondering if this is alright for schoolwork or if something like an Ideapad 5 is better for portability. I'm considering it for my little brother for his starting at university.",
  "Thanks! Here is the wallpaper source if you wanted it: \nhttps://www.pixiv.net/en/artworks/82467485",
  "That'll be funny af",
  "Reminds me about that time my friend decided to use a history presentation that was supposed to be about the effects of the Second World War on japan and just made it into a presentation about anime.\n\nas someone who is half Japanese, I wanted to kill him for the amount of cringe he made me feel",
  "LOL I intentionally said it",
  "Nice, hope your brother likes it as much as I did!",
  "Well, if there is a backdoor, I would nuke my OEM install and clean install Windows 10 Pro on it. But man, it can be concerning if people stored the most important data on their Lenovo laptop that still has OEM install.",
  "Well that's the config I got locally because most of the time, my mom doesn't trust buying very expensive stuff online... (and yes 1650 config is only GPU config available locally)",
  "I know but I'd leave it on for now :)",
  "Meanwhile this laptop is my third Lenovo laptop in the fleet alongside two Lenovo netbooks. The S10-3 netbook was a sentimental netbook that somehow survived the pretty big Pepsi spill...",
  "Lenovo hold up quite well. I have a Lenovo which almost decade or so older. With AMD A4 Radeon graphics 2.5 ghz and with only 2 gb ram and i still dsy trade with that. Hit me with a brick",
  "Yes, as a long time Intel Ivy Bridge user, this is definitely worth my savings for one of these.",
  "Thanks!",
  "Thanks! :D",
  "I use Firefox anyway, I manually installed Chromium based Edge cuz why not :v",
  "It's really hard for me to recommend though since both Lenovo Legion 5 and HP Omen 15 2020 are solid options, just that the Omen can go up to 1660 Ti, while Legion 5 can go up to 1650 Ti at the moment.",
  "Thanks, and yeah I have no regrets putting weeb background on my computers ;;",
  "nice :D",
  "That's...an insane upgrade! I was hoping to upgrade mine if I save up enough for them!",
  "LOL I don't even play Honkai but I just put this as a wallpaper cuz it's cool ;p",
  "Not an issue for me, since I usually use a laptop at an adequately low brightness settings anyway.",
  "Been doing some video rendering, gaming and then benchmark the crap out of it, and so far I can feel that it ran warm on the chassis itself. This laptop has a solid thermal performance despite only 3 heatpipes which should on par with Omen 15 2020.",
  "Well what can I say? It served me well, the 1650 GPU surprisingly never reached above 60 degrees when I do graphics testing like running Unigine and playing games.\nDefinitely a solid machine although AMD is quirky in terms of graphics driver, plus 1650 is weak in terms of gaming. I recommend going for 1660 Ti variant if it's available in your region.",
  "I have RGB on mine.",
  "I got like freezing issues sometimes on EUCN22WW BIOS version and after updating the EUCN28WW BIOS version, the problem went away.\nOtherwise, I have no issues with it so far. No thermal issues whatsoever during gaming and video editing, despite the one annoying issue that is fixable with BIOS update. (But yeh, i won't dare to do bios update on my main machine again)",
  "Well actually I'm Malaysian",
  "[removed]",
  "Oh cool",
  "Pretty heavy during my first impression at around 2.5 kilos, but it's enough for me to travel around.",
  "The weight of the laptop is pretty Ok. It is on the heavy side but its a gaming laptop so you should expect this.... but only downside I think is the power brick is so damn huge to lug around.",
  "Thanks!",
  "Thank you",
  "It could be worse",
  "Please tell me he didnt try to say something in japanese",
  "Ah understandable. I’m tempted due to it being cheaper online as compared to in stores.:) thank you though!",
  "Enjoy it😃it's really nice👍",
  "👍🏻👍🏻👍🏻",
  "I'll say from my experience so far I think you are going to like it",
  "RAM prices are cheap nowadays, for some workloads, having more ram is a bliss. Besides, the old rams can be sold to subsidize the upgrade :)  \nThe only minus with these ryzen laptops is the thunderbolt.  \nOtherwise, I wouldn't need to upgrade for a long time after this legion 5.",
  "Oh sorry 😬",
  "I mostly use it at home so it's a non-issue.",
  "Anytime (｡•̀ᴗ-)✧",
  "Time to change to a hentai background",
  "He said “It made anime baka” \n\nI wanted to die",
  "You're welcome! ;)",
  "U can still buy it online its estimated 6-8 weeks but most users can get it within 2-3 weeks",
  "Thank you! (｡•̀ᴗ-)✧",
  "I like it already, performs far better than my old laptop with Core i5-3210M. Going from dual-core to octa-core is way overkill for me but hope it served me well!",
  "[removed]",
  "177013",
  "Dear god...",
  "Have a lovely day",
  "Nitro 5 2020 AMD is a value champ but the aesthetics are gamery for me, however Acer Malaysia released the Intel version of Nitro 5 2020 first. Legion 5/5i however looks clean and no red accents anywhere. If you don't mind about gamery aesthetics, Nitro 5 2020 is definitely it, but if you want a gaming laptop without any red accents, Legion 5 is definitely it.",
  "Yes perfection",
  "Are you fine with the 120hz display? I read somewhere that it has only ~58% sRGB whereas the 144hz has almost 100%. There is a big difference in price in my country so I am asking if it's worth it.",
  "Yeah I am fine with 120Hz display since I don't use it under bright sunlight anyway. 144Hz panel is the recommended option for both productivity and gaming. 120Hz panel on this was fine for gaming.",
  "Yeah, the brightness is fkine indoors so I am not worried about that. My main concern is the color gamut, since it's supposed to be only ~58% sRGB. What do you think about the colors? I will use it for post-processing and photoshop among some other things like gaming so I need the colors to be good. Is the 58% good enough or should I pay extra for better colors?",
  "Good enough for gaming, not for color sensitive work.",
  "Lenovo Legion Pro 7, RTX 5090 Buy it or not!!! I am able to get Lenovo Legion Pro 7 with below specs at the price of 3.62 L. should I take this deal or not? Any other suggestion than this?? My usecase is gaming only.\nSpecs:\nMicrosoft Office Home 2024 India\n• 64 GB DDR5-6400MT/s (CSODIMM) - (2x32GB)\n• 1 TB SSD M.22280 PCle Gen5 Performance TLC\n• NVIDIA® GeForce RTX™ 5090 Laptop GPU 24G...\n• 5MP with Dual Microphone\n• 4 Cell Rechargeable Li-ion 99.9Wh",
  "You can’t ask for something better 🙂",
  "looks great if u have the money :(",
  "no there are build quality and qc issues, i bought the 5080 version",
  "Great deal but use discounts like student, credit card cashback, affiliate, coupons. Whichever you can.",
  "can you help me where can i get the affiliate discount coupons and other coupons as well",
  "Man, this is where it kills me on someone asking if he should build a pc or get a laptop\n\nIf laptops had full size pcie port (gen 5x8), it would have the best option to consider for people like you, could have get a rtx 5080 24gb gpu and a ultra 9 laptop as igpu have got enough powerful for low level tasks",
  "I have this exact spec laptop also bought India \nWorks great \nOiled gloss might be issue for some users\nPerformance is any game max\nNo regrets\n\n3dmark score is 24448 , gfx score 26120 and cpu score 17942\n\nI haven’t had issues with my build and I also use a stand initially for a month just to raise it and it was fine unless super long gaming session in like ghost of Tsushima after maybe 4-5 hours intense keyboard also gets toasty. But with cooling pad now it’s pristine .",
  "I am confused whether i should go for this one or should build a pc?? also i have seen in some videos tgp of rtx 5080 and 5090 laptop is same so should i go for rtx 5080 laptops then??",
  "so should i go for 5080 or 5090? is there any major changes in 5090 laptop over 5080??",
  "from where you bought it? and am i getting a good deal or should I buy it from elsewhere",
  "A pc will always be superior to a laptop when it comes to performance",
  "Check mobile vs desktop score. Mobile unfortunately is fake 5080/5090 due too pwr and cooling limitations 🤌🏼",
  "No the issue is with the chassis and quality control at lenovo both 5080 and 5090 come in the same chassis, i bought mine 5 days ago and i filed a ticket for replacement, lets see what they will do, but if you ask me i’d rather buy an asus rog strix its at a similar price point",
  "Bought it from Lenovo India site. Offline stores charge 20k more so I’d avoid the stores. Sites price is still about same as at launch. Maybe can get a bit more if you ask the sales team. Best discount is if someone has the Lenovo employee discount code. But if someone offers you that here they generally want some money for it. So idk if worth. Also if you do order it the shipping details date and all which they give will keep changing up and down and won’t update properly. Just save yourself a headache and assume it will come between 20- 30 days.",
  "but what are the extra charges i have to pay for it?? can it be build with same config within rs4L that is my budget",
  "You’re downgrading to a 5080 from a 5090? Is that right?",
  "The extra charge is now you have a desktop instead of a laptop. For the same amount of money, you can always get a desktop that will perform better, but you can't exactly take the desktop with you everywhere you go.",
  "the laptop comes with an option to select 5070ti or 5080 or 5090 i got mine with a 5080",
  "Lenovo legion pro 7 gen amd 16\" Hi guys, i got an offer on this laptop with ryzen 9 9955x3d with 5080 rtx along with 32gb ram and 1tb ssd oled screen for 3464CAD before tax. Is this a good deal?",
  "Hey everyone any thoughts on this deal!",
  "Its atleast 20 percent to expensive.",
  "But the laptops with these specs are going over 4500$ ",
  "https://www.bestbuy.com/product/msi-18-gaming-laptop-3840-x-2400--amd-ryzen-9-9955hx3d-with-64gb-memory-geforce-rtx-5080-2-tb-ssd-core-black-black/J3P7TXR2LR",
  "This one is more expensive but it has double the ram and double the storage and is a bigger screen. What is the refresh rate on the laptop your interested in?",
  "Brother that's USD price if i convert it in CAD its 4600 before tax",
  "The laptops you suggested are beasts but they are all in USD if i try to buy them in Canda they are over 4500 which is way beyond my budget ",
  "Because of tariffs?",
  "https://www.bestbuy.ca/en-ca/product/hp-omen-16-max-16-gaming-laptop-shadow-black-intel-core-ultra-9-275hx-64gb-ram-2tb-ssd-geforce-rtx-5090/19195151\n\n\nThis is the omen one that you provide the link for 😂",
  "No brother tariffs are not the problem, it's the exchange rate , sales tax and import costs.",
  "My Lenovo Legion 5 15 has arrived! :D ",
  "Have fun, I'm typing from mine right now! I \"needed one for work\" because they don't let us have administrator access on our office PCs.",
  "Off topic but is your thumb OK? lol  \nCongrats btw",
  "Nice .🎉🎉",
  " thank you for the unboxing experience, enriched my evening \\^\\_\\^",
  "Specs?",
  "Congrats! It looks sleek as hell dude.",
  "How's the display?",
  "Can you disable optimus with that?",
  "Does it have Type-C charging and camera shutter doohickey?",
  "[deleted]",
  "Congrats mister",
  "How long did it take to arrive? I'm about to order a 5 pro but the website says 2+ months to deliver. Currently considering the options",
  "I just ordered this same one, arrives Wednesday. What do you think of yours now that you've had it a couple weeks?",
  "Why does it have a Raedon Sticker ( in the fourth Image ). I thought the specks said an RTX 3050Ti.",
  "Nice, does it have a metal chassis? It's beautiful.",
  "what that thumb do tho?",
  "Loved your thumbs up. It just shows how genuinely happy you are! Congrats man!",
  "Probably going to buy one of these later in the summer for \"work\"",
  "Watching other people succeed in life sure make my day better, even though I cant afford something but just get to see other people buy the thing that i need it enough. By the way sick laptop. I'm proud for you",
  "good for you",
  "Nice! What's the backlight bleed like? My Legion 5 has a bit of bleed mainly near the right hinge. Also does it always run with the fans on even on idle? Mine does even on the quiet power mode. I haven't found a way to adjust the fan curve yet. Not that it's loud, can't even hear it during the day but it's still a bit bothersome when I'm just browsing the web at night. Other than that I'm pretty pleased with mine, hope you enjoy yours too!",
  "guys, that is the link for 3060 legion 5",
  "Awesome!! Is it the 3060 or 3070 variant? How are you finding it?  I am torn between this and the HP Omen 15......",
  "lmao thanks, i have a hitchhikers thumb and it just looks like that. very bendable, dunno why xD",
  "Thank you! It’s real smooth, glad I found it :>",
  "glad to hear it :)",
  "Ryzen 7 5800h, rtx 3050 ti, 16GB DDR4, only 512GB SSD though. It’s a 15.6 inch. 165hz 1920x1080 display.",
  "thank you! it's real nice :>",
  "The display is 1920x1080, 165hz, and honestly real good! Screen can get pretty bright at full brightness, but as laptops work that can effect the battery life (on the go). The 165hz perfectly suits with the rtx 3050 ti, and it's really smooth. Would definitely recommend.",
  "I honestly don't know, went to the BIOS to check, I do know however that you can change from discrete graphics to dynamic graphics if that helps with anything (probably not lmao)",
  "All Legion laptops (2020 onwards) can.",
  "Yep! Two USB-C slots and a camera switch, nothing goes over the camera though it’s just disabled.",
  "In the quiet mode, I’ve heard that it lasts around 4.5 hours without gaming on battery. Depending on the game, your battery will probably last around  2.5h-2h on a charge. Played a bit of Valorant last night after using the laptop to download some stuff on the laptop and got a solid hour and a half. Browsing with Opera GX on battery saver mode definitely saved a lot of the battery. Wouldn’t recommend Google Chrome though, anything you can do on Google chrome can be done on Opera :)",
  "thank you :>",
  "I personally ordered mine from amazon and it took a little less than a week. However, it is newer and more in stock than the pros I’d imagine.",
  "I'm in the same boat,  I asked a representative when they'll hit store shelves and they said they didn't have that info.  Also,  the website said 2+ months,  but the rep said 3+, not sure what to do,  I'm really liking the 16\" display.",
  "Performance is great, the only con for me is the battery life. With watching movies or shows, you can maybe get 4ish hours of watch time and with games I typically see 1-2 hours of gameplay before the battery gets low. Great laptop as long as it can be powered while playing. I really love the RTX, my desktop has an rx 580 and that is nothing in comparison to this. Overall, a great laptop!",
  "Radeon is integrated graphics. The 3050 Ti is dedicated.",
  "There are two graphics cards in it, the radeon is integrated and the rtx is dedicated.",
  "I think it's just plastic, but it doesn't get hot luckily. It is a real beautiful laptop nonetheless.",
  "yeah it just says “Minimalist Chassis” on the page, so probably either plastic or aluminum or something. I actually almost got my hands on the ROG zephyrus G14 but it sold out, and i’m glad it did because now i got this one :)",
  ";) have fun!",
  "That's beautiful bro, look up Neville Goddard and LOA. Use your imagination to change your reality. Trust!",
  "Yeah, my Legion has a little bit of bleed but nothing too noticeable, really only when you’re on a full black screen you see it. Also the fans are real quiet on this one on idle. This is my first gaming laptop so i don’t know much about them so unfortunately i can’t really help with the fans, but i wish you luck. Thank you! :D",
  "It’s a 3050ti actually with a ryzen 7 5800H, you can find the link here: https://www.amazon.com/dp/B08YKG5K7F/ref=cm_sw_r_cp_api_glt_fabc_6SBVTC9P3HNFBCQBSEYR?_encoding=UTF8&psc=1",
  ">very bendable, dunno why xD\n\npro gamer ~~move~~ thumb",
  "oh yeah and $1050",
  "🤌🏽",
  "How is the color gamut and brightness?",
  "The option to turn on/off hybrid mode appears when you open the Legion Vantage software?",
  "I thought the base models cannot do that, that is a new information to me. Thanks!",
  "Is type c charging available?",
  "That's good. I have the ROG zephyrus g14 but I actually like the aesthetics of this laptop more, if it were cheaper and aluminum I would've went with that.",
  "And you have a camera haha",
  "Question though, is it heavy?  How's the battery life when browsing the internet and doing basic things.  My current Acer 17 inch laptop that just died is slightly over 6LB and gets 4-5 hours of battery life.",
  "oh wow can i have a link from where you bought it with that model?",
  "I GET AN I5 WITHOUT GRAPHICS CARD IN 1100$ Sad noises intensifes.",
  "wow that's a great price, in South Africa, laptops with rtx 2060s are around 2000$ usd when the conversion is done",
  "Sheesh not bad for 3050ti",
  "Man you guys are lucky .. in india if they launch such a product that will be more than 1300 USD easily and also very difficult to get hands on... Enjoy 🤠",
  "Wait only 1050 dollar? Not expensive at all",
  "Pretty good deal for those specs.",
  "🤌indeed (oh yeah 165hz lmao)",
  "the color is great imo, brightness is also good but you can’t have it really bright on battery or it’ll die pretty quickly.",
  "yeah it’s available :)",
  "It is available, there are two type c ports on this laptop.",
  "It is pretty heavy, 5.28lbs, and like your previous laptop, with Opera GX (the better google chrome) battery saver, you’ll get around 4.5 hours of battery life.",
  "Sure! You can check Lenovo Legion 5 15 Gaming https://www.amazon.com/dp/B08YKG5K7F/ref=cm_sw_r_cp_api_glt_fabc_B2CT7MXAYJ0P8F83Q2EP?_encoding=UTF8&psc=1, that’s where I bought it. I can show more pictures of it if needed :)",
  "Everybody pay your respects here: F",
  "we cry together",
  "That’s exactly why i got it, saw a deal and couldn’t miss it. Also works well with the ryzen 7 5800h :)",
  "yeah i can only imagine, the population is so dense there that you can’t get a hold on anything. good luck with trying to find a good laptop for a good price, good sir o7",
  "that’s what i thought! :)",
  "I see Irish people",
  "Ohhh... I might buy one now.",
  "sweet!!",
  "ah mate don't think you should use that browser",
  "[deleted]",
  "I paid more for my 1650ti L5 lol",
  "The problem is not with the population my frnd .. if a company launched its products properly in India as in the whole world it will get the maximum profits due to the population .. idk y the companies have to sell their products at higher price here and ruin there product .. even iphones have literally double the price ... 1000 USD to 2000 USD",
  "irish and italian woo🤌🤌🤌",
  "is there something i’m missing here lmao",
  "I use regular opera that has a battery saver mode should I be worried?",
  "I’m not using this laptop to do music recording, however, looking at the system requirements of reaper (windows xp/vista/7/8/10 this laptop has windows 10), and the 16 GBs of RAM, I would imagine so. You just gotta plug in the microphone to the back with a usb-2.0/3.0 or usb-c cable.",
  "aw man that sucks 😔",
  "that’s real greedy of companies to do that, and it’s real messed up y’all can’t get that stuff. and doubling the price? that’s kinda extreme if i do say so myself. i’m sorry about that man, and again, good luck on your searches.",
  "It had some privacy issues leaking data etc.",
  "well no but you should switch",
  "[deleted]",
  "i hate shipping fees",
  "Ah alright, will make sure i don’t use it for some personal stuff and will stick with chrome for that :^) thanks!",
  "This one will probably do all you need, you just definitely need a good microphone if you’re going to record music, and also this one will run games if you need to.",
  "also, if you don’t want to spend this much there are some cheaper options, if you’re not going to be playing games or streaming or any of that, i’d think looking for a laptop with 8GBs of RAM would be a better option, however if you’re editing videos and playing games as well this is definitely the right option.",
  "f those shipping fees >:(",
  "welcome :)",
  "[deleted]",
  "Lenovo IdeaPad 5 Pro 16ARH7 Upgrades I own a Lenovo IdeaPad 5 Pro 16ARH7 and I would like to upgrade it. What components am I able to safely replace and what components should I replace them with?",
  "For this model, only the SSD is upgradable. RAM is soldered.\n\nAny 2280 NVMe works here.",
  "Thanks, any info about the WIFI card or should I just leave that be?",
  "Leave it.",
  "okie dokie\n\nthanks again man",
  "My Lenovo Legion 5 Windows 11 Wi-Fi Keeps Turning Off I have a Lenovo Legion 5 with an AMD Ryzen 7 processor, and recently I’ve been experiencing a frustrating issue where my Wi-Fi keeps turning off automatically. I need help to fix this. Give one title",
  "Try reinstalling the drivers to wifi, it may help. Sometimes windows updates overwrite current drivers",
  "The most probable reason is the wifi driver. \n\nDid you reinstall windows recently or upgraded?",
  "My friend had a similar problem then the wifi setting were gone altogether. He had to reinstall windows after that",
  "I reinstalled it but didn’t work",
  "While trying to fix the problem I did reset my pc (keep files).",
  "I had the same problem after automatically updating from Win10 to Win11. When using Win 10, no issue happened. After upgrading, from time to time, the wifi turned off and needed to be reconnected.",
  "Try to google your laptop model with your problem. My friend had similar problem with Bluetooth, turns out it was a mother board related problem. If you know how, you can also try to boot live Linux, and try to use wifi there. If it will work, it should mean, it's windows related problem, and not hardware problem",
  "How do I clean this ? Legion 5 pro ",
  "Scratched my thinkbook using plastic tools.. would use lot of isopropanol/ethanol to loosen the glue and/or a heatgun I guess next next.",
  "What should I do?",
  "Do not use tools to remove it. Try with either heat or alcohol. But check first at a less visible spot if the case reacts with alcohol first.",
  "MacBook Air M4 VS Lenovo Legion 5 - longevity, mediocre gaming I’m in search for a laptop that has great longevity, hardware; mainly battery wise - with Sixth Form, and A Levels upcoming in a few years time.\n\nI don’t play Triple-A games but don’t get me wrong, I play Minecraft (with Shaders, Mods etc), Terraria, Titles available on Apple Arcade, and, Roblox alike. So I need a decently powered device to run these games at a high fps. \n\nThe only downside with the MacBook Air is that the screen is only 60-Hertz which is a bummer but its battery and lifespan excels any gaming laptop there is out there; The downside of the Legion 5, is the battery life is weak but the screen specifications mainly the Hertz are to my liking in comparison to the MacBook.",
  "If you need battery life, you can't really get a gaming laptop.",
  "👌thx",
  "Hp omen max with 5080 or Lenovo legion pro 7 with 5070ti Pretty much the same price on black Friday deals. I have no experience with gaming laptops but this is where I’ve narrowed it down. \n\nThe specs would say probably HP, I think the ram speed is a little slower on the hp but that’s it. Build quality, experience with one or both, or just opinions would be welcomed",
  "Tough one the 16 go of vram vs 12 on the legion but I would compare the cpu and screens. Do you have the details?  Not all  hp omen max come with oled screens, so that’s a plus for the legion. Plus the legion typically uses the faster ddr5-6400 ram.  I have a legion pro 5 and have been really happy and typically online reviewers prefer the legions over hp.  Is there a store you can go look at em? The touch of the keyboard or track pad might be an instant no go.",
  "Yeah I realized after posting this that the omen doesn’t have the oled screen. Got caught spec chasing and didn’t realize. Now I’m trying to decide whether to get the 5070ti legion with intel i9 or 5080 with amd 9950hdx",
  "Selling my 3 months old lenovo legion 7i pro It's legion 7i pro with i9 14th gen, 2tb ssd, 32gb ram, 4080 and 33 months of premium warranty remaining and full battery life",
  "Why Selling though, any issues?",
  "Nah I bought it, but now I think I would have been better building a desktop, because I'm mostly at my apartment and rarely take it with me",
  "Yup, got it, Performance laptops are walking desktops TBH, but nothing can beat the raw performance of those unlocked CPUs.",
  "Had to order a new back cover for my display. Can anyone tell me what this strip is for? My old backing didn't have it (Lenovo Legion 5-15arh05h) So unfortunately this has the wrong pin connector (it's 30, I need 40), but I have my old connector which just has the display connector and the camera connector. The place I bought it from on ebay is allowing me to return it, but I'm not sure I can find a replacement that actually has 40-pin, so I'm wondering....\n\nIf I remove the 30-pin and camera connectors from this and replace them with my old one, would that be ok? Because I'd have to cut off the ribbon that's circled, and I'm not sure what that would affect.",
  "I think thats for the led on the i on the logo on the cover",
  "Probably for the LEDs in the Legion logo. \n\n\nYou might have an entirely different model of a back cover.\n\n\nIf the hinge screw holes align and you can swap the camera module.... I don't see why it won't work.",
  "Is this a good deal/worth buying for 81-82K?Lenovo IdeaPad Pro 5 (Core Ultra 5 225H, 24GB RAM Soldered, 1TB SSD, 2.8K 120Hz OLED, 84Wh battery) It's not have no cost emi or cashback on HDFC credit card (others too)\nI'm not going to buy in a one payment can i wait for card offers?\nWhat your thoughts on this price is it a good or not?",
  "Original Price (before applying any coupons or rewards): \n₹86,000-87,000\n\ndiscounts:\nSheerID Student Discount: - ₹4,149\nCUSTOMOFF Coupon: - ₹1,000\nLenovo Rewards 2396 pts (2 pts = ₹1): - ₹1,199\n\nNow ₹81,636\n\nIt's not have no cost emi or cashback on HDFC credit card (others too)\nI'm not going to buy in a one payment \nWhat are your thoughts on this price is it a good or not?\n\nThis is a cto model so I can't stack any other coupons other than \"CUSTOMOFF\"\n\nIf Any other better options are available let me know",
  "Thinking about buying Lenovo IdeaPad Pro 5 (Intel Ultra 9, 32GB RAM, OLED)Good deal at 1.17L? Hi\n\nI’m looking for a laptop mainly for daily stuff like programming, browsing, and watching movies. I found the Lenovo IdeaPad Pro 5 with these specs:\n\nIntel Core Ultra 9 285H\n\n32GB RAM (soldered)\n\n1TB SSD\n\n16 inches 2.8K OLED display, 120Hz\n\nWindows 11 Home\n\nPrice: 1.17L\n\nHas anyone used this laptop for daily programming and media? Do you think 1.17L is a fair price for these specs? is there any better option around this range?\n\nThanks in advance.",
  "get a thinkpad, depending on your budget you might wanna consider even used. i got a friend a used t15 with a 3080 for under a grand for gaming. if your worried about battery life they have plenty of good AMD options too !",
  "Good to go , but are you getting all disc like sheer id ?",
  "Thank you. Will check.",
  "I didn't understand, please explain a bit.",
  "Dm me.",
  "Being a god man",
  "Legion Pro 5 16 (Ryzen 9-Windows 11 Home-32GB-1TB-RTX 5070) Good morning,\nI intend to buy my very first gaming PC for €1649, and I wanted to get your opinion on it. It's been my dream since I was little to have a PC so that I can play (I don't know anything about this world of gaming) it's just a childhood dream that I can afford now that I'm an adult. I won't use it much for games, it will just be for relaxing on weekends or late evenings, I also intend to use it a little (small projects) for mechanical design and simulation with Ansys, SOLIDWORKS, fusion 360 software... And also for video editing.\n\nFeatures\nProcessor\nAMD Ryzen™ 9 8940HX processor (2.40 GHz up to 5.30 GHz)\nup to 5.30 GHz)\n\nOperating system\nWindows 11 Home 64\n\nWindows 11 Home 64\nGraphics card\nNVIDIA® GeForce RTX™ 5070 8GB GDDR7 Laptop GPU\n\nTotal memory\n32 GB DDR5-5 200MHz (SODIMM)(2 x 16 GB)\n\nHard disk\n1TB SSD M.2 2242 PCIe Gen4 TLC\n\nScreen\n16\" WQXGA (2560 x 1600), IPS, anti-glare, non-touch, HDR 400, 100% DCI-P3, 500 nits, 240 Hz, low blue light",
  "For video work I might suggest a gpu with more VRAM, and maybe an OLED screen. The 240Hz doesnt seem to be of much value for your use case. The CPU and memory are good options",
  "Even if I only intend to do small mechanical design and simulation projects? Because my real goal is to practice a little on software such as Ansys and SOLIDWORKS and do mini projects to remind myself of how they work. I don't intend to do big, heavy projects with lots of finished elements that would need a more powerful GPU.",
  "Is lenovo legion 5 pro worth for 1.6 Lakh INR or 1790 USD -40.64cms (16) WQXGA (2560 x 1600), OLED, Glare, Non-Touch, HDR 1000 True Black, 100%DCI-P3, 500 nits, 165Hz, Low Blue Light. , Intel® Core™ Ultra 7 255HX Processor ",
  "I need a genuine review of the galaxy book 5 pro (screen crack issues?) ",
  "Should I buy this Lenovo legion pro 5 gen 10? Hello r/laptops! I am currently browsing the interwebs for a new (gaming oriented) laptop. Don't really care about the holiday pseudo-deals, however, since the current laptop markets seem to be oversaturated and I'm way past the point in my life that I can spend enough time researching everything, I am coming to you for help. How does [this](https://laptop.bg/laptops-lenovo-Legion_Pro_5_16_Gen_10-lenovo_legion_pro_5_16_gen_10_83LT002BBM?conf%5B%5D=102022) laptop look to you quality/performance/price:\n\nLenovo Legion Pro 5 16\" Gen 10, 32gb DDR5, NVIDIA GeForce RTX 5070 (8GB GDDR7) 2560x1600 (WQXGA), 240Hz IPS, 3TB SSD NVMe Gen4 (1x1TB + 1x2TB)\n\nPrice is 2146E = 2,475$\n\nThank you for any input into the subject.",
  "Samsung Galaxy Book 5 Pro 360 OR the Lenovo Yoga 7 I'm trying to a find a good 2 in 1 for University use. I'm already in a Samsung ecosystem so im really geared towards the book 5 but I don't know much about laptops, and I need help choosing.",
  "Is my Lenovo Legion 5 15ACH6 upgradeable for 512gb or 1TB SSD? ",
  "Looking at the Lenovo Legion Pro 5 Gen 10 AMD (16″) for mechanical engineering + power and gaming use. Is it any good or is there any better? Hey all, I’m in my mechanical engineering program (so lots of CAD, simulation, maybe some rendering, plus general heavy multitasking) and I also have a Mac for lighter stuff, but I’m looking to get a *really* powerful Windows laptop that is also reliable and high quality. My budget is about **$2,000 CAD** (or close), and I’m considering [The Legion Pro 5 Gen 10 AMD (16\")](https://www.lenovo.com/ca/en/configurator/cto/index.html?bundleId=83LTCTO1WWCA2). Specs/options;\n\n* Processor: AMD Ryzen 9 8945HX (16C/32T) in this model. \n* Screen: 16″, WQXGA (2560×1600) presumably, good resolution for engineering/design work. RAM: I’ve upgraded it from 16 GB → 32 GB for $90 (seems like a very worthwhile upgrade for my use-case).\n* GPU: I have two options: stick with the RTX 5060 (the base GPU in some configs) or pay **$200** more to upgrade to the RTX 5070. Specs at a glance: RTX 5060 and RTX 5070 both 8 GB GDDR7 in this model. \n* Other specs: The model supports solid ports (USB-C, USB-A, HDMI, RJ-45) and build looks quite decent.\n\n**My questions to you all:**\n\n1. For my use (mechanical engineering, CAD/simulation, maybe rendering, multitasking, gaming), is the RTX 5070 *worth* the additional $200 compared to the 5060? Will I see meaningful benefits (in CAD/engineering workloads and gaming) or is the 5060 “good enough” and worth saving the $200?\n2. From the perspective of reliability, build quality, brand reputation: how does the Legion Pro 5 line look? Are there known issues (thermals, noise, durability) I should be aware of? I want something I can rely on through my degree and beyond.\n3. Given my budget (\\~$2,000) and the upgrade I’m doing to 32 GB RAM, does the config seem balanced (CPU strong, GPU choice open, RAM done) or am I perhaps over-investing in something that won’t pay off long-term?\n4. Any red flags (in this model or manufacturer) I should check (e.g., warranty, serviceability, cooling, noise level under load, portability/weight given 16″ size)?\n5. Is there any other laptop that is better and more powerful for this price range?\n\n**What I’m leaning toward:**  \nI really want headroom so I don’t feel like I’ve “cheap-ed out” on the GPU, especially since engineering software and maybe some creative work might benefit from a stronger GPU. On the other hand, if the 5060 already handles everything well and the difference to 5070 is marginal (or mostly gaming-oriented), then maybe I stick with 5060 and save $200 (and invest elsewhere maybe SSD, battery, etc).\n\nWould love to hear from folks who have used this exact model (or similar Legion 5/Legion Pro rigs), especially engineers or users doing heavy workloads (not just gaming). I would also love to hear if anyone has any better options that heyve personally owned. Thanks in advance!\n\n  \n",
  "The majority of the computational workloads you will do as a Mechanical Engineer will be mostly handled by your CPU rather than your GPU, the GPU will mostly just be used for making the visual model that you will be manipulating (so not nearly as significant). The mobile 5070 this generation isn't that much more performant than the 5060 either and is still restricted to 8gb of vram. I wouldn't say going for the 5070 would be worth it.\n\nNow, although the 8945HX is a Zen4 CPU rather than the most recent Zen5 architecture it is still very formidable and can easily last you for years in regards to CAD and FEA. As for gaming that is kind of up to you.\n\nYou could technically get better performance in CAD with a competing Intel CPU as those tasks do heavily rely on single threaded performance but the AMD cpus these days will do way more than fine for that.\n\nNow, 32gb of ram is great for smaller to medium sized builds but if you would like to carry this into the future you should go and get a 64gb kit. That's a problem for the future though, 32 is fine for now.",
  "Thank you thus is the best reply I got so far. Just for a follow up, you think this is one of the best in the market for what I’m specifically looking for or would you say there’s better?",
  "Lenovo Legion 5 / HP Omen 16 / TUF A 16 - Which one to keep? Hi guys, I've already bought these laptops but unsure which one to keep, mainly for gaming and music production. All of them with 32 GB Ram & 1 TB SSD\n\nHP Omen 16 variants:  \nAMD Ryzen 9 8940HX - RTX 5060 - IPS 1920x1200 144hz - EUR 1049  \nAMD Ryzen AI 7 350 - RTX 5070 - IPS WQXGA 240hz - EUR 1200  \nAMD Ryzen 9 8940 HX - RTX 5070 - IPS WQXGA 240 hz - EUR 1300\n\nLenovo Legion 5 variants:  \nAMD Ryzen 7 260 - RTX 5060 - Oled WQXGA 165hz no G-Sync - EUR 1039 (Do I have gsync if using an external monitor?  \nI9 14900HX - RTX 5070 - Oled WQXGA 165HZ no G-Sync - EUR 1349 (Do I have gsync if using an external monitor?\n\nAsus TUF A16:  \nRyzen 7 260 - RTX 5060 - IPS 1920x1200 165HZ - EUR 999\n\nHope you can help since I'm 100% unsure in which one to keep",
  "Is this lenovo legion 5 gen 10 a reasonable deal? or i can get the 5050 gpu instead for $1079.\n\nwonder if the upgrade is worth, or if i should just wait altogether for black friday?\n\nplan on doing unreal engine game development, light gaming, etc.",
  "Pretty great deal, I think you should get it.",
  "lol. It comes with \"Glare\".\n\nThat typo aside, the rest are solid specs for that price. Good deal.",
  "[removed]",
  "Actually chatted with a sales rep and used employee partnership discount. Through lenovo.com",
  "Lenovo legion 5 or HP Omen 16? ",
  "Help be decide between lenovo idea pad pro 5 and yoga slim 7i ",
  "Alternatives to power button on Lenovo IdeaPad 5 Pro 16ARH7 A few years ago, I bought the laptop mentioned in the title. It served me very well until the hinge broke and squished part of the screen. \n\nI now have a new laptop, but luckily my dad can use the laptop since he already uses an old laptop connected to some external displays. \n\nThe only issue is that ideally he would like to keep the lid closed and control it using the external peripherals but the power button is on the inside. I looked around in the bios but couldn't find any option like \"wake on lan\" or some option that would wake the laptop when it detects power.\n\nI was wondering whether anyone here has any alternative ideas to powering the laptop with the lid closed.\n\nThanks for any advice!",
  "Enable always on USB in BIOS, then try waking with the keyboard. If that fails, get a USB power button or wire the internal one out cheap and works fine.",
  "Is this Lenovo Legion Pro 5 (16IRX10, i7-14650HX, RTX 5060) a good buy? ",
  "Legion 7i vs Legion 5 pro What is the purpose of the pro, also is the 7i just better and should I just buy the 7i.",
  "5 pro is the 16\" one (regular legion 5 this year is a 15.1\".\nLegion 7 is the premium model (not counting the legion 9 as it's more of a experimental model). It has better cooling and better build quality while getting access to higher specs (5070 to 5090 etc)\n\nIf you're 5070 performs about ~13% better then the 5069 at 1440p but it's about a ~20% price difference. IMO, I'd get the legion 5 as it's better FPS for dollar BUT if you care about performance then the legion 7 is still a good option",
  "Legion Pro 5 16: 83LT004WIX Hi,\nI'm fairly new here and want to buy my first gaming laptop. I saw this offer and want to ask you guys, if that's a decent price for it:\n\nRegion: EU\n\nDescription: Legion Pro 5 16 (Ryzen 9-Windows 11 Home-32GB-1TB-RTX 5070)\n\nPrice: 1,699€\n\nShould I buy it?\nThanks alot for your help! :) \n",
  "Lenovo Legion 5 (ARH05) shuts off 5 seconds after boot, sometimes works perfectly for hours after several tries (video) Hey everyone, I’m having a strange issue with my Lenovo Legion 5 (Ryzen 5 4600H, GTX 1650).\n\nHere’s what happens:\n\nLaptop powers on, lights and fans come on normally.\n\nAfter about 5 seconds, it makes a click sound and shuts off completely.\n\nIf I keep trying (around 6–7 times), it eventually boots and then runs smoothly with no lag or heat issues for 2-3 hours.\n\nThe issue happens both plugged in and on battery.\n\nFans were a bit dusty I cleaned them, but it still behaves the same.\n\nTemps are normal.\n\nNo burning smell, no visible damage.\n\nI’ve attached a short video showing exactly what happens.\n\nDoes anyone know what might cause this",
  "Almost seems like it could be some sort of solder joint that doesn't have great contact, and after a few tries it heats up enough for it to work properly.\n\nI'd try also seeing if the issue persists with no battery at all",
  "Same issue with no battery at all.\nSolder joint issue? That means I've to replace the motherboard right? ",
  "It may not be that, but it certainly is possible. I'd try to get it RMA'd if nothing else works and you're still within warranty\n\n[https://www.reddit.com/r/LenovoLegion/comments/1lke2ky/2021\\_legion\\_deaths\\_an\\_analysis/](https://www.reddit.com/r/LenovoLegion/comments/1lke2ky/2021_legion_deaths_an_analysis/)\n\nThere doesn't seem to be examples here of these laptops(15ARH05) dying, but someone did say that the 2020 models (like yours) seem to share the 2021 motherboard issues.\n\nIt's worth trying to minimize heat in your laptop, as that seems to help deter the issue of the cold solder.\n\nI'd also do a memory stability test(like [OCCT](https://www.ocbase.com/download)), because that may be interfering with booting\n\nIt also could be BIOS related as mentioned here: [https://www.reddit.com/r/LenovoLegion/comments/1e39hag/lenovo\\_legion\\_515arh05\\_keeps\\_turning\\_off\\_after\\_i/](https://www.reddit.com/r/LenovoLegion/comments/1e39hag/lenovo_legion_515arh05_keeps_turning_off_after_i/) (this seems most likely to be the cause, but I'd try the memory test first, as unstable/error prone memory can mess up BIOS updates)\n\nBest of luck!",
  "Thank you so much for all the effort you put in to help me I truly appreciate it and I'll try it all.",
  "So bro I want to know if there are these motherboard issues or whatever things in the new 2025 model     ",
  "Lenovo Legion 5 vs HP Omen. Don't know much about PCs. Advices would be appreciated. ",
  "need some help with lenovo legion slim 5 settings hi. i recently got a lenovo legion slim 5 laptop, but i have an issue that i don't know how to resolve. whenever i have any game open, the laptop seems to focus on the game only, and whatever app i have in the background just refuses to work properly. for example: while i'm playing something i decide to open a chrome tab and it will take ages for it to load fully. i've tried turning off game mode, hardware-accelerated gpu scheduling, changing priorities in the task manager, changing some nvidia control panel settings...\n\nif anyone knows how to fix it please reach out i would really appreciate it!",
  "Lenovo Legion Pro 7i (RTX 5070 Ti) @ $1,999 - Worth it or wait for better Black Friday deals? Hey everyone! Content creator here looking for laptop advice. **Zero gaming** \\- this is purely for work.\n\n**My workload:**\n\n* Python automation & AI development\n* Video rendering (DaVinci/Premiere)\n* Running AI models locally (ComfyUI, Stable Diffusion, local LLMs)\n* Text-to-image, image-to-image, image-to-video generation\n\n**Current deal I found:** [Lenovo Legion Pro 7i at B&H - $1,999 (was $2,849)](https://www.bhphotovideo.com/c/product/1875948-REG/lenovo_83f5001bus_16_legion_pro_7i.html)\n\n* Intel Core Ultra 9 275HX\n* RTX 5070 Ti (16GB VRAM)\n* 32GB RAM\n* 2TB SSD\n* 16\" OLED 240Hz\n\n**Questions:**\n\n1. Is this the best deal right now, or should I wait for Black Friday proper?\n2. Anyone seen better early BF deals on comparable specs (especially RTX 5070 Ti laptops)?\n3. Considering Alienware equivalent - thoughts on Lenovo vs Alienware for content creation/AI workloads?\n\nThe 16GB VRAM on the Ti seems crucial for my AI work. Any insights appreciated!",
  "Should I buy Lenovo Legion 5 2024 13Th Gencore Intel I7-13650HX|NVIDIA RTX 4060 8GB(24GB RAM/512GB SSD/15.6\"(39.6Cm)/14Hz/FHD IPS/Windows 11/Office Home 2024/3 Month Game Pass/Grey/2.3Kg),83JJ0010IN Gaming Laptop ?? Fast asap",
  "Should you buy it ? If you want to.\n\nIs it a good idea to buy it ? It depends. The 4060 is a GPU from the previous generation, so if it's not discounted by a significant amount it's not worth it (also note that the newer rtx 5050 laptops are often cheaper and the performance is very similar).\n\nCompare the price to other similarly specced laptops in your area and you'll see if it's a good deal or not.",
  "Can get that for 105k (1184$)",
  "Loq or legion which is best ?",
  "Legion is the higher end model so it has better built quality, possibly higher wattage depending on the model and specifications etc.\n\nIt's more expensive however.",
  "Can get that for 105k (1184$)",
  "Every region has different pricing. In my country, Canada, this is expensive but in your country it could be a good deal. You have to do your own research or ask in more local communities (facebook groups, maybe subreddit for your country, check local store pricing...)",
  "Lenovo Legion 5 Fan Noise My laptop’s left fan has been making this annoying noise even in quiet mode. The right fan is perfectly fine, however, my left fan keeps making this noise which ends up making the left side of my laptop vibrate more than my right side.\n\nI cleaned my laptop recently for any dust and couldn’t find anything inside. The noise levels keeps changing depending on the incline of the laptop and whether I’m pressing on the left hand rest area of the laptop.\n\nThis is a sound recording of the noise taken up close:\n\nhttps://drive.google.com/file/d/1-gI42ZoLSOZLqsIiRfJlwfABDMW20n-P/view?usp=drivesdk\n\nPlease help me resolve this. This is my first gaming laptop and I don’t want to see it get ruined :(",
  "Lenovo legion 5 pro display issue , i have been facing the issue for past one week I have been using lenovo legion 5 pro for past 2 years,but recently i had a issue with display.when i switch on the laptop the display is fine but after 30 to 40 minutes corners of the laptop display seems to have grey shades as seen in the picture.does anybody faced this issue . If i want to replace the screen which is not under warranty it is costing me around 300$ since it is QHD display ",
  "What to choose between AMD Ryzen vs Intel for Lenovo Legion 5 2025 model So, I have decide to buy Lenovo Legion 5 but I can't decide whether to buy Ryzen or Intel some people say don't go with Ryzen why is that ?? I have no clue. Btw the both having same specs like 1TB storage 32 GB ram and RTX 5060     ",
  "Don't listen to trolls. Both AMD and Intel are good. But specifically this model, Intel has the advantage in terms of multicore performance. Watch [Jarrod's comparison](https://youtu.be/RQOvHqDXX-8?si=sZpdsLBiah1SqRv5) video and see here compares the 2 models.",
  "Yeah that's why I was confused too bro people are telling they have this problem with ryzen and stuff I don't know what to choose because of that I was going to choose intel and because it is pricey i have choose 16 GB instead of 32 GB ram      ",
  "Laptop blackscreened on me. All I can do is shut it on and off. Model is lenovo legion 5 15ith6h. This started pretty much when the new windows update came out. I dont know if this is a coincidence or not, but the last day it was working fine I downloaded a few games. Later I heard you couldn't download large games... so i don't know. Funny thing is a couple of days later I managed to turn it on normally and played games with friends. The next day it was blackscreening again.I tried battery drain reset, ram reseating, opening bios (can't do that unless I'm pressing the wrong buttons. I technically have the money for repairs, but I'm saving up for moving out, so unless it's not expensive I'm not too keen on that idea. Any ideas what I could do?\n\n(Also sorry if this seems scattered, it just feels like I'm having a damn stroke)",
  "Try connecting an external display and then remove 1 stick of RAM and try booting with said stick in both slots, then swap the stick and repeat. If that still doesn't work, take it to a shop, but it's possible it's the solder issues that plagues the 6th gens, which would be a death sentence. Would need reballing on the CPU which is pricey and not a lot of shops can do it",
  "Possibly worth replacing the RAM, if you have a spare stick. It doesn't happen often but I've seen a stick go so bad that the machine power cycles. In my case it was one chip near a corner was superheating.",
  "Check your RAM they might be loose, Clean the golden part with an eraser clean it and then attach it and try turning on, If you have two sticks do it with one at a time then if it works try with both",
  "Tried the external display already, but haven't tried swapping the slots yet, thanks I'll try that!",
  "My girlfriend has the same laptop as I do, ill try putting her ram in my pc before buying a new one, thanks!",
  "I tried taking out the ram and putting it back already, but I'll also try cleaning it, thanks!",
  " Ensure battery is unplugged first!!",
  "Didn't help :// I don't even know what to do anymore",
  "Laptop Lenovo IdeaPad Pro 5 14IAH10  Intel® Core™ Ultra 9 285H 5.4GHz, 14\" 2.8K, OLED, 120Hz, 32GB LPDDR5x RAM, 1TB SSD, Intel® Arc™ 140T, No OS, Luna Grey **I want to buy this laptop for college, for programming and I want someone capable to tell me if it is a good laptop for it's price and if it performs well via components etc.**",
  "What should I get Lenovo Legion 5 i7 w/ Rtx 5060 or Asus tuf f16 i7 w/5070? ",
  "Best laptop under $1000 for engineering student? Thinking Lenovo Legion 5 (RTX 5060)   \nHey everyone, I’m an engineering student looking for a laptop under $1000. I’ll be using it for CAD, MATLAB, and some light coding and gaming. I’m thinking of getting the Lenovo Legion 5 with RTX 5060 — looks powerful for the price.\n\nIs it a good choice or should I look at something else (like ASUS TUF or Acer Predator)? Mainly want good performance and thermals for long study sessions.\n\nAny suggestions or deals I should check out?\n\nThanks!",
  "Need help choosing between legion pro 5 variants 255HX and 9955HX. Both with 5060. Mostly I want to know how/if I can improve the battery life on the 9955HX by undervolting somehow(noob). Both are same price. Buying Advice I am mostly around a plug-point and very rarely use unplugged, unless there is a power outage or seomthing due to storms. I'll be mostly running Blender, Bambu studio, ComfyUI, Cursor AI(IDE) for JAVA/React. Most probably won't play games as now I never get time for that :(\n\nI can't decide between these two. All the other specs are same, except the 255HX can officialy handle 6400MT/s RAM, but that I might or might not upgrade and the difference might be very low.\n\nI want to know if I can undervolt 9955HX(No idea how to do this, or if it's even possible). I just want to have the laptop running smothly under batter atleast for an hour or two in emergency cases. WIll that be possible with the 9955HX. If it's too much of dent on battery I'll go with 255HX.\n\nPlease share your windom!",
  "try getting a better gpu 1.5L for 5060 8gb doesn't sound nice",
  "plus u have blender and bambu as one of your imp apps so I'd highly recommend going for a better gpu",
  "The next best GPU is 5070 ti and that costs a lot lot more. There is a couple at 1.75 lakh with some cost cuttings. Everything else is over 2.2 lakh. 5070 doesn't make much difference with 5060.",
  "Legion pro 5 memories and SSD consultation I just bought a new legion pro 5i (1TB 16G)and I want to upgrade it (2TB 32G).Are there any recommendations guys?Any nice brand? Or just buy the same brand that Legion has?(if my info is correct the ramshould be Crucial ,SSD  probably doesn't need to consider compatibility, so good quality is enough.)",
  "Would the Lenovo Legion 5 gen 10 be a good buy for a mix of school+gaming ? (ryzen AI 350 / RTX 5060 version) Hi, my question is basically what the title says.\n\nWhat brings the most questions for me is battery life. I already checked benchmarks and know this laptop will be enough for the games I play, but I can't find decent info on battery life. I need it to last a full 8 hours of class, so light use with just browsing and microsoft office basically. I would probably lower screen refresh rate and only use iGPU (if possible) to achieve that, and maybe other optimizations I need to look into. How much battery life can I expect in these conditions ?\n\nI also considered just getting a decent ultrabook with no dedicated GPU and a cloud gaming subscription, but a good ultrabook (asus zenbook 14 for example) is as expensive as a PC with a dedicated GPU, with the only advantage being battery life.\n\nAny inputs on the subject would be welcome, thanks :)",
  "no gaming laptop will last 8 hrs unplugged. youre better off getting a thinkpad and building a pc for gaming",
  "I already have a pretty nice desktop for gaming (9800x3d + 9070xt) but this PC will stay at my apartment (in the city I work in), and I'll spend half my time there and the other half where I go to school, where I'll live with my parents. So I won't be able to access my current PC half the year, and need a laptop for school anyways, hence why I'm looking for a compromise here.",
  "I've got a TUF A15 that lasts over 10 hours unplugged for basic tasks. The Legion he's looking at should get about 8 hours, possibly more; would vary depending on the settings.\n\nYou can switch to using the iGPU which significantly reduces power consumption. And since there's a lot of CPUs on gaming laptop that are quite efficient these days, including Ryzen 200/300 series CPUs, a lot will reach 8 hours or more.",
  "Could get something with a good iGPU that you can use for light gaming for when you aren't at your appartment. Something with a CPU like a Ryzen AI 365/370 would be more than good enough.",
  "Thanks for your answer, this was pretty helpful ! Can I ask which CPU is in your A15, and the battery capacity ?",
  "I thought about it, but the performance would be pretty bad compared to a laptop with a dGPU of the same price. Even compared to a rtx 5050, iGPU are still underpowered for anything but very light games, I'm looking to play mostly Baldur's gate 3 and souls games. This is why I'm trying to find something with a dGPU that still has a good battery life. Getting a laptop with only an iGPU kinda feels like I'm getting robbed.",
  "Ryzen 5 7535HS, 90WHR.",
  "Lenovo Legion Pro 7 (RTX 5070 Ti, OLED) vs HP OMEN MAX (RTX 5080, IPS) - which one? ",
  "Legion 5 or legion pro 5 I am a college student majoring in electrical engineering going into my 4th semester, I won't be playing any games on it just wondering if I should get the better cpu for future proofing or if it's overkill. \n\nLegion 5 \n- R7 260 \n- RTX 5060\n- 16GB 5600 \n- 1TB SSD \n- 15.1 in OLED (2560 x 1600) \nCost $1099.99\n\nLegion pro 5 \n- R9 9955hx \n- RTX 5060\n- 16GB 5600 \n- 2TB SSD\n- 16 in OLED (2560 x 1600) \nCost $1379.99",
  "My lenovo legion 5 has a line to the side of the screen but im not sure if it's a screen fault or a loose connection https://preview.redd.it/h9ydg05vpwxf1.png?width=4032&format=png&auto=webp&s=11644ec6579219c9180db065307fca24b1d71b4b\n\nThis is not my picture but mine is similar and a bit bigger and a bit more to the left.\n\nThe weird thing about mine is that in the area where the line is, to the bottom of the screen the laptop feels \"loose\" idk how exactly to describe it but pushing anywhere else the screen outline feels solid but pushing there exactly where the line is it feels loose and easy to push.\n\nWhen i push there the line starts to flicker and act kind of weird, once it even went all black for a second.\n\nIdk what caused this, since i never dropped my laptop and 3 days ago it was working fine and i didnt use it ever since but now i booted it up and it's doing this. Also moving the hinge or screen to fold it down also makes the line act weird\n\nIs it possible to figure out without going to a repair shop for a diagnosis?"
]