[
  "Lenovo Thinkbook G5 (R3 7330U) or Ideapad Slim 3 (R5 5500U) ?? Buying a laptop for my father, entry level, fast and good battery, mainly used for minor office tasks and media streaming. These two on shortlist                                                                                                                                        1. **Lenovo IdeaPad Slim 3 R5 5500U 15.6\" IPS LCD (16 GB/512 GB SSD/Win11 Home, MS Office)** *@ 32500INR/380USD* and                                                                                                                                                                  2. **Lenovo ThinkBook 15 G5 R3 7330U 15.6\" TN FHD (8GB RAM/512GB SSD/Win11 Home/Fingerprint)** *@ 27000INR/320USD.*\n\nAppreciate great metal body of thinkbook and nicer cpu but deal breaker for me is the awful *TN display* with disaster viewing angles and colors. biggest plus point on ideapad is being *only IPS in range*, rest is better on thinkbook. also going to look at screen all the laptop's life, movies or work so it is kinda major point. But in a dilemma after reading reviews on quality of ideapad. laptop is going to be safely used for normal tasks, low to none gaming, so okay with 5000 series processor.                                                                                                              others on list were *Lenovo IdeaPad Slim 3 Intel Core i3 1215U* and *ASUS Vivobook 15 (2024) Intel Core i3 1215U*\n\nEmphasis on build quality, cpu and display.\n\n**Will need quick decision as need to buy asap.**",
  "Looking to buy new laptop under 1200 USD Hey Everyone,\n\nTLDR - \n\nLooking to Buy a reliable professional-grade laptop around 300,000 PKR with strong CPU performance, expandable RAM and SSD options, a capable GPU for rendering, decoding, and solid build quality. Preferably new with local warranty support.\n\nAny recommendations or feedback would be highly appreciated.\n\n\\------------------\n\n# Back Story\n\nAfter a long while, I have finally decided to upgrade my laptop, but the current market dynamics is too confusing for me right now esp. between currency hit, price differences, open-box deals, and Masked/refurbished options, it has been difficult to decide on a laptop that truly fits my needs. I would really appreciate some input from the community.\n\n# Current Setup\n\nI’m currently using an HP ProBook 450 G5 (8th Gen). It has served me well, but it’s beginning to show its age, especially under heavier workloads.\n\n# Requirements\n\nCore Specifications\n\nCondition: Brand new preferred  \nCPU: Intel i7 (H-series or equivalent or better)  \nRAM: 24 GB (16 GB minimum with expansion slot - no soldered ones)  \nStorage - (Must be SSD + HDD option)\n\n* SSD 512 GB for OS (second slot for future expansion is a plus)\n* HDD SATA 1 TB (2.5” inch)\n\nDisplay: At least IPS with decent color accuracy & brightness  \nGPU: Nvidia RTX Ada series or something slightly stronger for rendering, encoding/decoding performance. I can work with gaming series but no older than 4000 series.  \n  \nPorts and Connectivity\n\n* Multiple USB A/B/C 2.0/3.0 ports for accessories (mouse, external drives, cooling stand)\n* 3.5 mm audio jack\n* VGA/HDMI port for external display\n* RJ45 LAN port\n* Wi-Fi 4/5 GHz support\n\nKeyboard and Build\n\n* Full-size backlit keyboard (numpad preferred)\n* Rigid build with minimal flex or hinge wobble. Weight isnt an issue.\n* Easy to open for cleaning or upgrades\n* Local parts availability for future maintenance\n\n# Usage Pattern\n\n* My workload involves heavy office use with constant multitasking, often running numerous browser tabs alongside background tools for downloading and file-syncing. Current system starts to lag with ram & cpu reaching max capacity before apps start crashing.\n* I do not play games on the laptop as I have a ps5 pro for that - so I dont require top end latest GPU.\n\n# Not Considering\n\n* MacBooks, due to hardware/software compatibility issues with some custom tools I use.\n* Touchscreen, 2-in-1, tablets, flipbooks or hand-held devices\n* Desktops, as I often work from multiple client offices and need portability\n\n# Current Thoughts\n\n* I’ve been considering Lenovo ThinkPad T or P Series, but many models seem to use TFT panels by default. \n* HP Victus models have good specifications but poor reviews regarding build quality, screen wobble, and keyboard flex. \n* I’m also uncertain about Intel versus Ryzen options and would appreciate insights on that. \n* My goal is to move to at least an IPS panel, since my current laptop has a TFT. OLED would be ideal, but likely beyond budget.\n\n# Budget: \n\nAround 300,000 PKR\n\n# Important Points\n\n* Models that offer the best balance of performance, portability, display & build quality\n* I would prefer numpad on keyboard but if laptop model is worth it then I can compromise as a trade off.\n\nI know I might be asking for a lot, but any advice or recommendations would really help. Thanks to anyone who takes the time to share their thoughts.",
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "What do you think about the HP OmniBook 7 Flip 16\" 2-in-1 AI Laptop? Is there any good reviews on the laptop? What do you think? Is there a better laptop for a similar price?\n\n  \n[https://www.costco.com/hp-omnibook-7-flip-16-2-in-1-ai-laptop---intel-evo-platform-powered-by-intel-core-ultra-7-258v---copilot-pc---3k-oled-touchscreen---32gb-memory---1tb-ssd---windows-11-home.product.4000355164.html](https://www.costco.com/hp-omnibook-7-flip-16-2-in-1-ai-laptop---intel-evo-platform-powered-by-intel-core-ultra-7-258v---copilot-pc---3k-oled-touchscreen---32gb-memory---1tb-ssd---windows-11-home.product.4000355164.html)\n\n  \n",
  "I will buy and tell you",
  "This was the first time I bought something with no reviews and not seeing it in person and I research the heck out of everything.  I just finished setting up this laptop and really like it.  Good build quality, great screen, great camera, plenty of memory and storage space, speakers sound great.  I really like the rotation of the screen.  I probably won't use it as a tablet, but I like being able to choose the angle of the screen.  This is just day 2, but so far I think this will be a great computer and the Costco price was right..",
  "Are you a college student?",
  "HOW DID COSTCO SELL IT FOR 1000 DOLLARS",
  "If you don't need touchscreen, OLED, or 2-in-1, This new Dell Inspiron 16 Plus (model DB16250) has the same Intel ultra 7 258V processor and is on sales for $899. It also has a numeric keypad.   [Dell 16 Plus Laptop - 16 Inch Laptop | Dell USA](https://www.dell.com/en-us/shop/dell-laptops/dell-16-plus-laptop/spd/dell-db16250-laptop/USEDB16250HBTOHGVH)",
  "I am on the fence for an ultra thin laptop, I was looking at the $750 Acer (32gb and same CPU), but the screen on it is very washed out, saw this in store and blew me away with the colors and build quality.  Will have to see if my local place has it in stock.",
  "I just got one last Thursday due to killing my last laptop with soup. Being used to a beefy laptop it def a change, the keyboard is something i need to get used to because it's a little more compact than my last one. I do a lot of digital art so the tablet mode is very helpful. It runs very smoothly I haven't had any issues. The hinges are strong and its a little hard to open the laptop its like opening a clam in my opinion lol. There's also a lot of like futuristic stuff I am not used to in tech like unlocking with my face and it sensing when I'm near and turning on, but it's still cool. If you want to play games on it, it also runs pretty well I can play marvel rivels for a little without it being weird.",
  "Haven't had it for a month and will not charge.",
  "Is it a good engineering laptop? Any recommendations for a first year engineering student?",
  "Would someone recommend this over macbook m4 10 core for photo editing?",
  "Bought it at Best Buy yesterday,Just shipped today.I was originally planing to test out this new laptop,I played 1 SINGULAR Roblox game on it,and then I closed it and went to use the bathroom.When I came back it was stuck at the screen where it said auto repairing,then it flashed and to troubleshoot from 1 second and then back at auto repairing.In the span of 1 hour and 30 minutes,it was completely unusable.The keyboard feels off,it feels like the old laptops,like the feel and the typing sound felt off.Another thing is that it only powers on when you plug it in,the battery was TERRIBLE,charged it for 3 STRAIGHT HOURSS and it felt like it hasn’t worked. T~T had to return it today since all the methods of resetting it didn’t work.Had to buy a different one today.\n\nDO NOT RECOMMEND🥲\n(Don’t know if my luck was bad,or it’s just that bad.But I can tell you the only thing that was working was the fan in the back😁👍)",
  "My HP Omen died RIP dear laptop.  I can't afford an Omen so I'm looking at the HP OmniBook 7 17.3 inch Laptop Next Gen AI PC.  My Omen had Windows Pro\nThe OmniBook comes with family.  I can customize the OmniBook and upgrade to Pro for $90.  Opinions on this appreciated.\n\nThanks",
  "Is there a omnibook flip model that comes with dedicated gpu?",
  "it's cheaper than $1k now, except for the version with a 4050 graphics card",
  "Well hurry up",
  "How’s the battery life ? And is it loud in any way? I’m looking for a college laptop and this one I’m considering.",
  "Is it still impressing?",
  "[deleted]",
  "How's the trackpad? Is it the clicky type, or is it haptic?",
  "hello how long does the battery last?\nDo you think this would be similar to yours HP OmniBook X Copilot+ AI PC 14 x360 2in1 Ai Intel Core Ultra 5 226V (Gen 2) 512GB SSD 16GB 14.0 Inch 2k 2880x1800 Arc Graphics W11H Blue",
  "Kind of. I'm a Graduate student at the end of my studies, but my laptop of 7 years is dying on me and I need to make a decision. I would like something that'll last me a while while being a damn good price. I'm currently in the \"do I prepare for the worst or should I try to wait it out until after I graduate\" mindset. I use my laptops for spreadsheets (Origin) for data analysis, python/labview for matrix/data transformations, and writing multiple near 1Gb word documents. I don't need a dedicated GPU, just something light to write on while being powerful. A nice screen helps to create figures on photoshop.\n\n  \nI don't get the luxury to be always by my desktop.",
  "Y'all think the deal will come back?",
  "I just got it on the hp website for $588 with student discount. It was recommended to me by tech support.",
  "Just bought it for 530$ in the HP store, for black friday.",
  "To be fair, some people consider the numeric keypad a bad design. In fact, 10-key-less laptops seem to have a higher average price and tend to be in the higher range of laptops. Off-center trackpads seem to be synonymous with \"cheap PC laptop\".",
  "What happens if you play Marvel's Rivals on it for longer than \"a little\"?\n\nI'd like to use mine for both med school and casual gaming (like Little Nightmares, Dark Souls, REPO)",
  "did you get it through Costco? if so, Costco's warranty should still be in play. I ended up not getting it. the processor isnt as strong as I'd like it to be. ​",
  "you'll be computing more than graphics, so something with a stronger processor should be good for you (H and HX cpus for Intel, and not V). otherwise, no recommendations at the moment. sorry. I dont know your budget, I dont know if youre looking to have a graphics card, etc. ​",
  "I just bought the Lenovo Legion at Costco for my engineering student. It’s $1499 but seemed like a good deal for what it has. \n\nhttps://www.costco.com/lenovo-legion-5i-16-gaming-laptop---intel-core-ultra-9-275hx---geforce-rtx-5060---wqxga-2560x1600---windows-11-home---32gb-ram---1tb-ssd.product.4000380973.html?sh=true&nf=true",
  "unreal, what a nightmare is this pretty standard for HP computers I wonder?",
  "What version is this this?  hp omnibook x flip - copilot+ pc - intel core ultra 9 - 32gb memory- 2tb ssd for $1600 at Best buy. Didn't even come with a pen and then they stiffed me for 50 bucks and free webroot for 6 months. I've read nothing but back things about this laptop. I think I'm going to return it. I'd like to know where I can find one with an Nvidia graphics card.",
  "I bought it yesterday and its great. Specification wise you will find lots of similar options but the screen is really something outstanding. If you work editing images its really nice. Honestly In person it looks very much like a MacBook because of the aluminum body. Costco has another HP model more gamer oriented for same price and dedicated graphic card, but bulky and so forth. It's like buying a car, you will find a van, pickup truck, sedan and motorcycle for same price range. You need to be sure first of what you are intending to do with.",
  "Nice avatar though.",
  "I find that this laptop is a great choice for college because, for me, the battery lasts all day through classes and study without needing a charge. I do not recall this laptop being loud at all. One thing I wish this laptop had are rubber feet since this laptop tends to move a bit too easy on smooth surfaces. I hope this helps!",
  "Yes, it is",
  "The hinge performs well.  It was a concern when I was purchasing due to issues they had with older models.  They must have fixed in this model because it feels like good quality, and I don't have any reason to think it would separate.  I just felt the bottom and top of the machine and neither seems to produce any excess heat.   I have a lot of apps open but have to test the heat when I use programs that use more processor and memory.",
  "It's very responsive.  It operates like most trackpads where you can tap to click on something, but you can also press down and feel it click (not haptic in the sense of using actuators to create a simulated vibration).  The keyboard also works well.   For ergonomics, I prefer to keep my computer at a higher height with an external keyboard and mouse on a tray under my desk for general use.  The 16in OLED screen is so nice I almost prefer it over my 24in monitor.",
  "I mean, it's still going on until June 8th. but Probably next year during this time for the next generation of CPUs.",
  "Deal starts again from November 17th to dec 1st if you’re still interested",
  "Hey, Best Buy has this deal rn until Sunday, just a heads up- I just bought one ",
  "Which specs?",
  "with the 3k oled ?",
  "Congrats on the med school did you end up choosing the omnibook?",
  "No but sending it back now tbh. I got it not even a couple weeks ago. Lol.",
  "I’ve been researching for like 6 months and we went to his college orientation this last Tuesday and one of the students giving tours said he had used his Lenovo Legion for the last three years with success.",
  "Just received mine yesterday. Do you find that the lock screen looks better than the desktop? To me, the lock screen appears to be clearer and crisper.",
  "Darn, won’t work for me, then. I need to be able to comfortably click at the top of the trackpad, something that only haptic trackpads do well.\n\nAs someone who is deeply into ergonomics, I disagree. Not being able to comfortably click (not tap, click) on the entire trackpad surface means having to choose one of these bad situations:\n- clicking with way too much force and probably bending the entire laptop, so it’s bad for my human hands and bad for the laptop\n- removing my hand from the keyboard home row to click with minimal force\n- enabling tap-to-click, which is error prone\n\nIt’s sad to see that PC laptops are still literal decades behind Apple when it comes to trackpads. Very, very few use haptics and they usually come with some other caveat, like a ridiculous price tag or some other showstopper.",
  "Shows out of stock ;(",
  "https://www.staples.com/hp-omnibook-7-flip-16-led-2-in-1-ai-laptop-copilot-pc-intel-core-ultra-5-4-5-ghz-16gb-ram-512gb-ssd-windows-11/product_24632150?cid=ps:gs:co:nb:pla:hp_laptops&gad_source=1&gad_campaignid=21768694499&gbraid=0AAAAAD-acddZ-mzgOdlTl-W8xqiUILeGc&gclid=CjwKCAiA8bvIBhBJEiwAu5ayrOGzxT86LgMavmaV8h0M8wO4U0FqcUac6G8UzAeIDIqOD3PoSsQ_nhoCfyEQAvD_BwE I gonna pick this one up",
  "Yeah, seems like you might have different needs, so glad I could help you understand in advance how this trackpad works.   I prefer my arms at about a 90 -120 degree angle and with a 30in high desk, for me the best way is with a bluetooth mouse and keyboard on a tray mounted on an arm under my desk.  Using a laptop fulltime without the screen and keyboard at proper height can result in neck, shoulder and wrist strains (been there).  If you don't have the luxury of a good setup, then pick the best laptop that works for you.  I believe Microsoft Surface, new Dell XPS and some Lenovo models have the haptic keypad.",
  "do you know if they regularly restock their laptops?",
  "For an upgraded version, Best Buy is at $999.99 with 32 GB RAM, 2TB SSD, 3k screen, and 16 inch, with intel ultra 9 processor",
  "Docked, I use a monitor above my laptop monitor to solve the neck issue, but I use my portable ergonomic split keyboard at all times, sitting right on top of the laptop keyboard. In my case, I need to be portable very often, so the trackpad matters. Mice are a gaming-only accessory for me.\n\nI feel stuck on Apple laptops. After 20 years of this, I’m really tired of the Apple desktop ecosystem and really want off of it. I’ve been eyeing non-Apple laptops for 4+ years, but just can’t seem to find a good fit. There’s always some catch. This is frustrating.",
  "Bought one yesterday.  Out of stock online, but in-stock in several local warehouses, saved $15 shipping and handling.",
  "Just picked one up at my local Costco in Massachusetts.  They had 4 in stock!",
  "it's in stock again.",
  "I just bought the ultra 7 because I hear it's actually better battery life wise than the 9",
  "I feel the same way man. trackpad is super important to me",
  "Maybe check out the ThinkPad X1 Carbon Gen 13, Microsoft Surface 7th edition or Dell XPS 13 if you need the haptic keypad",
  "Too small. I need a 15+ inch screen with a high resolution. The ThinkPad X9 15 seems to fit the bill; I’m very close to buying it, despite the (in my opinion) ridiculously high price.\n\n15+ inch laptops almost always have non-centered trackpads in the non-Apple world.",
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "Lenovo Thinkbook 16p Gen 6 (2025) Hello everyone, for those who have the Thinkbook 16p Gen 6 (2025), can you give us a brief review on perfomance, display, keyboard, constructive quality and of course.. some photos?\nThank you",
  "Hey recently I bought it from china will use it and let yall know \n\nSpecs \nUltra 9 275HX\n32Gigs of ram\nrtx 5070\n1 tb ssd",
  "I am also interested to know more about this product.",
  "Greattttt",
  "Hey so here are my thoughts on my laptop.\n\nI also do not know anything about its gaming capabilities as i have only played Forza horizon 4 on it and its an absolute breeze but I believe the 5070 will hold up\n\nSo my main use case is on Ansys mechanical and Optislang so I don’t find delays of any sort and also when using the GPU acceleration my simulations run pretty quickly as compared to my previous laptop which had a i5-1240p with no graphics card and the difference is astronomical especially all CAD tasks are smooth as butter with that said I do feel that the battery like could be improved as on a single charge it only lasts about 4.5 hours  and prolly 6 hours of light usage and also the magic bay i have not used it but i feel it is not really required.\n\nThe build quality is top notch\nThe keyboard is also good but not thinkpad p1 level \nAnd display is actually pretty good\n\nAlso there is little to no thermal throttling so far and the fans don’t even spin at light use cases\n\nAnyways my verdict is that it’s a really good laptop go for it if your budget allows you to. It costed almost  $1900",
  "Thanks for sharing! Can you add a photo or better a video of it just to see IRL how does it appear?",
  "Sub recommendation for full post :) r/LenovoThinkBook",
  "New Lenovo Chromebook Plus 14 Review: The laptop for most people This is my review of the new Lenovo Chromebook Plus 14, which has been hyped up as the “supreme being” of Chromebooks thanks to the new MediaTek Kompanio Ultra chip. I’m just a regular tech nerd who loves Chromebooks but can still look at things objectively, especially when something costs close to $800. This is an honest review, no marketing fluff of just reading the specs. I do reviews as a hobby because I genuinely love tech and enjoy spreading the gospel.\n\nWhile I was overall impressed, I think this machine is overhyped, mainly because of the chip. It’s not quite ready for the big leagues in some areas. I’m coming from using devices like my Galaxy Tab S9+ with the Snapdragon 8 Gen 2, which **EATS UP** anything I throw at it (AI, photo/video editing, multi tasking, video calls). That’s my dream: give me that level of power from a Galaxy Tab S series in a Chromebook with a great keyboard with zero compromises.\n\nSo here’s my category breakdown after using the Lenovo Chromebook Plus 14 for a week, alongside my trusty daily driver, the [HP Chromebook x360 14c](https://www.aboutchromebooks.com/hp-chromebook-x360-14c-first-impressions-great-build-quality-in-a-smallish-high-performing-package/) (i3/8GB RAM), which is still a beast since 2021.\n\n**-----------------**\n\n# 🔧 Build & Design\n\nThe Lenovo is thin and light, but solid. It gives off premium MacBook vibes in build quality, especially when typing. It's so light, it almost feels like a dummy unit, but clearly isn’t. It definitely feels like the next generation of Chromebook hardware.\n\nOnly downside? The bottom is plastic, so it lacks that full premium unibody feel. But unless you’re carrying it around a lot, it’s a non-issue. People mentioned keyboard flex but I didn’t experience any in daily use. And I’m a weightlifter and former lineman with 10.5-inch bear paws. I only got flex when I intentionally tried to flex the keyboard by pressing hard.\n\nThe hinge is firm, you can’t open it with one hand, but once open, it holds its position perfectly.\n\nCompared to the HP 14c, the Lenovo is a little longer and wider but way thinner and lighter. My HP is a full aluminum tank, it’s been a champ for years. The Lenovo feels like it’ll hold up, but its lighter build will need to prove itself over time.\n\nhttps://preview.redd.it/7cx1remd5ugf1.jpg?width=3946&format=pjpg&auto=webp&s=88fc512c4967fd3d9b6ea3b537f575ffb690dff4\n\nhttps://preview.redd.it/8m1a8ard5ugf1.jpg?width=3924&format=pjpg&auto=webp&s=efab4b1846b64e7727b72556ddd716a9c3daaf11\n\nhttps://preview.redd.it/cdn5xkwd5ugf1.jpg?width=4000&format=pjpg&auto=webp&s=665327d55e809b4a4685834ce4593af80b4fe985\n\n**Build Grade: A**\n\n**-----------------------------------**\n\n# 🔋 Battery Life\n\nLet’s be real: I never got anywhere near the advertised 17 hours. But that’s OK, because I still got a solid 9–10.5 hours under heavy, real-world use:\n\n* 20–30 tabs open\n* Zoom app + Teams (web)\n* YouTube music streaming\n* Constant typing\n* Screen at \\~70%\n\nCompared to my aging HP, which lasts about 4–5 hours now, this is a major win. For comparison, the [HP Dragonfly Pro ](https://www.aboutchromebooks.com/hp-dragonfly-pro-chromebook-review-the-pixelbook-of-2023/)from 2023 with an i5 is the worst battery life I ever had on a high powered Chromebook that gave me a max of 3 hours. That thing didn’t last the weekend before it went back.\n\n**Battery Grade: A+**\n\n**-------------------------------------------**\n\n# ⌨️ Keyboard, Trackpad & Fingerprint Reader\n\nTyping on this was a breeze, even with my bear paws. No real keyboard flex during regular use. The keys feel a little shallower than on the HP 14c, but once I got into a groove, I had no complaints.\n\nTrackpad is large, smooth, and accurate, feels close to a MacBook in responsiveness. No lag, no misclicks.\n\nThe fingerprint reader? 🔥 One of the best I’ve used on a Chromebook or any computer. I tried to fake it out with weird angles and different parts of my finger, but nope, still unlocked instantly.\n\n**Grade: A**\n\n**----------------------------**\n\n# 🔊 Sound & Speakers\n\nThe Dolby-branded speakers had me hopeful, but they’re great for a Chromebook, but average overall. My HP PC from 2013 would blow these out of the water, so it's nothing special there. They do have more depth than 99% of all Chromebooks and are a little louder overall, it's still Chromebook speakers, so they are decent in a small room.\n\nThe HP DragonFly Pro was also hyped up to have amazing speakers, but again, good for a chrombook, but in real-world usage, they are just ok.\n\n**Grade: C overall | B+ for a Chromebook**\n\n**--------------------------------------------------**\n\n# ⚡ Chip & Performance: Kompanio Ultra 910\n\nHere’s where the hype train slows down.\n\nIn benchmarks (Jetstream, Speedometer), this chip was twice as fast as my HP’s i3. In real-world use? Not really. It’s only slightly faster, like a 0.5-1 second lead in page loads, even for heavy sites like ESPN and data heavy Google Sheets.\n\nYes, it wins technically.... but it was often a photo finish.\n\nhttps://preview.redd.it/erj1q9w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=e9612c64acde7e2224c924ad258d9bfc6a111dcc\n\nhttps://preview.redd.it/u0brf8w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=0cad7a55498ced4378d570f2a42a10285385f394\n\nI **ran into consistent problems** using Teams in the browser. Video calls would freeze, the screen would stutter, and it even blinked to black unless I turned off the camera. Reddit confirms I’m not alone on this. Zoom (via app) worked fine, but Teams was rough. No such issues on my HP.\n\nBut, the Mediatek chip does allow you to download ALL of THE APPS in the Play Store, which opens up the full world of Android on your Chromebook. The i3 in my HP doesnt allow that, and each day more and more apps that I could download are no longer supported, so that gives it the edge to usher in the full Android Laptop experience, as some of the apps would be better on a full-screen computer with a keyboard compared to the phone.\n\nI tried video editing on the Lenovo using my favorite video editing app on Android called [InShot](https://inshot.com/), and it temporarily presented a dream come true, to have InShot on a laptop, not a tablet with an added on keyboard, where I could edit videos comfortably on my lap. But then I tried to edit together 4 different 15-second 4k files, and that's when it went to crap fast. As soon as I added in a transition, it became super laggy and jittery, and adding in more transitions and text almost made the computer quit. So video editing on the Lenovo is not ideal.\n\n**Video editing on this is about as good as a groundhog trying to make a beaver dam; it looks like it should work, and has the same shape and characteristics, but no, it won't do at all.**\n\nAI features like background blur or object removal? Not there yet. Definitely nowhere near Galaxy S phones or tablets.\n\nMy last point about the chip is, why not use past (1-2 year old) true flagship chips that can do it all, like the Qualcomm Snapdragon 8 Gen 2 (from the Galaxy Tab S9 series)? If they are going to charge such a premium price and say it's because of the chip, bring in a true elite chip that can handle everything like AI, multitasking, video editing, and more, all at the same time, and then Chrome OS would be a monster.\n\n**Grade: B**\n\n**--------------------------------**\n\n# 📺 Screen & Camera\n\nhttps://preview.redd.it/8ualptw55ugf1.jpg?width=4000&format=pjpg&auto=webp&s=23693f067cae0fa1665c752c8052afbdcf8eb7f5\n\n\n\nNow this screen, WOW. It’s a 2K OLED panel that’s absolutely beautiful. I watched an [8K Planet Earth video on Youtube](https://www.youtube.com/watch?v=6JWxHy0C_pI&list=RD6JWxHy0C_pI&start_radio=1) and it felt like I could reach into the screen and touch it. The best screen I’ve ever seen on a Chromebook. Also, they list the Lenovo at 400 nits, but it feels much brighter than 400. I kept the screen constantly at 60-70% and that was perfect for me in all of my use cases.\n\nBUT… a few things:\n\n* Some images/web pages looked oversaturated\n* No screen tuning or adjustment in ChromeOS\n\nThe camera is also surprisingly good. Not Galaxy Ultra good, but very usable for video calls even in tricky lighting.\n\n**Grade: A**\n\n**------------------------------------**\n\n# Final Thoughts\n\nThis is a great machine and a peek into the future of Chromebooks, especially with ARM chips. The design is sleek (though I wish they offered a deep gray or navy blue), the screen is stellar, battery is excellent, and it handles most tasks with ease.\n\nFor most users who use nothing but web apps (Google Docs, Office, email, YouTube) this is more than enough. People spending $2,000 for email machines should seriously consider this and Chrome OS as an alternative.\n\nBUT… looking at the complete picture of the Lenovo Chromebook Plus 14, this would be the no-brainer recommendation of the year (for any laptop, especially a Chromebook) at $500, as $750 feels like a reach when you can get a MacBook Air for $850. If Best Buy does their normal act of putting this on deep discount after a couple of months, and this goes down to $450-550 for a new one, **run**, don't walk to get one if you need a new laptop. At that price, this is the no-brainer Chromebook of the decade.\n\n**Overall Grade: B+**\n\nMe and my bear paws are off to test the next device.",
  "This is cool, but for $800, it better deliver without hiccups. Why risk it when you can grab a MacBook Air for a bit more?",
  "I have found my LCP14 to be fast, but I think the glowing performance reviews may be a bit overstated. I get some freezing/non-loading tabs with maybe 7-10 open (some of them being Google Docs or Gmail), which was unexpected. I also noticed it can't handle 16k (4320p) videos with 60fps on YouTube—not that this is a dealbreaker by any means, but I was still surprised. I typically use that as a test for a machine's horsepower.\n\nI assume all this has to do with the ARM processor and the extended battery life, which may come at a cost. The above tasks would never challenge my HP Elite Dragonfly Chromebook, but that machine had historically bad battery life. Overall, I'm happy with the LCP14 so far, but I thought I'd add this context.",
  "This is the review I've been looking for and have been going back and forth with a MacBook Air for the exact reason on price. I don't want to switch my ecosystem so I'll wait for a sale. Thanks for your hard work!",
  "Great review, thanks a lot. Very well written and exactly what I was looking for.\n\nEdit: I have one more question. How well or poorly does the touch display respond? And were you able to test Android games on it? Did they run better or worse than on Intel devices?\n\nTwo questions. Those were two questions. Sorry.",
  "Thanks for the insightful review! One question though, as I couldn't find this information anywhere. How far does the screen open? Maybe show pictures of maximum opening angle or a value in degrees would be fantastic :)",
  "[deleted]",
  "Well for those of us who love Chrome OS, its an alternative to Windows that faster and lighter, but as you mentioned for this price, it needs to be flawless, or we can grab a MacBook \n\nLike I said, for around $500 this is great, at its current price and chip flaws I see why people are taking it back (I have seen this a lot on here)",
  "See, you are a person who has actually used the machine and not just had one tab open and is hyping the machine up.   The Lenovo is fast, but the jitters and lag it has when doing real-world stuff are unacceptable for me at that price.  As I said, comparing it to my HP Chrombook with an i3 from 2021, they are neck and neck in real-world speed tests, but the i3 never stutters with 20 tabs open, playing 4k videos, and video calling at the same time. \n\nYes, the battery life is not great on my older HP, but I never experienced any hiccups like I did on the Lenovo, just doing what we have come to consider basic things, like video calling, when the Lenovo about aborted on me. \n\nI think the Mediatek chip is ok, but it's not as powerful as they make it seem.  As I said in my review, they need to take older top of the line chips like thise from a Galaxy s tab and put it into the Chromebook so that it cna do EVERYTHING with ease, and then it will be perfect.",
  "So which one are you going to get, the MacBook or the Lenovo?",
  "Thanks, I appreciate you!!\nThe touch screen is amazing, no issues the at all and it was good to use at times for certain things but it does leave a lot of smudges on the screen. \n\nGaming I don't do, but there's a video by Lon Sibon on YouTube that he talks about gaming.  Again I'm not sure how it will hold up because the chip is not as strong as they make it seem, you can download all the apps yes, but raw power is questionable in real world use cases as I mentioned.",
  "It goes all the way flat, or 180 degrees and the hinge is very firm  \nThis is not a convertible.  But, Acer is launching a 514 chrombook plus with this chip in it next month that will be a convertible and I think they will have he chip tuned better than I experinced on this Lenovo",
  "I agree with you, and the fact that the chip was struggling with certain task makes it even worse \n\n$450-500 it's a steal, but anything above $550 is a no",
  "I'm leaning Lenovo because of the ecosystem, but the m3 or m4 MacBook Air is on sale for ~$800 and seems like it would have better longevity than what the Lenovo may have (both based on past experience). I have a Lenovo duet 5 now which I love but the snapdragon is feeling a little long in the tooth when I have more than a few tabs open.\n\nI guess my heart says Lenovo but brain said MacBook Air.",
  "Thanks a lot for the feedback! 180 degrees would be perfect for me. I got a Acer Spin 513 (the one with the previous top ARM model) which is a convertible, but it turned out I hardly use it as a tablet. 95% only as a laptop. Having good speakers is a great bonus for the Lenovo for me, as well as a bright screen. Don't need maximum power as for heavy workload I want to rely on remote desktops.",
  "Check your local best buys, in my area (SE Michigan) the Lenovo is on BB as a used excellent for $530 which is the right price point. So see if you can find one in your area for that price",
  "Unfortunately not near me but I'll keep an eye out.\n\nWhat do you think the chances of the kompanio lasting close to apple silicon?",
  "Not sure, thats a ChatGPT quesiton lol \n\nHappy hunting, hopefully you can find one soon.   I hear that they are high-end Chromebooks with Spandragon x Elite processors coming; I'm hoping they are here just before the holiday season.",
  "Ended up with the m4 MacBook air. It went on sale on Amazon for 750(!) and I can't find the Lenovo near me. Also mixed in the surface laptop for fun but the air just seems too good. Thanks again for your help!",
  "Can i get anymore less than this? [Lenovo thinkpad 16 / amd ryzen 5 7535hs] And also how can I claim GST on this?\n\n\n",
  "You can still use a bank card for even more discount, mostly axis Bank and some low level banks offer better discounts like up to 2,000-4,000 on a certain percentage and limit. After that you can also check for gift cards or any offers from the site where you are purchasing.\n\nPersonally this is a lot cheap for the laptop, even with the bag and you should check for accessories combos which will really help you out in the long run. Mostly check for these accessories- Mouse(type-c charging), Mouse pad, Laptop stand, Pendrive. Although these are not much important but you can have them if your budget allows to.\n\nMost important- Warranty should have a minimum of 2 years and 1 year ADP + If you want then just add 1 year additional, no need for 2 years additional. I had made this mistake and did not get ADP. Now I have to pay half the price for my laptop just to get the display repaired.\n\nADP is Accidental Damage Protection, this is in case like the laptop gets dropped by you, water gets in or the laptop falls.This may not sound important but companies get you here to pay for repairs, I had made the mistake myself that is why I don't want others to make this mistake. This happens a lot in the first year of ownership so that's why ADP is important",
  "This laptop is not mostly recommended but is a good balance between side features, performance and value for money",
  "Why dont u recommend this laptop? I'm in a plan to buy it",
  "The one I am speaking about?",
  "But why?? Can u say some reasons",
  " If you put in more you can get a better option, and if there is no gpu then you can also get an oled which will make a real difference. The processor is good but not strong and the combined integrated gpu cannot handle heavy tasks and the battery size is also too small for it's price range.\n\nYou can find Asus or acer laptops that give better value for money, if you want I can recommend you better ones but they will go to 60k and there can be a gpu or not",
  "The best website to find laptops in India currently is 91mobiles,  they have every detail of everything you need to know about your laptop if it's there",
  "I don't hate his selection, the laptop is really nice but still there can be better options",
  "Yeah this is not a good price to performance ratio because it's not a consumer  laptops.. They are buisness grade laptops slightly less durable when compared to ThinkPad series.. But yeah I agree it doesn't perform like the consumer laptops and display isn't that good..",
  "Bro could you mention the better options. I am also looking into this laptop, and don't plan to buy another anytime soon so I'd love more suggestions",
  "If you want,then you can find a laptop at your budget at the website 91mobiles. This is not a sponsorship but just a recommendation",
  "Also I said to forget that my max budget is 45k .... And thanks for ur suggestion too",
  "I have messaged you privately, check",
  "did you end up buying laptop? If yes, do you mind sharing which one ?",
  "HP ProBook or Lenovo Thinkbook? Hi all! I have a chance to get for free one of these three laptop models and I have absolutely no idea: below you can see two models of Lenovo ThinkBook and one of HP ProBook.\n\nI need the laptop for basic things: internet websites and social media, Youtube, some streaming apps from time to time, all MS Office (Word, powerpoint, etc), BUT also I am interested in editing videos occasionally for a YouTube channel project. Will any of these models make it alive if I install Adobe Premier? Will it be possible do it at least slowly?\n\n  \n1) Laptop Lenovo ThinkBook 16 G7 ULT5 16GB 512GB WIN11PRO EDU\n\n[https://insgrafdigital.pl/Laptop-Lenovo-ThinkBook-16-G7-ULT5-16GB-512GB-WIN11PRO-EDU/1123857/INS01019](https://insgrafdigital.pl/Laptop-Lenovo-ThinkBook-16-G7-ULT5-16GB-512GB-WIN11PRO-EDU/1123857/INS01019)\n\n2) Laptop Lenovo Thinkbook 14 G8 IAL U5 (Core U5 225U) 16GB 512GB WIN11PRO EDU\n\n[https://insgrafdigital.pl/Laptop-Lenovo-Thinkbook-14-G8-IAL-U5-Core-U5-225U-16GB-512GB-WIN11PRO-EDU/1123900/INS01021](https://insgrafdigital.pl/Laptop-Lenovo-Thinkbook-14-G8-IAL-U5-Core-U5-225U-16GB-512GB-WIN11PRO-EDU/1123900/INS01021)\n\n  \n3) Laptop HP ProBook 465 G11 1TB\n\n[https://insgrafdigital.pl/Laptop-HP-ProBook-465-G11-1TB/1123892/INS01020?c=7621](https://insgrafdigital.pl/Laptop-HP-ProBook-465-G11-1TB/1123892/INS01020?c=7621)\n\n  \nI hope you can help me please! I'm afraid none of them will be good for editing.\n\nMany thanks!!\n\n",
  "Video editing would be OK on any of them with enough RAM and so long as you're not doing 4K or something. If you're doing 1080p or even better, 720p you'd probably be OK, although I'd still want to go up to at least 32GB RAM.\n\nIf you want to do 4K, you really 32GB to 64GB RAM and a better GPU.\n\nThey will absolutely work, but as you, maybe a bit slow. If you upgrade the RAM, they'll probably be OK.\n\nI used to do a bit of video editing on a 2015 MacBook Pro with 8GB RAM, and all those laptops absolutely demolish that computer in terms of performance, so you'll be OK.",
  "So, from a strictly performance standpoint for the CPU:\n\n225U > 125U > 7535U\n\niGP's performance:\n\n225U > 125U > 7535U\n\nBattery life, if all else were identical:\n\n225U > 125U > 7535U\n\nI have the 255H version of the 14 G8 IAL, and I have the 7735U 445 G11.  Probook is definitely superior build quality, but it's not like some night and day difference.\n\nDespite the Core Ultra's being better on battery (but not by a lot), the Probook will EASILY get the best battery life due to the 45wh vs. 56wh batteries.\n\nDisplays are effectively identical.",
  "Which of these two Lenovo 16\" laptops is the better long-term choice for my wife (office + PhD work)? Hi everyone!\n\nI’m choosing a laptop for my wife, and I’d love unbiased advice from people who used these models in real life.  \nQuick context: she uses the laptop mainly for Excel (large sheets), Teams, PowerPoint, academic research, and writing (PhD). Battery life and long-term reliability are important. I want something that will last many years rather than a quick 2–3 year replacement. She does everything else on her phone, so the laptop will be used solely for academic work. She also needs lots of storage for research materials (mostly video), but I’ll handle that by adding a second M.2 SSD (2–4 TB).\n\nTwo options I’m comparing (basic specs, no links):  \n1) **Lenovo ThinkBook 16 G8 (SKU 21SHA02PPB)—Intel** Core Ultra 5-210H, 16 GB DDR5, 512 GB SSD, 16\" WUXGA (1920×1200), 300 nits. The listing doesn’t clearly state the battery for this SKU; it could be 45 Wh or 71 Wh. Price \\~€636\n\n2) **Lenovo ThinkPad E16 Gen 2 (SKU 21M5001YPB)—AMD** Ryzen 5 7535HS, 16 GB DDR5, 512 GB SSD, 16\" WUXGA, listed battery 57 Wh. Price \\~€871\n\nThanks in advance; please enlighten me with your superior experience; I’ll gladly follow the community’s judgment.",
  "The Thinkbook with the Core 5 is almost two years newer for less money, so I'd probably go with that unless something about the design is just awful.",
  "Performance wise the ThinkBook is the better choice. However, I would advocate for the ThinkPad E16. While I only have experience with IdeaPad Pros and ThinkPads, I would say the ThinkPad will be the longer lasting choice. Build quality is better, more sturdy.",
  "Better get laptop used intel lunar lake processor for long battery life.\n\n[https://youtu.be/6HucWc7ThRY](https://youtu.be/6HucWc7ThRY) \n\n[https://youtu.be/cCGxNbFS9fc](https://youtu.be/cCGxNbFS9fc) \n\n[https://youtu.be/SlXYkamYdxY](https://youtu.be/SlXYkamYdxY)",
  "Buy the longest warranty directly with Lenovo, including accidental damage repair. Depot repair is around 10 days in Canada and probably quicker in the US. It was worth every penny for me.",
  "How about E16 gen 3 with Ultra 5 225U and 64Wh battery? ~€1070",
  "That seems like a very solid choice to me. They aren't cheap, but I have been very happy with every ThinkPad I have owned.",
  "Lenovo Legion 5i Gen 10 vs HP OMEN 16 Hi everyone, I wanna buy a laptop and found two options. I am an engineering student, doing my masters so I have a lot of modelling and simulation softwares which are quite heavier now. I don't play games much but I know if I will have a good machine, I will utilize it for gaming as well. So from the 2 options I selected as per my budget, I need suggestion. \n\n1: The first option is Lenovo Legion 5i Gen 10 (15\" intel) which is available at official website. Price is 1138 Euros for this machine.\nhttps://www.lenovo.com/at/de/p/laptops/legion-laptops/legion-5-series/lenovo-legion-5i-gen-10-(15-inch-intel)/83lycto1wwat1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=at:sem:119r6x&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612285964&gbraid=0AAAAADoYsTVG9sdrCzi93so9m2w4gXDwe&gclid=Cj0KCQiAiqDJBhCXARIsABk2kSlKRsr_RiRusec7INrkd4sG6viELtR1VLEbSAWZcFR1yyep4YEvLpUaAql9EALw_wcB\n\n2: The second option is HP OMEN 16-am0172ng. Price is 1099 Euros but this product is not available on the official website. So I have a little bit doubt in buying this. That's why I also appreciate if somebody has a prior experience of buying with this website.\nhttps://www.notebooksbilliger.de/hp+omen+16+am0172ng+888658?nbbct=6202&adid=782264824441&targetid=pla-2439679617521&device=c&cid=23224079894&agid=191137948074&pid=888658&kw=&kwmt=&kat1id=&kat2id=&gad_source=1&gad_campaignid=23224079894&gbraid=0AAAAADnfZYfgAQgHB6lEOEnvB89aX5TpG&gclid=Cj0KCQiAiqDJBhCXARIsABk2kSlSnpncgvJFfJdxBUCCbLQyuUDULx5yKGXQtk6rROzMQl-EUsHXD2UaAs2gEALw_wcB\n\nFor HP OMEN, I think it is better in every aspect. Just not sure about the display and also want some reviews for the built quality of both. \n\nThanks in advance for your guidance. ",
  "Best laptop stand for a 16\" Lenovo ThinkBook (2kg) without external keyboard? Hi all,\nI’m using a Lenovo ThinkBook 16\" that weighs around 2kg. I want a laptop stand that’s stable, ergonomic, and comfortable to type on since I won’t be using an external keyboard. If anyone has good suggestions for stands that work well for this kind of setup, please share.",
  "I like the metal feet from the first pic. I have them on 2 laptops and they are pretty convenient. ",
  "https://a.co/d/9Q3k86x\n\nMOFT one is good",
  "A better financial decision would be to buy a laptop cool.\nU can get a cheap one for around 400 to 500 rs.\n\nAnd your laptop can be placed at an angle and it can be used on ur bed/laptop without blocking the intake/outake system.",
  "Thanks man 🙏 ❤",
  "Hey i use my laptop mostly on bed idk which stand should I buy , laptop is 15'6 inch 2.1kg any recommendations",
  "3rd one seems nice, it has a good number of positive reviews.",
  "HP ProBook or Lenovo ThinkBook? Hey guys,\n\nAt work they gave me a list of laptops to choose from, and by a process of elimination I’m down to these two options:\n\n* [HP ProBook 4 G1i 16 inch Notebook AI PC (C67JGET)](https://www.hp.com/pt-pt/products/laptops/product-details/2103334327)\n* [Lenovo ThinkBook 16 G8 IRL - Model 21SH0081PG](https://psref.lenovo.com/Detail/2687?M=21SH0081PG)\n\nWhich one is better? Most of my work involves emailing and opening some Excel files, but in the future I’ll probably keep the laptop for personal use as well. I also like to play some games (I’m aware it’s not a gaming laptop), but just light online games that aren’t very demanding. Given this context, which option suits me better? Which is the better laptop overall?\n\nFrom what my colleague told me, the HP one has AI features and better battery life, does that make a difference in any way? I currently have a Lenovo and I’ve really enjoyed working with it and its design.\n\nThank you and have a great day!",
  "Planning to buy above Lenovo ThinkBook 16 laptop. Any suggestions? ",
  "Advice on Lenovo ThinkBook 16 AMD Ryzen 7 7735HS - 21 MWA0R4IN ",
  "College Laptop: Lenovo Think pad Vs Mac book I’m heading into college this fall and looking for a laptop that can last me at least 4 year, ideally all the way through a master’s program. I’ll be majoring in Psychology and possibly minoring in Criminology.\n\nAfter doing some research, the two laptops that keep coming up are the MacBook and the Lenovo ThinkPad series. I've narrowed it down to two models that are within my budget, but I’m really torn between them:\n\n1. MacBook Air M4 (2024)\n   * 16 GB RAM\n   * 512 GB SSD\n   * macOS\n2. Lenovo ThinkPad P14s Gen 5 (AMD)\n   * AMD Ryzen 7 PRO 8000 Series\n   * 32 GB RAM\n   * 512 GB SSD\n   * Radeon 780M graphics\n   * 1920x1200 (WUXGA) display\n   * Windows 11 Pro\n\nAlso, if you have other recommendations in the same price range, I’m open to suggestions!\n\nThanks in advance!",
  "Thank you for the inputs I decided to get the Macbook air",
  "1) If you look at the Mac, you probably want 24GB or 32GB as the RAM is not upgradeable if you buy.  If you have to, get a smaller SSD to make up for some of the cost difference - it's much easier to live with a smaller disk as you can move stuff off to external media.\n\n2) You can safely get 16GB with the Lenovo right now, as it's got socketed RAM and 16GB is enough right now (it may not be if you plan to keep the same machine for all four years.)\n\nOther thoughts:\n\nHow much does battery life matter?  The Mac will have hugely better battery life. The P14s is a nice machine in many ways, but it does not have particularly good battery life even by PC standards (and the AMD processor, while quite powerful for a thin and light PC, doesn't help)\n\nDo you game any?  The Lenovo will be way better for gaming, both because of Windows, and while that's not really gaming GPU, it's still a bit better.\n\nOtherwise, get what you're used to and are comfortable with.  If you don't game and you don't use Windows a lot already, they're both very solid system for what they are.  \n\nThe screen is brighter and has better color reproduction on the Mac. The size is bigger on the Lenovo, which may be easier to read/give you more space to work.\n\nThe keyboard style is quite different between the two, which may be worth checking out in person.  Some people like one better, some the other, and anyone who says one or the other is better for everyone is selling something.\n\nThe X1 Carbon, T14s, and T14 from Lenovo are all very similar models, likely in a (somewhat) similar price range, and potentially worth looking at. Dell's comparable models are the Dell Pro 14, Dell Pro Plus 14, and Dell Pro Max 14.  All likely in fairly similar price ranges.",
  "Both fine. If you're not into apple, choice is obvious. You might be interested in comparing display specs in detail",
  "A ThinkPad is going to be significantly cheaper and will most likely last longer. You can find quite a lot of them on Ebay, even if you buy it with specs you dont see good enough, you're free to upgrade as you like (except for CPU/GPU mostly)",
  "\\---You either get MacAir for that $1200 range budget, or get a same good windows laptop at least 200-300 cheaper with bestbuy openbox.\n\n  \n\\---You will need a lot of readings, so battery and screen resolution is the key. 1920x1200 in 2025 is utter trash, those belong to $500 laptop section.   \nMac would be the perfect choice since you are not enginnering/CS major. You won't have weird programs that Mac can't run. It's resolution + battery is the king of literature focused majors. \n\nIf go for Windows, at least get QHD, Lenovo Yoga 9i (2024) 2.8K OLED openbox sale always go below $1000. \n\n\n\n\\--16GB is 100% enough for your majors, same thing in 5 years. Web browser, pdf reader, statistics softwares they are legacy softwares, they won't magically eat up ram in 5 years. Stop taking weridos advice here saying you have to get 32GB. In their head, everyone is running machine learning, 4K video edting, have 30 tabs open, have a virtual machine at the back. Remember, reddit is gathered with extreme people. 90% of the users say they might need, don't actually need 32GB. \n\n  \n\n\nThe concept of future proof is very naive. Why? Because even if the ram happen to be enough, the other things will be behind in 10 years and you can not predict.   \n\nThe best way to future proof is keep buying up to date 1 year behind laptop on discount every few years.\n\nNow a \"future proof\" decked out laptop might cost you $3000, By the time it is 2035, the same spec laptop will be worthless and super slow. \n\nYou better off buy a $1000 decent laptop on sale and invest the $2000 cash into VOO. Use it till it bottle necks in let's say 2031 and then your invested cash grows to at least $2500, get a new one that's from 2030 might cost $1000-1500 and will have same or better specs than that original $3000 laptop. Also keep in mind if you ever break the laptop, you only lost $1000, not $3000. \n\nAs long as you get a good display and refresh rate, color accuracy, there will be no major user experience difference. 32GB is just a trick geeks use to fool the average people. Especially Mac's unified 16GB ram will last till the end of time in psychology, the battery will go out way before ram is not enough.",
  "I've been a Windows user my entire life but picked up my first MacBook last year and haven't looked back once. Unless you're gaming, I'd get a Mac over any offering with Windows for school. That's just me though, to each their own.",
  "Macbook is better overall.\n\nBut the Lenovo is a fine laptop if Windows works better for you.  Lenovo ship spyware so do a full wipe and install if you buy one.",
  "Both nice machines, the Mac will have far better battery life though.",
  "If you're not wanting to get sucked entirely into the Apple ecosystem, go for the Thinkpad. That'll work for Windows and work well for Linux should you decide to try that.",
  "Macbook air",
  "Got it tysm",
  "I have no idea why you would get downvoted for this. I’ve been building computers since my 286 in 1989, and the M-series MacBook Airs have the best price/performance and price/reliability ratios I’ve ever seen in my life.",
  "I thought about the getting a Mac book but a lot of my friends said they hated it and that it breaks really fast is this true? I've heard horror stories.",
  "https://www.bestbuy.com/product/lenovo-yoga-slim-7i-aura-edition-copilot-pc-15-3-3k-120hz-touchscreen-laptop-intel-core-ultra-7-16gb-memory-1tb-ssd-luna-gray/6594998/openbox?condition=0&sb_share_source=PDP\n\nOther than MacBook Air.\nSomething like this laptop would be a very nice fit to your needs. 15 inch screen just like MacBook Air, with 2880x1800 resolution. Intel ultra gen 2 chips with long battery life. \n120Hz refresh rate is same as MacBookPro gives you a way better viewing experience than MacBook Air. \n\nSick price Openbox. Mine here is showing less than $700, almost 50% discount, daylight robbery of a deal. But the specs is equal to a $1000+ laptop easily. You don’t see that everyday.\n\nDave2D has a video talked about this laptop, longest battery even more than MacBook, probably one of the sickest deal you can find for this price.",
  "Also if you have iphone they work like a dream",
  "Neither laptop is going to hold up well if you abuse it.",
  "Macs are generally well built, but have poor repairability, so if something goes wrong, it's a big deal to fix it, sometimes not worth it. They don't have a reputation for breaking quickly, your friends are making that up.",
  "Dude I’m using a 13 year old air. All my pcs have broken, Lenovos included",
  "I’ve had nothing but MacBooks for my personal laptops since 2014, and I’m an engineer, now working on my PhD. I don’t know anyone who would ever believe something as crazy as what you’re talking about.",
  "No macs are built like tanks. I think your friends had experience with intel macs which are truly garbage, but the apple m series macs are crazy good. No im not an apple fanboy I use a windows laptop. You can watch this video to get a better understanding [https://youtu.be/zOgRmw1atFU?si=Nc\\_OMXc596428jCw](https://youtu.be/zOgRmw1atFU?si=Nc_OMXc596428jCw) .",
  "Lenovo ThinkPad or HP EliteBook: I am looking for MAXIMUM long-term RELIABILITY (hinges/serious failures) for Programming. What model do you recommend? I am going to study Programming (Computer Science) and I want to choose a good laptop for my degree. The main thing I care about is that it has excellent battery life and a robust build quality that will serve me for years without a major failure (like broken hinges, audio glitches, or overheating problems that I saw in cheaper models).\nMy Key Minimum Requirements are:\nBattery: I am looking for a capacity of 60 Wh (Watt-hour) or more for high autonomy.\nEfficiency: Intel Core (U Series) or AMD Ryzen (U Series) processor for low temperatures and maximum battery life.\nRAM: 16 GB (or 32 GB if possible).\nI don't care about weight, screen size or aesthetics; just professional-grade reliability and durability.\nI am between the Lenovo ThinkPad and HP EliteBook series.\nAny specific model from these lines that you recommend or, on the contrary, that I should avoid at all costs due to known flaws?",
  "I like metal built, so HP EliteBook. Full CNC aluminium chassis, solid hinge. Another good option from HP is their ZBook mobile workstation, you can choose non dGPU variant for maximum battery life.",
  "Lenovo  thinkpad ftw\nHp is known for their hinge problems",
  "Dell Precision 16 7680 vs Lenovo P16 Gen 3 vs other contenders? — the best bang for your buck for office/business/logistic/investment work. Hello,\n\nMy brother is looking to invest in a new laptop for another few years. Since, he won't be gaming, rendering videos, etc., a dedicated GPU is not a must. Actually it might be even a better option = no overheating, more space inside, etc., but I don't know.\n\nAfter some reading we have opted for those two series, but we're open for any other suggestions as well. From what I've read Dell is not that great and many people hate them, have trouble with them, etc. The guarantee is great though (what I read).   \n  \nIf you have any experience with the current/past series, brand ,etc. every bit of information would be very helpful.\n\nSince he wants this laptop to last him for at least 5+ years, we have opted for 64GB RAM, and some fast CPU to go along with it.\n\nHe browses a lot of carts at the same time, ChatGPT, etc. His current laptop =  \n  \nHP ProBook 470 G5  \n\n\n... is a bit sluggish at times, keyboard giving up, heating up with CPU usage of 100%, you know... your typical bs laptop experience lol  \n\n\nI would call his work he does on a laptop a typical office/business stuff. He works in logistics so he has a few programs opened up at all times as well.\n\nThis is why it needs to be brisk as hell, so he can jump in-between everything without any hiccups./ \n\nWindows 11 will definitely not help with the task, but it's a must.\n\n\n\nGaming PCs are rather easy in comparison with laptops lol. I have no clue about them.\n\n  \nOnce again, any past/current experience, suggestions, info., etc. will be of great help to narrow down some potential.",
  "Current pick:\n\n[https://www.sklep-lenovo.pl/notebook-lenovo-thinkpad-p16s-gen-4-21qr003cpb.html](https://www.sklep-lenovo.pl/notebook-lenovo-thinkpad-p16s-gen-4-21qr003cpb.html)\n\nAny againsts?",
  "HP OMEN 16 VS LENOVO THINKBOOK 16PG5 Which is better?\n\nHello, everyone. I am just gonna dive right in,\ncurrently I don't have a notebook. I have been looking for one for 2-3 months and came down to 2 choices.\n\n1) HP OMEN 16 (2025- I think)\n1920x1200 165hz\nRtx 5060 8gb gddr7\n32gb(2x16gb) ddr5\n83wh battery and 230w charger\nIntel Ultra 9 285H\n2.9ghz base to 5.4 turbo ghz\n16 (6P+10E) cores and 16 threads\nArc Graphics 140T igpu\n1TB & 16 inches\n\n2)LENOVO THINKBOOK 16PG5 \n3200x2000 165hz\nRtx 4060 8gb gddr6\n32gb(2x16gb) ddr5\n80wh battery and 300w charger\nIntel i9-14900HX\n2.2ghz base to 5.8 turbo ghz\n24 (8P+16E) cores and 32 threads\nIntel UHD Graphics 32EU\n1TB & 16 inches\n\nI will mostly play Cyberpunk 2077, Hollow Knight, Silksong, Dispatch and modded Total War Warhammer 3. Maybe Hogwarts Legacy.  I will primarily use this to study and programming in R, Python and Matlab especially during my Financial Mathematics masters and risk management while working for some projects.\n\nI have been reading reviews, user problems and just using every website to AI to choose.\nI used notebook check and nanoreview. Don't know if there is any other good one. I'd appreciate your help. \n\n",
  "Guys I'm facing bluetooth connectivity issue on my new thinkbook 16. What should I do? Is there any way to solve the issue? Totally screwed up! I recently bought a thinkbook on this 27th and I can't connect the bluetooth with my phone's bluetooth i tried with three phones but can't able to connect to any of them. I updated all the windows update, updated the drivers (realtek adapter ) , restarted device and did all the steps. \nCan any of you could solve this issue it would be a great help for me. \nWhat I need to do next are there any other options for resolving this issue or is this some manufacturing defect?\nWhat steps I need to do now?\nDevice: Thinkbook 16 ryzen5 7535hs\nI bought this from Lenovo website.\n(NB:- It's my first laptop",
  "Thinkbook 16 gen7 ryzen 7 benchmarks Hi! Does anyone here can share their benchmarks of this variant? I've seen some people complaning that ryzen 7 is underperforming than ryzen 5 version. And, ryzen 7 ssd read/write speed is way worse. I'd be a huge help! If you dont know how to check then just send me a dm, I'll help. Thank you! ",
  "https://www.reddit.com/r/Lenovo/s/OPFZIh8B5k",
  "Lenovo ThinkBook 14 Gen 6: First impressions I purchased the Lenovo ThinkBook 14 G6, model 21NQCTO1WWBR1 on July 2025 and would like to make my impressions about this product:\n\nDESIGN AND BUILD: We don't have much to comment on the design, as it's quite minimalist. We're surprised that not all the keyboard keys follow Lenovo's signature layout, as is typical on IdeaPads, but at least the Ctrl and Fn keys are in their traditional positions, unlike ThinkPads. The light color isn't bad, but it's a shame there wasn't a darker color option (not black, which is typically only seen on ThinkPads, but a darker gray would have been nice). The touchpad is a good size. We found the number of ports interesting, but the Ethernet port's position wasn't particularly helpful, being on the right side. It's interesting that it also has an SD card reader. The number of LEDs also caught our attention, with one next to each USB-C port, in addition to the power button itself (which we really like being separate from the keyboard). We liked the backlit keyboard and the dedicated \"?\", \"/\", \"°\", and \"Menu\" keys, although they sacrificed one of the Ctrl keys. At least it didn't come with the \"Copilot\" shortcut. We didn't really like the notch in the webcam area and found it a rather questionable design decision, but we understand its usefulness. We also liked that it came without those infamous labels on the palm rest, just the Intel seal.\n\nSCREEN: We liked the quality of the IPS, but we were disappointed that the screen had excessive IPS Glow at the bottom edge, quite visible with the screen on a black background even in bright light. My brother was okay with it, but I didn't like this defect at all, which I'm already accepting is quite common in current LCD screens, as I've also seen notebooks and even smartphones and tablets from other brands with this issue. It shouldn't happen, but we've come to understand that IPS Glow is now part of the experience of having an IPS LCD screen, which is unfortunate. At least we like the thin bezels.\n\nSOUND AND WEBCAM: Neither impressed in any aspect, but neither disappointed.\n\nBATTERY AND CHARGING: The USB-C charger is interesting. My brother tested it by playing YouTube videos in 1080p with maximum brightness, and it lasted over 5 hours unplugged. For a 60Wh battery, it's an okay battery, but it could be better.\n\nPERFORMANCE AND USABILITY: Regarding performance, considering its specifications, I consider it okay. It worked very well even for running virtual machines via VirtualBox. We didn't notice excessive heat on the keyboard when heavily loaded. My brother installed the Big Linux distro, and in testing, it has worked well, including mirroring the laptop screen to our Smart TV wirelessly. My brother was unable to get BlissOS, based on Android 13, to work, as it didn't recognize Wi-Fi, but emulating Android on Big Linux with WayDroid has worked well most of the time.\n\n**Have you also purchased a Lenovo ThinkBook? Share your experiences with it in the comments below.**",
  "Looks cool",
  "I got the same laptop, with 8gb of RAM, and im quite satisfied with it. I use it mainly for college stuff, and it can handle an entire day of coding, browsing the internet and even playing some light games (such as Horizon Chase). \n\nBattery life on it is quite impressive on linux. I get 6-8h of usage with it. That's more than i get with Windows (i have no idea why i just get 3-5 hours on Windows), but i've seen some minor compatibility issues on linux, such as the mute key not lighting up or the volume keys getting \"sticky\" (if i hold it a little bit, it goes to max volume or 0), but overall, the laptop is very usable.\n\nI plan to upgrade to 16gb soon, because on my use case, 8gb is too low, especially when i get 16 tabs open for research + some niche software from 10 years and VScode.\n\nOBS: Você é o CAVBR do fórum Adrenaline, não é?",
  "What cpu is in there? Seems like an older one",
  "So, how are you liking it after 2 months?\nI'm between this one, Yoga 7i and Vivobook s 14, but there are not many reviews on this thinkbook.",
  "Isso mesmo.",
  "Intel Core i5-13420H.\n\nIn other countries, Lenovo has already launched ThinkBook Gen 8, but in Brazil (where I live), curiously, it recently launched Gen 6.\n\nIn fact, while in most countries, they're already launching models with the new Intel Core Series 1 and 2, in Brazil, the number of laptops with Intel Core 13th Gen has now increased.",
  "O meu irmão está usando, e não está reclamando. Só por ter como atualizar os dois pentes de RAM, ficaria com o ThinkBook.",
  "Valeu!",
  "ThinkPad L14 Gen 5 (AMD) VS  ThinkBook 16 G7 ARP Im reallly torn between these 2 cause the thinkpad i really like the aesthethics  but the CPU has a U which means it wont be as powerful as on the other side the thinkbook which has an HS cpu. Idk if its really a significant change but I do a lot of heavy tasks on cpu such as rendering, emulating stuff copying lots of files and my current laptop really struggles with that so I really dont know which one to choose  \nThx for all the help in advance\n\n[Thinkpad L14 Gen 5 (AMD) full Specs list](https://psref.lenovo.com/Detail/ThinkPad_L14_Gen_5_AMD?M=21L5002GSP)\n\n[ThinkBook 16 G7 ARP full specs list](https://psref.lenovo.com/Detail/ThinkBook_16_G7_ARP?M=21MW0042SP)",
  "What are the two cpus?",
  "AMD Ryzen 5 PRO 7535U (6C / 12T, 2.9 / 4.55GHz, 3MB L2 / 16MB L3)   \nand  \nAMD Ryzen 5 7535HS (6C / 12T, 3.3 / 4.55GHz, 3MB L2 / 16MB L3)  \nRespectively",
  "Okay so performance wise you give up about 15 percent in multicore and 5 percent in single core performance with the U chip in exchange for around 30-40 percent less power usage.\n\nHowever with the Hs chip you can always limit the power and gain back the efficiency but you can’t increase the power on the U chips.\n\n\nHowever the gen 5 also has a bigger battery and a better screen so I think the performance sacrifice is worth it for the better quality laptop unless you want the bigger screen of the g7",
  "How is this laptop for CSE student ( Thinkbook 16 AMD Ryzen 7 ) SystemSpecs:\nProcessor\nAMD RyzenM 77735HS Processor (3.20 GHz up to\n4.75 GHz)\nOperating System\nWindows 11 Home Single Language 64\nGraphic Card\nIntegrated AMD RadeonM 680M\nMemory\n16GBDDR5-4800MT/s(SODIMM)\nStorage\n512 GB SSD M.22242 PCle Gen4TLC\nDisplay\n40.64cms(16) WUXGA(1920x1200), IPS, Anti-\nGlare, Non-Touch, 45%NTSC, 300nits, 60Hz\nAC Adapter/Power Supply\n65W\nPointing Device\nClickPad\nKeyboard\nBacklit, Storm Grey - English(US)\nWIFI\nWi-Fi6E 2x2 AX& Bluetooth@ 5.1 or above\nWarranty\n1 Year On-site\nColor\nArctic Grey\nBrand\nLenovo\nScreen Resolution\n1920×1200\nSoftware Preload\nMS Office\n\n",
  "u can get something better",
  "For example ? I have a budget of around 60k Indian rupees ( 680-690 USD )",
  "how much does the ideapad pro 5 and yoga cost for you?",
  "IdeaPad pro 5i costs almost 960 USD \nYoga is also around the same range",
  "Need quick help! ThinkBook 16 vs ThinkPad E16 — Lenovo India sale ends tonight 😭 ",
  "How can I manage temperatures on my Lenovo Legion 5i 16\" (Ultra 9 275HX + RTX 5060) when XTU/ThrottleStop don’t work? Hey all,\n\n**Laptop:** Lenovo Legion 5i 16\" Gaming Laptop — Model 83NX0000US \n\n**Specs:** Intel Core Ultra 9 275HX (24C), RTX 5060 8GB, 32GB DDR5-5600, 1TB SSD, 16\" 2560×1600 240Hz, Windows 11 Home, 80Wh, 245W adapter. Retail listing badge: 4.3/5 (14 reviews). Price seen: $1,499.99.\n\n**What I'm seeing**\n\nAfter about 30 minutes in PUBG, my CPU temps spike to 100–104 °C and I'm getting Thermal Throttling warnings in the sensors.\n\nGPU temps seem fine though (60–80 °C), and my Afterburner undervolt/curve appears to be working.\n\nLenovo Vantage performance profiles change things a bit, but Intel XTU power limits (PL1/PL2) just keep reverting back whenever I start gaming.\n\n**XTU messages / logs I saw (what they mean)**\n\n* **Power Throttled** → CPU is hitting PL1/PL2 (long/short turbo power limits).\n* **Current Throttled** → limited by motherboard/VRM amperage caps.\n* **Thermal Throttled** → CPU reached the temp ceiling (\\~95–105 °C), clocks dropped to cool down.\n* **Graphics Current Throttled** → iGPU hit current limit (not really critical for dGPU gaming).\n\nBasically, power, current, and thermal limits are all kicking in—pretty normal for thin laptops under heavy load.\n\n**XTU \"Import Profile\" error I got**\n\n\"This system does not support importing profiles because certain controls required to permit overclocking are inaccessible.\"\n\nFrom what I can tell, Lenovo's firmware (EC) + Intel DTT lock most tuning controls on this Meteor Lake (Core Ultra) platform. What this means:\n\n* A lot of XTU sliders show up but any changes don't stick (or get overridden when you boot/load a game).\n* Undervolting is blocked (Plundervolt mitigation) on most 2023–2025 Legions.\n* ThrottleStop shows \"CPU not supported\" on Core Ultra → basically unusable.\n\n**My test interpretation (XTU + sensors)**\n\nDuring CPU stress: CPU Utilization = 100%, Package \\~71–74 °C, Power Limit Throttling = Yes, Thermal Throttling = No (in that specific run), P-core max dropped from \\~4.59 → 4.21 GHz.\n\nIn actual games (PUBG): later sessions definitely hit 100 °C+ and showed Thermal Throttling events.\n\nSo Lenovo's firmware is actively enforcing these safety caps (power/current/thermal)—the system's not \"broken,\" it's just designed this way.\n\n**What I've tried / current workarounds**\n\n* **Intel XTU:** Setting PL1 \\~65 W / PL2 \\~80 W → gets overwritten back to \\~120–140 W once gaming starts.\n* **ThrottleStop:** Not supported on Core Ultra → dead end.\n* **Windows Power Options:** Setting Maximum Processor State = 99% (and Minimum = 5%) → disables turbo, drops CPU temps 8–15 °C; 95% drops even more but with a bigger FPS hit.\n* **Lenovo Vantage:** Switching between Performance/Balanced/Quiet helps somewhat (seems to flip hidden PL tables), but there are no raw PL1/PL2 sliders visible.\n* **GPU (MSI Afterburner):** Undervolt/curve works; monitored with HWINFO—voltage \\~0.7–0.85 V, clocks \\~2.2–2.3 GHz, temps 60–78 °C.\n* **Cooling:** Elevated rear / cooling pad → small but useful temp reductions.\n\n**My questions (especially for Legion + Core Ultra owners)**\n\n1. Is there any BIOS or hidden Vantage option on the Legion 5i (83NX0000US) to manually set CPU PL1/PL2 or allow undervolting on Meteor Lake?\n2. Is there a reliable way to keep XTU limits from being reset by EC/DTT when a game launches, or is that just not possible on this model?\n3. Are there specific Vantage profiles (Balanced/Quiet/Performance/Custom) that meaningfully lower CPU power/temps in PUBG without a big FPS loss?\n4. For PUBG specifically (CPU-heavy, and those smoke effects spike the GPU), any settings combo that helps reduce CPU spikes? Like View Distance, Effects/Shadows tuning that other owners recommend?\n5. If the firmware locks are hard, are my only long-term options:\n   * Stick with 99% Max Processor State (no Turbo) while gaming,\n   * External cooling pad / repaste (or liquid metal, if I'm feeling brave), and\n   * Keep using the GPU undervolt for efficiency?\n\n**Extra context on GPU curve weirdness (MSI Afterburner)**\n\nI noticed the curve \"re-draw\" itself after Apply/reboot. From what I've read in community threads: that's NVIDIA GPU Boost doing its temperature/load compensation thing with the 15 MHz step behavior—the offset stays, but the drawn MHz shifts a bit.\n\nEven if the editor looks different later, HWINFO shows my voltage/clock under load match the target I set, so the undervolt is definitely applying.\n\n**TL;DR**\n\nXTU/ThrottleStop are effectively blocked on my Legion 5i (Ultra 9 275HX). PL1/PL2 reset under load.\n\nPUBG pushes the CPU to \\~100–104 °C at times → thermal throttle kicks in.\n\nBest results so far: Vantage profile + Windows 99% Max Processor State (no Turbo) + GPU undervolt + cooling pad.\n\nLooking for any owner-proven methods to tame these CPU temps (BIOS/Vantage tricks, practical PUBG settings) without taking a huge FPS hit.\n\nThanks in advance! 🙏",
  "Maby limit cpu power.. and see if no background things , do you hear loud fans .. so u know fans work.. u can use monitoring app...",
  "Have you found solution and issues fixed or not yet ?",
  "Lenovo Yoga Pro 9i 16 G10 Aura Edition Review with new 1600-nit tandem OLED ",
  "Lenovo Thinkpad E16 OR Thinkbook 16 Which one should I choose for long term professional use in the field of Computer Science where I'll be using tools Programming, Data analytics, Light video editing and gaming. Mainly I am looking for fast multitasking without any lagging.",
  "Avoid the E series, i heard the chassis is awful (not sure if they fixed it)\nhttps://youtube.com/shorts/2ExXkdBkM78?si=fbW3-8Z4f1nScdlx",
  "Get the Thinkpad but with the intel ultra 7 cpu.",
  "Still better than a thinkbook though",
  "Idk, never owned lenovo laptop. What about acer aspire series? They underrated from my use",
  "Thinkpad L16 Gen 1 vs Thinkpad E16 Gen 2 vs Thinkbook 16 G7 IML I'm looking for a new laptop which I will mainly use for internet browsing, Office applications and watching the occasional film. I've narrowed my search down to the three models below. They all have the same processor/memory/storage/display. The main differences are in the USB ports (L16 has 5, E16 and Thinkbook have 4), audio chip/speakers and warranty. \n\nAny suggestions as to which I should go for?\n\n  \n**Model: Lenovo Thinkpad L16 Gen 1**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB SSD M.2 2280 PCIe® 4.0x4 NVMe® Opal 2.0\n\nBattery: 46.5Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Senary SN6147 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Audio™\n\nNetwork Card: Intel® Wi-Fi® 6E AX211, 802.11ax 2x2 + BT5.3\n\nUSB Ports: 1x USB-A (Hi-Speed USB / USB 2.0), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On 1x USB-C® (USB 20Gbps / USB 3.2 Gen 2x2), with USB PD 3.0 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n\nWarranty: 3 years on parts & labour\n\nPrice: €1226\n\n \n\n**Model: Lenovo Thinkpad E16 Gen 2**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB SSD M.2 2280 PCIe® 4.0x4 NVMe® Opal 2.0\n\nBattery: 47Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Senary SN6141 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Atmos®, audio by HARMAN\n\nNetwork Card: Wi-Fi® 6E, 802.11ax 2x2 + BT5.3\n\nUSB Ports: 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 10Gbps / USB 3.2 Gen 2), Always On, 1x USB-C® (USB 20Gbps / USB 3.2 Gen 2x2), with USB PD, 3.0 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n\nWarranty: 3 years on parts & labour\n\nPrice: €1138\n\n \n\n**Model: Lenovo Thinkbook 16 G7 IML**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB M.2 PCIe 4.0 SSD\n\nBattery: 45Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Realtek® ALC3287 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Audio™\n\nNetwork Card: Wi-Fi 6, 802.11ax 2x2 + BT 5.2\n\nUSB Ports: 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On, 1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.1 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.1 and DisplayPort™ 2.1\n\nWarranty: 2 years on parts & labour\n\nPrice: €875",
  "Lenovo IdeaPad Gaming 3 15ACH6 – A review and upgrade path First, I’ll tell you about myself. Mainly because it could help you decide on getting the same or a similar laptop if you have similar needs to me. I’m a mechanical engineering student. Currently, I use CAD somewhat frequently for college and \\*very\\* frequently for personal use, so a dedicated GPU was pretty much necessary. A decently Good CPU was also needed for simulation work and \\*very\\* amateurish programming. Video and image editing are also hobbies of mine, but I don’t do anything extravagant so they weren’t really a deciding factor. I also love to be dramatic and firmly believe I am a professional writer. I’m not, so if you don’t like that kind of writing, I’ll leave a TL;DR at the end of this post.\n\nSo, the laptop. The IdeaPad 3 Gaming I bought comes with a wired RGB mouse I will probably not use (it’s still in its sealed bag), some very disappointing manuals and guides (I just downloaded the actual ones from Lenovo’s site) and a 135W AC charger. Internally, it has a Ryzen 5 5600H, a single 8 GB DDR4 SO-DIMM RAM clocked at 3200 MHz, one 512 GB M.2 Samsung NVMe Gen3x4 SSD (model is MZ-ALQ512B), a Nvidia RTX 3050 4GB and finally a 15.6” 1080p 120 Hz display.\n\nI actually wanted to do this just because of this next section: Upgrades. I’ve always been a sucker for high-capacity drives, so the tiny 512 GB of space made me feel uneasy every single time I thought about my locally stored movies, TV shows, comics, games… Point is: I wanted to upgrade. Problem was: I read online that only the 2242 M.2 slot (the one with the stock SSD) could reach Gen4 speeds.\n\nI’ve also read only that this thing would NOT work with a higher than 512 GB drive on the 2242 slot. I just ignored that and got a 2 TB Crucial P310 Gen4 drive. FUCK. YEAH.\n\nI found it on Micro Center for sale at $149.99 USD too. This is important because my third-world mind was already going crazy inside that celestial store. I felt like I was dreaming in that GPU aisle. The custom keyboards too???? I loved every single plack-time I spent in there. My dad (we were on a business trip btw) was searching for a USB to VGA cable and they had it. WHAT. Who even needs that? Truly, an ascending and heavenly experience.\n\nAnyways. I was very worried it wouldn’t work. I already have a fully functional 2 TB NVMe and a 1 TB SATA drive on my PC, so if this didn’t work I just wasted half my salary in something I would 100% not be able to sell at that same price. Not to mention, I still needed an adapter. This thing is 2230, and if you remember correctly, the slot only fits 2242 drives. So…\n\nI’ll go over how good it performs now:\n\n* Gaming\n\nIn the very few games I tested, it was a very good experience. I mostly play only old games, so this might not mean much to you, but Bayonetta, Sonic X Shadow Generations and Rocket League ran perfectly fine. In Bayonetta’s case, it ran even better than on my desktop -$1200- gaming PC, which honestly doesn’t mean much since it barely counts as running in that system.\n\n* CAD\n\nThe most important thing to me. It runs flawlessly. And now, we go back to the Crucial drive! I designed the adapters using Inventor 2025 on the base laptop (as in “stock configuration”). The only problem I could name is that, for some reason, it takes Inventor like a whole minute to load the first project. Be it a fully finished model or just a blank file. It’s very weird.\n\nAfter finishing the model and getting it printed, I was ready to see if my dumb ass would be enjoying two whole terabytes of data on his new laptop.\n\n \n\nIt. Worked.\n\n \n\nI was so stupidly happy. And you know what? I haven’t mentioned that I also installed two 16 GB 3200 MHz sticks. EVERYTHING WORKED WITH NO ISSUES. It felt amazing. The trip to Micro Center, the fact that I was actually upgrading a laptop, the excitement I felt going into the Amazon Locker to retrieve my shiny new 32 gigs of RAM… Truly a wonderful experience.\n\nAfter I installed Windows I decided to check both drive’s speeds, just to be sure. Another big discovery for us; 15ACH6 owners. Turns out that if you only have ONE M.2 drive installed, the drive will run at full Gen3x4 speeds. The damn manual says it runs at Gen3x2, but that is almost a complete lie. Thing is, if you install TWO NVMe drives, the speeds get halved, effectively functioning as two Gen3x2 slots. I’ll add the CrystalDiskMark results as pictures if you want to check them.\n\nTL;DR\n\nI’m really enjoying this laptop. It’s a very capable device. I can confirm that it supports up to 32 GB and a 2 TB NVMe drive and would recommend having just one of those installed to maximize speeds.",
  "hey man, wanted to say I appreciated this review. It made me decide its not for me, but wanted to thank you for the input.",
  "yo may i ask if u did something for the 32gb ram to work? \n\ni tried changing mine from 24gb to 32gb but it seems to have a problem. i always get a blue screen or sudden restarts.",
  "Nothing at all.\n\nDid you enter the BIOS at any point? There might be some setting there.\n\nYou could also change the RAM slots, clean the contacts and try using only one of the two sticks at s time to verify if they work.",
  "what brand are your rams?",
  "Crucial. It's always my brand of choice, though it shouldn't matter if you use any other brand at all as long as it fits the requirements.",
  "Benchmarks for Lenovo ThinkBook 16 Ryzen 5 7535HS Can anyone share benchmark scores for this laptop (Lenovo ThinkBook 16 Ryzen 5 7535HS,16GB RAM)?\n\n Specifically:\n• Cinebench R23 (single & multi)\n• Geekbench 6 (single, multi, GPU/OpenCL)\n• 3DMark Time Spy\n• PCMark 10\n• CrystalDiskMark (SSD read/write)\n\nThanks!",
  "MacBook Air or Lenovo ThinkBook 16 G8 Hi everyone,\n\nI’m trying to decide between two laptops and would love your input:\n\n1. **Apple MacBook Air 13.6 (M4, 10C CPU / 8C GPU, 16GB RAM, 256GB SSD)**\n2. **Lenovo ThinkBook 16 G8 (Intel® Core™ Ultra 7 255H, 16C (6P + 8E + 2LPE) / 16T, up to 5.1GHz, 24MB cache, 32GB DDR5, 1TB SSD, 16\")**\n\nI’ll mainly use it for programming/development. Heavy tasks like video editing or GPU/CPU-intensive workloads are not important for me. Storage isn’t a big deal either since I can always use an external SSD. I also don’t plan to use it for gaming.\n\n**The critical point is:** I need to connect **two Full HD 60Hz monitors** via an **HP USB-C Dock G5 Essential**.  \nI’m not sure if the MacBook Air can handle this setup or if it would be limited in terms of external monitor support.\n\nWhich one would you recommend?\n\nThanks a lot!",
  "MacBook can support 2 displays. Not that thinkbook... That has a horrible CPU",
  "Should I get a Lenovo think book for urban planning student In UK and im looking for a computer to use for programs like rhino, CAD, GIS, Photosho, and illustrator, I also do some gaming like transport fever or cities skylines.\n\nHow is this one?\n",
  "Also they have one with intel core  9 275HX is it worth it for like +£400?",
  "Intel version is thinner, lighter and have better battery life and there is a better screen option (3.2k) :\n\n[ThinkBook 16p G6 IAX](https://psref.lenovo.com/Product/ThinkBook/ThinkBook_16p_G6_IAX?tab=spec)\n\n[ThinkBook 16p G6 ADR](https://psref.lenovo.com/Product/ThinkBook/ThinkBook_16p_G6_ADR)",
  "Did you buy it ?",
  "Deciding between Lenovo Slim 3i and Asus Vivobook 16 for work Help! I’m looking to get a laptop that costs than $700 CAD for work and I’ve narrowed it down to these options. I have credit from Best Buy so I’m kind of stuck with them. I have a desktop computer which I use 80% of the time but I need a laptop for whenever I go to conferences, do presentations or work outside of my usual space. I mainly need it for Microsoft Office (Teams, Outlook, Excel, Word, PP), Airtable, web browsing. Secondary tasks would be downloading and uploading video files, some video editing on Premiere or Photoshop (I mainly do it on my desktop computer but it would be great to have a backup)",
  "XMG Neo 16 (2025) vs Lenovo Legion 9i (2025) — which one should I get? Hey everyone,\n\nI’m planning to buy a high-end gaming laptop this year and I’ve narrowed it down to two models:\n\nXMG Neo 16 (2025)\n\nLenovo Legion 9i (2025)\n\n(P. S both are the gpus, and 32/64 GB  of ram, while the xmg has Ryzen CPU instead of intel)\n\nWhat I’m looking for:\n\nTop gaming performance \n\nTop performance for 3d content creation, and animation (photoshop, blender, maya, ue5...)\n\nExcelent display\n\nGood thermals and fan noise (doesn’t have to be silent, just not throttling)\n\nBuild quality and long-term reliability\n\nBattery life is secondary, but not terrible would be nice\n\n\nI’ve seen that the Neo 16 has a lot of customization and strong cooling, while Lenovo models seem to have great screens and extra features. But I’m not sure which one is the best balance overall.\n\nQuestion: If you had to choose, which of these two would you pick for gaming + some productivity/creative work, and why? Any personal experience or reviews you’ve seen would help a lot.\n\nThanks!",
  "Lenovo xiaoxin pro gt 14 2025 Vs Lenovo thinkbook pro 14+ 2025 Lenovo xiaoxin pro gt 14 2025 Vs Lenovo thinkbook pro 14+ 2025\n\n\\*\\*Lenovo xiaoxin pro gt 14 2025\\*\\*\n\nOperating System: Windows 11 Home Chinese (FREE CHANGE OS)\n\nProcessor: Intel Core Ultra 5 225H, up to 4.90 GHz(14Cores/Threads)\n\nGraphics: Intel Arc graphics\n\nDisplay: 14-inch OLED, 2880 x 1800, 120Hz, 1100 nits, 100% DCI-P3, DisplayHDR True Black 1000\n\nMemory: 32GB LPDDR5x 8533MHz\n\nStorage: 1TB NVMe PCle SSD\n\nInterfaces: Right: 2x USB-A 3.2 Gen1, 3.5mm Headphone Jack Left: 2x Thunderbolt 4, SD card reader, HDMI 2.1\n\nFeatures: Al features,Lenovo OLED Care,V-Max Turbo\n\nKeyboard and Touchpad: Full-size backlit keyboard, large touchpad with multi-touch support Audio & Mic: Two speakers, two microphones Camera: 1080P HD Camera with Windows Hello Wireless Connectivity: Wi-Fi 7, Bluetooth 5.3\n\nBattery and Power: 84Wh lithium polymer battery, USB-C power adapter\n\nWeight and Dimensions: \\~1.3 kg, 312 mm x 227 mm x 14.5 mm\n\n\\*\\*Lenovo thinkbook pro 14+ 2025 (C)\\*\\*\n\nA: Ryzen 7 H 260\n\nProcessor: AMD Ryzen 7 H260 (up to 5.1GHz, 8 cores,16 threads)\n\nGraphics: AMD Radeon 780M\n\nMemory: 32GB LPDDR5X 7500MT/s (soldered)\n\nB: Ryzen Al 9 365\n\nProcessor: AMD Ryzen Al 9 365 (up to 5GHz 10cores, 20 threads)\n\nGraphics: AMD Radeon 880M\n\nMemory: 32GB LPDDR5X 7500MT/s (soldered)\n\n\\*C: Ryzen Al 7 H 350\\*\n\nProcessor: AMD Ryzen Al 7 H350 (up to 5GHz 8cores, 16 threads)\n\nGraphics: AMD Radeon 860M\n\nMemory: 32GB LPDDR5X 8000MT/s (soldered)\n\nOperating System: Windows 11 Home Chinese Edition Display: 14.5\" 16:10 3K (3072x1920) IPS 120Hz 100% DCI-P3 500nits Anti-glare\n\nStorage: 1TB M.2 2242 PCle Gen4 SSD\n\nRight: 1x RJ45, USB 3.2 Gen1, SD Card reader (SD/ SDHC/SDXC), USB 2.0 (Hidden)\n\nLeft: USB 3.2 Gen2 (10Gb/s), USB 3.2 Gen1, HDMI 2.1TMDS, USB-C 4 (Thunderbolt 4, 100W)\n\nFeatures: MIL-STD 810H certified\n\nKeyboard and Touchpad: Full-size backlit keyboard,1.5mm key travel, precision touchpad\n\nAudio & Mic: Stereo speakers, 2W x2, Dual microphone array\n\nCamera: ThinkShutter FHD 1080p IR camera\n\nWireless Connectivity: Wi-Fi 7, 802.11be 2x2,Bluetooth 5.4\n\nBattery and Power: 4-cell, 85Wh Li-ion Power Adapter: 100W Type-C Adapter\n\nWeight and Dimensions: 2kg, 322mm x 228mm x 17mm",
  "I like the ThinkBook Pro simply because of the IPS instead of the OLED.  I have the 2024 Xiaoxin Pro 14, and IMO it's kinda garbage.  VERY Cheaply made, pretty poor keyboard.  Performance is fine, but build quality is total ass.  I have the ThinkBook 14 (not +) G8 (2025) with the 2.8K LCD and 2 slots for RAM, and while the battery is only a 60wh (only reason I KINDA wanted the + instead, but not worth giving up upgradable ram) it's so much better made than the Xiaoxin Pro it's not even funny.",
  "The thinkbook pro + 16” and Xiaoxin pro gt 16” have upgradable ram but im really hesitant because of its portability. And yes i also think in xiaoxin lineup only GT is good… the thinkbook pro +2025 intel version also have tgx/oculink port and haptic trackpad… \\*sigh\\*",
  "Anyone using new Lenovo ThinkBooks G8? I've noticed them showing up locally. They are cheaper than preexisting laptops but they come with plain DDR5 RAM and \"basic\" 45% NTSC 1920x1200 screens (much better screens listed on Aliexpress SKUs).\n\nI'm kind of tempted to get one and dump 128GB RAM on it so it will be able to load some LLMs for testing (won't be fast but it should run).",
  "hello , did you end up buying it? if yes how was your experience using it ?",
  "Yes, I have the 14\" one. It's pretty solid, I like the palmrest/keyboard. I'm yet to switch the RAM and SSD moving to Linux and final setup. What I don't like is the bottom firing speakers that are lacking even vs basic Lenovo laptops with top-firing configuration (I have old ARM Lenovo and it's better while having original price of a chromebook :P). Thermals/noise is good on light/browser use as well. The screen seems fine while specs on paper don't look impressive :)\n\nNote that now TongFang GX4/5 entered EU stores (under custom names usually) and it offers up to Ryzen 9 with better screen while also having 2x SODIMM and 2x SSD and same or lower price.",
  "I found one g8 7 255h , 32gb , 1tb for 650$ is it good?",
  "What you want to use it for?",
  "Coding , deep learning, maybe some gaming",
  "iGPU can do light gaming, it's good for coding, while AI/ML will be limited to iGPU/CPU but as it has 2x SODIMM it can handle more RAM. For longer coding work you may look at external displays or the 16\" model. For 14\" you can also check local pricing and availability on TongFang GX4.",
  "So even 140t can’t handle these things? So better get mid range gaming laptop than this? , thanks in advance",
  "what things? For AI/ML majority of laptops won't be good, for more gaming decent dGPU would really be handy.",
  "Thinkbook 16 gen 7 (AMD). How many hours of battery backup should i be expecting? Specs: \n\n• 4 Cell Rechargeable Li-ion 71Wh\n\n• AMD Ryzen™ 3 7335U Processor (3.00 GHz up to 4.30 GHz)\n\n• 40.64cms (16) WUXGA (1920 x 1200), IPS, Anti-Glare, Non-Touch, 100%sRGB, 300 nits, 60Hz, Low Blue Light\n\nWill Ryzen 5 7355HS give more battery life?\n\nThis laptop will be for ideal working conditions for a student.",
  "Nice laptop",
  "Not sure how long it could be. It depends on what type for stuff you'll be doing.\n\nThe Ryzen 5 7355HS is actually a high power CPU and you will get less battery life \n\nThe Ryzen 3 7335U will give good battery life.",
  "Just Office apps, browser and streaming/watching on VLC. If it's more than 8-9 hours i'll be happy.",
  "Then this laptop is perfect for you. The U processor is low power but will still perform well for the stuff you will be doing. The processor is quite efficient and you get a big battery. It's likely you will get good battery life.",
  "Thanks. How many hours do you get from your vivobook?",
  "I have a medium power CPU, but it can still pull lots of power, and on top of that, an OLED screen, which also takes a lot of battery. My work involves me using multiple browsers and different software occasionally. I get between 3½-5 hours. The sad thing is that my Vivobook has a 50WH battery. Some other models have like 70 or 75WH.",
  "I was looking at few Asus laptops & found this [Expertbook P5](https://dl.flipkart.com/s/nDfvtfNNNN). Well i can afford it but i'm not sure i could get enough battery backup bcz of it's top-of-the-line screen, Ultra Core 5 226V & Intel Arc integrated from its 63whr 3 cell battery. I think it's a bit overkill for me.",
  "Nah. This Lenovo is an excellent choice. The expert book is focused on business customers. I wouldn't touch that.",
  "And don't fall for marketing tactics. If you look at the tech specs, the screen for this is a cheap IPS 400 nits screen.",
  "Ok got it 👍🏾",
  "Can a User of Lenovo ThinkBook 16 G6 please give a honest review of this laptop? And if the price of good? 📌 \\*\\*Lenovo ThinkBook 16 G6 (AMD) \\~\\*\\*438.06 **U**SD  \n💻 *Model: 21KK008F*AK\n\n* **CPU:** AMD Ryzen 5 7430U (6C/12T, up to 4.3GHz)\n* **GPU:** Integrated AMD Radeon™ Graphics\n* **Display:** 16\" WUXGA (1920x1200), IPS, 300 nits, anti-glare\n* **RAM:** 16GB DDR4 (Upgradeable)\n* **Storage:** 512GB PCIe 4.0 NVMe SSD (Upgradeable)\n* **Ports:** 2x USB-A, 2x USB-C (incl. USB4), HDMI 2.1, Ethernet, SD reader, audio jack\n* **Battery:** 45Wh, USB-C 65W charger\n* **Other:** Backlit keyboard, fingerprint reader, Wi-Fi 6E, 1.7kg",
  "im using 7530u variant for last 1 year, u can go for it. put a cloth when closing the lid, otherwise keys will have contact with the display.",
  "Ryzen 5 7430U should be around or less than 400 USD",
  "Cannot say something to this configuration but we had around 15 intel and amd based g6's in my company. Great devices except for one thing, around half of the devices had problems with the integrated webcam. Some of them in the first months, some of them after several months. The case was that that the system was loosing the physical connection to the webcam module again and again. ",
  "What about Ryzen 3 7335u version ? Thinkbook 16 g7 , I will be using it for coding and study related (cs student)\nOr should I opt with Ryzen 5 version?\nBudget is tight so can only go with Ryzen 3\nCan you suggest me if Ryzen 3 would work or else I should go with Ryzen 5 ?",
  "This is cheapest one I could find in the entire country.",
  "    As far as I remember, Asus Vivobook Go OLED with this processor was available for around INR 35,000 (USD 408) last year.",
  "I have used Thinkpads and Dell Latitudes, and Asus build quality feels awful.",
  "Lenovo Ideapad Slim 3 or Lenovo Thinkbook 16 https://preview.redd.it/47q1juxi9lmf1.png?width=1433&format=png&auto=webp&s=d50b69d811d7b3e266a98f40b915353ee08d3de2\n\nhttps://preview.redd.it/mtljullo9lmf1.png?width=1441&format=png&auto=webp&s=905721bd55eb5f3d87d3264973c5ddb172c40f17\n\nWhich one should I choose for long term professional use in the field of Computer Science where I'll be using tools Programming, Data analytics, Light video editing and gaming. Mainly I am looking for fast multitasking without any lagging.",
  "Hey, how good is lenovo thinkbook 16 g7 ryzen 5 7535hs 16/512gb Hi, my college is about to start and I want a laptop to help me with my academics this lenovo thinkbook is costing me around 45k rupees(510 $) which is under my expected budget my main query is about the ryzen processor on this many brands either provide an intel i5 13th gen u series or 12th gen h series, so should I go for those intel processors or stick with the ryzen, also will this be enough or should I   raise my budget for ryzen 7 7735hs by lenovo ideapad slim 5.",
  "Lenovo Thinkbook 14 Is it worth it for (1) Adobe Apps, (2) Video Editing, (3) Light gaming like roblox? ",
  "ASUS ZENBOOK 14 vs Lenovo Thinkbook 14 g8 Hello \nIf you had to pick one which would it be and why? \n\n-ASUS ZenBook 14 – Intel I7 12th Gen | 16GB RAM | 512GB SSD | Intel Iris Xe Graphics specs: Model: ASUS ZenBook 14 Processor: Intel Core i7-1260P (12th Gen, 12 cores, up to 4.7 GHz) Graphics: Integrated Intel Iris Xe Graphics RAM: 16GB LPDDR5 (soldered) Storage: 512GB PCIe NVMe SSD Display: 14\" Full HD (1920 x 1080) IPS, Anti-glare, 400 nits Operating System: Windows 11 Home Audio: Harman/Kardon-certified speakers Keyboard: Backlit keyboard with precision touchpad Ports: 2 x Thunderbolt 4 (USB-C) 1 x USB 3.2 Gen 2 Type-A 1 x HDMI 2.1 1 x 3.5mm Combo Audio Jack MicroSD card reader Connectivity: Wi-Fi 6E, Bluetooth 5.2 Battery: 75Wh, up to 16 hours of battery life Weight: Approx. 1.3 kg (2.87 lbs)\n\nORRRR -Lenovo ThinkBook 14 G8 - 21SJS00300 - 14\" - Core Ultra 5 225U - 16GB RAM - 512GB SSD - Intel Graphics specs: Processor: Intel Core Ultra 5 225U, 12C (2P + 8E + 2LPE) / 14T, Max Turbo up to 4.8GHz, 12MB Memory: 1x 16GB SO-DIMM DDR5-5600.\nStorage: 512GB SSD M.2 2242 PCIe® 4.0x4 NVMe. Display: 14\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC, 60Hz. Graphics: Intel Graphics.\nPorts: 1x USB-A (USB 5Gbps / USB 3.2 Gen 1) 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On 1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.0 and DisplayPort™ 1.4 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1 1x HDMI® 2.1, up to 4K/60Hz 1x Headphone / microphone combo jack (3.5mm) 1x Ethernet (RJ-45) 1x SD card reader",
  "Help choose between Hp Victus, Lenovo ThinkBook 16, and ThinkPad E16 G2 Hello Redditors!\n\nI'm looking for advice choosing between 3 laptops for mostly in-home use.\n\nKey uses: regular dev work (anaconda, code), multitasking, image editing (Darktable + GIMP) but not business grade, and occasional light gaming. Priorities are build quality, thermals, Linux compatibility, and overall longevity.\n\nAll three have DDR5 16GB RAM, here are the CPU details:\n\nHP Victus 15 – Ryzen 5 8645HS | Windows 11 Home\n\nLenovo ThinkBook 16 G7 – Ryzen 5 7533HS | No OS (I’ll install Linux), have an option of 100% SRGB screen here.\n\nLenovo ThinkPad E16 G2 – Ryzen 5 7535HS | No OS (Linux install planned)\n\nVictus leans more toward gaming/consumer, while the ThinkBook and ThinkPad are business-focused. I’m comfortable setting up Linux myself and don’t need Windows. Which one would you recommend for my use case?\n\nDo ThinkBooks last? Do they cause issues like MoBo and other h/w level issues?\n\nNote: I don't want to go for U series processors. Have used them in budget laptops and experience for my use case hasn't been smooth.",
  "ideapad slim 5 gen 10 (15\" AMD) or thinkbook 16 gen 7 AMD? I need help choosing between these two laptops and getting some reviews of them. Here are their specifications:\n\nthinkbook:  \ncpu: ryzen 7 7735hs  \nram: 32 GB DDR5-4.800MT/s (SODIMM) - (2 x 16 GB)  \nhard disk: 1 TB SSD M.2 2242 PCIe Gen4 TLC  \nDisplay: 16\" WUXGA (1920 x 1200), IPS, anti-glare, non-touch, sRGB 100%, 300 nits, 60 Hz, low blue light  \nWireless: Wi-Fi 6E 2x2 AX and Bluetooth® 5.1 or above  \nEthernet: Ethernet 100/1.000 M  \nPalmrest: PC/ABS  \nBattery: 4-cell 71Wh lithium-polymer battery\n\nideapad:  \ncpu: ryzen 7 7735hs  \nram: 16 GB LPDDR5X-6.400MT/s (saldata)  \nhard disk: 512 GB SSD M.2 2242 PCIe Gen4 TLC  \ndisplay: 15.1\" WQXGA (2,560 x 1,600), OLED, non-anti-glare, non-touch, HDR 600 True Black, DCI-P3 100%, 500 nits, 165 Hz  \nWireless: Wi-Fi 6 2x2 AX and Bluetooth® 5.3  \nPalmrest: Metal  \nBattery: 4-cell 70Wh lithium-polymer battery",
  "I won't pick an ideapad no matter what specs it has.",
  "why? it looks very good",
  "Why ?",
  "It's not durable enough for me.",
  "How is the ThinkBook 16 Gen7 Ryzen 7 7735HS ? Looking for a real user review. How are the thermals, good enough for casual gaming sessions (FIFA/F1)? What is the general performance like, snappy or stuttery? What is the build quality like?\n\nConsidering a 16 GB DDR5 ram with 512 GB Gen4 ssd.",
  "LENOVO THINKBOOK IDEAPAD Hey, going into my first year of uni as a BBA major, has anyone owned a thinkbook 16 gen 7? Or an ideapad slim 5i? Let me know if they’re good \n- are they durable?\n- good battery life? \n- fast/slow?\n- overall experience\n\nThanks so much. ",
  "Reviews on Lenovo? Any Recommendation? I have been working with an ASUS computer with meh specs but I need a more powerful computer for my workload (Devops. Cloud, a bit of AI-ML) I don't have a massive budget but when looking I came across  \n\n# Lenovo IdeaPad Slim 5 16IMH9 Core Ultra 7 155H 32GB LPDDR5x RAM 512GB M.2 PCIe NVMe PCIe SSD 16\" Display Wi-Fi Bluetooth Webcam Intel Arc Graphics Windows 11 HomeLenovo IdeaPad Slim 5\n\n# 16IMH9 Core Ultra 7 155H 32GB LPDDR5x RAM 512GB M.2 PCIe NVMe PCIe SSD 16\" Display Wi-Fi Bluetooth Webcam Intel Arc Graphics Windows 11 Home, \n\n  \nIt seems like a good fit but I haven't fully decided, anyone with  review or other recommendations?? (I am not an apple person)",
  "Why should I not get it?",
  "It’ll take care of most of your tasks, might not do well at intensively graphical tasks due to not having a dedicated GPU but it’ll do the job, good workstation laptop",
  "[removed]",
  "[removed]",
  "I see, i don't do intensively graphical tasks anyway so its good i guess",
  "great, thanks",
  "I'd say its sufficient for light tasks but if you have more data or processing requirements, preferably utilize cloud resources",
  "On modern laptops do I need ethernet ? I'm looking at Lenovo ThinkBook or IdeaPad. Nowdays do I need ethernet on laptop ? Mostly I will use it for university and work. I kinda like having ethernet option but IdeaPad doesn't have one.\n\nAlso I'm looking at this two laptops, I'm kinda more leaning to buy IdeaPad but its like 150 euros more expensive but doesnt have ethernet and can't be further updated, while on ThinkBook I can add one more SSD.\n\nLENOVO ThinkBook 16 G7 ARPLENOVO ThinkBook 16 G7 ARP, AMD Ryzen 7 7735HS, 32GB DDR5 4.800MHz, 1TB NVMe SSD\n\n[https://psref.lenovo.com/Detail/ThinkBook\\_16\\_G7\\_ARP?M=21MW000QYA](https://psref.lenovo.com/Detail/ThinkBook_16_G7_ARP?M=21MW000QYA)  \n  \nLENOVO IdeaPad Pro 5 14AHP9LENOVO IdeaPad Pro 5 14AHP9, OLED 2.8K, AMD Ryzen 7 8845HS, 32GB DDR5 6.400MHz, 1TB NVMe SSD\n\n[https://psref.lenovo.com/Detail/IdeaPad\\_Pro\\_5\\_14AHP9?M=83D3002CYA](https://psref.lenovo.com/Detail/IdeaPad_Pro_5_14AHP9?M=83D3002CYA)\n\nThank you in advance for advice and help!",
  "I require ethernet on any laptop I purchase. WHen I have to configure a new switch, router, access point, firewall, security camera, etc, nothing beats being able to connect directly to the device in order to get it ready for the network.",
  "The USB to Ethernet adapters work really well, but if you use ethernet daily it likely is nice to have a port on the laptop.",
  "Depends if your wifi router is in the same room as you ",
  "I have a laptop and if possible I use Ethernet.",
  "No. Wifi is good. Never faced the need to require ethernet and have never used it either.",
  "If you need ethernet you can get a usb adapter from rocketfish for like $15",
  "ethernet to usb-c or a port extender with ethernet",
  "A lot of the new laptops have the closed ethernet ports which are a pain. \n\nEven though I have an Ethernet port on mine, I still use an USB to ethernet adapter to avoid breaking the one on my laptop…. for the rare occasion I need to use it.\n\nEDIT: I have the TP-Link Ethernet to USB adapter. It’s on sale for less than $9 right now.",
  "All of my old laptops eventually become something in my homelab, so I prefer to have the Ethernet port to connect it to my switch.  I notice a lot of the newer laptops don't have that anymore.  The Asus ExpertBook and VivoBook look interesting. Some have Ethernet and others don't.\n\nSo, it really depends on your needs.",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you, btw what you think between these two laptops, wich one to buy ? (I may found ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Thank you will give it a look, btw what you think between these two laptops, wich one to buy ? (I may found third one ThinkBook with Intell 155H instead of ThinkBook with AMD 7735HS , but not sure about Intel anymore tbh)",
  "Both of those carry very capable processors. The Intel processor is newer and looks better on paper. You will not lose with either processor. I would look at other features to make my choice because both processors are capable.",
  "I have had more amd laptops myself. I have 2 year old ideapad with a Ryzen 7 5700u, and I did see some reviews of this new Ryzen 7 8840hs that seems to be good too. So, I think I wold have confidence in that Thinkbook. I have heard mixed things about intel. Some people on the reddit subs have said they heard about problems (who knows if this true or not). I know PC magazine tested an HP spectre with intel core 7h. They did get great graphics performance on it despite  using the igpu. They said they did a bunch video editing and it was very fast for not having a dedicated gpu.\n\nI would probably go amd just knowing what I was getting.",
  "Considering that you mostly need ethernet when you're in your uni and work get the ThinkBool",
  "Thats a tough choice between those two laptops. The 8845 is more powerful and has an OLED screen, which will have better colors than the other laptop. But the screen is smaller, the ram is soldered onto the board, and it only has 1 m.2 slot for a ssd. 32 gb of ram is a lot, and you probably wont need more. But if it ever malfunctions you wont be able to change it because its soldered onto the board.\nThe 7735 is slightly less powerful. But it has 2 ram slots and 2 m.2 slots. Ram is really cheap should you want up upgrade to 32 gb. And you can add another m.2 ssd for more storage. \nOther than that they're both about equal. I would be really hesitant to take the 8845 because of the soldered ram and 1 m.2 slot.",
  "LENOVO ThinkBook 16 G7 because the IdeaPad Pro 5  has soldered memory. It isn't upgradable & if one goes so goes the motherboard. And memory is one of those items that fails.",
  "Either one will be solid.  The OLED will be beautiful but drains more battery than the 1080P screen.",
  "Need help choosing between two laptops under ₹50,000 – Samsung Galaxy Book 4 vs Lenovo ThinkBook 16 Hey everyone,\n\nI'm planning to buy a laptop under ₹50,000 and I've shortlisted two options that seem to offer great value, but I'm confused about which one to go for. I'd love your opinions, especially if you've used either of these models or similar ones.\n\nHere are the two laptops I'm considering:\n\n1. Samsung Galaxy Book 4\n\nIntel Core i5 1335U, 16GB LPDDR4x RAM, 512GB SSD, Intel Iris Xe Graphics.\n\n2. Lenovo ThinkBook 16\n\nAMD Ryzen 5 7535HS, 16GB DDR5 RAM, 512GB SSD, Integrated Radeon Graphics\n\n##What matters to me:\n\nPerformance, Display quality, Battery life, Build quality, Thermal management\n\nThanks in advance!\n\n",
  "Personally, putting myself in your shoes. I would go for Lenovo. AMD processor is power efficient, good processor, Lenovo has a good display and robust build quality.\n\nIntel is not bad compared to the AMD, Intel has 4 extra E-Cores that perform less demanding tasks like Paaint (its a joke), less demanding tasks like opening task manager (another joke, sorry).\n\n**Cores:**\n\n* Intel has 2P+8E = 10P & 12 threads\n* AMD has 6P & 12 threads\n\n**RAM:** Samsung has DDR-5600 RAM & Lenovo has DDR5-4800 RAM\n\n* Samsung doesnt have the RAM upgrade option as far as I know, researched about it.\n* Lenovo has 2 upgradable slots & upto 64GB RAM (imagine 16GB DDR5-5600 vs 64GB DDR4-4800)\n\n**Storage:** Both Samsung & Lenovo offering 2 SSD slots for upgrade upto 4TB (2tb each slot)\n\n**Warranty:**\n\n* No info on the onsite/offsite warranty for Samsung\n* Lenovo has 1 year Onsite Warranty ; no rushing to service and standing in queue to get your device registered\n\n**Favorism:** I am an AMD person."
]