[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Guys is this genuine? Like seriously 1 rupees? ",
  "likely a phishing page, open a new tab type \"store.lenovo.com\" manually and make sure it's still in your cart there",
  "Proceed with caution. For that price, I'd say to just go ahead and buy it and see what happens, considering you're on [store.lenovo.com](http://store.lenovo.com), but I'm still very suspicious about it. There's no reason they'd actually sell anything for that price, unless it was a mistake on the website. However, if it is a mistake and it lets you place the order, it's possible that they might still honor the purchase and just eat the loss as a result of their mistake and still send it to you. It looks like the actual Lenovo website. Look closely at the URL, and type in the Lenovo website URL manually and navigate there directly to make sure you're at the right place. If you still see it there, maybe try and see if it lets you order.",
  "Try and find . Pay 1 rupee",
  "If this is real some intern finna be fired",
  "Could be an accident. \n\nI found an issue on HPs website once and got some accessory stuff for Penny's on the dollar.",
  "Already seen that on the Lenovo Page. They released a new device and instead of 2000€ it said 200€ the Order got canceled. Might be mistakes or Intention to get intention",
  "Looks like a scam",
  "Whenever I Google the Indian version of Lenovo's website, it takes me to lenovo.com/in/.\n\nFeels like a scam. If you have a prepaid debit/credit card, it may be worth trying. I wouldn't give any information linked to my bank if I were you.",
  "I have orderd 2 of them at 2 rupees , lets see what happens,  haha",
  "Show us the whole url.\n\nIf that's phishing, all they needed were your payment credentials.",
  "Well Rupees are a fictional currency from The Legend of Zelda video game series so I’d say it isn’t genuine.",
  "Next time just order it and don't post it on places like this",
  "they brought the store down since",
  "Do you think it can be true?",
  "Happened to me. Threatened them with commerce commission and they gave it to me",
  "Its a phishing site, just went to it myself, its pure fishy. Also look at the copyright in the bottom",
  "Just got a new pc! For some reason, every time I try to launch steam, it keeps giving me the error message \"Glory to the CCP.\" Any fixes?",
  "Go for it, the worst that can happen is you lose 1 rupee, the best outcome, you effectively get a free laptop, just make sure to use a single use card number (like zip pay single use card, or something similar)",
  "Use a throw away card from Walmart",
  "Check the website, yours might be fake.",
  "Make sure it's the actual site 1st and not just some phishing website to take your credentials and payment information",
  "How?\n\n**Edit:** I found the same bug. Placed an order. Few minutes later some guys from the store called and said they cannot sell it for ₹1 and cancelled the order.",
  "1 rupee and you still asking \"is this genuine\" how old are u boy?",
  "i think OP has done inspect element   \nhe just wanted some attention",
  "This is a scam for sure  it’s just a copy site and it’s even in html 🙃\n\nOfficial site : https://www.lenovo.com/in/en/laptops/",
  "Guys here is the url \nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Run it with PayPal and just see",
  "Bhai 2 4 mere liye karde paise deta mein",
  "Buy 2.",
  "Tip\nIf its too good to be true, its fucking scam.",
  "try to trace and get the complete URL and look for signs the website might be a phishing site.\n\nor you just found a pricing error and started chaos",
  "Checked. Website is genuine, having Google sign in option as well. The item looks like a wrong entry.. They will correct it and cancel orders before shipping.",
  "I haven't seen any malware that attacks android phones and modify the webpage content / hosts file to redirect you to a phishing page. Looks like a real website, but the pricing is definitely a glitch, which they would either honor it as another redditor mentioned, or cancel the order if you place it. Yet - the company has all rights to cancel an order at anytime and refund you the money. \n\n  \nI'd go for it and see what happens if I were you, no harm in losing a rupee. Virtual cards are best, I remember SBI had this feature at least 10 years ago but not sure now. Proceed with due diligence.",
  "It's only 1 ruppee... Plus shipping maybe? Not the worse scam I've ever seen. Because that's barely a profit",
  "Try and see if it actually arrives",
  "Make a rando paypal, add one dulla to it, disconnect your all your stuff form it, buy.",
  "It is just a glitch, but with a credit card and make sure they charge 1 r",
  "I'll take 8000. I can't figure out how to get the page OP is on though.",
  "hold on i gotta place that order",
  "Scam Alert ❗❗❗",
  "Why is that website so sketchy?  Visiting from the US and it still gives me info as if I'm in India?",
  "First you should paste the link so that other users go try it out. \nSecond you buy it and choose the shipping method as STORE PICKUP. \nLastly DON'T GIVE ANY BANK DETAILS EVEN IT'S FREE (they surely want consumers to prepay it).",
  "Not too sure but could of just been a fuck up on their end when pricing. Had it happen a few times on websites, once at JD sports with some AF1 marked down to $20 instead of $200 but they ended up refunding everyone lol and once with a skate deck that was FREE, again they just emailed me saying lol no 😂",
  "Rupees? Yeah totally legit. No scams ever.",
  "I have bad vision but it can’t be this bad to see 1 rupee",
  "It seriously went out of stock lmao",
  "What's the harm in trying bro",
  "Make sure that's really the store site (security certificate and all that).  It might be bait to get you to enter your credit card details.",
  "I guess not..",
  "For me it shows 137k",
  "I think it depends on your country's law system. For example, in Mexico, we have a consumer protection enforcer, which forces the seller to honor their stated price, even in case of human error or similar snafus. This has led to several incredible bargain stories over the years.",
  "Share us the laptop link",
  "I checked it. does show just 1 but currently out of stock. Update us OP",
  "[deleted]",
  "This happened with me too and then they cancelled the order after 2 days",
  "Looks like someone turned friendly fire on.",
  "Back end website error. Some one pushed a change to the store front and really fucked up. Lucky for you. Hope they don't catch it before it ships. Ive worked on retail websites and seen this happen.",
  "[store.lenovo.com](http://store.lenovo.com) its a malicious site nor official one, don't fall for it.",
  "It happened in my country once, and they honored the purchase. Mistakes happen sometimes.",
  "Think you cut out the banner there that should apply to you right?!\n\n[imgur](https://imgur.com/a/04Bwbtx)",
  "Aaw a similar thing for legion go for 90quid didn't trust it as the reservation counter always update over and over again.",
  "Go for it, but you might want to use a virtual credit card using for example Revolut. So you won't leak ur credit card info if this turns out to be fake :)",
  "Any updates?",
  "That's probably a colored cardboard brother...",
  "At best you get an almost free Thinkpad, at worst you're on a spoofed website that's collecting your credit card details. What could go wrong?",
  "Did you buy it or not?",
  "https://privacy.com\n\nNo reason to not give it a go. Use a burner card from above. First twelve each month are free.",
  "It’s an obvious scam jfc",
  "It's out of stock now 😭",
  "Better order 10 more",
  "Keep us updated OP!",
  "Bro at least sign in \nThen check the price",
  "That website looks suspicious to me.Your card might get blocked or u might get scammed.Lenovo website is secured website while the website you are showing is not secured.I would not make the payment.",
  "Credit card sir",
  "Please update us if it actually comes through",
  "You should not have posted this. You should have tried first. .\nExpect the order to be cancelled",
  "I am really interested to know if you really got it",
  "Just buy it whats the worst that can happen",
  "Order it but make sure you're at a public place and not near/at your house",
  "Link ?",
  "Pay with a throwaway account or if none make a virtual debit card from your banking app, set the lowest possible limit on it so it can't be used for scam, use it, purchase, receive and then delete that card.",
  "I would definitely take the bait",
  "Phishing or error.\nEither you get scammed or you get refunded",
  "So any update?",
  "In Germany it's a different shop. https://www.lenovo.com/de/de/d/sale/\n\nI would be careful",
  "They just want your bank details. Check at the end of website is it really lenovo website or a fake one",
  "i often buy mispriced products on aliexpress, and about 30% of the time i actually get them.",
  "Update us if it gets delivered",
  "They didn’t honour their error in my experience. I purchased a machine on a fantastic sale. The website said that they had it in stock. They in fact did not have it in stock. I only learned this after a month of waiting for it to arrive and it being in the ready to ship stage, still showing that they had stock. When the error was discovered they offered to cancel my order and find a machine that “fit” my needs at whatever price they were selling it at. No, I wanted a machine with the closest specifications at the price that I ordered and paid for the first one that you said you had in stock. They didn’t budge at all. I ordered a machine at $250, the next one that had the closest specifications was $750. The original price of the machine I ordered was $950. Some brands are better than others when it comes to errors. Lenovo isn’t one of them.",
  "i dont remember lenovo's official site looking like this. There was no green color, all the accents were black or red in my memory",
  "I had the same bug on the HP website, €1 for a computer that is worth €1,400, I paid but after a few hours my order was cancelled. They'll probably do the same to you, it must be a bug in the site.",
  "Order it I guess but pay with PayPal or something",
  "Could be a pricing error too. Order it",
  "Which store was it?",
  "Get one for me 😜",
  "If the website is legitimate I'd fuck around and find out 😂",
  "Is store.Lenovo.com strictly for India? I’m in Canada and it’s showing me rupees",
  "What do you fucking think?",
  "Well probably a key logger that want's your card details.",
  "Just create an internet bank account, deposit a small amount of money and purchase it. Simple, end of story.",
  "Yeah, genuinely stealing your personal information.",
  "Could be a price mistake. If you want try it out with a safe payment method",
  "link??",
  "any update what hapeend ,i am curious......................:;:::::",
  "obviously not legit. \n\nThe real website link is lenovo.com\n\nnot site.lenovo.com",
  "Plot twist...\n\nOP made this site so people go and buy/log in and THEY are now stealing your info. This seems way to scummy/scammy. \n\nWeblink isn't true. Copied page.",
  "Be careful could be a wrong Site or sometimes Like Amazon a Price Tag was wrong I could buy it but often the offer was then canceld",
  "Seems like that one incident where the gas prices were mistaken at a station and one comma was off (10 times cheaper price).\n\nAnd some dude was filling like the back of his truck with gasoline. Not sure how specific the action was, but basically they were taking advantage of the situation.",
  "RUN",
  "SCAM!!!!",
  "Purchasing a product at the advertised price isn't illegal. Not selling you a product for the advertised price is illegal in a lot of places. Hopefully in your country too.",
  "Use a burner card if you can. Doesn't hurt to try it.",
  "Is like one of those amazon errors where some products are like 1 dollar",
  "Send me the full link pls",
  "Well this is because the prices are set by the individual store owners. Something like that happened with me too. A laptop I wanted to buy was showing for 50% less at only one lenovo store. It was hella skeptical. I contacted that store and they clarified that is not the correct price and will be changed that morning. ",
  "Why is it when I go to [store.lenovo.com](http://store.lenovo.com) that it instantly sends me over to India?  I live in NY, USA.  That seems suspicious.",
  "cod karwa le",
  "https://ibb.co/7xSwZjMb\nhttps://ibb.co/Pz17nqVC\n\nCheck these links store .Lenovo.com seems to be a fake site. The actual one is Lenovo.com",
  "Try without keeping more than 5 rupees in your account. If it goes you are super lucky !",
  "Shouldn't have posted it on Reddit",
  "Make a wallet like family pay and pay 1 rupee with that and never use it again",
  "Use a prepaid one use Revolut card",
  "Store.Lenovo isn’t owned by Lenovo.",
  "Website copyright 2021 - Almost real. Its a scam don't fall for it.",
  "that is the Shipping price",
  "Hmm low risk...",
  "Never heard the phrase if it’s to good to be true it’s not?",
  "Is it's in India, everything is a scam, they even spread to other countries",
  "Link ?",
  "Link ?\n\nIf possible let us know if order",
  "Well, it's been 3 days, have you purchased it already? If so then no problem but if you're still planning to, then I would say they likely have corrected this mistake by now, or even earlier, like 10 hours after you saw it",
  "Might as well give it a shot lol",
  "Link shared by OP seems to be individual local store link and they are free to set their prices so someone probably made a typo. Ordering it will likely result in the local store cancelling it as 'Out of Stock' and 1 Rs. refund.\n\nHere's the online store link: https://store.lenovo.com/in/en/nb-yg-slim-7-14ill10-u7-32g-1t-11s-83jx001min-2191.html",
  "It's sketchy my malwarebytes browser protection on an android phone blocked it when I turned the protection off the page loaded. It's a phishing page.",
  "Any updates on what happened?",
  "It's a scam, check the cert\nThe main page is a wild card, the store subdomain is a free SSL cert from last week. Someone has poisoned the DNS most likely and stolen the sub domain? Lenovo has a year long cert from a different company and wouldn't be using a free public cert from last week.",
  "Naah.\nPricing issue maybe",
  "Naah, pricing issue maybe",
  "Browser inspect element go brr",
  "bro found the deal every parent is haggling for",
  "prolly not but 1 inr, might as well",
  "how to avail this offer, bro😭",
  "soon as you make an account or log in... it's likely gonna change the price. that shit happens all the time with aliexpress too",
  "Paid for my laptop 2 years ago\nAll fine, still have it\nIf tis official website youll be fine",
  "Buy it and see why happens!",
  "Had something similar happen with HPs website a few years ago - sadly my order got cancelled :(",
  "Pay with a gift card",
  "From my understanding, it seems that this site is acting as a marketplace where the verified Lenovo stores are adding their inventory and setting their prices based on their offers/etc. So, it might be that this particular seller listed this product at a mistake price.",
  "Any update?",
  "If it looks like a scam and sounds like a scam.....",
  "I guess he didn't get it.",
  "Use a through away virtual card with a limite and get it",
  "Did you ever get it",
  "Intern: oh shit i'm in danger",
  "This looks like either a pricing glitch or a placeholder/test price. Big brands don’t just sell ₹1.8 lakh laptops for ₹1 unless it’s some promo for employees or a contest. If it actually lets you check out and ship, you’re extremely lucky — but 99% of the time the order gets cancelled or refunded",
  "100% legit. Good deal",
  "probably phishing website \ntry to copy past the URL into different word processing apps like notepad and more > check carefully for discrepancies like ś that might pop out.",
  "Do it.\nWhat's the worst that could happen?",
  "do it bro",
  "[Real link.](https://store.lenovo.com/in/en/nb-yg-7-2-in-1-14ill10-u7-32g-1t-11s-83jq000nin-1525.html) \n\nPrice is showing up as ₹137,490.00 for me\n\nI would scan your shit for anything malicious",
  "scam, there ain't no fucking way lenovo giving out cheap ass price's, let alone a laptop.",
  "Obviously not",
  "In Brazil we have a saying that roughly translates to \"When the offering is too good even the saint gets suspicious\"",
  "Thats literally a fake single page , go to original lenovo website and compare with it . Don't be dumb Nothin ever gonna be free",
  "Too good to be true",
  "scam.",
  "A general life lesson is:  if it seems too good to be true, it probably is.",
  "Is it even logged in brother? It still shows sign in option . I suppose u can't order without signing in . Or u can ??",
  "[deleted]",
  "No",
  "100% scam. \n\nDone very convincingly but it's not the official lenovo India. \n\nLike someone else said the official lenovo site doesn't start with store in the url.",
  "Lenovo's store is not [store.lenovo.com](http://store.lenovo.com)\n\nThe whole website is a scam\n\nLenovo's actual store website is [https://www.lenovo.com/gb/en/d/sale](https://www.lenovo.com/gb/en/d/sale)\n\nGo to [lenovo.com](http://lenovo.com) | Click \"Products\" and look at the URL\n\nWhole website seems to be a scam, the only thing different should be the location and Language after [**lenovo.com/**LOCATION/LANGUAGE](http://lenovo.com/LOCATION/LANGUAGE)",
  "What do you think bro?",
  "Bro that's not official lenovo website",
  "It's still there lmao 😭.",
  "Did you got the laptop",
  "Wait... I just went to [store.lenovo.com](http://store.lenovo.com) from the USA and I'm getting a bunch of ads talking about how many INR (Indian Rupee?) discount I'll get.\n\nWTF?",
  "They're not gonna eat the loss just because it's their mistake.",
  "uppercase i and lower case L look alike so they might have switched them to make it look like the official Lenovo website while it's actually ienovo website :b",
  "Lenovos webshop has been notorious for having odd bugs, my father purchased a laptop years ago and for some reason the payment failed so he got pissed off and went to a store and bought one. Like 2 weeks later he got 2 laptops from Lenovo and a reminder in his email that his laptop is waiting for payment to be shipped out.",
  "From just the image I can't see the whole link. It looks like a / at the end indeed, so it might be safe. But it's also possible the website can look like this: \"store.lenovo.com_custom_link.net\" be careful about these kind of links. I encountered one like this saying they are airbnb.",
  "You cannot see if they are on store.lenovo.com - they could be on store.lenovo.communityscams.in",
  "Lenovo sold me a defective laptop and then refused to replace it, instead offering a refund and a discount on future purchases that was less than the discount I'd bought the defective laptop with \n\nThey don't care about honouring shit",
  "Happend to my brother on an other site for idk which item, and they did not honor the purchase",
  "I once found a mistake where they sold a 4tb m.2 ssd for like 50 bucks. I bought 2 and 2 days later got an email that the order was canceled due to pricing mistake.\n\nLuckily for them the ssd was not in stock for about 1 week so they had time to fix it. But if they sent it then I'm pretty sure they would have to eat the loss.",
  "it could be a pharming scam so it even has the same URL but is in reality a different site, scan your pc for malware",
  "Sacaría todo lo q pueda de la tarjeta registrada (dejando solo un poco de dinero) o la cambiaría para luego comprar   \nCuestión de no perder en caso de reclamos.  \n  \n(Escribo en español)",
  "could be a risk, whole account might be swiped clean",
  "Well I ig thy already did cause it isn't showing now",
  "If an intern even had the access needed to do such a thing its not the intern that needs to be fired",
  "Ohh lucky you!",
  "Same, had an infinite amount of 50€ off vouchers, vot a backpack, mouses, speaker, storage with it",
  "lucky guy. My order got cancelled.",
  "Excuse me here, but how the hell can a subdomain of a **genuine** lenovo site be a scam?",
  "That's a legit site and ig the product entry was incorrect I don't think they'll shop it but if they do let me know brother and congrats if that happens ",
  "Really? Did it say \"Only 3 left\" when you ordered them?",
  "any updates?u got laptop?",
  "How did you guys order",
  "https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F\nWell I barely have around 150 in my bank account 😅",
  "Real talk: My brain immediately thinks of Zelda instead of India when I hear “Rupees”",
  "[deleted]",
  "U ain't tuff my guy!",
  "I loaded it myself earlier and saw the same thing.",
  "Nah it was real and a tech-error",
  "I don't have PayPal",
  "Also shows copyright from 2021. while other lenovo domains like psref.lenovo.com have it at 2025.",
  "Really?",
  "!RemindMe 1 week",
  "No",
  "It didn't allow me to make the payment",
  "This is exclusive store site",
  "I didn't buy",
  "Here is the url-\nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Here's the link or if u find this sus u can google lenovo official store new bel road and try  https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Somebody needs to learn how domain names work.",
  "LoL there is a thing called dns you should learn it",
  "Are u dumb?\nIt's a Fcking subdomain of lenove. It can't be a scam unless someone has Fcking access to the Lenovo domain or is doing. Mitm attack on opm",
  "What makes you think so? Like this is from official website! Unless it might be some glitch or smtg",
  "Well it's from lenovo exclusive store website and search for the branch new bel road",
  "You don't know how subdomains work.",
  "[deleted]",
  "The site has enough reputation to show up in google searches for \"store lenovo\". It wouldn't be the first time someone both hijacked a subdomain and also got it into a google search.\n\nThe cert is signed by Lets Encrypt instead of Lenovo's cert which is just what a scam site would do.\n\n*edit* store.lenovo.com/in/en has been in use since 2023. \n\nhttps://web.archive.org/web/20230314012913/https://store.lenovo.com/in/en/",
  "Entirely true : entered the url store.lenovo.com and arrived on an Indian version while living in Europe.\nVery few redirection links working. \nProbably a scam to steal credit card informations.",
  "But u can find the same from lenovo exclusive store website and search for new bel road branch",
  "[deleted]",
  "Seems like they've taken down their online store, when I just visited there was no way to buy online",
  "They may not even catch it. The order is probably processed by a computer and then packed and shipped automatically.",
  "They are many reasons they might eat it, particularly because it may be too much work to undo.\n\n*EDIT* If 1000 people start ordering it, they'll notice and cancel them all. OP you blew it by telling the rest of us.",
  "A little bit unrelated. I went to buy some expensive craft beer at a local shop and it was extremely cheap for some reason, like the whole thing cost less than the bottle. Cashier called the manager about it and they clearly stated that it is not what it suppossed to be, they can't do anything about it and they let me buy all of them for that very low price. Felt like winning the lottery.",
  "Had the same thing happened to me, they just sent a follow up email saying the price was a mistake on their end and they won't process the order.",
  "You can go to consumer court. They have to honor the purchase. You can’t just back out of contracts when the contract becomes a loss for you.",
  "Loss?",
  "The margins on these things are insane, my company buys their devices and they pay 20% of the public retail price. They make billions, it's probably not worth making the customer unhappy",
  "Most of the time they will, my boys in a telegram group where they post all types of these website bugs where the price is stupid low, all the guys on that telegram including my mate all buy and resell the shit they bulk buy off these websites and they pretty much all clear and get delivered",
  "It has happened before. I remember when a code was floating around for free Razer stuff, including laptops, and they said it was their mistake and honoured the orders.",
  "in eu they are required to sell it to you at the price its posted, i bought a portable AC from a site in slovenia because some fked up and instead of 450€ it was posted for 45€ and i got it for 45",
  "Sennheiser did when HD 600 were selling for 50$ instead of 500$",
  "One time I caught designer jeans they missed a 0 on. They sent it and fixed the price after. ",
  "Lenovo while not being an American company does a lot of business here, and one of their dual hqs are here, so legally, if they fucked up, they have to eat the loss, if any corp sends you something you didn’t order or they wayyy undersold it to you(like this case) legally you can view it as a gift and are under no obligation to return it, it happens with apple all the time where someone orders an iPhone and they get 5 instead of",
  "In germany if they send it out to you before realizing the mistake it's yours for that price so worth trying i guess",
  "Have you ever worked retail?",
  "Social media clout init",
  "Yes they will. I got a 3k laptop for under 300 dollars because they ate the loss. I did have to speak to someone on the phone, but I was polite and assertive about it. All in all, less than twenty minutes.",
  "Depending on region, ie. Quebec, they're legally required to honor the list price and eat the loss. Even outside of Quebec the amount of times I've gotten something better than what I actually ordered on Amazon is impressive Amazon always ate the loss. There's a good chance Lenovo just eats the loss.",
  "Second this. Currently dealing with Lenovo trying to return a laptop I bought that was advertised as having a feature I wanted, and shock horror, it doesn't. Their only response has been 'we know it can be upsetting to not get what you expected'. Can confirm they will refuse to eat the loss of their mistakes.",
  "They have to....",
  "They will, if you order from the EU. The fine they would pay otherwise due to consumer protection laws will be devastating.",
  "You can't have uppercase urls.",
  "That's a good idea. You could get like a visa gift card and order it with that.\n\nI'm writing in English.",
  "but the website is legit [store.lenovo.com](http://store.lenovo.com) \n\nu/Inevitable-Owl-550  you should log in with the same account in another device and then pay and see what happens",
  "People still keep all their money in an account linked to a card???\n\nMy pay goes into a secondary account with no cards linked to it, if I want to spend money, I manually transfer it, if someone steals my wallet, or a phishing site gets my card number, the most they'll get out of me is about $50 (which is all I keep in there for convenience)",
  "google pay then or single use card.",
  "Keep 2 rs in the account",
  "Upi lite se karo payment",
  "Bro your should have just ordered it, and if they didn't honour the purchase you can easily file a case against them",
  "I’m curious whether this was a scam link (My personal knowledge says that’s not possible coz store.lenovo.com seems legit, and doesn’t make sense to be a scam in terms of how DNS works) or the real store but someone messed up prices",
  "Did you buy it?",
  "Dude next time just go for it. Don’t let Reddit talk you out of a good deal. It’s the legit Lenovo website you scored yourself an absolute steal.",
  "Yeah but that's not how the corporate world works unfortunately",
  "Check the URL Certificate attributes and certificate chain. It will or should have Issued to as Lenovo.",
  "Domain takeovers exist, and through some VPN, Proxy, Public WiFi, really anything between you and the server can redirect to a scam server instead of loading the real page.",
  "[DNS Hijack, for example](https://www.imperva.com/learn/application-security/dns-hijacking-redirection/)",
  "they didnt confirm the order, looks like incorrect entry.",
  "u/U_GET_ME yes now its only one left, but order is not showing in **my order** sections",
  "No , it was just an entry mistake by a store owner in Karnataka. Order was cancelled by their side",
  "If I'm you, I'd probably buy it using my virtual card and limit the transaction to 1 rupee then lock the card and generate a new one after purchase.",
  "It isn't working now.\n\nDid you order it?",
  "Yeah no shit lol",
  "Does Indian credit cards have protection against fraud or are you out the money if your card gets stolen",
  "I will be messaging you in 7 days on [**2025-08-29 06:58:15 UTC**](http://www.wolframalpha.com/input/?i=2025-08-29%2006:58:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/laptops/comments/1mwcbkj/guys_is_this_genuine_like_seriously_1_rupees/na17fd3/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Flaptops%2Fcomments%2F1mwcbkj%2Fguys_is_this_genuine_like_seriously_1_rupees%2Fna17fd3%2F%5D%0A%0ARemindMe%21%202025-08-29%2006%3A58%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201mwcbkj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
  "Unfortunately it's not, no green color is used on the checkout page for me anyways",
  "Im unable to open the website so probably a scam",
  "... yes, it's right there.",
  "Please explain",
  "[deleted]",
  "This isn't helpful.",
  "Go ahead and try it then I guess 🤷‍♂️",
  "Yeah some people can be quite rude and dismissive in here",
  "Please explain",
  "Provide a link for that please.",
  "But it's a phone",
  "I see the same product using my Macbook.",
  "OP is clearly on a phone though",
  "Bruh unless it’s modifying webpages locally, it’s still a price served from Lenovo server.",
  "uppercase letters aren't allowed in domains",
  "Yeah I'm sure that's much more likely than a simple pricing mistake that happens all the time and would never ship",
  "This is what I'm thinking. Not that they'd do it intentionally, but the order would probably just get entered into their automated system to process it and the request to package and ship the laptop would be passed into their fulfillment/shipping department and someone there might ship it, not knowing or caring what people paid for anything.",
  "Yea, like my dad saw a wrong price on jbls site, 0 euro soundbar, and he ordered one, but then he ordered 15 more. Im pretty sure thats the reason that they catched it. A while ago i saw a wrong price on jbls site, 25 euros for a flip 4 camo. I ordered one and actually recieved it",
  "Most likely true. I work at a very large company and work in picking and shipping orders, and it's generally the same for every company. If a product is in stock and is purchased, the order is automatically added to the queue and dropped in the next wave of orders for the warehouse workers to pick and ship it. \n\nMany times the packlist/order receipt will show the total price of the order, but nobody really pays attention and even if a warehouse grunt sees it, they will assume nothing and still send it out. No managers or financial workers will see the order until well after it is shipped and delivered in most cases",
  "I have worked at a popular grocery store for over a decade. In the U.S. if a store has a price sign in front of a product that indicates an incorrect price, we have to honor it. Otherwise it’s called bait and switch. I have no idea how this is handled online or internationally however.",
  "They don’t. Law undergraduate here. This falls under contract law. A website listing or product is considered as an **invitation to treat**, and not an **offer**. To define an offer, I will quote it from the case of Preston Corpn Sdn Bhd v Edward Leong: An offer is an intimation of willingness by an offeror to enter into a legally binding contract. Its terms either expressly or impliedly must **indicate** that it is to **become binding on the offeror** (buyer) assoon as it has been **accepted by the offeree** (seller).\n\nEven if the customer were to send an offer (by checking out), a **binding contract** is not yet formed because Lenovo has yet to accept that offer and they can choose to back out as there is no **legally enforceable agreement** yet. (A confirmation email is also not signifying of acceptance of order!)\n\nA similar example to this would be Chwee Kin Keong v Digiland Mall Pte Ltd. TLDR is that an employee keyed in a pricing for a product at $66 instead of $3,854 (MSRP) and the company obviously didn’t want to fulfil orders that were made and got taken to court. Court ruled in the company’s favour.\n\nIn consumer court, courts do consistently rule in favour of the seller during obvious pricing mistakes like a $1 phone etc. because they take the view of a **reasonable person in consideration and apply the objectivity test**. \n\nFor example, in this case, the court said:\n“I find ... that the plaintiffs, given each of their backgrounds, would in any event, each have separately realised and appreciated, before placing their purchase orders,that a manifest mistake had occurred – even if no communications on the error had taken place between them. Further, the character of the mistake was such that **any reasonable person** similarly circumstanced as each of the plaintiffs would have had every reason to believe that a manifest error had occurred.” . \n\nOtherwise, the court would also simply treat it as a **clerical or unilateral mistake** and not punish the seller. Similarly in this case, Lenovo would win.\n\nIf there’s any Law graduates reading this and want to improve on my stand, please do! I’m still studying and open to improvement",
  "Nope where it's clearly a mistake and you know it, they don't need to honour it",
  "They are not and three seconds of googling will support that. Just because you once managed to slip one through doesn’t mean that’s the law.\n\nImagine a computer store mislabelling a €4000 laptop at €1 and a large amount of units are ordered overnight while nobody’s at work. Your argument is that EU law now effectively forces this company into bankruptcy by being required to honor these sales that were clearly made exploiting an error in pricing?",
  "No....",
  "Depends on the Ts and Cs",
  "Yeah.... depends on if that's enforceable to a website in another country.... Much like the GDPR fines the EU charges.... a US website isn't subject to that....  even if they decide to keep data on you... because they're not breaking THEIR laws.",
  "had this happen in the us with a 5000 dollar tv listed for 5.\n\n  \nthey cancelled the order and gave us a 20 dollar off of 100 or more coupon.\n\n  \nthis was on Samsungs website a few years back.\n\n  \nmaybe the uk is protected against this somehow but I’m almost positive there’s some loophole that companies could take advantage of to cancel it. regardless, it’s worth a try if it’s from the legit website",
  "Well it's the same in other accounts too",
  "This is the way to do it imo.",
  "I don't think that's how it works. Especially considering that OP is checking it on a phone. Like imagine if disc.google.com could be swapped by something malicious? \n\nCorrect me if I'm wrong, but aren't sites check response and then send info about a site, judging from 1) the subdomain, 2) the page (/in) and then parse arguments passed in the url if there are any? It's server-client thing – client sends response (get/post etc.), site's backend transfers specific data to the client (rendering the page if needed and so on). Done.",
  "you really think that there is a malware that will only affect lenovo's website dns? Most stupid way to snatch someone's credit card infos.",
  "Yup as expected ",
  "Bro i also paid but it shows incorrect entry and it got cancelled 🤣",
  "overthinking final boss",
  "[deleted]",
  "And look at the Lenovo logo, the padding is absolutely way off",
  "It took me about 30 seconds to load.\n\nThe first time it came up I had the same 1 rupee deal. I reloaded and it's gone. They may have just found it.",
  "Can u google lenovo official store new bel road and check?",
  "store.lenovo.com is a subdomain of lenovo.com, which is Lenovo's parent public domain.\n\n*anything*.lenovo.com is legitimate Lenovo.\n\nDomains are ordered right-to-left. \".com\" being the top level, \".lenovo.com\" being Lenovo, and anything else is just a host or subdomain belonging to Lenovo.\n\nWhat you need to watch out for is what is *after* the \"company\" up until the first \"/\". So for instance;\n\n- https://store.lenovo.com is the store at Lenovo.com.\n- https://lenovo.estore.net is \"Lenovo\" at eStore.net.\n\nAnything after the \"/\" is just a path to a file on the host. So;\n\n- https://store.lenovo.com/in is the \"in\" folder on whatever resoirce store.lenovo.com points to. In this case, it contains the India version of the store pages.",
  "Cant say about the India site but yeah, Lenovis site in general is pretty garbage.",
  "Well yeah if you're wrong. Learn about DNS.",
  "[deleted]",
  "Android run on a version of Unix, which contains a hosts file that can technically be edited to redirect specific URLs to a specific IP address.\n\nThis is technically a way you could target someone, but would be a weird angle of attack honestly \nThere are better ways to fake a website.",
  "They gave out a free $350 tablet when I bought a $400 phone last month so they might just be trying to dump old inventory and they don't care about taking a loss.",
  "Completely understandable. My situation was a bit different though, the product had the correct price sign and it became extremely cheap when it got scanned by the cashier.",
  "I’m fairly certain we have the same rules here in the Netherlands (from the law classes I’ve had during my first year of business admin)",
  "Depende del país y de muchas cosas q poco importa lo que cites",
  "I didn't read the wall of text, but I meant if they accept the order and send a confirmation email then they have to honor it. Obviously if they don't accept the order they don't have to to honor it.",
  "Not just that, but if you know that it's an error and you accept it, they can claim it's theft because you should've known that the price was an error.\n\nAn example often give is when someone sets the gas pump price accidentally to $0.32 USD when it should've been $3.20/gal USD.... if you fill up at $0.32/gal, you can technically be charged with theft.",
  "bamkrupcy? because of a couple ten thousand dollars ? bro you have no idea how companies finances work",
  "Well.. retail eats cost for mistakes all the time. If we have an outdated sign that didn’t get removed for a sale and a customer complains or seems upset we give it to them instantly no questions asked. Especially customer service oriented retail.",
  "Not really, you can't sign your rights away. At least in the EU.",
  "Not true. It's a common misconception. I",
  "u/Inevitable-Owl-550 i have ordered 2 of them, if i actually get , i will send you one",
  "the certificate is the first thing that is being validated, after opening a tcp connection to https, even before sending commands to the web server.",
  "Trust chain will be broken in that case. This validation happens even before the API call could be made, as a callback. There is no way to bypass it other than manually adding the root certificate to trusted root authority which I did not do, in every other case it will not qualify as HTTPS. Even if I manually add it, even then it will be not a real HTTPS and a warning will be displayed when I open the site for HTTPS containing a self signed certificate. \n\nPS : I work in security domain.",
  "I'd imagine if you do this type of attack you'd likely try to redirect as many possible large sites as you can (banks, large companies, big retailers, etc), so it wouldn't have to be this one specifically, but it is plausible if they failed to hijack more",
  "Are you aware of jokes? Jesus Christ lol",
  "I googled it and it works so this must be a phishing website",
  "Oh, I see. Thanks for the explanation.",
  "Thats such an unlikely attack vector lol. Why would you even suggest this?",
  "is it rooted",
  "Only modifying the hosts file would show dire HTTPS warnings in the browser because the site certificate wouldn't match.",
  "Bro be quiet it is 100% a glitch on the website, since it is on offical lenovo website he should buy it and if it charges full price then just refund lmaoo",
  "Or it can configure private dns to do the same thing. No root required.",
  "Good lord, I very much doubt the guy has such a threat model someone is going to do that.",
  "Keeping said inventory is probably losing them more money",
  "Oh yeah, that’s a weird one! Lucky purchase!",
  "We don't. Webshops have to honor the order, unless the error they made was big enough for the buyer to know beforehand that is was a typo. So in this case, yes, they would not have to honor it, but they have to honor the agreement generally when you purchase something on their website.",
  "True, but I was just giving an example to explain. However, if we look at it in layman terms, the universal legal principle will be the same. You simply cannot reasonably expect to enforce a contract based on a price that is **obviously an error**. So in any jurisdiction, I’m highly confident that Lenovo would win should this be taken to court. \n\nIf you search up similar topics, you will find that across common law (Singapore, UK, US) and civil law (France, Germany, EU), the courts follow the same reasoning:\n1.\tObvious pricing errors = no binding contract.\n2.\tBuyers cannot exploit a mistake they recognize.\n3.\tThe worst that happens to the retailer is refunding the money.\n\nHowever, if we are referring to say, a $599 MSRP laptop being listed erroneously at $499, the court may order the seller to honor some of the orders, which has happened in many jurisdictions before, since borderline errors (e.g., 10–25% off normal price) can be interpreted as a discount/promotion and would lead a reasonable person to believe that there is no mistake in pricing.\n\nIn this case though, it’s a laptop for $1. So it’s pretty obvious and no court would side with the buyer.",
  "Incorrect.\nTL;DR Lenovo (and most other companies) explicitly states that a confirmation email does **NOT** signify acceptance of the order. **No acceptance = No contract.** (This clause is commonplace for every business) Consumer will lose if he tries to go to court, even if he has the best lawyer. Below, I will cite Lenovo.\n\n**Full explanation:**\n\nA confirmation email, if you dig deep into any businesses’s Terms and Conditions (the thing that everyone ignores), has built in protective clauses in their Terms of Sale, and they’re not obliged to provide the consumer with any goods or service with a confirmation email alone. **Confirmation email ≠ acceptance.** A confirmation email only signifies that they have **received** the order.\n\nHere, I will specifically cite for this case, Lenovo. Under their T&Cs, it clearly states that **a confirmation of Lenovo receiving and/or processing your order does not constitute acceptance of the order.** (1.2)\n\nSource: https://www.lenovo.com/au/en/legal/new-products-and-warranty-services/?srsltid=AfmBOop9YcXqtlgbWWSEtLd4WCy7paTFtCMABKIs8xZmfYyPvIBRyTbc&ut\n\nIt also states under 1.1 that:\n\n1.1) **No contract** for the purchase of Products or Services will be formed until Lenovo accepts your Order by **one of the following**:\n\n**(a)** shipping the hardware Product and sending you a shipment confirmation email; or\n\n**(b)** making the software Product available to you; or\n\n**(c)** providing the Service to you.\n\nTherefore, that confirmation email is **not a binding acceptance** and is more of an acknowledgment that they’ve received your order and are processing it. Until shipping occurs (or software is delivered, etc.), Lenovo **reserves the right** to cancel or adjust your order **even if** you’ve already received a confirmation email or any other form of confirmation.\n\nI personally think that TV shows these days make the law seem very shallow to the average person, like; “Little guy sues company and wins!”. \n\nThe reality is, that every business has multiple built in protective and failsafe clauses layered into their contracts etc. to make sure that real consumers **will never win against them** in court. I feel like the average person should read more into the T&Cs so they know what they’re getting themselves into, but we don’t, so companies take advantage of that; and that is why we have lawyers :)",
  "Do enlighten me. 99% of companies in the EU are labeled “micro scale”. And also, way to deflect from the question about legislation ;)\n\n“A couple ten thousand dollars” in this case would be 5-10 laptops sold at the wrong price. You can see from this topic that ppl flock to these things like moths to a flame.\n\nMy most commonly used online computer store typically has a stock of about 50 of each gaming laptop, do the math on a say 5 of those products being mislabeled overnight and each those selling out at a €3999 discount. That’s about a million euro lost on a clear database error. “Just suck it up, it’s the law”, yeah not so much bro.",
  "Perfectly legal to have Ts and Cs that reserve the right to cancel orders where there has been made an obvious mistake",
  "Give an update if the order actually gets processed. Unlike what others said, the website itself is not a scam for sure. The items listed by that seller is controlled by them afaik, so either it is their mistake and they will simply not process the order, or, if you're lucky, there must be some kind of flash sale for a few units and they might actually give it.",
  "How were you able to order it ?\n\nDo you have a link for the page ?",
  "Update if you get it",
  "Mind helping me out as well?👀",
  "did u get em",
  "See dm",
  "[removed]",
  "what’d they say",
  "They wouldn’t dare go through the Ardennes /j",
  "Have to redeem themselves when they were wrong the first time lol",
  "I agree, but like... The laptop is not one rupee..",
  "Wow. Someone here finally has some common sense.",
  "[deleted]",
  "you dont know where im from, my country has 2 million pop.. the site in question gets about 5 thousand people traffic everyday.. and the amount of people looking for acs is like 100 every day, there were only 30 of those acs in stock..thats 12 grand and yes statistics matter and not every error is amillion loss dude, get over yourself",
  "this is how Samsung weaseled out of a similar pricing mistake a few years back. both us and eu orders were cancelled ( this was around 10 years ago tho)",
  "Depending on place it might be even law. In Poland for example it's literally in civil code.",
  "Website might be a scam. The copyright is linked to 2021.",
  "It's over bro , was a technical error",
  "See dm",
  "happy cake da",
  "[deleted]",
  "LOL he deleted it?! He legit thought I was serious when I was saying Rupees are a fictional currency from Legend of Zelda and when I said no shit he still thought I was being serious. Social IQ of a dead tree I guess.",
  "twice",
  "exactly, like nobody cares about this bla bla bla rooted phone host files like man he tried other things and it was was the same, it's just a damn glitch.",
  "to be correct: a non rooted phone also has a hosts file \\^\\^",
  "We’re not talking about that specific site though, are we? Nor are we talking about your country. You brought up EU law and some fantasy story that they have to sell it at the shown price no matter what it is. Apparently you’re more interested in arguing than taking a minute to check the applicable rules, have fun with that and have a good night.",
  "Did they say it's been cancelled or that they'd honor it lol?",
  "I don't see ur DM",
  "dm me",
  "People on reddit\n\n50% chance it's a scam\n49.99% chance you're the target of elite state sponsored cyber attack. \n\n0.01% chance it's a genuine error / mistake. \n\nPeople have lost all sense of logic nowadays!",
  "Exactly I 100% agree with you, the dead internet theory is real.",
  "My Portable Game station setup Lenovo Legion Pro 7 Razer blade 18 ",
  "This man is hitting three cartridges while gaming on two laptops",
  "Why two laptops?",
  "How do you like the Legion's OLED screen? I'm kinda hesitant to get one because of the reflections.",
  "looks good!",
  "Yezzir 🤟🏽",
  "Kinda out of the blue but has your Zephyrus been reliable and performed well with no issues ? Im asking a lot of Zephyrus owners to get a better picture with so with so many horror stories such as liquid metal leakages, coil whine etc Im trying to find the good in all the negativity since I need a portable MacBook like device but with gaming capabilities so has it been reliable and easy reformer well ? ",
  "lol why not",
  "its a 10/10 G colors just pop! HDR and 1000 true black is so satisfying to see",
  "sorry my guy thats a different brand i dont own a asus grand laptop, but the legion pro not to expensive as the other brands and performance and thermals are great for longevity",
  "No coil whine and I don't believe this one has liquid metal, so no leakage issues there. Overall, it's been great. The build quality is pretty solid, but it's not as good as the MacBook or the Razer Blade I had. However, Razer got rid of the glass on their displays, which has led to them feeling lower quality to me, and lesser in comparison to the Macs that still use glass. The bottom panel is a cheap plastic one which again, feels lesser in quality vs those other two, but it's not something I notice in my regular usage because it's either docked or on a desk and then going in and out of a bag. \n\nIt has a minor issue on the trackpad, but it's still very usable, just annoying. Since I rarely use the trackpad and use external M&K when at home, or a mouse and the built-in keyboard while traveling, it's not a big deal. \n\nPerformance-wise, I'm still able to max out all of my games on absolutely Ultra settings including Path Tracing on Cyberpunk 2077 and Alan Wake 2 with good frame rates on my external 34\" Ultrawide. When playing on the 2560x1600 internal display, performance is obviously even better. \n\nI bought this because I needed the absolute most power possible in the lightest, most portable package possible. I traveled for work weekly for the past few years, and I travel regularly, so having this has been a godsend. I remember playing Warzone in LaGuardia at one of the bars when my flight got delayed and blowing off steam was great. I took this to QuakeCon for 3 years now, and the ability to pack more power than my desktop into something that fits in my backpack is amazing.  \n\nComing from a Mac, probably your biggest hurdle is going to be battery life, but the latest CPUs are supposedly much better in that regard (though we hear that every generation so YMMV).",
  "ever considered add a monitor with a bigger screen?",
  "Cost, managing files and games between two computers, weight for transporting them, etc. etc. etc.",
  "I have an OLED TV so I know how great OLED looks. My question is more about how reflective the display is, because no matter how good it looks, it doesn't matter if you can't see shit because you're staring at a mirror.",
  "Why do u call it true black or whatever? the pixels are literally off..",
  "I was replying to the other guy who has a Zephyrus not you but thanks for the reply! ",
  "i got asus oled dual mode 4k.240hz 1080.440 hz back home its fire thinking bought shipping it to where im at now",
  "i travel for work all over the place can u imagine shipping a expensive desktop on the plane having people toss around yo setup like its a bag of candy or just shipping a pc state to state lol so i put my laptops in my backpack hop on a plane an call it a day.",
  "5k for the razer 2.7k for legion, weight probley 9pounds with chargers and got 3tb in legion 2tb in razer",
  "well i wear transition lenses so i dont have those problems but no crZy glare i see",
  ">i travel for work all over the place \n\nGreat. So do I. I also travel frequently around the US and internationally for pleasure. I took my laptop to Europe for 5 weeks earlier this year, to QuakeCon in August. I took my Razer Blade around the world for 9 months. \n\nThat doesn't clarify the two laptops angle. \n\n>can u imagine shipping a expensive desktop on the plane\n\nHaving shipped my desktop for a family member, yes. Again, what's the point of this? It has literally no relevance to the question on why you want *two* laptops. \n\n>so i put my laptops in my backpack\n\nI'm going to give you the benefit of the doubt and assume English isn't your first language and there's a language barrier here. ***Nobody*** is asking why traveling with a laptop is easier than a desktop. The question is why you have *two* high performance laptops instead of *one* high performance laptop and maybe a good external screen.",
  "bro i got multiple cars multiple vapes multiple everything what else u want to hear 😂 thats just me i guess",
  "I get having multiple laptops, I have 3 that I use regularly but more then one gaming laptop seems a bit unnecessary.  I like having non-gaming laptops because they are really cheap and durable so I don't have to worry.  But I guess if money isn't an issue I can see it.",
  "Sudden weird bubble on the laptop frame any idea how? Should I be worried (Lenovo Legion 5 2021) It was just there no idea how",
  "Did you take apart the laptop at all?\n\nI'm guessing it's from a too-long screw reinstalled into the bottom.",
  "[deleted]",
  "Screw",
  "Yes, I was a Dell tech for 5 1/2 years, and yes, that screw was too long and is poking its way up through the palmrest\n\nDamage is done.",
  "Definitely over tightened screw, recently had a Lenovo legion come in for repair, with exactly the same lump.",
  "Wrong screw (too long). This happened to my laptop after I changed the RAM.",
  "LSD (Long Screw Damage)",
  "Definitely too long of a screw put in on the reverse side.",
  "long screw in a short hole. sigh",
  "Don't worry. Your laptop is going through puberty.",
  "It comes with the new bios update, helping to leave a distance to keyboard and screen",
  "Looks like your laptop hit puberty and just got its first acne. Take it to a dermatologist.",
  "semen, clean your laptop after youre done with your kinky stuff",
  "Most likely a long screw in a short hole.  If this legion is like my legion 5 there are supposed to be small screws running along the front bottom.\n\nAnother question I have is if OP were to remove all the screws and make sure only small ones are in the holes along the front could you just push this bubble back down and be fine or is this permanent damage?",
  "I did the same for my legion 5 looool. I opened it, saw it, knew right away lol",
  "Just a loo long of a screw put there at one point. Won't do anything. Purely cosmetic.",
  "Level 1 technician replace the screw in a wrong location. #wrongsize",
  "This happened to me exactly there but i put a too long screw",
  "Long screw in a short hole😂",
  "It's the screw poking through, someone put it in the wrong place.\n\nI did this with my old ASUS laptop, it's the kind of mistake you only make one time, I'm super careful to separate the screws now when I take it apart so I know which goes where when I put them back.",
  "Too long screw in the wrong hole, why do they make the screws different lengths anyways and why don’t they just make it metal?",
  "pimple",
  "As mentioned in other comments, the \"\"technician\"\" put the wrong screws in the wrong holes. He damaged the case, basically.",
  "You should be worried. Your laptop just hit puberty. It will probably start acting up and turn into a drama queen soon, so be prepared.",
  "Just a pimple your laptop is getting older no worries",
  "I think it’s aroused 😳",
  "It’s going through puberty",
  "Has it ever been disassembled? If so you or whoever took it apart put the wrong screw in that location on the underside and it's pushing out.",
  "Just bang another sticker over the top of it",
  "did this on my own laptop but accident. turns out one if the screws is ever so slightly longer. would call the repair place and ask for compensation for a new panel",
  "If it was an ASUS they would void the warranty, rich because they are the ones who usually do that to units we send for warranty.",
  "Relax guys it's just a pimple. It'll go away in a day or two.",
  "Yeah I recognize those are",
  "I believe you have opened the case of your laptop then you've misplaced a screw that's longer for that place.",
  "I didn't but the battery was replaced maybe the technician",
  "This is an over tighten screw, I seen it a bunch.",
  "Repair technician here.  This is the correct answer.  They put a shorter screw under the trackpad, whoever worked on this mixed the screws up.  Easy fix.",
  "Ha I did this. I wasn't paying attention and didn't realize all 3 track pad screws were different sizes. Let's just say I now have 2 dot friends above my track pad.",
  "[deleted]",
  "Doesn't even need that.  Plastic can be pressed back into place after the screw is swapped.  Purely cosmetic.",
  "It was lenovo's on site warranty guy also contacted them regarding this",
  "Remove the screw aand replace it with the shorter one the tech was suppose dto have used, then you can take a Bic lighter and heat the spot up and press it down once the plastice is pliable, should only take a few sconds of flame to heat it up enough, then use the sloped side of the lighter to pres the plastic down. It won't be perfect but it's an easy fix.",
  "That's my guess aswell.",
  "Only form of LSD i don't like",
  "🤨",
  "1) weird comment\n\n2) in what world is jacking off considered kinky??",
  "I have tried that on a few devices, I would say it's permanent because the laptop is white. On a darker colored one, you could carefully heat it up until you can push it back, but white plastic is likely to be marked by the heat",
  "There you go.",
  "Ah yup they put a screw that was too long in the wrong place. I would take it back to the person who did the battery repair.",
  "That tech had to be a noob. Remove the screw, find the short one at either the midway or back side, and swap them, then roll over the spot with the round part of a spoon and some force, and you can usually get it very nearly back to normal.",
  "[removed]",
  "Euhh no!",
  "[deleted]",
  "Or you can just simply pretend that it isn't there,don't you?",
  "When it’s on a laptop",
  "Not necessarily. Did a Lenovo the other day and it turned out the plastic on the bottom cover had broken for two screws, so they went in further than they should have and formed similar bubbles. Not sure why the plastic broke in that particular manner, didn’t even notice it was gone until it happened. Poor molding, maybe?",
  "This is 100% what happened. I've seen it done before on many a HP computer.",
  "It was lenovos very own on site technician so will need to contact them",
  "It could be worse. I handed a laptop off to another tech after finishing diagnostics for battery replacement. When I walked by they ended up cracking hinges on both sides.",
  "So close yet so far. It looks like he was confused and combined it",
  "Classic redditor",
  "You know your mum doesnt love you?",
  "I brought this laptop while I lived in a city now my job forces me work in a very rural area am happy I got my battery fixed honestly this toh is minor aesthetic damage will live with it :)",
  "Portablegamingdevicesexual or PGDsexual for short",
  "Poor everything. It's a Lenovo.",
  "Was it at least one of those cheap grey plastic HPs? lmao I hate that.",
  "Or, English isn’t their first language?",
  "Yea but the redditors have to correct them and make fun of them , so they can feel better",
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "Would you get a macbook air m4 over Lenovo Legion 5i? Been thinking about this for a month now and haven’t decided yet. I do 3D modeling and my pc gave up. I also use multiple tabs of tiktok, IG, and other socials since I do source content creators with heavy formats google sheets.\n\nI’ve found a quite a good deal for the m4 air with 16gb unified memory and 512gb for 63k pesos, thinking I could also build a pc set up for 50k pesos if I bought the macbook. However if I go for the Legion I will spend around 86k pesos with rtx 5060 ryzen 7.\n\nWould buying the Macbook m4 air be enough? Or should I buy macbook + pc combo. Or just stick with the lenovo legion as my desktop and laptop.\n\nThank you for your opinion in advance!\nPS: my currency is Philippine Peso",
  "MacBook is going to perform way better in anything productivity related and battery life is going to obliterate any non MacBook laptop there is. Also the build quality is so much better than any gaming laptop, and indeed those Legion laptops suck in terms of both portability or build quality",
  "I was with a similar decision a few years ago, I decided for an rtx 4050 laptop to just do everything. It was a huge mistake, gaming laptops are generally heavy, battery life sucks and have a huge power brick. I travel a lot for work so it became a huge pain to use, plus the screen was just FHD. Now I have a macbook air m4, and man it is much more pleasant to use, text looks crisp thanks to the high resolution, and I barely have to charge it every few days. Plus, it is easy to carry around.\n\nMy opinion: get a macbook air for productivity, and a dedicated gaming device (pc or console) just check if the 3d modeling you want to do will be good enough on the air. I just sold my gaming laptop, I will be probably waiting for the steam machine. Macbook air isn´t bad for some light gaming though.",
  "I think the MacBook can do the 3d models, question is could you bump the memory and come in closer to the Lenovo.\n\n\nIssue with the Lenovo, you know what your walking into the battery life will be half of the mb, I believe you can charge it by usb c and if you have a decent charger brick you should be fine. But the vram on the Lenovo you want more than 8gb or you could run into issues with exporting and models and games. You could with the MacBook also but 24gb can help resolve that. \n\n\nMy thing would be should I rebuild the pc, spend some extra on a good tablet with keyboard setup for portable travel.. Idk your use case. But id take a mb over Lenovo with 8gb vram. 12gb vram I might would take the Lenovo. \n\n\nBut also pc + tablet.. ",
  "Great! Thank you very much for this comment.\n\nWas thinking the same if I ever use the gaming laptop for everything and might cost me more in the future if the device finally gave up based in my work load. I’ll definitely will need to buy another..",
  "I just got a 5070 laptop weighing 5.5 pounds which is nice and cannot tell it is a gaming laptop.",
  "what about the charger? Is it usb-c?",
  "No, regular charger",
  "Lenovo Legion Pro 7, RTX 5090 Buy it or not!!! I am able to get Lenovo Legion Pro 7 with below specs at the price of 3.62 L. should I take this deal or not? Any other suggestion than this?? My usecase is gaming only.\nSpecs:\nMicrosoft Office Home 2024 India\n• 64 GB DDR5-6400MT/s (CSODIMM) - (2x32GB)\n• 1 TB SSD M.22280 PCle Gen5 Performance TLC\n• NVIDIA® GeForce RTX™ 5090 Laptop GPU 24G...\n• 5MP with Dual Microphone\n• 4 Cell Rechargeable Li-ion 99.9Wh",
  "You can’t ask for something better 🙂",
  "looks great if u have the money :(",
  "no there are build quality and qc issues, i bought the 5080 version",
  "Great deal but use discounts like student, credit card cashback, affiliate, coupons. Whichever you can.",
  "can you help me where can i get the affiliate discount coupons and other coupons as well",
  "Man, this is where it kills me on someone asking if he should build a pc or get a laptop\n\nIf laptops had full size pcie port (gen 5x8), it would have the best option to consider for people like you, could have get a rtx 5080 24gb gpu and a ultra 9 laptop as igpu have got enough powerful for low level tasks",
  "I have this exact spec laptop also bought India \nWorks great \nOiled gloss might be issue for some users\nPerformance is any game max\nNo regrets\n\n3dmark score is 24448 , gfx score 26120 and cpu score 17942\n\nI haven’t had issues with my build and I also use a stand initially for a month just to raise it and it was fine unless super long gaming session in like ghost of Tsushima after maybe 4-5 hours intense keyboard also gets toasty. But with cooling pad now it’s pristine .",
  "I am confused whether i should go for this one or should build a pc?? also i have seen in some videos tgp of rtx 5080 and 5090 laptop is same so should i go for rtx 5080 laptops then??",
  "so should i go for 5080 or 5090? is there any major changes in 5090 laptop over 5080??",
  "from where you bought it? and am i getting a good deal or should I buy it from elsewhere",
  "A pc will always be superior to a laptop when it comes to performance",
  "Check mobile vs desktop score. Mobile unfortunately is fake 5080/5090 due too pwr and cooling limitations 🤌🏼",
  "No the issue is with the chassis and quality control at lenovo both 5080 and 5090 come in the same chassis, i bought mine 5 days ago and i filed a ticket for replacement, lets see what they will do, but if you ask me i’d rather buy an asus rog strix its at a similar price point",
  "Bought it from Lenovo India site. Offline stores charge 20k more so I’d avoid the stores. Sites price is still about same as at launch. Maybe can get a bit more if you ask the sales team. Best discount is if someone has the Lenovo employee discount code. But if someone offers you that here they generally want some money for it. So idk if worth. Also if you do order it the shipping details date and all which they give will keep changing up and down and won’t update properly. Just save yourself a headache and assume it will come between 20- 30 days.",
  "but what are the extra charges i have to pay for it?? can it be build with same config within rs4L that is my budget",
  "You’re downgrading to a 5080 from a 5090? Is that right?",
  "The extra charge is now you have a desktop instead of a laptop. For the same amount of money, you can always get a desktop that will perform better, but you can't exactly take the desktop with you everywhere you go.",
  "the laptop comes with an option to select 5070ti or 5080 or 5090 i got mine with a 5080",
  "Lenovo legion pro 7 gen amd 16\" Hi guys, i got an offer on this laptop with ryzen 9 9955x3d with 5080 rtx along with 32gb ram and 1tb ssd oled screen for 3464CAD before tax. Is this a good deal?",
  "Hey everyone any thoughts on this deal!",
  "Its atleast 20 percent to expensive.",
  "But the laptops with these specs are going over 4500$ ",
  "https://www.bestbuy.com/product/msi-18-gaming-laptop-3840-x-2400--amd-ryzen-9-9955hx3d-with-64gb-memory-geforce-rtx-5080-2-tb-ssd-core-black-black/J3P7TXR2LR",
  "This one is more expensive but it has double the ram and double the storage and is a bigger screen. What is the refresh rate on the laptop your interested in?",
  "Brother that's USD price if i convert it in CAD its 4600 before tax",
  "The laptops you suggested are beasts but they are all in USD if i try to buy them in Canda they are over 4500 which is way beyond my budget ",
  "Because of tariffs?",
  "https://www.bestbuy.ca/en-ca/product/hp-omen-16-max-16-gaming-laptop-shadow-black-intel-core-ultra-9-275hx-64gb-ram-2tb-ssd-geforce-rtx-5090/19195151\n\n\nThis is the omen one that you provide the link for 😂",
  "No brother tariffs are not the problem, it's the exchange rate , sales tax and import costs.",
  "Lenovo Yoga 7 with AMD - good or bad option? My bad if I mess something up on this post, I have to do it on my phone and it's late lol.\nNot too familiar with Yogas; are they decent? My main worry with a Lenovo is that the last one I got, I ended up returning it because it ran into a TON of issues within a week of barely using it - BSOD for no reason, wouldn't correct to wifi after initial updates, delayed keyboard feedback, stuff like that. It was an IdeaPad though, and those are trash anyways (I dunno what I was thinking, getting it in the first place, tbh).\nLooking to get something that'll work for me in college. I am taking art classes and a touch screen laptop would be great. If this, the Yoga, is junk, what else should I look at? Thought about Samsung, but I'm also rather unfamiliar with those too. Are they better for drawing and general school work? Was looking at the 360 ones, but I was a tad worried about the glass screen (hopefully I'm thinking of the right thing) cause I tend to damage things just by looking at them, somehow. \n\nSoooooo. Steer clear of Lenovo, or do I just buy it while it's on sale? College starts next week and while I CAN use the dumb Chromebooks they let students borrow, I REALLLLLY hate drawing with a mouse :)\n\nLink: https://www.bestbuy.com/product/lenovo-yoga-7-2-in-1-16-2k-touchscreen-laptop-amd-ryzen-7-8840hs-with-16gb-memory-512gb-ssd-artic-grey/JJGSHX8YFG",
  "Every one have different experiences with brand, personally, Lenovo is one of my top brand laptops pc, they have good spec/price/quality, and the one u have here seem very good, yoga is a high quality category of the Lenovo laptop, AMD CPU can even play AAA game with his iGPU, and price here seem pretty low. Then again, quality control vary everywhere, I have good experience with my Lenovo, hope it’s fine for you",
  "i bought the maxxed out config and i am quite happy with it. the display is gorgeous",
  "In general avoid 2 in 1 laptops, almost always badly built and there isn’t really a good option. And Yogas are usually very thin and break easily on their own. Steer clear of those. \n\nAlso glass screens are usually fine unless whole screen is glass. Stuff where the glass screen is encased in a plastic/metal frame is much better, plastic screens are not ideal.",
  "Thank you for your input. I've seen a loooooot of mixed reviews about the yogas, and as a recent member of the \"I hate ideapads\" community, I've been a bit skeptical of anything that isn't a Thinkpad when it comes to Lenovo... Unfortunately, I'm limited to BestBuy and ThinkPads are out of my price range, otherwise I'd just get one of those and deal with the mouse drawing. I'm glad to hear that you've had a good overall experience with the brand though; I'll definitely keep this in mind when I finally make a decision.",
  "Do the hinges seem pretty good? ",
  "Ah, alright. Do you think it would be a reasonable idea to get a tablet for drawing, and a non-touchscreen laptop (only reason I've been looking at touchscreens is for the drawing, I don't care about them otherwise) for assignments and such? \n\n\nEither way, do you have any suggestions on what I should get?",
  "I am from France, so customer protection is pretty important here, btw I have a Lenovo ideapad pro 5 gen 9 (780€, oled, 2.8k, 84Wh, 32go ram, amd ryzen 7 8845hs, 1.5kg, full aluminium), I compared mine with some yoga I say in shop and even thought yoga should be higher quality, my ideapad pro feel better in quality (I suspect that is because it’s a Chinese version product = \"xiaoxin\" coz Chinese version generally have a higher quality and lower price)",
  "yes smooth action can initially open with one finger then use 2 to open fully",
  "Used to think the same for touchscreen that I needed it but actually I don’t, but here you’re drawing which I don’t do a lot. You can try a drawing pad.\n\nAnyways, i don’t know much about 2in1s, i only know bad models.",
  "Wish I could say the same about America and customer protection; I've had some pretty bad customer service experiences with pretty much every laptop brand out there, and they usually want me to pay more money, even with a warranty, to get a fix. Wish prices weren't so crazy here too. Feels like I'm spinning in circles just to find something I can afford that I'll be happy with.\n\nI've definitely heard better about the ideaPad pro build quality, so your statement makes sense. The ideapad that I had, and returned, wasn't a pro, and the casing was plastic and felt very cheap tbh. Perhaps I'll just steer clear of anything with a plastic case and see where that gets me.",
  "Oooh, I forgot about drawing pads. Haven't used those since like.. middle school. I'll consider getting one of those and picking a laptop with good build quality. Thanks for your input.",
  "What, US have the best price eve… wait a minute, since the 🍊 head became president did he impose tariff here? Then again, my DREAM laptop cost 2000€ in France and it’s 1100$ in America, the G14 ASUS zephyrus, did price hike by a lot? \n\nAnd yeah aluminum for the win, another good business laptop is ASUS zenbook, some like it (like me) other don’t (coz the material feel plastic and it’s way to light) search some video about it, it’s one of the most esthetic one for me lol, price should be low in the US.\n\nIdk if u have huawei laptop in the us since apple got scared of huawei, but they have some VERY good looking, high quality, good specs one for extremely low price even in France where price are HIGH, it’s only 550€.\n\nAnother brand is Samsung, some are great, some are expensive, it’s also extremely light and have a phone glass like panels",
  "I'm kinda on a tight budget so I'm probably a bit biased when it comes to my definition of \"crazy prices,\" but from what I've seen, it does appear that tech prices in general have jumped if they are imported in some way. Don't completely take my word on that tho, that was only like 30min of reading stuff online. Not surprising if it's true, it's a dumpster fire over here right now.\n\nNo easy access to huawei that I know of, over here; looks like ebay would be the best option for getting one. I've never heard of them before your comment, so definitely not common over here as far as I'm aware.\n\nThanks for the other suggestions and commentary about them. I'll take a look at the zenbook and Samsung - I was considering getting a Samsung galaxy book 360 when it was on sale but I took too long trying to decide, since I know almost nothing about them as a brand, and then it went offsale lol.",
  "My Lenovo Legion 5 Windows 11 Wi-Fi Keeps Turning Off I have a Lenovo Legion 5 with an AMD Ryzen 7 processor, and recently I’ve been experiencing a frustrating issue where my Wi-Fi keeps turning off automatically. I need help to fix this. Give one title",
  "Try reinstalling the drivers to wifi, it may help. Sometimes windows updates overwrite current drivers",
  "The most probable reason is the wifi driver. \n\nDid you reinstall windows recently or upgraded?",
  "My friend had a similar problem then the wifi setting were gone altogether. He had to reinstall windows after that",
  "I reinstalled it but didn’t work",
  "While trying to fix the problem I did reset my pc (keep files).",
  "I had the same problem after automatically updating from Win10 to Win11. When using Win 10, no issue happened. After upgrading, from time to time, the wifi turned off and needed to be reconnected.",
  "Try to google your laptop model with your problem. My friend had similar problem with Bluetooth, turns out it was a mother board related problem. If you know how, you can also try to boot live Linux, and try to use wifi there. If it will work, it should mean, it's windows related problem, and not hardware problem",
  "Hp omen max with 5080 or Lenovo legion pro 7 with 5070ti Pretty much the same price on black Friday deals. I have no experience with gaming laptops but this is where I’ve narrowed it down. \n\nThe specs would say probably HP, I think the ram speed is a little slower on the hp but that’s it. Build quality, experience with one or both, or just opinions would be welcomed",
  "Tough one the 16 go of vram vs 12 on the legion but I would compare the cpu and screens. Do you have the details?  Not all  hp omen max come with oled screens, so that’s a plus for the legion. Plus the legion typically uses the faster ddr5-6400 ram.  I have a legion pro 5 and have been really happy and typically online reviewers prefer the legions over hp.  Is there a store you can go look at em? The touch of the keyboard or track pad might be an instant no go.",
  "Yeah I realized after posting this that the omen doesn’t have the oled screen. Got caught spec chasing and didn’t realize. Now I’m trying to decide whether to get the 5070ti legion with intel i9 or 5080 with amd 9950hdx",
  "PSA: No one should be buying anything but the Lenovo Legion 5i Gen 10 Right Now Update: Lenovo Legion 5 15 (2025 edition) is the name, typo in the headline  \n  \nSpecialized use cases not withstanding, but [Notebookcheck.net](http://Notebookcheck.net) says this laptop has double the fullscreen brightness of any OLED laptop right now (925 nits) because it's shipping with one of the new true tandem oLED panels similar to the iPad Pro, and it can be configured for $1249. If you care about image quality this is the way to go.\n\n[https://www.notebookcheck.net/The-best-mainstream-gamer-in-2025-Lenovo-Legion-5-15-Laptop-Review.1047975.0.html#c13724188](https://www.notebookcheck.net/The-best-mainstream-gamer-in-2025-Lenovo-Legion-5-15-Laptop-Review.1047975.0.html#c13724188)",
  "NGL, this smells like an ad.",
  "Ha I hear you. But nobody paid notebookcheck!",
  "Lenovo Yoga 9i (Core Ultra 7 258V) - Will weak multicore performance be an issue for my use case? Hey everyone,\n\nI'm considering picking up a Lenovo Yoga 9i with 32GB RAM and the Core Ultra 7 258V processor. The thing is, this CPU only has 8 cores/8 threads, and from what I'm seeing on benchmarking sites like NanoReview, the single-core performance is solid but the multicore scores are pretty underwhelming.\n\nMy main use cases are:\n\n* Office work (Microsoft Office suite)\n* AI applications and Coding\n* Cloud Computing\n* Cloud gaming via GeForce NOW\n\nI'm not doing heavy video editing or anything like that. Given what I'll be using it for, should I be concerned about the multicore performance? Or will the strong single-core be enough to handle my workflow smoothly?\n\nWould appreciate any insights from people who have experience with this chip or similar use cases. Thanks!",
  "I despise the throttling on my Think pad x1 with 258v and 32gb RAM.",
  "Office Work - Fine  \n\"Cloud\" Gaming - No Effect  \n\"AI App\"??! - Coding - No Effect RUNNING apps/Services in the background? - Throttled.  \nCloud Computing - Anything you run in the cloud won't be affected, anything you run locally in the background will be throttled.",
  "Lenovo Legion 5i Gen 10 vs HP OMEN 16 Hi everyone, I wanna buy a laptop and found two options. I am an engineering student, doing my masters so I have a lot of modelling and simulation softwares which are quite heavier now. I don't play games much but I know if I will have a good machine, I will utilize it for gaming as well. So from the 2 options I selected as per my budget, I need suggestion. \n\n1: The first option is Lenovo Legion 5i Gen 10 (15\" intel) which is available at official website. Price is 1138 Euros for this machine.\nhttps://www.lenovo.com/at/de/p/laptops/legion-laptops/legion-5-series/lenovo-legion-5i-gen-10-(15-inch-intel)/83lycto1wwat1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=at:sem:119r6x&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612285964&gbraid=0AAAAADoYsTVG9sdrCzi93so9m2w4gXDwe&gclid=Cj0KCQiAiqDJBhCXARIsABk2kSlKRsr_RiRusec7INrkd4sG6viELtR1VLEbSAWZcFR1yyep4YEvLpUaAql9EALw_wcB\n\n2: The second option is HP OMEN 16-am0172ng. Price is 1099 Euros but this product is not available on the official website. So I have a little bit doubt in buying this. That's why I also appreciate if somebody has a prior experience of buying with this website.\nhttps://www.notebooksbilliger.de/hp+omen+16+am0172ng+888658?nbbct=6202&adid=782264824441&targetid=pla-2439679617521&device=c&cid=23224079894&agid=191137948074&pid=888658&kw=&kwmt=&kat1id=&kat2id=&gad_source=1&gad_campaignid=23224079894&gbraid=0AAAAADnfZYfgAQgHB6lEOEnvB89aX5TpG&gclid=Cj0KCQiAiqDJBhCXARIsABk2kSlSnpncgvJFfJdxBUCCbLQyuUDULx5yKGXQtk6rROzMQl-EUsHXD2UaAs2gEALw_wcB\n\nFor HP OMEN, I think it is better in every aspect. Just not sure about the display and also want some reviews for the built quality of both. \n\nThanks in advance for your guidance. ",
  "Is lenovo legion 5 pro worth for 1.6 Lakh INR or 1790 USD -40.64cms (16) WQXGA (2560 x 1600), OLED, Glare, Non-Touch, HDR 1000 True Black, 100%DCI-P3, 500 nits, 165Hz, Low Blue Light. , Intel® Core™ Ultra 7 255HX Processor ",
  "I need a Lenovo brand computer. I’ve had good experiences with them and am loyal. I have an older legion gaming laptop for the past 4-55 years that runs almost 25/7 ",
  "How is lenovo Ideapad slim 5 Ryzen 7 7735HS. If anyone have this laptop i really wanna know the reviews. Nd battery too.",
  "FIrst and foremost doubt. Why is the title and description says 7735HS and the options below says 7735U?\n\nBoth of them are good performers. If we go to specifics, both have same cores and threads, 95% details are same between those twooo.\n\nThe only difference is:\n\n* **7735HS** is 15% better in multi-core performance than 7735U. HS is 15% better in performance than U.\n* **7735U** has better performance per watt, meaning slightly higher battery power than 7735HS. U has better efficency than HS (maybe like 10mins more depending on the usage).\n\nMake sure you are getting the model that you are looking for. The seller might have done the incorrect information, but just to make sure you are getting the same contact with them and confirm once. Just a precautionary.\n\n**Disclaimer:** These are rough calculations.",
  "I prefer to buy from lenovo official website , you get a 3000₹ off on a offer called after10deal it applys after 10 pm and if you use credit card 3000₹ off further,  finally it will be around 56,000₹\n\nIt has a 70Whr battery 100% SRGB display and its 15 inch version  \n\n\nhttps://www.lenovo.com/in/en/p/laptops/ideapad/ideapad-s-series/lenovo-ideapad-slim-5-gen-10-15-inch-amd/83j3003sin",
  "Yes I know this much about it. I'm asking if this is a good option or not?",
  "Fine but I don't want soldered ram does it come in SoDIMM?",
  "Yes yes, OP. Its really a good laptop and your choice.\n\nBattery Life of **Ideapad 8-11Hrs** as per various sources, thats an average. Some even got 12hrs with single charge.\n\nIf you dont mind me saying this, I have the same brand and processor in my notepad list and its only 56K from direct Lenovo site. However, its a ThinkBook and not IdeaPad.\n\n**16\" | 7735HS | 16GB DDR5 | 512GB SSD | Battery: 7-11Hrs | PassMark: 23209**\n\n* ThinkBook 16 (21MW008WIN): [Lenovo ThinkBook](https://www.lenovo.com/in/en/p/laptops/thinkbook/thinkbook-series/lenovo-thinkbook-16-gen-7-16-inch-amd/21mw008win) (₹56,831)\n* Gaming: [https://www.youtube.com/watch?v=ICce-CWxzbQ](https://www.youtube.com/watch?v=ICce-CWxzbQ)\n\n**What’s Included:**\n\n* 1 Year Onsite Warranty\n* MS Office Home 2024\n* Lenovo 39.6cms (15.6) Value Plus Backpack at ₹1",
  "whats your usecase?",
  "The thinkbook u mentioned ppl say it will come max 4hr battery life is it true or false info",
  "Coding, little gaming and vdo editing. \nI'm a cs major student",
  "I promise you, when I first saw this laptop model 5 months ago. Its have very good battery and overall quality. Then, after 2 months I am seeing build quality is not good and its between Ideapad & ThinkPad quality.\n\nBut, seeing its battery capacity as 45Wh, no wonder it has low battery backup. I feel bad now for sharing that shit piece.\n\nFor that 54k price, you can get the ThinkPad though with a bit less performance processor and good build quality as most of them knowns that ThinkPads are build like tanks.\n\n**16\" | 7535HS | 16GB DDR5 | 512GB 2242 SSD | 45%NTSC, 300 nits, 60 Hz | PassMark: 17929**\n\n* ThinkPad E14 (21M3S0FJ00): [Lenovo ThinkPad](https://www.lenovo.com/in/en/p/laptops/thinkpad/thinkpade/lenovo-thinkpad-e14-gen-6-14-inch-amd/21m3s0fj00) (₹55,870)\n* Gaming Test: [https://www.youtube.com/watch?v=-QL41ovz6hc](https://www.youtube.com/watch?v=-QL41ovz6hc)\n\nI hope atleast this one will have a good battery life. I checked the battery reviews from couple of websites and some mentioned it has good battery life and only a couple of people reported defective batteries.",
  "if theyre light games, then yes it is all good",
  "But this also has just 47wh \nI saw this https://share.google/4MdWRKCVp33Zjj2Na\n\nWhich 70wh it goes to 57k sometimes  but I searched everywhere but no review on this specific laptop",
  "I mean gta v for short time",
  "Can I use it for light 2d works? Not heavy ones",
  "So, I was scrolling randomly and saw someone asked for the same thinkbook review. One of the commenters mentioned it was shit...\n\nThey said this: The camera is really bad. Everything else seems to work fine. The battery is small though. 45Wh only (I get around 3.5 - 4hrs of battery under light usage). You can try for IdeaPad slim 3 with r7 8840HS. It has a 60Wh battery. Or IdeaPad slim 5 gen 10 with ai 7 350. The processor and battery combination in this one is deadly (and so is the price). 55k\n\nI think this would help you in picking up a good battery life laptop hopefully.",
  "yes, it should be sufficient",
  "Thank you",
  "Lenovo Yoga 7 Pro vs Asus Zenbook 14 OR Lenovo Yoga 2 in 1 vs Zenbook S14 Hi, so I am looking for a premium thin and light powerful laptop with great battery life in the premium segment. I have shortlisted to 2 categories and 4 laptops which I have mentioned in the title.\nHere are some basic configurations :-\n1) Lenovo Yoga 7 Pro \n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD \n- Aura édition 8853 MT/s\n- Touch\n\n2) Asus Zenbook 14\n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD\n- Normal édition and less than 8853 MT/s\n- Touch and stylus support\n\n-> 3) & 4) Both have Intel core ultra 7 258V processor which I'm worried won't be sufficient for tasks such as light gaming even. \n\nPlease provide your valid inputs with your reviews and also I would consider yoga 7 Pro but it comes in a single color which I found a little bit unsatisfactory than the zenbook's looks.\nInputs are welcome! Thanks\n\nP.S. - I am going to buy the laptop tomorrow so I need quick suggestions please.",
  "I have the Zenbook 14 (mine has the 1920x1200 OLED, otherwise specs as you listed) and would definitely recommend it. In mixed use (some Youtube, web browsing, a couple hours playing 9 Kings) I've been getting 8-9 hours of screen on time out of the battery, and performance has been excellent. Battery might be slightly better or worse on Windows (I am using Debian Linux), but for the performance I think that much battery life is still mindblowing. The hardware is 100% a premium device. If I could do it over, I would buy this laptop again.",
  "Damn, but didnt you consider yoga 7 Pro cuz it has better features otherwise",
  "Been looking everywhere for someone who has this OLED! The 3k doesn’t appear to be available in the UK. Do you have the reported issues with seeing dots on the digital layer for the touch screen? Do you do a lot of reading and typing as supposedly it’s not great for that either?\nFinally, how is wifi 7 card?\nThank you",
  "I did not. The Yoga 7 Pro doesn't appear to be readily available in the US (where I live) in anything close to the spec you listed, so that takes it out of the running for me. I did find a listing for $200 more than I paid for the Zenbook, which doesn't inspire me much. Are the prices for the two similar where you are?",
  "> Do you have the reported issues with seeing dots on the digital layer for the touch screen?\n\nI don't; however, those seem to be reported by people who view a lot of white backgrounds. I just checked out a white background myself to try to look for it and I *think* I saw a little of it on a fully white screen, but frankly the sheer amount of white light was far more offensive than any pattern that may or may not have been there. With anything not majority pure-white I can pretty confidently say it's not an issue.\n\n> Do you do a lot of reading and typing as supposedly it’s not great for that either? \n\nNot sure how a screen would be bad for typing, personally - if this is re: the keyboard, I have found it to be very solid as far as laptop keyboards go. Primary use case for this for me is as a web browsing machine/capable PC on the go, but it is not my main PC. I have not noticed anything that would lead me to say it's not great for reading, though.\n\n> Finally, how is wifi 7 card?\n\nWorks well, though I can't speak to the Windows-specific aspects of it. No complaints once it was up and running (If you're a Linux user, it wasn't detected by the Debian installer, so I had to use a USB-C-to-Ethernet dongle to get the OS installed; worked fine out of the box once the OS install was complete. If you're a Windows user I am sure it will be perfectly fine out of the box.).\n\nOverall, I'm really happy with this laptop. I bought it as a secondary device as mentioned, but I could happily use it as my main PC (outside of graphically-demanding games) if needed. It's got tons of power in an extremely portable form factor with an excellent screen, which is exactly what I wanted from it.",
  "Well well it's even about a 100$ cheaper here the yoga",
  "Really appreciate you taking the time to reply, thank you.\nI think the reading/typing comment was tied to the screen in the sense of it being suitable for that type of work (coding, desktop publishing etc) vs gaming/entertainment, but I’m satisfied hearing from a real world not review world use case. \n\nI’m probably going to go for ultra 7 rather than 9 - my use case won’t really benefit from the extra power when the trade off for the power is slightly less battery time , and more heat and subsequent fan noise. \n\nThat conclusion is also formed from reviews though, so if you’ve an opinion on that I’m all ears! (I will be running Windows)",
  "I may be wrong (going off of the US website as that is where I am based) but it looks like the Ultra 7 variant is the older 155H, whereas if you want the current crop of CPUs the Ultra 9 285H is the only option; from what I was able to find the 155H and 285H get similar battery life, but you get a healthy chunk more performance with the 285H (as you'd hope). If the pricing is similar imo go for the 9. Haven't found heat or noise to really be an issue with this machine anyway (yes the fan can be heard when it's on like any laptop, and yes putting a big fat 16 core CPU into a thin and light chassis like this means the fan will be coming on regularly - that will be the case both with the 155H and the 285H, so I would not consider it a factor in purchase decisions personally). Obviously, if the 155H meets your needs and comes at a decent discount, then it makes sense to go for it.",
  "Lenovo Legion 5 / HP Omen 16 / TUF A 16 - Which one to keep? Hi guys, I've already bought these laptops but unsure which one to keep, mainly for gaming and music production. All of them with 32 GB Ram & 1 TB SSD\n\nHP Omen 16 variants:  \nAMD Ryzen 9 8940HX - RTX 5060 - IPS 1920x1200 144hz - EUR 1049  \nAMD Ryzen AI 7 350 - RTX 5070 - IPS WQXGA 240hz - EUR 1200  \nAMD Ryzen 9 8940 HX - RTX 5070 - IPS WQXGA 240 hz - EUR 1300\n\nLenovo Legion 5 variants:  \nAMD Ryzen 7 260 - RTX 5060 - Oled WQXGA 165hz no G-Sync - EUR 1039 (Do I have gsync if using an external monitor?  \nI9 14900HX - RTX 5070 - Oled WQXGA 165HZ no G-Sync - EUR 1349 (Do I have gsync if using an external monitor?\n\nAsus TUF A16:  \nRyzen 7 260 - RTX 5060 - IPS 1920x1200 165HZ - EUR 999\n\nHope you can help since I'm 100% unsure in which one to keep",
  "Any reviews/experience for the ThinkPad E14 G7 with Intel Ultra 7 258v CPU? I could only find reviews for the version with the 255U, because that version launched first.\nI'm mainly interested in it's battery life, because I'm looking for a laptop with decent performance and long battery life. \nNeeds to be x86 (want to dual boot Linux), so I've been looking at the Lunar Lake chips. Because Ram is soldered I'm going for 32 GB.\nThe other laptops I'm considering (Asus Zenbook, Vivobook 14, Lenovo Yoga slim 7, Acer Swift ai 14) all have glossy screens, the E14 G7 seems to be the only one in my price range (<1500€) with a matte screen. ",
  "its just gonna be maybe an hour less i dont think battery life is that deep of an issue",
  "I have a 268v cpu in my laptop and it is pretty slow compared to my desktop cpu. You would be better of getting an AMD HX 370 or 395.",
  "Did you buy the laptop OP?",
  "Yeah, I'm almost certain it will be fine, I just don't like the idea of buying a laptop without seeing at least one review of the specific model. Will probably buy it because spec wise it fits my needs the best",
  "Yeah, I bought it, I'm quite satisfied, mainly with the battery life. I haven't stress tested the performance, because so far I've mostly used it for office type work.\nDo you have a specific question about it?",
  "Cool",
  "Great, yes I wonder about fan noise. I would like a TP but with recent new CPU's I worry some of them get hot under load. I also would use it mostly for office work though.\n\nWhen doing basic task, does the fan turn on often, if so, is it audible? If it turns, does it stay for long?",
  "Do you know anything about fan noise on 258V?",
  "During typical office work I'm not hearing the fan at all. The lowest fan setting is also barely audible. \nBecause the lunar lake chips are tuned to be energy efficient they don't generate a lot of heat. \n\n\nI just ran a few CPU benchmarks and found out that while running on battery there are rather strict limits on power, so even during a (admittedly short) high load, it doesn't get very hot or loud. During the entire benchmark the CPU temps never exceeded 70°C, fan on medium. \n\nIf plugged in it gets louder and hotter, in return for almost double the score in 3D Mark. And still quieter than some other laptops.\n\n\nIf its charging the fan is more likely to turn on, I'm guessing because charging also produces heat.",
  "Thanks, those user reports are very important to me, and other people sensitive to noise since revies often ommits fan behaviour. \n\nAnd what power modes did you use for the tests? I wonder if for example power saver+plugged on AC will be noisy, since you stated if plugged it gets hoter. That has obvious explanation for the new design of fast charging PSU, unfortunate in modern latops.",
  "Is this lenovo legion 5 gen 10 a reasonable deal? or i can get the 5050 gpu instead for $1079.\n\nwonder if the upgrade is worth, or if i should just wait altogether for black friday?\n\nplan on doing unreal engine game development, light gaming, etc.",
  "Pretty great deal, I think you should get it.",
  "lol. It comes with \"Glare\".\n\nThat typo aside, the rest are solid specs for that price. Good deal.",
  "[removed]",
  "Actually chatted with a sales rep and used employee partnership discount. Through lenovo.com",
  "Is the Lenovo Legion (2025) a good laptop for an Engineering Student? So I was thinking of getting my first laptop as a 1st year engineering student (been surviving on an 8th Gen iPad for almost 3 years now) and I've been having some trouble picking a laptop out.\n\nI need a laptop that can run engineering software like CAD/AUTOCAD, Solidworks, Matlab, etc. Preferably something that could last me a bachelor's degree.\n\nA laptop that did catch my eye was the Lenovo Legion Pro 5i Gen 10 (2025), which is currently priced at a discount of $1264.99. \n\nIts specs are as listed:\n\nCPU: Intel i7-14650HX (Also an i9 option but \n+$285)\nGPU: Nvidia RTX 5060 (8 GB GDDR7)\nRAM: 32 GB DDR5 (SODIMM 2×16 GB)\nStorage: 1 TB SSD\nOther: Wifi 7, 80Wh Battery, 1 year warranty.\n\nThere was also other options but with different CPUs like the AMD Ryzen AI 7 350, and the AMD Ryzen 7 260.\n\nI would really appreciate your thoughts and opinions and any other laptops suggestions.",
  "Lenovo Legion 7 Help!!!! ",
  "Lenovo Legion 5 (ARH05) shuts off 5 seconds after boot, sometimes works perfectly for hours after several tries (video) Hey everyone, I’m having a strange issue with my Lenovo Legion 5 (Ryzen 5 4600H, GTX 1650).\n\nHere’s what happens:\n\nLaptop powers on, lights and fans come on normally.\n\nAfter about 5 seconds, it makes a click sound and shuts off completely.\n\nIf I keep trying (around 6–7 times), it eventually boots and then runs smoothly with no lag or heat issues for 2-3 hours.\n\nThe issue happens both plugged in and on battery.\n\nFans were a bit dusty I cleaned them, but it still behaves the same.\n\nTemps are normal.\n\nNo burning smell, no visible damage.\n\nI’ve attached a short video showing exactly what happens.\n\nDoes anyone know what might cause this",
  "Almost seems like it could be some sort of solder joint that doesn't have great contact, and after a few tries it heats up enough for it to work properly.\n\nI'd try also seeing if the issue persists with no battery at all",
  "Same issue with no battery at all.\nSolder joint issue? That means I've to replace the motherboard right? ",
  "It may not be that, but it certainly is possible. I'd try to get it RMA'd if nothing else works and you're still within warranty\n\n[https://www.reddit.com/r/LenovoLegion/comments/1lke2ky/2021\\_legion\\_deaths\\_an\\_analysis/](https://www.reddit.com/r/LenovoLegion/comments/1lke2ky/2021_legion_deaths_an_analysis/)\n\nThere doesn't seem to be examples here of these laptops(15ARH05) dying, but someone did say that the 2020 models (like yours) seem to share the 2021 motherboard issues.\n\nIt's worth trying to minimize heat in your laptop, as that seems to help deter the issue of the cold solder.\n\nI'd also do a memory stability test(like [OCCT](https://www.ocbase.com/download)), because that may be interfering with booting\n\nIt also could be BIOS related as mentioned here: [https://www.reddit.com/r/LenovoLegion/comments/1e39hag/lenovo\\_legion\\_515arh05\\_keeps\\_turning\\_off\\_after\\_i/](https://www.reddit.com/r/LenovoLegion/comments/1e39hag/lenovo_legion_515arh05_keeps_turning_off_after_i/) (this seems most likely to be the cause, but I'd try the memory test first, as unstable/error prone memory can mess up BIOS updates)\n\nBest of luck!",
  "Thank you so much for all the effort you put in to help me I truly appreciate it and I'll try it all.",
  "So bro I want to know if there are these motherboard issues or whatever things in the new 2025 model     ",
  "Lenovo Legion Pro 7i (RTX 5070 Ti) @ $1,999 - Worth it or wait for better Black Friday deals? Hey everyone! Content creator here looking for laptop advice. **Zero gaming** \\- this is purely for work.\n\n**My workload:**\n\n* Python automation & AI development\n* Video rendering (DaVinci/Premiere)\n* Running AI models locally (ComfyUI, Stable Diffusion, local LLMs)\n* Text-to-image, image-to-image, image-to-video generation\n\n**Current deal I found:** [Lenovo Legion Pro 7i at B&H - $1,999 (was $2,849)](https://www.bhphotovideo.com/c/product/1875948-REG/lenovo_83f5001bus_16_legion_pro_7i.html)\n\n* Intel Core Ultra 9 275HX\n* RTX 5070 Ti (16GB VRAM)\n* 32GB RAM\n* 2TB SSD\n* 16\" OLED 240Hz\n\n**Questions:**\n\n1. Is this the best deal right now, or should I wait for Black Friday proper?\n2. Anyone seen better early BF deals on comparable specs (especially RTX 5070 Ti laptops)?\n3. Considering Alienware equivalent - thoughts on Lenovo vs Alienware for content creation/AI workloads?\n\nThe 16GB VRAM on the Ti seems crucial for my AI work. Any insights appreciated!",
  "Rog strix vs lenovo legion I'm a first year CS student. Just need a laptop that should last a decade.\nASUS ROG Strix G16,Samrtchoice, AMD Ryzen 9 8940HX, Gaming Laptop(RTX 5050-8GB/16GB RAM/1TB SSD/FHD+/16\"/165Hz/90Whr/Windows 11/M365 Basic (1Year)*/Office Home 2024/Eclipse Gray/2.5 Kg) G614PH-RV033WS vs lenovo legion specs mentioned above",
  "Lenovo Yoga Pro 7 14ASP9 Hi all\nI'm looking to buy new laptop for myself, i came across this model(32 ram, 1tb ssd, recently 9 365) it looks great to me specs wise considering it can get it for 1k euro with discount. Also i was looking at macs but they're kind of pricey, especially in want to have same storage and ram. I could not really find comprehensive information regarding battery life for this model, either reviewers say it's ok like 7 hrs, or some ppl on reddit say it's abysmal. Is there anyone here who uses it and can share some insights? Also i was thinking of running linux on it, it seems that it's quite compatible and I'm guessing l'l get better battery life?",
  "OMEN 16 or Lenovo Legion i5??? Wsp guys I want to buy a gaming laptop for my 3D renderings in product design engineering at Uni and I’m wondering if I should buy the: omen 16 intel i7 240H or either the Lenovo Legion i5 13650HX. Take on account that I want a good overall GPU power (I’m okey with a RTX5060) for the renders and a good quality screen. Don’t really need it OLED, but I want it to be 100% DCPI. \nMy budget should be under 1400€.\n\n",
  "Go with the Lenovo Legion 5 — the i7-13650HX is a good chip with much better performance than the 240H, plus it has an OLED display, and sturdier build. Overall, it’s the more powerful and premium option for gaming.",
  "Lenovo Legion Motherboard Replacement? I bought Lenovo Legion Slim 5 16APH9 Ryzen 7 8845HS RTX 4060 8GB about 7-8 months ago.\n\nI was using the laptop and I heard a small pop, the laptop turned off and I saw smoke coming out of the Power button. I tried to turn on once and heard spark sound. Then I immediately removed the charger and shut down the lid. Next day I sent the laptop to the service center since it was on warranty time.\n\nThe service center said that CPU is burnt and this doesn't come under warranty. They sent these pics saying it has a hole in the motherboard and I'll need to buy a new Motherboard to replace. I looked up on lenovo site and the board costs a lot.\n\nIs there anyway this can be fixed or should I just accept my fate?",
  "I'm pretty sure they drilled a hole into your laptop while the pop was just a battery dying",
  "They drilled the hole, motherboard isn't THAT weak that there will be a hole... If there wasn't that hole it would be covered under warranty, you can file a case in consumer court or tbh u could've gone for onsite support, these service center bastards are upto no good",
  "Where are you located? is this within the European union?",
  "Well there's no way of getting it fixed now there's a hole. Motherboards are made up of multiple layers with thousands of traces on each level and are covered in a heat resistant resin. They are surprisingly durable. \n\nIt is unlikely anything would be burning a hole in your motherboard. Usually resistors, capacitors and mosfets (transistors) etc when they burn out just smoke and then leave a residue around the offending component.\n\nThat looks like a nice round hole done by a drill bit.",
  "I had no idea about motherboards, thanks for telling me this.....I'll do some research and ask them in more detail....hopefully they'll admit if that's the case",
  "No, I'm from an Asian country.",
  "Lenovo Legion Pro 7 (RTX 5070 Ti, OLED) vs HP OMEN MAX (RTX 5080, IPS) - which one? ",
  "Reddit i need help,just bought my first gaming laptop, a lenovo Loq arp9 with Fhd Amd R.7 7435hs and Rtx 4060,512 ssd, 24gb ram for a bit under 21k mex.peso but my friend showed me this Thunderobot R16 Intel Core i7 14650HX 16GB RAM 1TB SSD Nvidia GeForce RTX 4060. Rn the Thunderobot is within my budget and the few reviews i have seen says is a good product, should i refund the LOQ to get the other one? rn the LOQ has heat rebooted a couple times  which is new to me, usually my old laps would lag until having a stroke and blue screening but this one runs smoothly and then just restarts, heard that overheating is a big issue with gaming laptops but never knew it got that bad, or is it a faulty product? kinda of a double question but i really need to be sure, is a big expense and i want to get the best i can afford.\n\nEdit: Thanks to everyone that helped!",
  "For mee Is a no, you lose RAM and battery Life for Better cpu performance",
  "Thunderobot are even lower build quality than Lenovo, also heating issues were with my bro's laptop, the exact specs you're mentioning, after only 9 months\n\nI would HIGHLY advice against it, even if it's cheaper - trust me, it's for a reason",
  "Personally I’d probably stick with the bigger brand, when spending this much money on anything it’s always a bit of a risk to go for something nobody has heard of, nobody knows if they’ll be around in a year when you need support etc.",
  "Being a lenovo user, YOU WILL MISS OUT. don't change it. Keep the lenovo LOQ and also add another ram because why not 16gb ddr5, add it , it will become unstoppable",
  "To be honest I heard about the driver problems with chinese generic brands from laptops, that's a huge issue in the long run, also quality problems, they have good specs but terrible build.",
  "I hav same laptop for 8months dm if u buy with same cpu",
  "Thanks, im dont really know much about specs except bigger numbers = more fps = better :D  \nWont mind buying an extra ram but battery is kinda important for laptops",
  "Speaking about your particular laptop - check if you have latest AMD drivers, if yes - install older ones, helped me with restarts. If it doesn't help and temps are ok - chance it might be faulty, ye...",
  "Apreciated! i researched a little bit and it being a chinese brand that just appeared of nowhere with really good specs made me super suspicious but the whole 3 videos reviewing i watched agreed it was super good and thats why i came here just as someone said up in the long (not really that long) run it gets rough.",
  "is both my first gaming laptop and lenovo, went tru an acer and an hp for studying, dont really know much about brands except Apple is overpriced af, will totally be investing in maxing out both ram and ssd on the long run, rn i feel already unstoppable with 24, my only problem rn is heat, which seems that even if the lap can run something smoothly it can still explode due to temperature",
  "Thanks, ig it was really too good to be true :/",
  "Well not Always RAM Is upgradable, you should check",
  "Thanks! really would have hurt to spent that much for it just to turn into a brick after just a little bit, my old hp pavillion helped me tru a lot, rn is barely hanging but it still works perfectly after +8 years (had to change battery and fans tho).  \nGoing to looks tru the drivers, dont really know much about that but google helps, is there any way i could test if is faulty besides opening it?",
  "I think your Lenovo is a faulty product because I have one and it works perfectly.",
  "Opening it probably won't give you much info actually, if the drivers reinstallation won't help, try to check your temps with something like HWinfo64 before it shuts off",
  "Gonna pray the problem is within the drivers",
  "Hey been a bit but have a question, is your lap still running no issue? do you play resource heavy games? i was playing elden ring at like 55-59 c° for a while when suddenly it restarted, it also happened playing dying like but after lowering the graphs it was ok, thing is lap wasnt struggling with any of those, am thinking of buying one of those fancy $200 cooling pads which is another can of worm i will have to open but rn this is what makes me worry.",
  "Got msi afterburner to check temps, it seems 38-40C° just by watching videos, havent tested with the heavy program yet but will soon, i saw it got to 70C° in the videos so that will be my cap",
  "Optimizing Ryzen 7 7735HS on Lenovo Legion for CPU-Intensive Games ",
  "Optimizing Ryzen 7 7735HS on Lenovo Legion for CPU-Intensive Games ",
  "How can I manage temperatures on my Lenovo Legion 5i 16\" (Ultra 9 275HX + RTX 5060) when XTU/ThrottleStop don’t work? Hey all,\n\n**Laptop:** Lenovo Legion 5i 16\" Gaming Laptop — Model 83NX0000US \n\n**Specs:** Intel Core Ultra 9 275HX (24C), RTX 5060 8GB, 32GB DDR5-5600, 1TB SSD, 16\" 2560×1600 240Hz, Windows 11 Home, 80Wh, 245W adapter. Retail listing badge: 4.3/5 (14 reviews). Price seen: $1,499.99.\n\n**What I'm seeing**\n\nAfter about 30 minutes in PUBG, my CPU temps spike to 100–104 °C and I'm getting Thermal Throttling warnings in the sensors.\n\nGPU temps seem fine though (60–80 °C), and my Afterburner undervolt/curve appears to be working.\n\nLenovo Vantage performance profiles change things a bit, but Intel XTU power limits (PL1/PL2) just keep reverting back whenever I start gaming.\n\n**XTU messages / logs I saw (what they mean)**\n\n* **Power Throttled** → CPU is hitting PL1/PL2 (long/short turbo power limits).\n* **Current Throttled** → limited by motherboard/VRM amperage caps.\n* **Thermal Throttled** → CPU reached the temp ceiling (\\~95–105 °C), clocks dropped to cool down.\n* **Graphics Current Throttled** → iGPU hit current limit (not really critical for dGPU gaming).\n\nBasically, power, current, and thermal limits are all kicking in—pretty normal for thin laptops under heavy load.\n\n**XTU \"Import Profile\" error I got**\n\n\"This system does not support importing profiles because certain controls required to permit overclocking are inaccessible.\"\n\nFrom what I can tell, Lenovo's firmware (EC) + Intel DTT lock most tuning controls on this Meteor Lake (Core Ultra) platform. What this means:\n\n* A lot of XTU sliders show up but any changes don't stick (or get overridden when you boot/load a game).\n* Undervolting is blocked (Plundervolt mitigation) on most 2023–2025 Legions.\n* ThrottleStop shows \"CPU not supported\" on Core Ultra → basically unusable.\n\n**My test interpretation (XTU + sensors)**\n\nDuring CPU stress: CPU Utilization = 100%, Package \\~71–74 °C, Power Limit Throttling = Yes, Thermal Throttling = No (in that specific run), P-core max dropped from \\~4.59 → 4.21 GHz.\n\nIn actual games (PUBG): later sessions definitely hit 100 °C+ and showed Thermal Throttling events.\n\nSo Lenovo's firmware is actively enforcing these safety caps (power/current/thermal)—the system's not \"broken,\" it's just designed this way.\n\n**What I've tried / current workarounds**\n\n* **Intel XTU:** Setting PL1 \\~65 W / PL2 \\~80 W → gets overwritten back to \\~120–140 W once gaming starts.\n* **ThrottleStop:** Not supported on Core Ultra → dead end.\n* **Windows Power Options:** Setting Maximum Processor State = 99% (and Minimum = 5%) → disables turbo, drops CPU temps 8–15 °C; 95% drops even more but with a bigger FPS hit.\n* **Lenovo Vantage:** Switching between Performance/Balanced/Quiet helps somewhat (seems to flip hidden PL tables), but there are no raw PL1/PL2 sliders visible.\n* **GPU (MSI Afterburner):** Undervolt/curve works; monitored with HWINFO—voltage \\~0.7–0.85 V, clocks \\~2.2–2.3 GHz, temps 60–78 °C.\n* **Cooling:** Elevated rear / cooling pad → small but useful temp reductions.\n\n**My questions (especially for Legion + Core Ultra owners)**\n\n1. Is there any BIOS or hidden Vantage option on the Legion 5i (83NX0000US) to manually set CPU PL1/PL2 or allow undervolting on Meteor Lake?\n2. Is there a reliable way to keep XTU limits from being reset by EC/DTT when a game launches, or is that just not possible on this model?\n3. Are there specific Vantage profiles (Balanced/Quiet/Performance/Custom) that meaningfully lower CPU power/temps in PUBG without a big FPS loss?\n4. For PUBG specifically (CPU-heavy, and those smoke effects spike the GPU), any settings combo that helps reduce CPU spikes? Like View Distance, Effects/Shadows tuning that other owners recommend?\n5. If the firmware locks are hard, are my only long-term options:\n   * Stick with 99% Max Processor State (no Turbo) while gaming,\n   * External cooling pad / repaste (or liquid metal, if I'm feeling brave), and\n   * Keep using the GPU undervolt for efficiency?\n\n**Extra context on GPU curve weirdness (MSI Afterburner)**\n\nI noticed the curve \"re-draw\" itself after Apply/reboot. From what I've read in community threads: that's NVIDIA GPU Boost doing its temperature/load compensation thing with the 15 MHz step behavior—the offset stays, but the drawn MHz shifts a bit.\n\nEven if the editor looks different later, HWINFO shows my voltage/clock under load match the target I set, so the undervolt is definitely applying.\n\n**TL;DR**\n\nXTU/ThrottleStop are effectively blocked on my Legion 5i (Ultra 9 275HX). PL1/PL2 reset under load.\n\nPUBG pushes the CPU to \\~100–104 °C at times → thermal throttle kicks in.\n\nBest results so far: Vantage profile + Windows 99% Max Processor State (no Turbo) + GPU undervolt + cooling pad.\n\nLooking for any owner-proven methods to tame these CPU temps (BIOS/Vantage tricks, practical PUBG settings) without taking a huge FPS hit.\n\nThanks in advance! 🙏",
  "Maby limit cpu power.. and see if no background things , do you hear loud fans .. so u know fans work.. u can use monitoring app...",
  "Have you found solution and issues fixed or not yet ?",
  "Impression + AMA - Core Ultra 7 258v VS Ryzen 7 AI 350 for a casual user (feat. Lenovo Yoga Slim 7 Gen 10) Hello there! Just a quick introduction to explain why I'm making this post: I'm currently in the market for a new laptop (coming from a Blade 14 2021 w/ RTX 3070). Here are my requirements:\n\n* Thin and light\n* Decent battery life (doesn't need to exceed 10 hours)\n* Most importantly, good unplugged performance\n* Casual gaming (mostly indies)\n* Quiet and at least not hot to the touch\n\nMy Typical Usage:\n\n**Two Browsers** – about 20–30 tabs each\n\n* **Browser 1** – TradingView, multiple crypto trading exchanges\n* **Browser 2** – Messenger, WhatsApp, X, Telegram, Discord, Databricks, Reddit, YouTube, Chatgpt etc.\n\n**Other apps (background + foreground)** – Spotify, Outlook, Teams, ShareX, OneDrive, Steam, Excel spreadsheets (2–3 at least)\n\nSo, I narrowed my choice down to the Lenovo Yoga Slim 7, but I have a big dilemma due to the CPU choice—Intel 258v vs. AMD AI 350. Naturally, being an AMD fanboy, I would have picked the AI 350 without question, especially since AMD has usually been the battery champ in Windows laptops over the past few years. After doing further research into Lunar Lake, I'm very intrigued by its efficiency but wary about the lack of multithreading.\n\nThe problem is that there isn't a review out there that really focuses on actual unplugged user experience in terms of performance and multitasking. Most reviewers dish out raw numbers like everyone is a content creator or something. Sure, user experience is rather hard to quantify, but I need a laptop that feels smooth in daily use.\n\nTherefore, I decided to take matters into my own hands. I went to my local retailer and ordered both models. They just arrived today, so now I have the AMD model with a touchscreen in Tidal Teal and the Intel model without a touchscreen in Lunar Grey. After setting them up and playing around for a few hours, here are my early impressions (mind you, these are not scientific results).\n\n**Performance (Unplugged) – Nitpick Alert**\n\nNo, I don't run benchmark scores—you can find those online easily. I care more about actual system responsiveness: how the laptop feels in day-to-day use and under light loads.\n\n**Intel 258v** – To my surprise, the 258v delivers much better responsiveness. I'm talking about switching windows, animations, moving things around the screen, having multiple windows open, and running background apps during my typical workload. Additionally, it’s able to handle everything I need without a single lag—I even had a 4K YouTube video playing in a floating window while working. Even in 'Best Power Efficiency' mode, the scrolling animations remain smooth, which is a nice touch. Sure, my workload isn’t the heaviest, but this is an ace in my book. One thing to note: I started noticing slight sluggishness in animations when the battery falls below 15%.\n\n**AMD AI 350** – While the AI 350 can also do everything without slowing down, the general animations aren't as smooth as the 258v’s when unplugged. Things like minimizing/maximizing windows and bringing up the quick menu feel less fluid. This is particularly noticeable in 'Best Power Efficiency' mode, where I lose the smooth scrolling animation while charting on TradingView. It’s not bad or slow per se—it works fine—it’s just that the 258v keeps things consistently smooth across all settings.\n\nI'll run some games during the weekend and see how it goes. However, gaming performance is not my main requirement—nice to have, but not a must-have. You can find plenty of benchmarks online anyway.\n\n**Noise & Heat**\n\nAnother win here for the 258v. Aside from the initial setup, the fan rarely ramps up. While running my typical workload, it gets just a little warm at the top left corner of the keyboard—not bothersome at all. Otherwise, it remains cool and quiet. \n\nThe AMD AI 350 also fares pretty well—it gets *slightly* warmer than the 258v, but I'd say it's negligible. The fan kicks in more often than the Intel 258v’s, though. However, I'd say both can achieve silent performance.\n\n**Battery Life**\n\nToo early to tell, as I haven't gone through a full battery cycle on either laptop yet. First impressions suggest both are neck and neck. I'll update the post once I have more results.\n\n**Build Quality**\n\nNormally, they should be the same, but I noticed a few differences worth reporting. The AI 350 has some backplate creaks—it makes a slight noise when picking the laptop up or moving the lid. Meanwhile, the 258v feels more solid, but it has a rattly touchpad, which kind of drives me nuts at times. Lenovo's QC seems poor here.\n\nI find this surprising since I usually hear Lenovo has the fewest RMA cases—or maybe I just have the worst luck.\n\nAs of now, the Intel 258v is more likely to stay with me. I'll update this post once I have more testing results. **AMA!**",
  "Well, the Intel Is Better in every category except multi core performance, battery Life Will be mutch Better(around 15% more), if you want tò go amd with some reason tò not go with Intel you should get a ryzen 9 365, or if you do not care using Intel the ultra 7 258v or if you want also multicolore performance (loosing the bonus battery Life ) the 255h",
  "I'm having the same experience as you with a new AMD AI 350 Laptop (HP OmniBook X) that for some reason doesn't feel as smooth for casual use which is surprising coming from a Ryzen 5 5600H as reference.  I'm not sure if it's the HP bloatware and I should try a fresh windows install before returning. \n\n\nI'm getting in the meantime a Lenovo Yoga Slim 7i with the Core Ultra 7 258v so I will be able to compare between those.",
  "I'm thinking about whether it's worth paying $200 more for the 258V?",
  "I'm planning to upgrade from my Lenovo with a 5500U because it's starting to feel a bit slow in everyday use nothing heavy, mostly just browsing. I was leaning towards AMD for the performance, but your comparison really got me thinking, and now I'm considering the 258v. Did you end up keeping it? How’s it been after using it for a while?",
  "Hey mate, what did you notice with the battery life?",
  "Any updates on the battery life?^^",
  "How did it go?",
  "I guess this really depends if you need that 32GB. As far as I know, there isnt too much CPU performance different wbeen 256v vs 258v but yeah the price different is rather steep.  \nPersonally, I only upgrade my laptop like after 5 years or when it dies, so 32GB could futureproof'' things down the road for me.",
  "Ended up getting a HP Omnibook Ultra with the Intel 258V. So far way smoother experience than the Omnibook X with the AI 350 for some reason even though the specs of the AMD sounded better. The Yoga Slim 7i was equally smooth experience when I tried but found a great deal on the HP.",
  "Sorry, I meant that I'm also looking at the Lenovo Yoga 7i and the Intel version with the 258V is $200 more than the Ryzen 7 AI 350.",
  "And how is the battery in comparison?",
  "sorry i misunderstood your question.  \npersonally I would, considering Im only mostly doing light but moderate multitasking, I dont need that extra horsepower considering the 258v has plenty for me.\n\nMoreover, the extra battery life, silence and lower temp gives a nice feeling.\n\nBut anyway, I've returned both of the laptop due to build quality issue.\n\nI've just picked a 2024 Omnibook Ultra Flip 14 on sales, 10% less than what I paid for the yoga 7 258v, which has way better build quality. However, the Yoga has better screen quality though as the screendoor effect on the HP is crazy.",
  "Hye, any update on the battery life comparison? Did you test it out completely before returning them?",
  "yes please any battery life updates? what are your thoughts",
  "Bloatware New Lenovo Legion 5 Hi,\n\n  \nCan anyone identify any bloatware running in the background?\n\n  \nThis screenshot was taken with no apps running in the foreground.\n\n  \nThanks\n\nhttps://preview.redd.it/1coa1pa1j9uf1.png?width=991&format=png&auto=webp&s=a159473d4a8eccf547b61be24fe0e3bdfd11595f\n\n  \n",
  "[Help] Deciding Between Lenovo Yoga 7 (Ryzen AI 7 350 - Kraken Point) and Yoga 7i (Intel Core Ultra 7 258V - Lunar Lake) – Real-World Multitasking Hi everyone,  \nI'm currently torn between two very similar laptops and I was hoping to get some help based on *real-world multitasking experience*, especially with the Intel model.\n\nThe two devices I'm choosing between are:\n\n* **Lenovo Yoga 7 2-in-1 16\" (AMD Ryzen AI 7 350)**\n* **Lenovo Yoga 7i 2-in-1 16\" (Intel Core Ultra 7 258V)**\n\nBoth have **32GB of RAM**, identical displays, and very similar overall designs.  \nThe main differences are:\n\n* The **Intel version has 2x Thunderbolt 4 ports (40Gbps)**\n* The **AMD version has 2x USB 3.2 Gen 2 (10Gbps)**\n* The **Intel version offers better battery life** from what I’ve seen in reviews\n\nI ended up choosing between these two models because I **need a 2-in-1 with a numeric keypad**, which is important for me. Unfortunately, comparable Asus models don't include the numpad, so these two Lenovos are basically my only options at this level.\n\n# Here's the deal:\n\nI've read all the benchmarks, and I know the AMD Ryzen AI 7 350 generally beats the Intel 258V in multi-core performance. But I'm not sure how that translates to the **kind of multitasking I do**. If the Intel version can handle my workload well enough, I’d prefer it for the ports and better battery life. But if it's going to struggle, I'd be okay with going AMD.\n\n# My typical workload looks like this:\n\n* **3-4 browser windows** open (usually Chrome and Brave), each with **\\~20 tabs**\n* **Excel spreadsheets** for management control (some light, some around 1MB with decent formulas)\n* **Word**, **Discord**, **TradingView** (in browser or desktop app)\n* **NordVPN**, **Bitwarden**, **OneDrive**, **Dropbox**, **Google Drive** running in the background\n* Regular Windows background tasks\n* Occasionally, I’ll have other apps open too\n\nIn the near future, I’d like to start learning Python — partly to replace some of my Excel work (used in my job), and partly as a hobby, to run basic simulations on historical stock data (in this case I suppose I’d mostly use libraries like **pandas** and **numpy**).\n\nI need the system to stay smooth and responsive under that kind of load.\n\n# What I’ve found so far:\n\nFrom what I’ve read, I believe the **AMD AI 7 350** shouldn’t have any trouble handling this workload smoothly.\n\nI’ve read mixed things about the **Intel 258V** — some reviewers say it’s fine with heavy multitasking, others say it struggles under load. I haven’t been able to find many real-life experiences on the Yoga 7i with Intel Lunar Lake. \n\nIf anyone here has tried this system under heavy multitasking and want to share his experience I’d really appreciate it.\n\nThanks in advance!",
  "The Ryzen is quite a bit faster, I'd get that.",
  "I have expertbook P5 258v. I don't have problem having multiple excel and chrome tabs. AMD battery life sucks big time; they are last on almost every battery life benchmark and real world cases vs Intel, Qualcomm and Apple.",
  "The Intel is definitely fine for your use case.",
  "Hey guys, i just got my Yoga 7 Gen10 2 in 1 with AMD Ryzen 7 350 /32GB Ram / 1TB SSD\n\nNow my question is, was that the right coice ? \nI need it for my School with some CAD (smal solidworks things) and some 3D-Slicing\n\nIt feels good Over all, but the battery feels very weak, what are your experiences with it and expecially the battery life",
  "Thanks for your reply! I know AMD is faster, but do you think I will benefit from it in my usage? I'm considering also that Intel's version has Thunderbolt 4 (vs USB 3.2) and better battery life, so if Intel's performance is enough for me I'd take this version..",
  "Thanks! Just curious—do you know from direct experience, or is it just that you understand CPU specs better than I do? 😅",
  "Im looking into it with the same intensions, so not so happy with it? Im worried about the hinges as i dont want them to fail after warranty expires. Also how happy are you with the display, it should have 1100nits which should be insane",
  "I wouldn't care about the Thunderbolt or battery life, but those things are important to you, then maybe get the Intel. They're both good computers.",
  "It is just that none of your tasks are individually heavy (except perhaps Excel?). If anything, my experience as a tab hoarder (300 tabs+) is that most modern CPUs are fine, you just need enough RAM. For example, I used to have a i7 8750H, which is fairly weaker than the 258V, and it used to run absolutely fine even if I was doing heavy dynamical systems numerical simulations in the background (in that case you just have to set core affinities such that you have one core left for the OS otherwise everything does slow down to a crawl). \n\nMy educated guess about the Excel is that you'd know if you needed something more powerful; I doubt most cases will scale beyond needing 4 strong cores + 4 fairly strong cores (258V 4P + 4E cores).\n\nAbout you learning Python, it should also be fine. If you are going to deal with big matrices and linear algebra operations the Ryzen would probably be significantly faster (but it's not like the Intel would be awfully slow).  \n\nI asked ChatGPT to come up with some sort of benchmark related to what you said (which, to be honest, I know nothing about). It seems to be taking a price time-series, calculating some moving averages, standard deviations and correlations and then some calculations based on weighting each stock differently.\n\n\n    import time\n    import numpy as np\n    import pandas as pd\n\n\n\n    def run_simulation(n_stocks=1000, n_days=5000):\n        # Generate synthetic stock price data (log-normal to resemble stock prices)\n        prices = np.random.lognormal(mean=0, sigma=0.01, size=(n_days, n_stocks))\n        df = pd.DataFrame(prices, columns=[f'Stock_{i}' for i in range(n_stocks)])\n\n        # Simulate typical operations\n        start = time.time()\n    \n        # Daily returns\n        returns = df.pct_change().dropna()\n    \n        # 20-day moving average\n        ma_20 = df.rolling(window=20).mean().dropna()\n    \n        # Volatility estimation (std dev over 20 days)\n        volatility = df.rolling(window=20).std().dropna()\n    \n        # Correlation matrix (last 250 days)\n        corr_matrix = returns.tail(250).corr()\n    \n        # Portfolio simulation: mean-variance portfolio\n        mean_returns = returns.mean()\n        cov_matrix = returns.cov()\n        weights = np.random.random(n_stocks)\n        weights /= np.sum(weights)\n        port_return = np.dot(weights, mean_returns)\n        port_volatility = np.sqrt(np.dot(weights.T, np.dot(cov_matrix, weights)))\n    \n        duration = time.time() - start\n        return duration, port_return, port_volatility\n\n\n    run_simulation()\n\n\nThis takes about 600ms on my Ryzen 8845HS independent of the number of threads (I think Pandas is mostly single-threaded while Numpy can use more threads for its operations, but in this case it didn't make any difference). This would probably be about the same performance you'd expect from both the 258V and the 350 in this particular scenario.\n\nOutside numerical stuff, they should all be roughly equivalent, specially since Python doesn't really like multiple threads.",
  "The Display is really Great ! \nThe hinges look kinda good, but to whole screen shakes if u touch it with the pen (or finger) to write somerhing\nThe good thing is, every laptop i tested so far does this (checked with 40+ laptops/convertibles) \n\nMy Screen turned black whenever i pluged or unpluged the power cable, now after a complete reset the laptop is working just fine.\n\nI kinda miss an Ethernet connection \n\nSo far so good, i will keep you updated.\n\nAre you looking for the intel or the amd version ?",
  "Thank you very much for your answer, very comprehensive!!",
  "Sounds like a great info,\n\nThe ryzen looks a lot better, but i would miss the 40gbps thunderbolt. Which could have been there :D\n\nI can live with wifi or some dongle, so the ethernet is not the worst thing.\n\nWell sounds good so far from your standpoint, i was also looking into vivobooks but they are more expensive and have max 500nits of brightness.\n\nYeah, keep me updated if you can :)\n\nEnjoy it!",
  "I've just bought and received the Yoga 2-in-1 with the Ryzen 350, if you have any questions.",
  "Yesterday i tested the battery life \nI opened a Youtube video an let is run on 35% brightness, it lastet 7h (started with 70-\n%) \n\nI realy dont know if thats the right Notebook for my school, imagine i cant charge it ther 😬😬",
  "Thanks, but I received mine two weeks ago — I ended up choosing the version with the Intel 258v. So far, performance seems fine. Maybe we could do some comparisons :)  \nHowever, the Windows taskbar is driving me crazy: I have it set to \"automatically hide,\" but it often stays visible, covering part of the windows. The only way to hide it again is to open and close the Start menu, which is *super* annoying.  \nDo you happen to have the same issue?\n\nP.S. (Initially, when I kept the taskbar always visible, I had a different issue: sometimes the icons wouldn't respond to clicks, and I couldn't switch between open apps. Again, the only fix was opening and closing the Start menu).",
  "would be interested in knowing how you like it so far",
  "I have 10years old gaming laptop that at its prime could do 2-3hours and now the battery is so cooked that its just there for the sake of it.\n\nI can imagine 35% being a lot if the max brightness is 1100.\n\nIn my books these are good numbers, but i am really sceptical about the hinges, i cant justify spending so much money to then get fucked with hinges. Also the thunderbolt could have been there with amd :P\n\nThx for info.\n\nHows the pen, have you used it?\n\nEdit: i can imagine you buying a 100W powerbank to improve the battery life while in school. \n\nIf it would have been a 20000mAh, that could add you about 65Wh which is about 70-80% of the whole battery.",
  "Man, I don't use the laptop too often for anything other than taking notes or just bed time sleep procrastination watching something, so I haven't really noticed that. I gave it a quick test and it seems to be working \"fine\". Fine in the sense that I have this overall feeling that everything in Windows behaves a bit wonky and erratically sometimes, but it has been mostly not too annoying.\n\nMind you that I've done a clean reinstall of the system because I originally was just going to use Linux but unfortunately for now it seems that the system is not well supported by any distro I've tried.",
  "It works fine.\n\nI think the screen is really nice, OLED and all that, as well as 120hz. The keyboard is really nice to type on and performance is all right (I haven't tested too much because for heavier stuff I use my desktop). In regular use it is silent and doesn't heat too much.\n\nNotebookcheck somewhere mentioned the Moiré effect for older models screens and I haven't noticed in this model, so maybe it doesn't suffer from that or maybe I just haven't noticed or came across. In any case I love the screen.\n\nWebcamera is all right but not anything really to write home about (but it is actually usable unlike most other laptops it feels like). Mics I haven't really got a chance to test it properly.\n\nBattery I'd say is all right as well. I am a bit disappointed mainly because it is not much better than what I already had with my old 2018 XPS, but still, I'd say you can get maybe 12h of web browsing, maybe 9-10h of Youtube. Local video watching probably around 12-14h. I believe note taking only I'd be around 15h-ish. \n\nIf you plan to use Linux, I'd say for this system in particular driver support is still a bit messy, specially regarding the WiFi and Bluetooth. Older kernels seem to work better than newer, but still not great. Might be just a case of skill issue, but I couldn't be bothered trying too much. I'll give it a go again later this year. \n\nAnother thing in this case that Windows does better is handling touch and pen. Specially the onscreen keyboard, which in Linux I found that only Ubuntu had a usable experience; however the pen was not well recognized and I couldn't alter pressure settings (it did work, however).\n\nI enjoy taking notes with the pen but it is not perfect. If you orient the PC so that the hinge part is near your body and you wrest your wrist on it, it squeaks a little bit; the flipped orientation is better. Another problem is that for some reason when the pen is tilted the lines are not drawn straight anymore; like you try to draw a diagonal line and it comes out a bit wobbly. I don't know if it is a pen issue (the default one that came with it \"Lenovo® Yoga® Pen\") or with the screen. This is unnoticeable with notetaking but I guess if you are drawing it could be a deal breaker. I actually feel like this is a pen issue and maybe other models work better, because with less tilt this doesn't happen at all (or at least I don't notice).\n\nFor anyone curious, Linux says that the screen pen thingy is called \"wacom hid 5402\".\n\nAnother thing that pisses me off is no USB 4 (even the AMD predecessors have, so like wtf) and the HDMI is gimped (HDMI 2.1 TMDS 6Gbps). It doesn't matter to me but it seems like a such unnecessary cost cut, specially the USBs. Bright side is that both USB-Cs at either side support charging so that is cool.\n\nLet me know if you have further questions.",
  "Ah yes, i guess it could be ok and i just have to try it. \n\nIm not so worried about the hinges to be honest. Thunderbolt is nice to have but i dont really miss it.\n\nThe pen is pretty nice, works great for me. (But it is the first pen i am using so far) \n\nYes the idea with a powerbank was already there but i dunno, thanks for you Feedback!!",
  "thanks a lot for this extensive review, appreciate it!",
  "Is this a good deal for Lenovo Legion 5? I'm thinking of getting the Lenovo Legion 5 (15\" Gen 10) for around $2400aud with the specs listed below. Is this a good deal? I will mostly be using it for remote work, video editing, content creation, adobe creative suite and some light gaming like sims or overcooked. Should I also add the extra 1TB second SSD at an extra cost, or is the current 1TB good enough? Additionally, if any one has any other better recommendations around the same price point or less do let me know!\n\n**Processor:**  AMD Ryzen™ AI 7 350 Processor (2.00 GHz up to 5.00 GHz)  \n**Operating System:**  Windows 11 Home 64  \n**Selectable Memory :**  32 GB DDR5-5600MT/s (SODIMM) - (2 x 16 GB)  \n**Solid State Drive:**  1 TB SSD M.2 2242 PCIe Gen4 TLC  \n**Second Solid State Drive:**  No Storage Selected (but have the option to add 1TB)  \n**Display:**  15.1\" WQXGA (2560 x 1600), OLED, Glare, Non-Touch, HDR 600 True Black, 100%DCI-P3, 500 nits, 165Hz  \n**Graphic Card:**  NVIDIA® GeForce RTX™ 5070 Laptop GPU 8GB GDDR7   \n**Camera:**  1080P FHD IR Hybrid with Dual Microphone  \n**Keyboard:**  24zone RGB Backlit, Eclipse Black - English (US)  \n**Wireless:**  Wi-Fi 7 2x2 BE 160MHz & Bluetooth® 5.4  \n**Battery:**  4 Cell Rechargeable Li-ion 80WhPower   \n**Cord:**  245W 30% PCC 3pin AC Adapter - ANZ\n\n",
  "Purchase advice Legion 7 refurbed Any feedback regarding the Legion 7 refurbished? Im looking for a white laptop for my spouse that's not apple. This is a hard enough challenge but they're looking for the following:\n\nTouchscreen\nBright enough to see outside\nDecent battery (the MSI we have now needs to always be plugged in) \n\nMain use: \nSpreadsheets \nEmails\n\nI know the Legion is overkill but hard to find something decent and that's white, the brand new updated Legion is around $1700 so this older model is easier on the budget. \n\nhttps://www.lenovo.com/us/outletus/en/p/laptops/legion-laptops/legion-7-series/legion-7i-gen-9-16-inch-intel/83fdx013us\n\nDetails \nProcessor\n14th Generation Intel® Core™ i9-14900HX Processor (E-cores up to 4.10 GHz P-cores up to 5.80 GHz)\nOperating System\nWindows 11 Home 64\nGraphic Card\nNVIDIA® GeForce RTX™ 4060 Laptop GPU 8GB GDDR6\nMemory\n16 GB DDR5-5600MHz (SODIMM) - (2 x 8 GB)\nStorage\n1 TB SSD M.2 2280 PCIe Gen4 TLC\nDisplay\n16\" 3.2K (3200 x 2000), IPS, Anti-Glare, Non-Touch, 100%DCI-P3, 430 nits, 165Hz, Narrow Bezel, Low Blue Light\nCamera\n1080P FHD with Dual Microphone and E-shutter\nAC Adapter / Power Supply\n230W\nFingerprint Reader\nFingerprint Reader\nPointing Device\nClickPad\nKeyboard\nPer-Key RGB Backlit, White - English (US)\nWIFI\nWi-Fi 6E 2x2 AX & Bluetooth® 5.1 or above\nWarranty\n1 Year Standard Depot Warranty\nColor\nGlacier White\nAdd-ons\n3 Month Xbox PC Game Pass",
  "Title: 7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Says It’s a Game Changer in 2025 🎮 Hey everyone,\n\nI just read this review titled *“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025”* and thought it’d be worth sharing/discussing. (Link included below.)  \nHere’s a quick breakdown + my take — would love to hear what you all think:\n\n# 🔍 Key Highlights from the Review\n\n1. **Top-tier graphics & processing** – It leans on Intel + latest RTX (5000 series) hardware for serious gaming punch.\n2. **Stunning OLED 240 Hz display** – Crisp visuals, high refresh, rich colors.\n3. **Performance & cooling optimized** – Good thermal design (especially on a stand) helps sustain heavy loads.\n4. **Strong build quality & premium feel** – Materials and finish got good praise.\n5. **Quiet / balance modes are effective** – You don’t always have to blast full power.\n6. **Decent audio & ports** – For a gaming laptop, it doesn’t skimp too much.\n7. **Some compromises & trade-offs** – Battery life is underwhelming, smudge-prone surfaces, and the new port layout (sides vs back) isn’t ideal for everyone.\n\n# My Thoughts & Questions\n\n* This looks like a beast if you mostly use it plugged in — for gaming, video, creative work. But if you're mobile and need long unplugged sessions, the battery life sounds weak (which echoed in other reviews too).\n* The OLED + 240 Hz combo is tempting, but in bright environments, reflections may kill the vibe.\n* Side instead of rear ports is a controversial change — ergonomics over aesthetics?\n* I’m curious: for folks who’ve tried it, how is it in real-world use (noise, heat, battery wear)?\n\n**Link to full review (for reference):**  \n“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025” [mesnbot.com](https://mesnbot.com/7-powerful-reasons-the-lenovo-legion-pro-7i-gen-10-review-proves-its-a-game-changer-in-2025/?utm_source=chatgpt.com)",
  "ChatGPT review lol",
  "HP Victus vs Lenovo Legion 5 which is better long-term? I’m choosing between:\n\nHP Victus 15 (i7-13620H, RTX 5050, 24GB RAM, 1TB SSD)\n\nLenovo Legion 5 (i7-13650HX, RTX 4060, 24GB RAM, 512GB SSD)\n\n\nMain use: 4 years of online lectures, projects, PDFs, and some light gaming (Minecraft, GTA V/VI, COD).\nI need something that can last 4–5 years stable, hopefully 7–8 with good care.\n\nWhich would you recommend? Or any better options around 1–1.1L INR?\n",
  "Bruh not even comparable lol 😂",
  "would get the Legion 5, as it is more overall better built. The Victus in the first hand is equal or even a lil bit below to the LOQ which is basically a budget Legion and its competition in the first place.\n\nin terms of storage it isn't a problem as you could just upgrade it in the long run, as well as it has full powered TGP GPU, unlike the Victus that is limited to 75w or even reports on r/HPVictus as low as 50w which is not ideal.",
  "Thanks for the detailed insight! That makes sense. For me though, the main use is 4 years of online lectures, projects, PDFs, and just light gaming like Minecraft, GTA V/VI, and COD. I’m not planning on heavy GPU loads. That’s why the Victus looked attractive with the 1TB storage out of the box. Do you still think the Legion is a smarter pick for this lighter use case, or would the Victus hold up fine?",
  "If you wanted a laptop that last you long, often the best choice is to invest the best you could get right now in terms of overall which the Legion qualifies, as it has better overall quality considering that hinge design of Legions are well known to be good in comparison with the Victus with a wobbly screen and hmmm hinge design.\n\nScreen quality is another as you often look at with this all Legions have good color accurate and good brightness panels in average, in comparison to Victus as HP budget lineup that the colors may tend to be dull and dim brightness.\n\nAnother is performance, if both laptops have the same GPU wattage basically both are on par tho it is not as the Victus is only rated at 75w (or even 50w on some models) compared to the Lenovo having the maximum GPU power so it has better GPU performance.\n\nNext is the CPU tho they almost similar the Legion has the HX chip, a better binned CPU among the two where you could undervolt it making the CPU perform better, more efficient, cooler, as well as extend more its lifespan by doing so.\n\nSo with Legion, you'll getting overall better build of laptop, quality of life, as well as performance making it last better in the long run.\n\nAs again the Victus initially is a competitor to the LOQ that is a more budget variant of the Legion (which would say even a better option the Victus if we are comparing laptops with similar specs)",
  "want review on Lenovo V15 AMD Ryzen 7 7730U i have my eye on the laptop on this upcoming diwali sale - Lenovo V15 AMD Ryzen 7 7730U 15.6\" (39.62cm) FHD 250 Nits Antiglare Thin and Light Laptop (Free MS Office) Lifetime (16GB/512GB SSD/Windows 11/Iron Grey/1.65 Kg) 1 Year Brand Warranty, 83CRA01SIN ..... i am willing this laptop to last until my phd for research purposes as i am a Environmental science student ... ",
  "ryzen 7 7730u with 16gb ram and 512gb ssd is solid for research and long term use but the screen and battery are weak points so if you can get the ips version it’ll be much better for phd work",
  "help deciding between lenovo yoga 7 ryzen 7, lenovo yoga slim 7i and lenovo yoga slim 7i aura edition hello! ill hopefully be going to university this september and I'm looking to buy a decently well-built, durable laptop that can last me the whole 3 years of my course and maybe some time after that. \n\nmy budget is between £850 - £950. can't really go over that..\n\n2 of my friends have the lenovo yoga 7i and they're enjoying it a lot but im not 100% sold on it because I've heard mixed reviews, especially about the hinges. They've only had them for a couple months each so I don't think they can answer my questions from a long-term perspective, if you get what I mean.\n\nanyways, i would mainly like to use this work school work along with streaming movies, watching YouTube and hopefully being able to play games. the games i would like to play on this are roblox, valorant, overwatch 2 and some story games (lis, tlou2, rdr)\n\nill copy and paste the links below so the full specs can be seen:\n\nhttps://www.currys.co.uk/products/lenovo-yoga-7-14-refurbished-2-in-1-laptop-amd-ryzen-7-1-tb-ssd-blue-very-good-condition-10269152.html\n\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOTNJgM_IosqUGJRGjYPUOxOOeO0JrO77bafqzhQ8iQtmdFR4KC1lBsaAmvtEALw_wcB ",
  "definitely the yoga slim 7i aura edition from lenovos website \n\nit would have the best battery life and igpu out of all these. the core ultra 226v and the 200v series processors are REALLY good at everything. tlou2 and rdr might be fine, if i remember correctly it should be fine at 1080 low/medium. search for some gaming benchmarks on youtube for this. roblox/valorant/ow should be fine \n\nonly problem is 16gb of ram which might struggle in gaming but for everything else itll be fine. the oled screen will be really nice for watching movies",
  "ooh okay, thank you!!\n\nin the specs of the slim 7i aura, it says 16GB (memory on package) instead of (soldered)\ndoes this mean i would be able to change the memory to 32GB? i don't actually know how to do this yet, but would that be possible?\n\nalso, is it worth getting any security software (norton) or should i just leave that",
  "That's what I just got (I'm in Italy)  Nice machine but a bit disappointed with battery life (I bought this notebook almost exclusivley for its battery life but in 3 days I have done 8 htrs at the most (with most settings to minimum included 60hz)",
  "nooo dont get norton, windows defender is perfectly fine\n\nand no sadly the ram isnt upgradeable. with the new core ultra chips, the ram is soldered (memory on package is another way of saying it), so that the ram has higher speeds=better performance especially for the igpu\n\nand clicking on the build your pc option, it seems like we cant even get 32gb which sucks\n\nthe only option with 32gb ram is the core ultra 7 258v, which seems like it is an extra 110 in total. if youre willing to spend that much, its gonna be worth it (better cpu and gpu performance+more ram).",
  "ohh okay then, i won't.\n\naw, that sucks. i don't have the money to buy anything over 1k :( so ill stick with the 16gb\n\nalso, im really stuck on something. on the website there's this other lenovo yoga 7i slim 7 aura edition gen10\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb5?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOQtLrzWLnEL9t1kRgkhS7z0s-S_GgUHqP0wj2K2ZpTkXXNkhQq7-WkaAgcdEALw_wcB\n\nthere's a £20 difference but i can't see any differences between them? im comparing them on the website but i don't see anything.. maybe im blind but is there any difference or can i just take the cheaper option?\n\nand have you ever bought from the lenovo website yourself?",
  "everything seems to be the same other than the fact that the 20 cheaper has no premium warranty?\n\n[https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html](https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html) \n\nanother option is this\n\nthe ryzen 9 365 is really good, its oled, the vivobook s15 is made of metal so it feels premium, display is also 120hz instead of 60 and importantly, its 32gb of ram!",
  "ooh okay, ill check it out! pretty expensive tho😭\n\nis there a major difference in quality between the yoga slim 7 and the aura edition? i know they can both handle basic things like writing documents, but streaming and gaming wise? im feeling anxious about spending almost 1k on a laptop so should i just go for the cheaper option..? im assuming the slim is better than the regular yoga 7i so im not asking about that (could be wrong tho ofc)",
  "you mean the yoga 7 from currys? its refurbished and the cpu is a rebadged older processor. if youre gonna use the laptop for a couple years imo it is worth spending more for the aura/vivobook",
  "i meant this slim 7i\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\ndoes the fact that it's ultra 7 mean it works faster/better than ultra 5? \nwould this not be able to last for at least 3-4 years based on how ill be using it?\ni only got this money bc of a scheme in the uk called child trust funds and i got 1k and some change so i feel anxious to spend all of it on a laptop yk?",
  "Ohhhh for 700 its good. yeah the core ultra 7 155h isnt as efficient as the newer 200 series processor but performance is on par and the igpu is actually better\n\nso yeah I would say this will still be good to go for 3-4 years",
  "ooh okay so does that mean it can handle games and streaming better?\n\ni will probably get this one instead then!",
  "XMG Neo 16 (2025) vs Lenovo Legion 9i (2025) — which one should I get? Hey everyone,\n\nI’m planning to buy a high-end gaming laptop this year and I’ve narrowed it down to two models:\n\nXMG Neo 16 (2025)\n\nLenovo Legion 9i (2025)\n\n(P. S both are the gpus, and 32/64 GB  of ram, while the xmg has Ryzen CPU instead of intel)\n\nWhat I’m looking for:\n\nTop gaming performance \n\nTop performance for 3d content creation, and animation (photoshop, blender, maya, ue5...)\n\nExcelent display\n\nGood thermals and fan noise (doesn’t have to be silent, just not throttling)\n\nBuild quality and long-term reliability\n\nBattery life is secondary, but not terrible would be nice\n\n\nI’ve seen that the Neo 16 has a lot of customization and strong cooling, while Lenovo models seem to have great screens and extra features. But I’m not sure which one is the best balance overall.\n\nQuestion: If you had to choose, which of these two would you pick for gaming + some productivity/creative work, and why? Any personal experience or reviews you’ve seen would help a lot.\n\nThanks!",
  "Thoughts on this Lenovo Legion Thoughts on this Lenovo legion for a physics student?\n\nBeen looking for a computer, and it is currently $1299, so I wanted to know if that would be worth it. Let me know ya'lls thoughts!\n\nHere's the full link\nhttps://www.costco.com/.product.4000380973.html?adobe_mc=TS%253D1758469427%257CMCMID%253D79307034283651709068969843625741692738%257CMCORGID%253D97B21CFE5329614E0A490D45@AdobeOrg&mboxSession=ebc90646-2a3f-473c-9d62-69790df2d27e&sh=true&nf=true",
  "Would you recommend this for gaming? Lenovo Legion 5 OLED 15IRX10 I'm planning to buy a new laptop for gaming and work. And I found this new laptop. What do you think about it? \n\n\nThis is the spec:\n\nScreen size\t15,1 inches\nProcessor\tIntel Core i7\nInternal RAM\t24 GB\nTotal storage capacity\t512 GB\nVideo card\tNVIDIA GeForce RTX 5070\n\n\n\n",
  "It's pretty good imo, I'd probably install another m. 2 afterwards cause 512gb is just not enough nowadays.",
  "are you grateful about screen size ? it looks like small.",
  "Thank you. I would do the same. But do you think Legion is a solid choice?",
  "Yeah, legion series has gotten significantly better in the past couple of years, balancing in price, build quality and performance.",
  "Lenovo Legion Pro 5 won't turn on again We had taken the laptop with its charging cable and the laptop was running on battery after we returned home. I didn't realize it but while my son was playing some game on it he managed to discharge the battery completely. That's when I discovered the AC adapter wasn't charging the laptop anymore.\n\nI tried using a MacBook Pro 87W USB-PD charger to charge it overnight and this morning I see a white light in the power button area. However when I turn on the power all I see is a flashing white light when I press the power button (the flashes are long ever 10 seconds or so). If I press down the power button for a while the flashes stop again. But no display nothing. I don't even get the sound of the hard drive or fan turning on. \n\nThe manual says the USB charger should be rated 140W which it is not. But then shouldn't that mean I should be able to run the laptop on battery at least assuming the white light at the top means it was able to charge the battery while in switched off mode?",
  "Do an EC reset. Disconnect internal battery/cmos (little battery) and external power source. Then press the power button for 1 minute and connect the cmos/internal battery again (do not press power button). Plug in original AC adapter, it should turn on by itself.",
  "Check which UsbC port you have used for charging, not every port on laptop is able to take PD charging.",
  "Thanks. Didn't work unfortunately. Didn't physically remove the main battery as I didn't have the right tools but was able to open the laptop cover and disconnect the cable connecting battery to the motherboard, which should have had the same effect I think. Held down the power button with battery disconnected and put the adapter back but it didn't start. Reconnected the battery, held down the power button again and reconnected the adapter and it still won't turn out. Same, long duration flashing white light in the power button area.\n\nUpon closer inspection looks like there were dark patches in the motherboard near the area connecting battery to the motherboard. Wonder if that was due to overheating as the battery was supplying power while Roblox game was being played last time the laptop was used. Or maybe I am overthinking this.",
  "It was the one in the front labeled USB-PD. I did check with someone at Geek Squad and they told me because I used a 87 W adapter (MacBook Pro one), it likely isn't rated for Lenovo. I thought it would atleast recharge the battery but it's possible it did nothing inspite of the white light I see now when I plug it back in.",
  "Then it hardly be the charger issue. It should charge as it supports pd20v. Then most likely the problem in the laptop or battery.",
  "Lenovo Yoga Pro 7i 14 (Ultra 7-Windows 11 Home-32GB-1TB) I just bought my new Lenovo a week ago, and there are several things I like about it, but the most important ones for me, such as battery life, are starting to bother me. According to the website and reviews I've seen, the battery should last more than 8 hours with normal use for web browsing, Netflix, and so on. But every time I unplug it and it's at around 90% or 80%, it says there are 5 hours remaining. On the other hand, I started hearing metallic noises from the chassis when I pick it up or move it. I don't know if this is normal, but I'm thinking of returning it and switching to a Macbook Air. Considering that I paid €1,099 for the Lenovo, I could get the Macbook M4 for a similar price.\n\n\n\nMy use of it is quite simple for now: web browsing, multimedia, office automation. General student use and perhaps work. That's why I feel that the Macbook is a better option, considering the battery life, which is the most important thing for me.\n\n\n\nAnother thing the Lenovo has is the 3k OLED touchscreen, but I don't really use the touchpad...\n\nWhat do you guys think? Should I return mine and buy a Macbook Air 16ram 216/512 SSD?",
  "Which one did you get, was the problem there initially? Or it you faced it much later on",
  "Hi, wgich reviews did you see?",
  "How is the battery life now after 3 months, have you found any solutions to make it last longer?",
  "Lenovo Legion Slim 7 resale value? Hello. How much should I reasonably expect to get for this laptop through private selling on FB or what have you. Thank you. \n",
  "800-900",
  "Planning to buy a lenovo ideapad 3 slim ryzen 7 5000 series, laptop Thoughts in this? \n\nFull specs in the pic\n\nSomehow I can't find any reviews on this specific model. I think it's because it's in my region/country only(?). \n\nTo clarify, my purpose of buying this is for light gaming, studies, programming, & multitasking. I'm fine with ram being soldered. Will use this 4 years minimum. \n\nIn general, can anyone who uses/used lenovo ideapad 3 (any models, or this in particular) share their experience and if there are any issues? any reviews or feedbacks? 🙏\n\nQuestions:\n- Can this last for 4 years? \n- How many hours does battery last based on ur experience? \n- Any heating issues? Is it recommended to buy a cooling pad right away? \n- Can it handle minor damages?\n\nOr if you better recommendations pls feel free to do so. Though, don't recommend me thinkpads, i know it's good, but i have a budget and need cheaper like this. Thank you 🙏\n\n\n\n",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy courses that require Windows-specific tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on what you’re studying and whether your coursework leans heavily on Windows-only dev environments.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8), so no dedicated GPU. it’s fine for light gaming or basic rendering, but it’s not gonna handle anything GPU-heavy. also unlike something like an M4 or M3 Mac, which has dedicated media/GPU cores optimized for ML tasks, this is just CPU + iGPU.\n\nas for reliability — IdeaPad 3’s are budget-tier machines. they work, but don’t expect amazing build quality. plastic chassis, average screens, and thermals can get loud under load.\nit’ll probably get you through 4 years if you take care of it, but it’s not something you’ll want to hold onto long after that.",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy coursework that needs Windows-only tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on your major and what your dev tools require.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8) — no dedicated GPU. it’s totally fine for light gaming or basic workloads, but don’t expect any heavy lifting. also, unlike something like an M2 or M4 Mac, there’s no real media or AI-optimized GPU cores.\n\nas for reliability — IdeaPad 3 is entry-level. they work, but they’re built cheap: plastic chassis, basic thermals, and screens that are just okay. it’ll likely last you 4 years if you take care of it, but it’s not really something you’d want to hang on to after graduation.\n\nhonestly speaking, you should give your laptop a bigger budget — this is something you’ll use thousands of hours over the next few years. it’s worth investing a bit more into something that won’t annoy you with throttling, battery issues, or cheap build after a year.",
  "+ Does the audio sounds good and loud enough? ",
  "pls be honest if u did anything that made ur laptop had issues (like overheating it for a long period, opening sites that has malware, accidentally dropping a heavy object on the laptop, and such) 🙏 , im very careful with my devices so if it's the kind of laptop that just malfunction/become faulty all of a sudden, pls let me knoww tysm",
  "Based on 47Whr battery, it will last you prob 5hrs at best when you do a battery saver setting.\n\n\nBut that's what should have been with budget laptop.\n\n\nIf by light gaming you mean games that can be played with iGPU, then it's no problem.\n\n\nAbout heating issues, as long as the fan is working, it won't be a problem. Cooling pad is recommended tho.\n\n\nCan this last 4 years , depends on how you use it. And probably the first problem that you will have within 4 years is not enough storage.",
  "Wdym by that? Is 16/512 combo not enough for a non working professional student?",
  "system already takes 44GB, and the storage won't be 512 , probably less when you have the laptop.\n\nso, imagine you install games that take at least 20GB , and then some videos and photos, overtime it will be filled.\n\nmine already have less than 700GB already from total 950GB in 6 months.",
  "I dont play games....well mine does have an ssd port so ig i can add more storage in the future if i need"
]