[
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "First impressions of the 2023 Lenovo Slim (Yoga) Pro 9i I just bought on clearance I finally pulled the trigger on a new laptop. I was waiting for the new 16 inch Yoga Pro 9i to go on sale at Best Buy when I found last year's 16 inch Slim Pro 9i on clearance for $1,099 at a Costco about an hour from my house. Even though it lacks some of the refinements of the newer model, I couldn't pass up that price. It is the mini-LED touch screen version with intel i9 processor, GeForce RTX 4050 GPU, 32GB RAM, and 1TB SSD. I will mostly be using it for productivity, music production, some video editing, and watching stuff on YouTube.\n\nI set it up last night and did all the system updates. Here are my first impressions\n\n**Looks/build/feel/ports:**\n\n* Build quality feels insanely good to me - the Storm Gray aluminum body is super sleek. \n* The keyboard is incredible (one of the things I liked about the new model when I tried it at Best Buy) \n* The glass trackpad also feels amazing and has a fairly satisfying click (I prefer this to haptic personally).\n* A little heavy, but also seems slimmer and more compact than I was expecting.\n\n**Screen:**\n\nI wasn't sure how I'd feel about the screen, as I've never owned a glossy one before, but wow. It is spacious and bright and very impressive. Unfortunately, the HDR mode in Windows seems to do something wacky with the colors, but in SDR, it still seems to have plenty of contrast to me. I put it side by side with my partners MacBook Pro and it was definitely brighter, although the overall colors on the Mac are still better IMO. I haven't really noticed any of the blooming people complain about. Ghosting has also not been an issue.\n\n**Speakers:**\n\nAs good as everyone says. Comparable to Mac.\n\n**Performance:**\n\nThis computer is fast and fluid, even at 60hz refresh. It is very quiet and cool when not in performance mode. I haven't really put it to the test yet, but I'm thinking it should be able to handle whatever I throw at it.\n\n**Battery:**\n\nThis is the main thing reviewers complain about with this model (and to a lesser extent the newer model). I was expecting the worst, but so far I'm pretty impressed. I've been using it off and on today for the last 6 hours for some work and web browsing, and I'm now sitting at about 25%. This is with battery saver on, so I'd expect worse in intelligent cooling mode, and much worse in performance mode.\n\n**Conclusion:**\n\nSo far, I'm pretty much loving this thing. Most of the issues I've had have been related to OneDrive syncing things I didn't ask it to and other Windows-related complaints. The other issue is ports - it has a decent selection, but I'm hoping I can find a USBC charger that will work with it (this has been another complaint in previous reviews).\n\nOf course, the newer model just went on sale at Best Buy for $1,499. That has the \"Ultra\" i9 processor and a slightly bigger battery, as well as fixing some of the port issues. But at that price it comes with the IPS, albeit a very nice one, and it's still $400 more than what I paid.  They have the mini-LED variant with RTX 4060 on sale for $1649 as well.\n\nPart of my plan was that if I wanted, I could just return this one to Costco and go grab the newer model, but I really like getting a good bang for my buck and I think I've achieved that with the older model. However, I'd say if you are considering the new Yoga Pro 9i, both options are a great value at the current sale price.\n\nSidenote: the other great value option I was considering was the IdeaPad Pro 5i at Costco for $1,499 with similar specs, but with an OLED. However, I wasn't impressed with the low-resolution of the screen in person and the build just didn't seem as good to me. ",
  "Paid 1599 for it a year ago same specs mini led ",
  "If you haven't yet you need to download the hdr calibration tool from the windows store and manually calibrate the screen. I thought I was watching things in hdr but realized it wasn't calibrated at all and was basically the same as sdr. If you don't see any blooming, you're probably not really using the hdr capabilities. It's night and day once you do.",
  "I bought this laptop too around half a year ago, also mostly because of the pretty decent discount. I was deciding between it and a Legion Slim 7 for around $200 less although I regret picking it despite still liking it overall.\n\n**Pros**\n\n* keyboard feels great to type on and is a step above other Lenovo laptop keyboards\n* very bright 3200x2000 165Hz mini-LED screen\n* loud, booming speakers\n* relatively quiet fan noise in a variety of use cases\n* capable of light gaming in a pinch - mobile 4050 is roughly equivalent to a desktop RX6600/RTX3060\n* solid build quality outside the base cover\n* fairly thin at around 0.7\"\n* high quality webcam and microphone\n\n\n**Subjective Pros/Cons**\n\n* extremely large Macbook-sized touchpad\n* bland aesthetics fit for an office\n* lack of RGB keyboard backlighting\n* high resolution of 3200x2000 potentially wasted in a 16\" form factor and makes games more difficult to run\n* uses Torx screws to access the internals\n* beveled and rounded corners on the panel\n\n**Cons** \n\n* woeful battery life of around 2-3 hours with casual use\n* only one USB-C port\n* no Advanced Optimus\n* creaky base cover\n* mediocre SD read/write speeds\n* relatively heavy for a thin non-gaming laptop\n* noticeably higher black levels in SDR mode\n* soldered unupgradable RAM\n* no ethernet port\n* outdated HDMI 2.0 (some report 1.4, but I can output 4K60 on mine) standard\n* tiny up/down arrow keys\n* mini-LED local dimming only activates in HDR mode",
  "Do you still have it? How are you liking it?",
  "Yeah that sounds about right. The legion slim 7 is supposed to be a great machine.",
  "Is this list regarding the Lenovo Slim Pro 9 14IRP8?",
  "Yep I still have it. The screen is the best part every time I open it. The performance is still great and I have no issues. I hate to say but the battery life is terrible. Barely 3 hours with medium usage.",
  "I used it for a while and also really liked it. Longer battery life, more gaming-capable, lighter, more ports and better located, per-key RGB backlighting, etc. \n\nBut the screen (while still very good) didn't pop as much with the colors, the keyboard was mushier, the speakers/webcam/microphone weren't as high quality, and the build quality was a slight step down as I could feel some creaks holding it one-handed. With the Slim Pro 9 I really only feel the creaks if I apply pressure on the bottom cover. And I grew to really like the size of the Slim Pro 9's touchpad.",
  "No, it's for the 16\" variant.",
  "Sounds like I made the right call then (for me), assuming I can find a more portable charger. I'm really liking the feel of it so far.",
  "Man, I have seen such minimal coverage for the 14\" version!",
  "Oh yeah, the charger on the Legion was also noticeably larger, which makes sense as it was trying to drive a 4060 instead of a 4050.",
  "Have you found an additional charger yet? I'm struggling to figure out what wattage I need!.",
  "Yeah, I've actually heard good things about it, but I can't say how many of these pros/cons apply.",
  "I haven't bought one yet, but I'm still planning on getting the portable 100w ugreen charger before I do any traveling. Supposedly anything 65w or above will work.",
  "I have it myself and it basically fits all of your pros and lacks most of the cons. Maybe I'm missing something, but I'm surprised it isn't more popular. \n\nIt almost seems like a unicorn device that Lenovo's had to cover up to stop it from cannibalizing sales\n\nI'm trying to buy a backup charger and can't find any reference of what power specs it needs",
  "That's my goal too!\n\nI've tried other power sources (Samsung s24u 45W@9v) hoping for even the ability to trickle charge, but they were simply too weak to even be recognized by the computer.\n\nI'm curious if there is also an upper limit to the wattage. Or even what voltage it charges at. Or where to find such information!",
  "Whats a good general purpose medium-high performance laptop with a touchscreen? Hello all, I'm looking for a new laptop going into college and i'm having trouble picking one that meets my needs. In general I'm looking for something with a nice CPU and GPU and good thermals, with a touchscreen available. It will be used for general purpose stuff, as well as CAD and light gaming, and occasionally drawing if possible (hence the touchscreen)  \n\n\n**LAPTOP QUESTIONNAIRE**\n\n* **Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:**\n\n$1700 to $2200 USD range, purchasing in the US.\n\n* **Are you open to refurbs/used?**\n\nI'd prefer new.\n\n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?**\n\nBuild quality, Performance, then battery life and form factor. I almost always have my charger with me so battery life isn't super important to me.\n\n* **How important is weight and thinness to you?**\n\nnot super important. I care more about it having good thermals than having it be super thin. That said, thinner than an inch is fine for me.\n\n* **Do you have a preferred screen size? If indifferent, put N/A.**\n\n14\"-16\" is good. \n\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.**\n\nSome CAD and light gaming. for CAD I want to be able to smoothly run Inventor and Altium designer, maybe solidworks?\n\n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?**\n\nI play a lot of minecraft and emulated older games (I would love to be able to emulate PS3 and Wii U if possible) but nothing incredibly graphically intensive. That said I would like something that can handle a bit more, if I decide to throw more powerful games at it in the future.\n\n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?**\n\nReliable build quality is very important to me, I want something that will last. Also a decent touch screen, ideally with some stylus support. a good trackpad would be nice too, as i'm used to being able to do gestures and whatnot on my old macbook's trackpad\n\n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**\n\nNeeds to be a Windows machine, will be used for school as well as personal stuff. A nice screen would be great but it's not a stiff requirement for me.\n\n&#x200B;\n\nSo far heres some good options i've seen:  \n\n\nDell XPS 15 9530: i9-13900H, RTX 4060 8G, 16G DDR5 4800MT/s, 512GB NVMe SSD, 15.6\" oled Touch,86Wh, $1850  \nThis looks excellent on the surface but the TDP is very limited, and as such it seems like people have overheating issues with it. I also see a LOT of complaints about quality control for this laptop.  \n\n\nASUS ProArt Studiobook: i9-13980HX, RTX 4060, 16G DDR5, 1TB SSD, 16\" oled Touch, 90Wh, $2000  \nFrom what i've seen this is the best option, if the quality control is good. TDP is fairly high so it should stay cool most of the time if I understand correctly. Probably a bit overkill.  \n\n\nASUS Zenbook pro 14: i9-13900H, RTX 4060, 16G DDR5, 1TB SSD, 14.5\" oled Touch, 72WH, $1800  \nsimilar to the studiobook but smaller and a decent bit less powerful.   \n\n\nLenovo Slim Pro 9i: i9-13905H, RTX 4060, 32G DDR5, 1TB SSD, 16\" miniLED Touch, 75Wh, $2150  \nOn the high end of my budget, but comes with more RAM and a very nice form factor.\n\nDoes anybody here have experience with these machines? how is the quality control on these, especially the ASUS laptops? Any other recommendations? Thank you.",
  "[removed]",
  "Thank you! I'm probably going to go with the Studiobook.",
  "What would you buy? Asus Vivobook 16 vs. HP Envy 16 vs. Lenovo Slim Pro 9i 16 Hello all,\n\nI am stuck deciding between a few laptops to use as a desktop replacement that I would be purchasing in the US. After a lot of research and asking around, I have found three main contenders that are all pretty similar:\n\n1. Asus Vivobook Pro 16 OLED K6602VV-ES94. Specs: 3.2k OLED, i9 13900H, RTX 4060, 16 GB DDR5 (8 GB soldered), and 1TB SSD, similar to the one listed here.  [https://www.newegg.com/quiet-blue-asus-viewbook-pro-16-k6602vv-es94/p/N82E16834236435](https://www.newegg.com/quiet-blue-asus-viewbook-pro-16-k6602vv-es94/p/N82E16834236435) After a bunch of gift cards I have not used, it would end up coming to about $1300 after taxes.\n2. HP Envy 16 with the following specs: 2.8k OLED Touch, i7 13700H, RTX 4060, 32 GB DDR5 RAM, 512GB SSD. This one would be about $1600 after taxes and some discounts I have from HP. [https://www.hp.com/us-en/shop/ConfigureView?langId=-1&storeId=10151&catalogId=10051&catEntryId=3074457345620826319&urlLangId=&quantity=1](https://www.hp.com/us-en/shop/ConfigureView?langId=-1&storeId=10151&catalogId=10051&catEntryId=3074457345620826319&urlLangId=&quantity=1)\n3. Lenovo Slim Pro 9i 16. Specs: 3.2k Mini-LED Touch, i9 13905H, RTX 4060, 32 GB RAM (32 GB soldered), 1TB SSD. This one would probably cost me around $1699 after tax after I use another discount I have. [https://www.bhphotovideo.com/c/product/1762580-REG/lenovo\\_83c00004us\\_16\\_slim\\_pro\\_9.html/specs?ap=y&ap=y&smp=y&smp=y&lsft=BI%3A514&gad\\_source=1&gclid=CjwKCAiAjrarBhAWEiwA2qWdCB3J\\_BepKVY3wAzNkMEXrPDXM98LMgG27KY8Ptox8a7b1i-0uDQniBoCCwMQAvD\\_BwE](https://www.bhphotovideo.com/c/product/1762580-REG/lenovo_83c00004us_16_slim_pro_9.html/specs?ap=y&ap=y&smp=y&smp=y&lsft=BI%3A514&gad_source=1&gclid=CjwKCAiAjrarBhAWEiwA2qWdCB3J_BepKVY3wAzNkMEXrPDXM98LMgG27KY8Ptox8a7b1i-0uDQniBoCCwMQAvD_BwE)\n\nIs anyone familiar with any of these machines? Are there known problems with any of them? The reviews of each one seem to be fairly scarce. Which one is the best choice? I am especially interested in the best display,\n\nAlso, I know the ASUS one has a bunch of related \"X\" models that are probably due for a refresh soon. Was not sure if it was worth waiting for those. There is also a related Zenbook but it comes with a 14.5-inch screen, which seems a bit small. I am a bit apprehensive about HP because I have heard mixed things about their OLED touch panels looking not great concerning the \"screen door effect\".\n\nTo follow the rules, I also attached below the form I understood that I was supposed to fill out when asking for buying advice. \n\nThank you and any advice is appreciated.\n\n* **Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:**  \nCountry of purchase: USA. Budget cap: $1700 USD\n* **Are you open to refurbs/used?**  \nI don’t think so.\n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?**  \nPreference goes to metal chassis and a thinner, macbook-type look. I dislike the clunky RGB gaming laptop look. To me, they are a bit grotesque. More battery life is always a plus. Something with under 4-hours would be off-putting. Display quality is very important.\n* **How important is weight and thinness to you?**  \nWould prefer thinner and lighter, but open to heavier.\n* **Do you have a preferred screen size? If indifferent, put N/A.**  \n15 inches minimum, 16 ideally\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.**  \nWeb design on wordpress/wix, light gaming, nothing AAA, photo  \nWould prefer to have an HDMI port, high quality. very color-accurate display (important), and a good keyboard. I was looking at Unreal and it looked like it would be interesting to make art on that. As much as I like other Apple products, I would need a Windows laptop for compatibility purposes.\n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?**  \nProbably nothing much more intense than a B2 game or phasmophobia, prefer it to run pretty high though. Also, I do not want to limit myself too much if I am more interested in games in the future.\n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?**  \nWould prefer to have an HDMI port, high quality. very color accurate display (important), a good keyboard.",
  "I have the slim pro 9i and I just bought the envy. \n\nI will update with my experiences with the envy once I get it.\n\nBut I will say the slim pro 9i is a fine machine, but the blooming in hdr is pretty bad. It really bothered me a lot to think point where I just don't use it in HDR.\n\nBy sheer luck, I was able to keep the slim pro 9i for free and it'll be my work laptop, but the hp envy seems like a better buy with that OLED display.\n\nThis is exclusive, however, but either is a good option. Is get whatever is cheaper. The hp has upgradeable ram, however, which is a big big plus. \n\nAs for the vivobook, I'm not too sure. I've heard they have issues with throttling. In my experience, the Lenovo also throttles, but I've heard the hp has a really solid cooling system\n\nEdit:\n\nThe vivobook is the cheaper option, but the soldered ram is a deal breaker. I think it has one open slot, but that still kind of sucks.\n\nI'd look into the HP. It seems like a good option. They also have good warranties that get refunded if you don't use them",
  "So I'm giving an update to my original comment since I've now had time to compare the envy and slim pro 9i.\n\nThe envy is thinner and looks really nice, but the slim pro 9i feels more premium. They are both metal, however.\n\nBoth screens are nice with drawbacks for each.\n\nWith the slim pro 9i, in HDR, there is noticeable blooming with the screen. I imagine this is due to a lack of dimming zones. I've heard the 14\" model has a similar number of dimming zones so blooming is probably less noticeable on the smaller screen. The 14\" slim pro 9i also has a mux switch I believe.\n\n\nThe hp envy OLED option has a beautiful display, but the touchscreen digitizer is really noticeable and kind of can ruin the experience. Since most use is in SDR, I'd say the legion slim pro 9i overall has less drawbacks.\n\nInterestingly enough, the contrast ratio in SDR for the slim is actually quite good, I think it approaches va panel territory so there's actually decent contrast. Not as good as an OLED, but honestly surprisingly good.\n\nWith regard to performance, this is where I was surprised.\n\nI had the envy with an rtx 4060 and the slim has an rtx 4050. The slim performs better. I don't get it, neither were thermal throttling and they have similar GPU wattages. I was kind of shocked. I tested both in games and 3d modelling software.\n\nI returned the hp envy right away. I also think Lenovo as a company is more consumer friendly (I mean they can still not be the best, but that's as expected).\n\nIf I were to choose all over again, I'd go for the 14\" slim pro 9i because of the mux switch and potentially less blooming in hdr due to the smaller screen size with similar dimming zone number.\n\nIf you want a 16\", however, the slim pro 9i is still a fine choice.\n\nEdit:\n\nThe performance difference could potentially be due to ram speed limitations in the envy. Envy doesn't have soldered ram, which usually runs at a lower transfer rate.",
  "Thank you for your replies. I may wait a bit longer on buying as the 2024 stuff is coming out, such as the new ROG Zephyrus OLED G16, the 2024 version of the Lenovo, and a few others. I did also notice the digitizers on OLED panels seem to really stick out. I see there are new Spectras that look interesting, but I expect they have the same problems. \n\nThe only thing about the new G16 is for some reason, they decided only give the USA mediocre SKUs. Only the 4080/90 seems to come with more than 16GB soldered RAM. Why? I’d rather have a 4060 with 32GB. Canada has that one.",
  "Another option is the gigabyte aero 16. It has upgradeable ram, and I think it might come with an OLED non-touch model. I'd stay away from HP though, the brands you'll want to focus on are lenovo and asus. \n\n&#x200B;\n\nDon't get me wrong, I'd honestly recommend the slim pro 9i. You can probably find an rtx 4060 variant. The display is no slouch and if you use it in a lit room. then you likely won't really notice the blooming in hdr. \n\n&#x200B;\n\nYou can also look at the Vivobook Pro 16X, as opposed to the regular pro. There is an rtx 4070 variant with 32 gb ram, mux switch, and OLED panel. This might be your best option and I believe the price is reasonable. \n\n&#x200B;\n\n[Vivobook Pro 16x](https://www.amazon.com/ASUS-Vivobook-Pro-16X-Laptop/dp/B0BZQP8591/ref=sr_1_1?crid=DOQ4SOCS7KNX&dib=eyJ2IjoiMSJ9.wJpcXBmsP-e9Oldjx_wB2yNWut2FX_2vWTnG6JfuUrVicg4MeM_paM2nvU55DZXu0x6E_Djnk_79Bp7PADL83saA8ltfX3RewVtNa-B8Yfp4wBqUFsW_-l819virJuLGw9dl-YxYDspzQM7H9cwbfOpDfgcIR8TcSOIOn5j3YFCwuRJmRwZbr5Th729o7meQTwJJ4r4Xm0Ugo6Mmlg-wm63begXK1r83tMo6uHJIgRc.TsErwuWpN8nLyo8dbYvCHLu5wYN5u30e1WSFzDfQWcw&dib_tag=se&keywords=vivobook+pro+16x+rtx+4070&qid=1708801960&sprefix=vivobook+pro+16x+rtx+4070%2Caps%2C124&sr=8-1&ufe=app_do%3Aamzn1.fos.17f26c18-b61b-4ce9-8a28-de351f41cffb)\n\n&#x200B;\n\nYou can even take a look at the used option here. In all likelihood, it still has the manufacturer warranty which you could upgrade. Amazon warehouse generally exaggerates the conditions of the returned laptops so it could very well be like new, just with a busted box. You could take a chance with this and return it if it's not to your liking.",
  "Hi, I’m Vetted AI Bot! I researched the **ASUS Vivobook Pro 16X Laptop 16 16 10 Display Intel Core i9 13980HX CPU NVIDIA GeForce RTX 4070 GPU 32GB RAM 1TB SSD Windows 11 Home Earl Grey K6604JI AS99** and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Powerful performance for neural networks (backed by 1 comment)\n* Great for cad and design software (backed by 1 comment)\n* Excellent screen resolution and quality (backed by 2 comments)\n\n**Users disliked:**\n* Overheating issues leading to performance problems (backed by 4 comments)\n* Unreliable touchpad affecting user experience (backed by 2 comments)\n* Inconsistent quality control leading to premature failure (backed by 2 comments)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/joqd89c/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](http://vetted.ai/reddit)",
  "Patterns on Lenovo Slim Pro 9i laptop display I need a laptop with bigger display, so was looking at Lenovo Slim Pro 9i 16 inch that's on sale at Costco. The 3.2K mini-LED display looks very nice at the first impression, but my eyes felt uncomfortable after a few minutes reading, so I switched to EIZO test app with a white background. Surprisingly, it shows a few horizontal shadow bands, no matter if the HDR is switched on or off. In comparison, MBP doesn't have this problem. Is this something related to mini-LED screen, or something particular to Lenovo laptops? \n\n[IMG-2388.jpg](https://postimg.cc/MvqJk6zK)\n[IMG-2389.jpg](https://postimg.cc/kDdg4d7L)",
  "I have only seen one miniLED laptop in person which is an M1 Pro MacBook pro and it did not look like this. I assume that this is not how things should look. \nI know with OLED some \"grid\" shapes can be normal but this is deffinitely not normal. \nSo if you have the option, I would ask for a replacement under warranty.",
  "I haven't bought it, just looking at the display at Costco. Checked it at two Costco and it's the same. I don't understand how come a screen like this can have excellent reviews.",
  "Might just be a thing with display models, running their displays 24/7 for days on end and also people touching them non-stop and possibly damaging them by pressing too hard on the screen and so on."
]