[
  "User-Review: Ninkear A15 Pro The Ninkear A15 Pro has been updated with more current hardware this year. Its predecessor was equipped with an AMD Ryzen 5 6600H. The 2025 model uses an AMD Ryzen 5 7430U. Read my review here to find out how the device performs.\n\nhttps://preview.redd.it/pyf9pncxu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=1fd25bbdde81ba27af2fd5169b47bd3c9aa17f05\n\n**Design and workmanship**\n\nThe Ninkear A15 Pro retains a straightforward and unobtrusive design. The housing is made of aluminum alloy, which contributes to a solid feel. The surface is matte and resistant to fingerprints. The workmanship is appropriate for this price category, with clean edges and fits. The hinge still allows the display to be opened up to 180 degrees, which makes it more flexible to use and gives it stability. Weighing often less than 1.8 kg and with a slim design that is 20 mm thick, it is also easy to transport.\n\nhttps://preview.redd.it/pd5aceszu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=58e8e1ef90e4b8338a011ab2802ff609941dbe25\n\nThe base is made entirely of aluminum and can be easily removed after removing 11 Phillips screws.\n\nhttps://preview.redd.it/ti7foey1v9ef1.jpg?width=1280&format=pjpg&auto=webp&s=4025e49254415ed35592f152584bd31cda7ac101\n\n**Display**\n\nOne feature of the Ninkear A15 Pro is its 16-inch IPS display. It offers QHD resolution (2560 x 1600 pixels), which enables sharp display of text and images. The brightness is specified at 400 nits. The color space coverage in the sRGB range is 99-100%, making the display suitable for multimedia content, light image editing, and office applications. The 120 Hz refresh rate supports smooth display.\n\n**Performance**\n\nInside the 2025 Ninkear A15 Pro is an AMD Ryzen 5 7430U with a TDP of 15W. These CPUs offer balanced performance and energy efficiency. In conjunction with 16 GB DDR4 3200MHz (one module) and a 1 TB NVMe SSD connected via PCIe 3.0. Daily tasks, multitasking, demanding office applications, and basic image or video editing can be performed smoothly. The integrated AMD Radeon also allows you to play less demanding games at moderate settings. Fortnite runs in Full HD at around 60FPS on the lowest settings.\n\nhttps://preview.redd.it/6ivvbzf5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=f9b5fc6852f21829cc49bbf8164cc7fcd4732269\n\nhttps://preview.redd.it/dg3ne1g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=55fabe070c429c1b00cb2d3a64cced24cedbf1a9\n\nhttps://preview.redd.it/lbno40g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=569979cb24136170fa055d0d9d9b90cd404af375\n\n  \nThe built-in PCIe 3.0 SSD is from a manufacturer called TSWC, which I am not familiar with, and I can't find any information about it on Google. The temperatures remained constant at 44°C.\n\nhttps://preview.redd.it/ye3nhzr7v9ef1.png?width=1012&format=png&auto=webp&s=e5999ee43785995c0cbd9fa02de490d00be345bd\n\nhttps://preview.redd.it/xjv4vxr7v9ef1.png?width=724&format=png&auto=webp&s=7c3d062da74b8645bc1cb25153738289b9630cab\n\nThe performance in Crystaldiskmark is also acceptable. However, the SSD was only 19% full. With an almost full SSD, the situation can be quite different. With inexpensive SSDs, transfer rates can plummet.\n\nSince I don't have another PC or laptop with a 6-core (and 12-thread) CPU, there is no comparable model here. The closest thing I have is an AMD Ryzen 5800H in my Lenovo Legion, but it has 2 more cores and is therefore always faster.\n\n\n\n|Benchmarks|Ninkear A15 Pro|\n|:-|:-|\n|3D mark Timespy (complete/CPU)|826/4390|\n|Cinebench 2024 (single/multi)|55/348|\n|Fortnite 1920x1080 Performance Mode all low|58FPS|\n\n**Input devices and connectivity, scope of delivery**\n\nThe keyboard of the Ninkear A15 Pro is backlit and offers a pleasant typing experience with good key travel and a clear pressure point. The keyboard itself has an ANSI-US layout, and no other layout is available for purchase.\n\nhttps://preview.redd.it/f4wb1oynv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=da8d3e7ca926567506df4725b2c054188998060b\n\nThe touchpad is a comfortable size, responds precisely, and supports Windows multitouch gestures without any problems. The fingerprint sensor is located in the upper left corner of the touchpad and works flawlessly with Windows Hello.\n\nUnlike the Ninkear N15 Pro, which I also tested, the two touchpad buttons are quiet and do not make a loud clicking sound when pressed.\n\nConnectivity is comprehensive: the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support, plus three USB-A ports (USB 3.0), an HDMI output for external monitors, a 3.5 mm audio jack, and a micro SD card slot. For wireless connections, there is Wi-Fi 6E and Bluetooth 5.3. On my 5GHz Wi-Fi, the laptop connects at 866 Mbit.\n\nhttps://preview.redd.it/5p6vvneqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=316d28c48d3bb1dd8dda8447db11fc5bdf8f2f23\n\nhttps://preview.redd.it/yqqx8geqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=a8f0a5d9d59398a2e469fb0ece00bcc616028516\n\nIn addition to the Ninkear A15 Pro, the package includes a 65W USB-C power adapter, a very simple, inexpensive wired mouse, a small mouse pad, and stickers for the keyboard to customize it to your preferred language.\n\n**Battery life and cooling**\n\nThe battery life of the Ninkear A15 Pro is adequate thanks to the energy-efficient AMD Ryzen processors. With moderate use (office, browsing, streaming), 6 to 7 hours of use are possible, making it a companion for the workday or longer university sessions. The cooling system is barely audible during normal operation. Even under load, the noise level remains low, and the case only heats up in certain areas, but remains very inconspicuous overall.\n\n**Upgrading**\n\nThe RAM can be upgraded as there is one slot free. The built-in RAM is from a manufacturer unknown to me called Gofatoo. It will be very difficult to find a second identical RAM module. If you plan to upgrade the RAM, buy two 16GB modules from one manufacturer.\n\nhttps://preview.redd.it/3f0wg3ktv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=c8b2596f11b270335be8260aea8e08d583b44df4\n\nThere is also a second NVME SSD slot in which a second SSD can be installed. This is also connected with PCIe 3.0 x4.\n\nThe Wi-Fi module is also located in an M.2 slot and can be replaced if necessary.\n\n**Conclusion**\n\nThe Ninkear A15 Pro (2025 version) offers a good balance between price and performance and is aimed at those who are looking for a notebook for productivity, multimedia, and occasional gaming. For students, home office users, and anyone who needs a reliable all-rounder, the Ninkear A15 Pro (2025) is a good option. The price in the company's own online shop is currently around €570. The device is shipped from Germany. Unfortunately, I cannot say anything about support and/or warranty issues.\n\nThanks to Ninkear for providing me with the device for testing.\n\n\n\nBest regards, hugoLOST",
  ">the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support\n\nAre you sure the USB-C supports DisplayPort? I don’t see it mentioned anywhere on their website or on aliexpress",
  "Yes",
  "I only connected one Display",
  "Both",
  "Both",
  "Is whole body aluminium? Are hinges mounted well?",
  "Is factory installed system full version and legal ?",
  "Got the same laptop. There's a red watermark in the top right of the screen, but I don't understand how to remove it. If I take a screenshot it doesn't show. Any idea? Thank you in advance.",
  "How bright is the screen? 350 nits is true?",
  "Do you is it possible to buy battery for this A15 Pro model?",
  "Yes, I tested it. But not at the same time",
  ">So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?\n\nto this?",
  "Yes, but you tested the two USB-C ports for display support individually or only one of them? And you tested it in a USB-C to USB-C connection, right? Thanks again.",
  "Last question, USB-C to USB-C, USB-C to HDMI or USB-C to DisplayPort? Thanks!",
  "?.. There are 3 options",
  "Only the bottom and top cover",
  "Yes, an no virus or spyware is installed.",
  "Can you post a picture, mine doesn't have that.",
  "Yes. For inside with with the Laptop it's enough",
  "So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?",
  "How would you know?",
  "Thank you for your reply brother. I took a pic with my phone. [https://ibb.co/F4GTrggn](https://ibb.co/F4GTrggn)",
  "I searched with different tools",
  "Maybe it's a screen foil. Or the wallpaper",
  "It was the screen foil. 🤣\nThank you so much my friend",
  "No problem"
]