[
  "Help me find a BestBuy! ",
  "Which should I buy?! I saw these were the best options for under $1500! \nI just graduated basic training for the Air Force now I am in tech school for 11 months. I want to use the laptop for school and for gaming. I also want it to last me for at least 4+ years while I take college classes. If you have any different recommendations let me know! Thanks! \n\nAsus TUF Gaming A17 RTX 4070: $1,799 $1,399 @ Newegg\nSave $400 on the TUF Gaming A17 with Nvidia GeForce RTX 40 Series GPU. It packs a 17.3-inch (1920 x 1080) 144Hz display, AMD Ryzen 9 7940HS 8-core CPU, 16GB of RAM, and 1TB SSD. For graphics handling, it's outfitted with Nvidia's GeForce RTX 4070 GPU with 8GB of graphics memory. \n\nMSI Katana 15 RTX 4070: $1,499 $1,159 @ Newegg Save $340 on the MSI Katana 15 RTX 4070 gaming laptop. This high-performance machine is built for gaming and content creation. It packs a 15.6-inch (1920 x 1080) 144Hz display, Intel Core i7-12650H 10-core CPU, 16GB RAM and 1TB SSD. For heavy graphics lifting, it employs Nvidia's powerful GeForce RTX 4070 GPU with 8GB of dedicated memory.\n\nAsus ROG Zephyrus G15 RTX 3080 GPU: $2,199 $1,429 @ Best Buy\nBest Buy is currently slashing $770 off the Asus ROG Zephyrus G15 RTX 3080 gaming laptop. In our Asus ROG Zephyrus G15 review, we praise its sleek design, stunning display, strong CPU performance. Its battery lasted more than 8 hours during testing which is impressive for a gaming laptop. Besides Nvidia's powerful RTX 3080 GPU, the laptop in this deal packs a 15.6-inch 2K Quad HD (2560 x 1440) display, AMD Ryzen 9 5900HS 8-core CPU, 16GB of RAM, and 1TB SSD. \n\nLenovo Legion Slim 7 RX 6800S: $1,949 $1,300 @ Best Buy\nSave $650 on the Lenovo Legion Slim 7 in this pre-Prime Day-rivaling deal from Best Buy. Thin and lightweight, this gaming laptop packs a 16-inch (2560 x 1600) display, AMD Ryzen 9 6900HX 8-core CPU, 16GB of RAM and 1TB SSD. AMD's powerful Radeon RX 6800S does the heavy lifting for graphics.",
  "Lenovo Slim 7 Pro 14IHU5 Hey , I was looking for a good laptop for webdev / general use and I found out about this laptop with\n\nEDIT : its the version with the  Intel Iris Xe Graphics and not the mx version\n\ni7-11370H | 16 GB | 1TB SSD | TouchPad 14\" 2.8k 2880x1800 100% srgb display .\n\nI saw some reviews and I want to ask some questions before pulling the trigger :\n\n1. I saw that there is no Ethernet connection , I've only heard about thunderbolt a few days ago so , it should be a problem getting an hub with ethernet connection right ?\n2. The video reviews / their site shows a very good battery life , is it real ? because from what I know intel cpu's tend to consume more power. ( they said around 8-12 hours of general use ).\n3. any big drawbacks in this laptop?\n\nI currently have legion 5 17\" with i7 rtx2060 , while it has a very good build quality I'm looking to get a smaller , lighter laptop with better battery life since im not playing much games anymore . thanks 🙂",
  "I have this exact laptop as my daily. Yea a thunderbolt dock is easy and will work. Battery life is 5-8 hours depending on my use and especially brightness of display. It’s been amazing tho I’ve had it since December. Lmk if you have any other questions. No drawbacks in particular other than it’s expensive but coming from a MacBook I wanted to pay for the build quality and got this one at Costco for a good deal.",
  "Exactly how much battery life do you need?\n\nWhen it comes to laptops, manufacturer advertised battery life should be ignored. You are looking at \"2021 Lenovo Ideapad Slim 7 Pro 14 Intel\" which has a [5 hour](https://www.ultrabookreview.com/51062-lenovo-yoga-slim-7-pro-review/) runtime at best if you turn down the brightness. This is NOT the laptop to get for battery life.",
  "Cool , actually I found a nice deal on it , but even online its not that expensive.\nHow about the screen reflection, is it disturbing?",
  "damn thats kinda bad battery life runtime , I dont need insane battery like the newer macbooks but at least 8 hours of general use ( visual code , browsing , office , etc ) .",
  "I came from a gloss screen MacBook so I wouldn’t know any different. I have no problems but it’s a deal breaker for some",
  "Where are you buying from and what is the budget?",
  "So this laptop is more than enough for me , thanks :)",
  "my budget is around 1k usd .   \nHonestly , I've decided to just go with macbook air even tho its abit expensive with extra ram.",
  "Great choice!",
  "Laptop buying advice - choice of 3  So I'm looking to upgrade my laptop next month and I'm considering 3 machines: **The LG Gram**, the **Lenovo Legion 7 Slim** and the **Dell XPS 17**. My budget is between $1500 - 1800 and it's basically for internet surfing, light gaming and streaming movies/shows. I don't upgrade often, maybe once every 10 years ...so my main concern is just getting the best all around rig for the money that will be as future proofed as possible. I would prefer 17'' but will take 15'' if it's a much better laptop or deal. I think the Dell XPS is a little out of my price range but there seems to be one on the Dell site under 'Deals' (just not sure if it's 'for real' a decent XPS). Suggestions ...and why you think it's better than the other two? Also I have seen on reviews that UHD will kill the battery life more of the laptop and unless you KNOW you need it (into hardcore gaming) ... you don't really need it? It's a big step up in price I might not need to consider.  Also, is the Intel I7-11800H still a pretty good CPU these days?",
  "BRO. Just get a \"cheap\" $600 laptop. Use that other money for savings, your mortgage, taxes, a PC, crypto, real estate, stock market. Why spend all that money? With the rest ($900-$1200), you could get a PC or use it for the above or other things."
]