[
  "Need help buying a laptop (India) I've checked many specs and wanted to go with Ryzen(ntg more specific ) not gonna be gaming but need the laptop to last a few years at least. Decided on this laptop. Give suggestions please ,abt this laptop and any other good one's.",
  "Never seen a Laptop with 24Gb Ram. Lmfao. \nNevertheless is a good comp.\nBut it dont have a graficcard",
  "Considering your at a budget where you can only get a new consumer grade laptop, Lenovo Ideapad is a budget laptop same as Acer Aspire 3, you get what you pay for so if you pay for budget price, you get budget quality, but I can't really pinpoint how long that laptop will last because it's either you're unlucky that it will last for only two years or lucky enough for it to last for 4 to 5 years",
  "budget? in rupees",
  "Check on lenovo.com maybe after offer and discount you get it cheaper there dm me for help",
  "Which laptop did you buy? I have the same budget and use as you. I landed on the same laptop, but the one that comes with the Snapdragon X chip. As I am looking for a long battery backup and a Lenovo or Asus Brand. I am getting the Lenovo IdeaPad Slim 3 Snapdragon variant at 40K. All the office applications I use are already compatible with the Snapdragon processor, so that is not an issue. Should I go with this option and is there any other laptop that I should consider?",
  "Ikr the ram and Thank you. I won't specifically need a graphic card so it's okay",
  "Oh okay. Hope I'm lucky , also Do u have any other laptop suggestions ? without considering the budget",
  "Around 60 to 65,000",
  "Will check it out, thank you",
  "I Bought this one , I checked out many options and found this the best considering the price and specs, idk much abt snapdragon so can't compare, but this is good for now and other than this the lenovo yoga , asus vivobook is good but higher price.",
  "Here you go,here is a detailed review of this laptop,tech power up reviewed the 16gb ram variant in this review.\n\nhttps://www.techpowerup.com/review/lenovo-ideapad-slim-3-15ahp10/",
  "Probably the lenovo thinkpad or a framework laptop",
  "Yes get from site you'll get sheer ID disc other coupons and 3yr ADP and premium at very low cost",
  "I think apart from Snapdragon processor both laptop are same. Yes, i also believe it is the best value for money as compre to other laptop in that price range. How's the build and overall laptop? Any issues?",
  "Oh wow, thanks",
  "Will check it out, thank you",
  "Also I am getting the snapdragon laptop for 35k. Do you think apart from processor it is a good laptop and would you recommend. ",
  "Nope, it's been more than a week and no issues till now , build is fine and battery is good",
  "Yeaa",
  "What laptop out of these two would be the best one for me? Hello! I'm on here to ask about two laptops that I'm curious about. The two laptops in question being the Acer Nitro 5 17.3\" Gaming Laptop and the Lenovo IdeaPad Slim 3 Chromebook Laptop 14\". I'm looking for one preferably under $300 that can handle smaller games such as Roblox and Minecraft, with decent storage and good quality browsing.\n\nI know the basics of laptops but that's pretty much about it, so I'd appreciate any help given! Any other recommendations within budget would also be great. Thanks! :)",
  "Ideapads are one of the crappiest laptops out there. Whats the specs and year on the nitro?",
  "Acer Nitro is better in every way. No chromebook is capable of running Minecraft or Roblox.",
  "The specs are in the description of this Best Buy url: https://www.bestbuy.com/site/acer-nitro-5-17-3-full-hd-ips-144hz-gaming-laptop-intel-core-i5-12500h-nvidia-geforce-rtx-3050-512gb-pcie-gen-4-ssd-black/6507908.p?skuId=6507908",
  "Good to know. I'm only going off reviews off of here and the Best Buy website, but needed some more up-to-date details.",
  "For sure grab that one. Great entry gaming laptop and that price is a steal!",
  "Planning to buy a lenovo ideapad 3 slim ryzen 7 5000 series, laptop Thoughts in this? \n\nFull specs in the pic\n\nSomehow I can't find any reviews on this specific model. I think it's because it's in my region/country only(?). \n\nTo clarify, my purpose of buying this is for light gaming, studies, programming, & multitasking. I'm fine with ram being soldered. Will use this 4 years minimum. \n\nIn general, can anyone who uses/used lenovo ideapad 3 (any models, or this in particular) share their experience and if there are any issues? any reviews or feedbacks? 🙏\n\nQuestions:\n- Can this last for 4 years? \n- How many hours does battery last based on ur experience? \n- Any heating issues? Is it recommended to buy a cooling pad right away? \n- Can it handle minor damages?\n\nOr if you better recommendations pls feel free to do so. Though, don't recommend me thinkpads, i know it's good, but i have a budget and need cheaper like this. Thank you 🙏\n\n\n\n",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy courses that require Windows-specific tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on what you’re studying and whether your coursework leans heavily on Windows-only dev environments.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8), so no dedicated GPU. it’s fine for light gaming or basic rendering, but it’s not gonna handle anything GPU-heavy. also unlike something like an M4 or M3 Mac, which has dedicated media/GPU cores optimized for ML tasks, this is just CPU + iGPU.\n\nas for reliability — IdeaPad 3’s are budget-tier machines. they work, but don’t expect amazing build quality. plastic chassis, average screens, and thermals can get loud under load.\nit’ll probably get you through 4 years if you take care of it, but it’s not something you’ll want to hold onto long after that.",
  "honestly if battery life and long-term reliability matter and you’re not gaming much, just get a MacBook Air.\nyou’ll get like 15–20 hrs real use, no fan, no random performance drops, and it stays fast for years.\nmacOS handles school, office stuff, zoom, and light coding effortlessly.\nfor most students, it just works.\n\nbut — if you’re doing certain types of programming, especially stuff like machine learning, CUDA, or algorithm-heavy coursework that needs Windows-only tools or GPU acceleration, then yeah, a Windows laptop might make more sense.\ndepends on your major and what your dev tools require.\n\nedit: the IdeaPad 3 you’re looking at uses integrated graphics (Radeon Vega 8) — no dedicated GPU. it’s totally fine for light gaming or basic workloads, but don’t expect any heavy lifting. also, unlike something like an M2 or M4 Mac, there’s no real media or AI-optimized GPU cores.\n\nas for reliability — IdeaPad 3 is entry-level. they work, but they’re built cheap: plastic chassis, basic thermals, and screens that are just okay. it’ll likely last you 4 years if you take care of it, but it’s not really something you’d want to hang on to after graduation.\n\nhonestly speaking, you should give your laptop a bigger budget — this is something you’ll use thousands of hours over the next few years. it’s worth investing a bit more into something that won’t annoy you with throttling, battery issues, or cheap build after a year.",
  "+ Does the audio sounds good and loud enough? ",
  "pls be honest if u did anything that made ur laptop had issues (like overheating it for a long period, opening sites that has malware, accidentally dropping a heavy object on the laptop, and such) 🙏 , im very careful with my devices so if it's the kind of laptop that just malfunction/become faulty all of a sudden, pls let me knoww tysm",
  "Based on 47Whr battery, it will last you prob 5hrs at best when you do a battery saver setting.\n\n\nBut that's what should have been with budget laptop.\n\n\nIf by light gaming you mean games that can be played with iGPU, then it's no problem.\n\n\nAbout heating issues, as long as the fan is working, it won't be a problem. Cooling pad is recommended tho.\n\n\nCan this last 4 years , depends on how you use it. And probably the first problem that you will have within 4 years is not enough storage.",
  "Wdym by that? Is 16/512 combo not enough for a non working professional student?",
  "system already takes 44GB, and the storage won't be 512 , probably less when you have the laptop.\n\nso, imagine you install games that take at least 20GB , and then some videos and photos, overtime it will be filled.\n\nmine already have less than 700GB already from total 950GB in 6 months.",
  "I dont play games....well mine does have an ssd port so ig i can add more storage in the future if i need",
  "Help deal ends soon- Laptop for gift-below any good? Gifting a laptop for mother day, will be used for work, will need to handle fast downloads of large files while efficiently running multiple office apps. No gaming or video editing.\n",
  "Yeah, might not be the newest chip on the block, but being 8 cores, 16 threads, it's still PLENTY performant.  With 16GB ram for smooth multitasking, should handle the things you mention without any issues.  The only major downside on it, and it's to be expected at this price, is the display is incredibly underwhelming.  It's USABLE, but never will be confused with a good display.",
  "How large are the files?",
  "The laptop should be perfect for what she needs to do. The SSD will guarantee fast read/write speeds to the drive, so the only limitation on download speed is the speed of your mother's home WiFi.",
  "Good call, knew there had to be some downside.",
  "A couple hundred mbs.",
  "Itll be fine then lol",
  "Need a laptop for uni \n * **Total budget (Poland):**\n \n 5200 PLN ≈ $1300\n \n* **Are you open to refurbs/used?**\n \n Yes\n \n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?**\n \n Decent build quality preferred, no HP Victus hangers :)\n \n* **How important is weight and thinness to you?**\n \n Thinness not important, weight - a little bit. Will have to carry it.\n \n* **Do you have a preferred screen size? If indifferent, put N/A.** \n \n Everything smaller than 17\"\n \n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** \n \n Sound design (Ableton, Reaper), some video editing (DaVinci Resolve)\n \n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?**\n \n Witcher 3, Control, Warframe. Mid-high settings preferred.\n \n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** \n \n Numpad preferred\n \n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**\n \n I checked the models in local stores, and Gigabyte G6 (i7-13620 + 4060) caught my eye, but I'm not sure about build quality - never used any Gigabyte product before. Current device - Lenovo IdeaPad Z500 :)",
  "Quite a tricky buy here. You either get a gaming laptop or a workstation. \n\nSince you want to carry the laptop, you need something light. And here I can only recommend any of the Dell Precision 5000 series. Their 17 inch models are quite small, and they fit in 15.6 inch bags. Sadly they do not include a numpad, though, on any of the models.\n\nMost manufacturers do not put a numpad in their lightweight versions of workstations. Even Lenovo and Asus do this.",
  "So, out of \"gaming\" laptops, what models would you recommend?",
  "Probably any Lenovo Legion Slim. I searched one on [elenovo.pl](https://elenovo.pl) and the cheapest option was 4700 in Polish currency.\n\nEdit: If you could look there and send me the specifications, it would be great, because the site does not open anymore for me.",
  "I also found some deals on eBay:\n\n1. [Legion Slim 5](https://www.ebay.com/itm/166860926375?itmmeta=01J3MPB2FGK650NB7G3ZJ971PH&hash=item26d9afada7:g:Dc8AAOSw11dmjaPk&itmprp=enc%3AAQAJAAAA8D22%2BBMqNVnieSiYXxY0M6nlC28vOaNi5Wtzuo6BZHFwH5N7Ek%2FLKa72qUfdlJVsh4WjQJ72yY%2B3mwZq45PXUv1obtXpx5tmgH5Gej2tLNcytKTnE2x4CPuN18GlfvzITanbZSnNgVhOSKMiZN%2B%2BD6uBdXjrB1nOE5yrLl9wEpD0Sl6k5U3ZmJ6Toj8CopRT2LRSxxxftk1OMjgNVkmGKS71NPTGkHlaaE%2BXhHb3ouZvCh55fPuYGcHO9cuaCpbHNywoczTl0K%2FZRkw%2FxQCzHm29akz2ebsATmDXIW6csW1TN%2Fy8areIBKQcTfWS5LvjQQ%3D%3D%7Ctkp%3ABk9SR-ynrJadZA) with Ryzen 5 7640HS and RTX 4060.\n2. [Legion Slim 7](https://www.ebay.com/itm/285974728244?itmmeta=01J3MPJGGM3C65A930MCMSJDQZ&hash=item42956c0e34:g:C9YAAOSwX9Jmn--4&itmprp=enc%3AAQAJAAAAwPvrpgEuq2ErbVbmipZuSN91Xj6pG5MrIiXv2EcLRjI4qLEPKjQ7FH3GfCpPKyCbpsr54QFjWu2ITU4izvnFaMHfSo1FdphnW9c1XCdWbrIA2uFQo7Kovx7bMN%2B4362rv56OgpsvpHr97td6BunPDRrIHZprqJy5aQGQxJLjepQjPeHwgBcvKtJAMFIRnB%2F%2BajdCSskfttkwhj%2FFiKlKtIcA83XHf%2BaapbeoonjINn1oq8YhVOIU6DYUqeWDp3aFKg%3D%3D%7Ctkp%3ABk9SR7SIypadZA) with Ryzen 7 5800H and RTX 3060.\n\nBoth models fit your needs.",
  "The specs for the Legion Slim 5 you're talking about are: \n* NVIDIA GeForce RTX 4050\n* Intel Core i5-13500H\n\nThere are also a bunch of i5 + 4050/60 LOQs and a 3050-Ti Legion 5",
  "Thanks a lot for the links! I've heard some bad reviews about Ryzens, so also wasn't sure if they're worth buying",
  "I also gave some recommendations on eBay. Also the Core i5 will run OK, but a Core i7 or Ryzen 7 option will run even better.",
  "Which one should I get So I'm having a hard time deciding between these two, I need a laptop for coding and gaming(emulators) plus I am going to be buying a Xbox series s to game on there(primarily)\n\nExchange rate is $1 = R18.98",
  "[removed]",
  "16gb + 1tb 512gb isn't alot at all",
  "Thanks for the feedback😁👌",
  "🤔u right because I am also going to be editing videos on it for yt.",
  "Laptop Recommendation 30k-35k php  Hello. Help a kid in distress; I've been looking for a laptop for about 3 months, and of course planning to buy one. Budget is around **30k-35k php**. Will use this for school,  wfh, and maybe light gaming. Below are my choices, help me pick one. I'M OPEN for RECOS.**NOTE**: not techy pls respect huhu :))\n\n[Asus Vivobook 16](https://www.lazada.com.ph/products/asus-16-vivobook-wuxga-laptop-intel-i7-1255u-16gb512gb-win11-black-i4405643138-s24771469797.html?c=&channelLpJumpArgs=&clickTrackInfo=query%253Aasus%252B16%252B%252BVivobook%252BWuxga%253Bnid%253A4405643138%253Bsrc%253ALazadaMainSrp%253Brn%253A84838ae502eb419d06adabf316d9de20%253Bregion%253Aph%253Bsku%253A4405643138_PH%253Bprice%253A34795%253Bclient%253Adesktop%253Bsupplier_id%253A100159544%253Bbiz_source%253Ah5_hp%253Bslot%253A1%253Butlog_bucket_id%253A470687%253Basc_category_id%253A11147%253Bitem_id%253A4405643138%253Bsku_id%253A24771469797%253Bshop_id%253A180001&fastshipping=0&freeshipping=1&fs_ab=2&fuse_fs=&lang=en&location=Metro%20Manila&price=34795&priceCompare=skuId%3A24771469797%3Bsource%3Alazada-search-voucher%3Bsn%3A84838ae502eb419d06adabf316d9de20%3BunionTrace%3Aca8abca117157560345163980e%3BoriginPrice%3A3479500%3BvoucherPrice%3A3479500%3BdisplayPrice%3A3479500%3BsinglePromotionId%3A900000025648311%3BsingleToolCode%3ApromPrice%3BvoucherPricePlugin%3A1%3BbuyerId%3A0%3Btimestamp%3A1715756035096&ratingscore=5.0&request_id=84838ae502eb419d06adabf316d9de20&review=4&sale=17&search=1&source=search&spm=a2o4l.searchlist.list.1&stock=1) [Dell Inspiron 15](https://www.lazada.com.ph/products/dell-inspiron-15-3525-156-fhd-laptop-ryzen-7-5700u-16gb-ram1tb-ssd-win11-carbon-black-i4105471481-s22653412966.html?c=&channelLpJumpArgs=&clickTrackInfo=query%253ADell%252Binspiron%252B15%253Bnid%253A4105471481%253Bsrc%253ALazadaMainSrp%253Brn%253A6a926330a6b67391217b9546ed38ed7e%253Bregion%253Aph%253Bsku%253A4105471481_PH%253Bprice%253A33995%253Bclient%253Adesktop%253Bsupplier_id%253A3%253Bbiz_source%253Ah5_pdp%253Bslot%253A6%253Butlog_bucket_id%253A470687%253Basc_category_id%253A11147%253Bitem_id%253A4105471481%253Bsku_id%253A22653412966%253Bshop_id%253A1885&fastshipping=0&freeshipping=1&fs_ab=2&fuse_fs=&lang=en&location=Metro%20Manila&price=33995&priceCompare=skuId%3A22653412966%3Bsource%3Alazada-search-voucher%3Bsn%3A6a926330a6b67391217b9546ed38ed7e%3BunionTrace%3Aca8abca517157563224713833e%3BoriginPrice%3A3399500%3BvoucherPrice%3A3399500%3BdisplayPrice%3A3399500%3BsinglePromotionId%3A-1%3BsingleToolCode%3AmockedSalePrice%3BvoucherPricePlugin%3A1%3BbuyerId%3A0%3Btimestamp%3A1715756322892&ratingscore=5.0&request_id=6a926330a6b67391217b9546ed38ed7e&review=1&sale=2&search=1&source=search&spm=a2o4l.searchlist.list.6&stock=1) [Lenovo Ideapad 1](https://www.lazada.com.ph/products/lenovo-ideapad-1-156-laptop-ryzen-7-5700u-16gb512gb-ssd-cloud-gray-i4418611428-s24895315530.html?c=&channelLpJumpArgs=&clickTrackInfo=query%253ALENOVO%252BIDEAPAD%253Bnid%253A4418611428%253Bsrc%253ALazadaMainSrp%253Brn%253Ab5cf2b646e142cb5e2729dfe4913ddad%253Bregion%253Aph%253Bsku%253A4418611428_PH%253Bprice%253A30895%253Bclient%253Adesktop%253Bsupplier_id%253A100159544%253Bbiz_source%253Ah5_pdp%253Bslot%253A6%253Butlog_bucket_id%253A470687%253Basc_category_id%253A11147%253Bitem_id%253A4418611428%253Bsku_id%253A24895315530%253Bshop_id%253A180001&fastshipping=0&freeshipping=1&fs_ab=2&fuse_fs=&lang=en&location=Metro%20Manila&price=30895&priceCompare=skuId%3A24895315530%3Bsource%3Alazada-search-voucher%3Bsn%3Ab5cf2b646e142cb5e2729dfe4913ddad%3BunionTrace%3Aca8abca517157563610168384e%3BoriginPrice%3A3089500%3BvoucherPrice%3A3089500%3BdisplayPrice%3A3089500%3BsinglePromotionId%3A900000025648311%3BsingleToolCode%3ApromPrice%3BvoucherPricePlugin%3A1%3BbuyerId%3A0%3Btimestamp%3A1715756361434&ratingscore=&request_id=b5cf2b646e142cb5e2729dfe4913ddad&review=&sale=1&search=1&source=search&spm=a2o4l.searchlist.list.6&stock=1) (above budget: [MSI Modern 15](https://www.lazada.com.ph/products/msi-modern-15-b7m-amd-ryzen-7000-series-processor-16gb-ddr4-ram-amd-rx-vega-graphics-512gb-ssd-156-ultrawide-display-wifi-6e-full-size-backlit-keyboard-windows-11-i4110344806-s22718639755.html))",
  "I would go with the Dell inspiron 15",
  "Help me buy myself my first laptop i am 17 and from bangladesh. my parents will be out of the country for 7-8 months, i need a laptop that can run me atleast 1 year smoothly. so, if the laptop ends up being too slow, i would have nothing to do for a year. My budget for the laptop is under 60k taka (bangladesh currency). i need the laptop to do daily 3 hours classes, very light gaming (Genshin, Valorant, Fortnite and sometime use bluestack for some mobile games), 8gb ram atleast and 512gb ssd and a 1080p display, i also serf a lot on the internet so it would be good if it had 2 memory slots so i can upgrade later.\n\nthe city i live in has only one good laptop store ([https://www.startech.com.bd](https://www.startech.com.bd))  \nwhen i went to the store to ask for a good laptop with these requirements.. they showed this   \n[https://www.startech.com.bd/lenovo-ideapad-slim-1-15amn7-ryzen-3-7320u-fhd-laptop](https://www.startech.com.bd/lenovo-ideapad-slim-1-15amn7-ryzen-3-7320u-fhd-laptop)  \ni dont know much about laptop cpus so i dont know if its good and also that its really thin and the screen woobles when the ceiling fans are at full speed, i am scared it might brake easily... the only two laptop, i found eye catching were. please let me know, if these are good or just trash choices  \n[https://www.startech.com.bd/msi-modern-14-c11m-core-i3-11th-gen-fhd-laptop](https://www.startech.com.bd/msi-modern-14-c11m-core-i3-11th-gen-fhd-laptop)\n\n  \nand\n\n[https://www.startech.com.bd/lenovo-ideapad-3-15alc6-ryzen-5-5500u-laptop](https://www.startech.com.bd/lenovo-ideapad-3-15alc6-ryzen-5-5500u-laptop)\n\ncan someone help me out to pick myself a good laptop (preferably from this website).",
  "just get the ideapad   \nhttps://www.startech.com.bd/lenovo-ideapad-slim-1-15amn7-ryzen-3-7320u-fhd-laptop  \none",
  "I would love to help but there's isn't really much of options to choose from on the site.\n\n if you're focusing on gaming cuz any budget laptop can do daily school tasks no problem so I sat that aside.\n\nThe one they recommended you would be fine or MSI should do it as well.",
  "no gaming with this though",
  "the screens kinda ehhhhh as per the review.",
  "isnt the ideadpad 3's cpu more powerful. they recommended AMD Ryzen 3 7320U. the ideadpad 3 has AMD Ryzen 5 5500U.",
  "it can game fine",
  "i mean at this price can you complain about that?  \nid just go with something thats fast and reliable enough so as to last you a while.  \nand trust me the screen would be fine ive used worse laptops and theyre just fine",
  "nope. AMD's naming scheme is stupid. the  number you're looking for is mainly the 2nd and 3rd numbers with the 7000 series. \n\nThe 7320u is exactly equivalent to a 5300U - the 7 means it \"came out\" this year, the 3 means \"ryzen 3,\" and the 2 means Zen2 architecture, which would be 2020-2021 models. AMD's already on Zen4 with some of their new releases. here's how the R5 5500U compares to the 5300U: [https://www.notebookcheck.net/R5-5500U-vs-R3-5300U\\_12981\\_12985.247596.0.html](https://www.notebookcheck.net/R5-5500U-vs-R3-5300U_12981_12985.247596.0.html)\n\nlong story short, it's like a 5% difference in light tasks, and 15% or more of a difference in heavy tasks, all in favor of the 5500U.\n\nhere's an article about the 7320u: [https://www.notebookcheck.net/AMD-Ryzen-3-7320U-Processor-Benchmarks-and-Specs.654997.0.html](https://www.notebookcheck.net/AMD-Ryzen-3-7320U-Processor-Benchmarks-and-Specs.654997.0.html)\n\ni'll also add that the 7320u is apparently equivalent to a 4300U, not a 5300U lol",
  "afak",
  "Decent gaming laptop Hi, \n\ni'm about to buy a new laptop gaming, a decent one with a good price, the best one so far in terms of price and specs is an  Lenovo IdeaPad 3, with an i5-11320H, 8GB DDR4 (i will upgrade this to 16GB) and an RTX3050, the thing is that there is more options, another with the same GPU but with an Ryzen 5 5600H (a little bit more money for this) or a cheap ones with the same CPU's but with an GTX1650, i will play CS:GO, GTA 5 and more games like this, i'm not a big fan of ultra settings so... for now, the question is, Ryzen 5 or the i5, in the reviews, the Intel option got more FPS and single core performance, the Ryzen one seems to be more power efficient, have more cores, but i don't think that i will see the difference between them, also i know that the battery is not the best. \n\n&#x200B;\n\nThanks a lot!",
  "Have a look on Asus vivobook 15 x571",
  "best budget gaming laptop, $600 only : [Nitro 5 17\" 12500, 3050: $600](https://www.bestbuy.com/site/acer-nitro-5-17-3-fhd-144hz-ips-144hz-gaming-laptop-intel-core-i5-12500h-nvidia-geforce-rtx-3050-256gb-pcie-gen-4-ssd/6521831.p?skuId=6521831)\nAlso, this is a decent gaming laptop for $1200 only:\n[Tuf 12650,3070 deal](https://www.bestbuy.com/site/asus-tuf-dash-15-6-fhd-144hz-gaming-laptop-intel-core-i7-16gb-ddr5-memory-nvidia-geforce-rtx-3070-512gb-pcie-ssd-off-black/6494644.p?skuId=6494644)",
  "Lenovo Y740 17\" Review (8750H, 2080 Max-Q) Good afternoon Reddit!\n\nI recently just got in my Lenovo Y740 17” (8750H, 2080 Max-Q, 16GB Dual Channel) and just got done running some benchmarks and so forth in an effort to shed some light on this enigmatic model, as the  15” variant gets \\~95% of the coverage in terms of reviews and user anecdotes.\n\n**Chassis and Physical features**Pictures of all the I/O and interior/exterior found [here](https://imgur.com/a/s0wqMQz).\n\nIt weighs about \\~6 lbs., and is actually pretty thin, just under 1 inch thick (or \\~23mm). The keyboard deck has a bit of flex when pressing down with force, but given its size, it’s still pretty sturdy. Trackpad uses Precision drivers, but is WAY too small given the area Lenovo had to work with. The dedicated mouse buttons are okay; they just get the job done. The exterior has a “butt” that protrudes outward and houses the majority of the I/O and 4 exhaust vents. This does not fit in my 15.6” laptop bag (it is not deep enough, but does fit width-wise).\n\nThe bezels are a bit larger than the 15” brother, but they did move the webcam back to the top, so no more nose-cam! Very happy about that. The screen is a 144Hz IPS G-Sync panel, and gets reasonably bright compared to the competition, \\~300 nits. My unit has very minimal backlight bleed, but that does vary heavily from unit to unit.\n\nKeyboard layout is great, but “feel” is, well, okay. Nothing special, nothing awful. Feels like one of Lenovo’s IdeaPads or something. I wish it felt more like their ThinkPad lineup, but not sure how that would look on a gaming laptop. I did however hit close to my typing speed record on my second try with it (104 WPM)\n\nOverall, I’d give the unit a 7/10 for build quality and design, docking points for wasted space on the keyboard deck, thick-ish bezels and some flex around the unit. I do love the minimalist design otherwise.\n\n**Performance/Thermals and Noise**\n\nNow, this is where this beast really shines. All benchmarks are run with max-fans and -140mV core/cache undervolt.\n\n[UserBenchmark link](https://www.userbenchmark.com/UserRun/18724106)\n\n[Heaven Unigine Benchmark Score](https://imgur.com/Bqs6qqT)\n\n[FireStrike Scores](https://imgur.com/a/ik5Y4DX)\n\nI won’t go into detailed game benchmarks, as I don’t have a full Steam library to do so, but I can tell you all this: the temperatures on this thing are **insane.**\n\nI ran three loops of Heaven’s benchmark with uncapped FPS and **didn’t see above 63C on the CPU and above 60C on the GPU, even with a +100MHz OC.** I have yet to mess with the voltage curve to really maximize the potential of this 2080 max-Q.\n\nCineBench R15 on repeated runs stays in the 1200 range, and the CPU can pull \\~60W when the GPU is not also under load. Highest core temperature was 65C after 3 runs, the rest were 61-63C.\n\nWhile using the laptop with normal tasks, it’s almost completely silent; I can only really hear the whirr of the HDD. Max fans is also much quieter than I anticipated. Notebookcheck’s review shows it maxing around 45-47dB, which is twice as quiet when compared to most 15-inch gaming notebooks with similar or worse specs, which are in the 54-56dB range. (TIL that every 10dB is equivalent to doubling the sound intensity or perceived increase in volume)\n\nSimply put, 10/10. Could not ask for better thermals given its performance output in <1” footprint.\n\n**Misc. (I will add to this to answer questions about things I may have forgotten)**\n\nBattery life with G-Sync enabled is about 2-3 hours. Without, 4-6 hours depending on how aggressive you are.\n\nRunning on BIOS revision 1.07, preserving the ability to max the fans with FN+Q.\n\nFeel free to ask questions and I will try to answer them!",
  "Thanks for taking the time to post this review. It sucks there has been so much focus on the 15\" and not as much on the more powerful 17\" version. \n\nAny chance you could install the free version of 3dmark Firestrike? I would love the see the scores you hit with the undervolt. \n\nI am torn between this and the MSI GS75. I know the GS75 is a sexy beast with a smaller footprint, but I like the style on the Y740 as well. Have you had a chance to check out a GS75? I'd love to know how the build qualities compare.",
  "How are you able to you Max fans as the latest BIOS removed Max fans feature?",
  "Hey everyone! I added my FireStrike score to the post :)",
  "What’s your average clocks on the 2080 and what wattage is the card + what drivers does it run?",
  "where you able to squeeze more performance out of the GPU? Did you OC it with afterburner?",
  "Both have okayish build quality. stiffness is a little weak compared to other brands, but still no real reason to complain.\n\ni would strongly reccomend the Y over the GS tho, its cooling system is simply SO MUCH ahead of any other manufacturers cooling solutions that its downright ridiculous to not chose the Y, no matter what other gaming notebook in this category you compare it with.\n\nI would love to see an overclockable HK processor in this thing, just to see how much you can get out of this baby.",
  "I have the gs75 with the same cpu and gpu. The temps get really high that causes it to thermal throttle 90-95 degrees under load with max fan curve. I did a repast and undervolt now I’m sitting at 75. Y740 has better cooling but the gs75 looks a bit better on design.",
  "I just bought the y740 with a i7-9750H and rtx 2060. I was considering an MSI, but the end decision was more with the thermal and overall quality seemed to be a lot better. MSI is good, don't get me wrong, but the cons seemed less ideal for MSI than Lenovo Legions. Plus I didn't want to be that kid to haul out a loud ass spaceship in class. \nCheck out this review: \n https://www.youtube.com/watch?v=bTUytmEYx6s&feature=share",
  "I purposely disabled automatic updates when I received mine, and it was on BIOS build 1.07, so I still have that ability.\n\nI'm going to update the post to include my BIOS revision.",
  "Without tweaking the voltage curve in Afterburner, I’m in the 1500s usually. It is an 80W variant, but running on max fans allows it to pull 90ish Watts. \n\nI have to get back on the Drivers when I get back home!",
  "Where did you go to turn off auto-updates?\n\nYour post made me decide to go ahead with my purchase. I'll be ordering one this weekend. I downloaded a copy of the 1.08 bios in case I need to revert it from 1.09. I cant seem to find 1.07 anywhere online though.",
  "Nice, its better to avoid that latest BIOS unless Lenovo fixes it",
  "Lenovo Vantage software!",
  "Ordering for Lenovo is a little janky, fyi. They're backlogged on orders rn so you'll have to wait a couple weeks and they're payments won't seem logical, but it should all work out on its own.",
  "Yeah, I did some reading prior to getting the laptop and the first thing I planned to do was prevent a BIOS update if it was older than 1.09, or do a flashback lol",
  "Seeking expert advice on switching an HP Envy for something more beefy RE: graphics card and processor speed So I had to get a new laptop since my Lenovo bricked - HP Envy 17m with 11th generation quad-core i7 processor is what I went with (4.7 GHz base speed, which I guess is the sum total of the 4 cores put together?). Has 12 GB DDR4 ram and a 512 GB SSD, Intel iRIS Xe graphics card. Seen here: [https://www.bestbuy.com/site/hp-envy-17-3-touch-screen-laptop-intel-core-i7-12gb-memory-512gb-ssd-32gb-intel-optane-natural-silver/6453114.p?skuId=6453114&ref=212&loc=1&ref=212&loc=1&ds\\_rl=1264993&ds\\_rl=1264987&gclid=Cj0KCQjwwLKFBhDPARIsAPzPi-Iir7CGZ8IvoYIKa0kTLJZi\\_Rud7hw46UG5fap0fzYJtTcD12xaHHoaAoJMEALw\\_wcB&gclsrc=aw.ds](https://www.bestbuy.com/site/hp-envy-17-3-touch-screen-laptop-intel-core-i7-12gb-memory-512gb-ssd-32gb-intel-optane-natural-silver/6453114.p?skuId=6453114&ref=212&loc=1&ref=212&loc=1&ds_rl=1264993&ds_rl=1264987&gclid=Cj0KCQjwwLKFBhDPARIsAPzPi-Iir7CGZ8IvoYIKa0kTLJZi_Rud7hw46UG5fap0fzYJtTcD12xaHHoaAoJMEALw_wcB&gclsrc=aw.ds) Seems quite fast compared with my 2018 Lenovo Ideapad for most things though the graphics card being integrated and only pulling around 2gb memory leaves something to be desired on the performance end for certain tasks even though it's perfectly great for most daily things. I'm thinking of returning it and getting something that is hopefully also 17\", i7 processor.\n\nI usually use FFXIV benchmark as a measuring stick because for me, personally, I feel that if a laptop can get \"Extremely High\" on the Shadowbringers benchmark, it should be able to handle most anything I'd personally be throwing at it (I am not big into playing online FPS titles that require crazy framerates or anything, nor would I necessarily even play XIV again - big time sink - but it's nice to know I COULD if I wanted to).\n\nSo. The FIRST thing I did when I got it home was to download the Shadowbringers benchmark and see how it handled it. It scores around a 3,000 (\"Fairly high\") on the benchmark test, so should handle the game fine as long as I'm not putting it on maxed out everything, but I was kind of hoping a brand new PC would handle it a bit better than \\*fairly\\* high.\n\nSo I got to thinking: I've already dropped $1,250 on this thing. It's the best laptop I've ever owned and the only i7 I've ever had - huge leap over an i3 obviously. But might it be worth it bite the bullet and return it and get an Alienware or Asus Predator or something that is a BIT more expensive (hoping not much over $1500, hopefully closer to the price of the HP I just bought), but I'd want something relatively future-proof that will last me at least 3-5 years with proper care and that has an comparable or better processor, a better graphics card, and can hit that \"extremely high\" standard on the Shadowbringers expansion. I look and I see that people were getting scores of 12,000+ on desktops in 2019, and with the pace of technology, I'd expect a laptop should exist in this price range that should be able to get those kinds of numbers, at least upward of 10,000, meaning it can handle it on max settings, everything maxed out, just fine.\n\nI know nothing about Alienware - never owned one, but the wife seems to think even though they're owned by Dell that they're much higher quality and longer-lasting than most Dells. I also don't know about Asus but she seems to hate them, though I'm seeing ok reviews on the predator including lifespan/reliability. I've always WANTED an Alienware - they just look so cool - but the price has kept me away, but I think if I drop $1300-$1700 on one, maybe it'll serve me well for any task including general work and writing, gaming, youtube, etc, for the next 3-5 years? Hopefully? If I'm treating it nicely? Then again...I hear a lot of complaints about loud fans and heat and the giant adapters you apparently need to buy separately (what?!? That sounds like a pain if I travel to China or elsewhere, which I often do). I don't mind if it's a bit heavy. I just want it to be hopefully upgradable to an extent (I hear Alienware IS for graphics cards?) and capable of demolishing that benchmark, with a nice 17\" screen, and I'm happy. As long as it's not going to brick on me in a year or so.\n\nIn shopping around, I see some in the price range but I don't understand all the differences between the processors, graphics cards, what all the numbers mean and so on.\n\nQUESTION:\n\nHow exactly does a 10th generation i7 with 6 cores but which is listed at 2.5 Ghz base speed compare with an 11th generation i7 with quad cores seen in the HP Envy linked above? Specifically, 11th Generation Intel® Core™ i7-1165G7. I'm a little confused by how that works exactly, because I saw another gaming PC that had a 10th generation but only a 2.5 Ghz clock speed, which seems odd. Am I correct in understanding that a 6 core is always better than a 4 core? Then why does the 11th gen i7 clock at 4.7 base and the 6 core clocks slower? That to me is vexing. Is it going to impact things like speed of opening and running apps, for instance, vs the 11th gen? For instance, when I test computers in Best Buy I always open power point or excel and time how long it takes to open. The i5's where all opening it MUCH slower than the i7's, which open it almost instantly, and my old i3 would take ages to open it. That's all I know about that. I just noticed the higher generation i7's seem to open it slightly faster than the older gen ones. Whether that would be magnified over time as the computer slows down I don't know.\n\nNext, is it really necessary to go up to 32 gb DDR4 RAM or am I fine with 16? The HP Envy has 12, which, again, is far more than I've ever had on a laptop, but I'd like at least 16. 32 seems excessive maybe unless you're super hard core and have to have a $3,000-$5000 beast of a machine, I suppose?\n\nLastly, any recommendations that would fit all of this in that or close to that $1300-1700 price range? I guess I could consider a tad higher if it's REALLY worth it but I'm trying not to ruin my marriage by buying a PC that costs as much as some used cars if I can help it ;) The HP Envy for $1250 was already way higher than I initially intended...and then I felt like I wanted to just get an awesome one that'd crush that benchmark, 17\" monitor, reliable, at least 512 gb SSD, at least 16 GB memory, and a better (maybe upgradable) graphics card than the iRIS Xe series of integrated cards.\n\nSorry, I know that's a LOT to ask of a laptop in that under 2k price range but I'm HOPING something might exist on sale somewhere that would fit that. In Best Buy in Reno, NV, the only competition in the price range of this one were an HP Pavilion gaming PC (better graphics card, $999, but only 8 GB of RAM and the speakers are REALLY way too quiet, which was a significant factor in choosing the HP Envy over it - the speakers were EASILY over twice as loud) and an Omen in the $1200 range (screen too small, again only 8 gb ram, again a slightly better dedicated graphics card, and again, vexingly, REALLY quiet speakers compared to the HP Envy even on full volume - the Envy on HALF volume was louder than either of the gaming laptops at full volume. Really strange. Cool light-up keys, though. I like that.\n\nOn a final final note....how would something like this Alienware fair on that benchmark, do you think? It's a 10th gen i7 as well (though sadly under 17\" screen), and the processor speed appears slower but then it overclocks a bit faster? I am clueless on how that all works, again, apologies. I just don't know about the speakers on the Alienware (HATE soft speakers), the heat issues I've heard of (would that be an issue if I'm MAINLY using it for daily things e.g. internet surfing, youtube, MAYBE FFXIV or the much older FFXI which a potato can run on max), and the noise issues I've heard of (would it really be so noisy if I'm only doing the above? or only if I'm playing CoD on max everything and going nuts with it?) ....and do I really HAVE to have a giant adaptor - or two, I hear? - to run an Alienware? Those things look MASSIVE. [https://www.dell.com/en-us/member/shop/dell-laptops/alienware-m15-r3-gaming-laptop/spd/alienware-m15-r3-laptop/wnm15r321s](https://www.dell.com/en-us/member/shop/dell-laptops/alienware-m15-r3-gaming-laptop/spd/alienware-m15-r3-laptop/wnm15r321s)\n\nOK, sorry for the deluge. I'm just trying to make what to me is a big decision and hoping for some sage advice on what to go for that'd meet those criteria, if anything.\n\nThanks so much for your patience with this clueless cave dweller! \\*EDIT\\* I should add that desktops, while it might be easier and cheaper to build a machine easily more powerful, are not really an option because we move around far too much for that to be a viable thing. ",
  "Casual gaming laptop: Lenovo L340 or Lenovo Legion Y530 Hi guys, I'm having trouble picking a laptop.\n\n&#x200B;\n\nWhich do you think would be better for a casual gaming laptop. League of Legends and WoW mainly.\n\n&#x200B;\n\nLenovo L340\n\n17.3\" LED backlight FHD display\n\nCore i7-9750H Processor\n\nNVIDIA GeForce GTX 1650\n\n256 GB SSD HD\n\n [https://www.notebookcheck.net/Lenovo-IdeaPad-L340-17IRH-Review-The-well-rounded-mid-range-gaming-notebook-is-unable-to-reach-its-full-performance-potential.434845.0.html](https://www.notebookcheck.net/Lenovo-IdeaPad-L340-17IRH-Review-The-well-rounded-mid-range-gaming-notebook-is-unable-to-reach-its-full-performance-potential.434845.0.html) \n\n&#x200B;\n\nLenovo Legion Y530\n\n15.6\" FHD IPS display\n\nCore i5-8300H Processor\n\nNVIDIA GeForce GTX 1050 Ti\n\n1TB 7200rpm + 16GB Optane Memory\n\n1 TB HD\n\n [https://www.notebookcheck.net/Lenovo-Legion-Y530-i7-8750H-GTX1060-Laptop-Review.379946.0.html](https://www.notebookcheck.net/Lenovo-Legion-Y530-i7-8750H-GTX1060-Laptop-Review.379946.0.html) \n\n&#x200B;\n\nThanks!",
  "Links?  \n\nAlso, do you have any priorities?  Do you want something big or small?  Do you like doing other things while you game?  Do you store a lot of stuff on your computer?",
  "Thanks for the response:\n\nI see now how little info I gave!\n\nI have just added links to main post. I'm not too pushy about the size of the laptop. Which I'm really after is something which isn't overly noisy or heats up too much. And yes I like switch between the game and my browser a lot.",
  "Need help/advice on which laptop to buy. So I'm gonna move for university and will be doing CS as my major. Also I'm a casual gamer, I've always had the dream of having dual monitors and all so needless to say I'll be doing that, but I want a nice sleek laptop which has pretty good specs. I've shortlisted a few below please do feel free to add any suggestions on if I should get any other laptop, or not get any of the laptops from my options below (also please do give reasons). I will be buying a external GPU so yes the laptop has to have a USB port c also choosing this eGPU is another day's work. \n\nMy maximum budget is $1400 but I would like to stay under it so I may buy some decent peripherals also I'd prefer a medium screen (15.6\") can be bigger or smaller.\n\nSo these are my shortlists for now (in no particular order, numbering done so that it's easier to reference):\n\n1. [Lenovo Ideapad 330](https://www.newegg.ca/Product/Product.aspx?Item=9SIAH6W7GH6385)15.6\" HD TouchScreen, 8th Gen Intel® Core™ i7-8550U Processor, 8GB DDR4 RAM, 128GB SSD, Intel HD Graphics 620- ($1000)\n2. [Lenovo Laptop IdeaPad 530s](https://www.newegg.ca/Product/Product.aspx?reviews=all&item=N82E16834850643) 81EU000JUS Intel Core i7 8th Gen 8550U (1.80 GHz) 8 GB Memory 256 GB SSD NVIDIA GeForce MX150 14.0- ($1475)\n3. [ASUS ZenBook 13 UX331UA-DS71](https://www.newegg.ca/Product/Product.aspx?Item=N82E16834234966) Ultra-Slim Laptop 13.3\" Full HD WideView Display, 8th Gen Intel Core i7-8550U Processor, 8 GB LPDDR3, 256 GB SSD ($1100)\n4. [ASUS VivoBook S](https://www.newegg.ca/Product/Product.aspx?Item=9SIAH207ER8242) Intel Core i5-8250U Processor, 8 GB DDR4 RAM, 256 GB SSD\n5. [ASUS S510UN-EH76 VivoBook S](https://www.amazon.com/S510UN-EH76-VivoBook-i7-8550U-GeForce-Windows/dp/B0786TPWBP/ref=pd_sbs_147_2?_encoding=UTF8&pd_rd_i=B0786TPWBP&pd_rd_r=899aed96-fa11-11e8-84c9-c9e00b2a0326&pd_rd_w=vIm3u&pd_rd_wg=krdLG&pf_rd_p=7d5d9c3c-5e01-44ac-97fd-261afd40b865&pf_rd_r=XFFS6ECFSEABGZYFA0AY&psc=1&refRID=XFFS6ECFSEABGZYFA0AY) 15.6\" Full HD Laptop, Intel Core i7-8550U, NVIDIA GeForce MX150, 8GB RAM, 256GB SSD + 1TB HDD ($900)\n6. [ASUS VivoBook Pro Thin & Light Laptop](https://www.amazon.com/VivoBook-i7-8550U-Processor-GeForce-Backlit/dp/B07661CYPD/ref=pd_sbs_147_1?_encoding=UTF8&pd_rd_i=B07661CYPD&pd_rd_r=899aed96-fa11-11e8-84c9-c9e00b2a0326&pd_rd_w=vIm3u&pd_rd_wg=krdLG&pf_rd_p=7d5d9c3c-5e01-44ac-97fd-261afd40b865&pf_rd_r=XFFS6ECFSEABGZYFA0AY&psc=1&refRID=XFFS6ECFSEABGZYFA0AY), 17.3\" Full HD, Intel i7-8550U, 16GB DDR4 RAM, 256GB M.2 SSD + 1TB HDD, GeForce GTX 1050 4GB ($920)\n7. [ASUS ZenBook Ultra-Slim Laptop](https://www.amazon.com/gp/offer-listing/B079TBQ4H4/ref=dp_olp_all_mbc?ie=UTF8&condition=all) \\- 14” FHD IPS WideView Display, Intel Core i7-8550U CPU, 8GB DDR4, 128GB SSD + 1TB HDD, ($1200)\n8. [ASUS ZenBook UX430UN UltraBook Laptop](https://www.amazon.com/ASUS-ZenBook-UX430UN-UltraBook-Laptop/dp/B077BXRBK1/ref=pd_sbs_147_5?_encoding=UTF8&pd_rd_i=B077BXRBK1&pd_rd_r=056ab5a7-eb3a-11e8-b4a1-71fe8814db4b&pd_rd_w=9cZg7&pd_rd_wg=QX3ts&pf_rd_i=desktop-dp-sims&pf_rd_m=ATVPDKIKX0DER&pf_rd_p=7d5d9c3c-5e01-44ac-97fd-261afd40b865&pf_rd_r=S9R5PZBWMPGEK8JP2Y62&pf_rd_s=desktop-dp-sims&pf_rd_t=40701&psc=1&refRID=S9R5PZBWMPGEK8JP2Y62): 14\" Matte NanoEdge FHD (1920x1080), 8th Gen Intel Core i7-8550U, 512GB SSD, 16GB RAM, NVIDIA MX150 Graphics ($1050)\n9. [ASUS ZenBook 13 UX331UA Ultra-Slim Laptop 13.3](https://www.amazon.com/Ultra-Slim-WideView-i7-8550U-Processor-Fingerprint/dp/B07CY2D829/ref=pd_sbs_147_6?_encoding=UTF8&pd_rd_i=B07CY2D829&pd_rd_r=056ab5a7-eb3a-11e8-b4a1-71fe8814db4b&pd_rd_w=9cZg7&pd_rd_wg=QX3ts&pf_rd_i=desktop-dp-sims&pf_rd_m=ATVPDKIKX0DER&pf_rd_p=7d5d9c3c-5e01-44ac-97fd-261afd40b865&pf_rd_r=S9R5PZBWMPGEK8JP2Y62&pf_rd_s=desktop-dp-sims&pf_rd_t=40701&psc=1&refRID=S9R5PZBWMPGEK8JP2Y62)” Full HD WideView display, 8th gen Intel Core i7-8550U Processor, 8GB LPDDR3, 256GB SSD ($880)\n10. [ASUS ZenBook 14 Thin and Light Laptop - 14”](https://www.amazon.com/ASUS-ZenBook-Thin-Light-Laptop/dp/B0768M9KVY/ref=sr_1_33?s=pc&ie=UTF8&qid=1542549458&sr=1-33&keywords=laptops&refinements=p_n_operating_system_browse-bin%3A17702486011%2Cp_n_feature_five_browse-bin%3A13580791011%7C13580790011%7C13580789011%2Cp_n_feature_fourteen_browse-bin%3A2057441011%2Cp_n_feature_four_browse-bin%3A2289793011%7C2289792011%2Cp_n_intended_use_browse-bin%3A9647498011)Full HD WideView, 8th gen Core i7-8550U Processor, 16GB DDR3, 512GB SSD ($1300)\n11. [ASUS N580VD-DB74T VivoBook Pro 15 FHD Touchscreen Laptop](https://www.amazon.com/N580VD-DB74T-VivoBook-Touchscreen-GeForce-keyboard/dp/B0747S3V8D/ref=sr_1_21?s=pc&ie=UTF8&qid=1541774278&sr=1-21&keywords=laptop&refinements=p_n_feature_five_browse-bin%3A13580791011%7C13580790011%7C13580789011%7C13580788011%7C13580787011%2Cp_n_feature_four_browse-bin%3A2289792011%2Cp_computer_cpu_speed-bin%3A2+to+2.9+GHz%7C3+GHz+%26amp%3B+Up%2Cp_n_feature_seven_browse-bin%3A3012497011%7C3012495011%2Cp_n_operating_system_browse-bin%3A17702486011%2Cp_36%3A-150000%2Cp_n_feature_fourteen_browse-bin%3A2057441011%2Cp_n_size_browse-bin%3A2423840011%7C2423841011), Intel Core i7, NVIDIA GeForce Gaming GTX 1050 4GB, 16GB RAM, 512GB SSD, backlit keyboard ($1040)",
  "the options you've listed varies so much. \n\nDo you care about portabilty?  A touch screen? a powerful dedicated GPU? ",
  "You can get a Lenovo 330s with ssd, i7 and a GeForce 1050 for around $760 with the sale they have going on right now. ",
  "Get Walmart's overpowered laptops if they're in stock get the 17 in model though",
  "As mentioned before GPU isn't a big deal as I will be getting a eGPU within a few months after purchasing the laptop. And yes portability is a big requirement. Touch screen I couldn't care less if it didn't have one.",
  "Desperate Canadian asking for help (casual gaming+college, CAD$1300-1400) Hello guys. I have picked a short list of budget gaming/college laptops after research, and can you guys help me making a decision? I play games that are not very demanding but also AAA games occasionally. I use heavy duty programmes not that often. I am able to carry big bags all around but battery life is important as well. \n(The following price is after deduction and shipping. Copied from another post of mine in r/SuggestALaptop)\n1. Acer Nitro 5 CAD$1250\nhttps://www.amazon.ca/Acer-Gaming-Laptop-i7-7300HQ-Windows/dp/B071JLXH2G?th=1\ni7-7700hq, 1050ti, 8gb ram, 512gb ssd, FHD IPS. Other specs unknown. This laptop is very new and doesn't have a review yet. But I think it has superb specs.\n\n2.Dell Inspiron 7567 CAD$1200\nhttp://www.dell.com/en-ca/member/shop/productdetails/inspiron-15-7567-laptop/ni157567_ftsb_s512e\ni7-7700hq, 1050ti, 8gb ram, 1TB 5400rpm w 8gb cache, FHD TN (Unfortunately, all Canadian Inspirons are TN screen. Ah, capitalists) Also a nice laptop with unrivalled battery life but the TN panel is a significant defect.\n\n3. Lenovo Y520 (customized) CAD$1130+HDD$90=$1220\nhttp://www3.lenovo.com/ca/en/corporatepluscard/laptops/ideapad/lenovo-legion-y-series-laptops/Lenovo-Y520-15IKBN/p/80WKCTO1WWENCA0/customize?\ni7-7700hq, 1050ti, 8gb ram, 128gb ssd, FHS IPS. Plus a 1tb 7200rpm FireCuda from Amazon that will cost me $90.\n\n4.Lenovo IdeaPad Y700 15\" Touch CAD$1277\nhttp://www3.lenovo.com/ca/en/corporatepluscard/laptops/ideapad/ideapad-y700-series/Lenovo-IdeaPad-Y700-Touch-15ISK/p/80NW0035US\ni7-6700hq, 960m, 16gb ram, 256gb ssd+1tb 5400rpm hdd. UHD IPS w touch.\nCould a 960m support an UHD screen well?\n\n5. MSI GL72 7QF-1057 CAD$1141\nhttps://www.newegg.ca/Product/Product.aspx?Item=N82E16834154594&ignorebbr=1\ni7-7700hq, 960m, 8gb ram, 1tb 7200 rpm hdd, 17.3'' FHD (unknown tn/ips)\n\nWhich one do you guys think is best fit for me, if battery life is weighed the same as the budget high specs? I am not a hard-core gamer but maybe I will occasionally have some AAA games.\nI am really interested in No.1 (Acer Nitro 5), but I am afraid that it isn't as good as advertised due to lack of reviews. Should I wait for a moment or buy now to avoid possible rise in price? It that worthy?\nIf I live in US, then Inspiron 7567 will be a no brainer. But the TN panel is, eh, undesired. It would cost me $200 to change a screen.  \nFinally, is there a model that is super fascinating that costs CAD$1300-1400? I didn't looked into that range much.\nThank you very much! \n",
  "The IPS screen on the 7567 is a game changer in the US - really sucks that you can't buy it in Canada. I'd recommend the other laptops. Maybe consider the Acer Helios 300 (GTX 1060 at just over $1000 USD) if it's the same price in Canada.  ",
  "Dont buy Lenovo you will regret it, they ship all their laptops with defects, mine and 1000 people.more who bought 510 yisk have defect touchpads",
  "Switch the TN panel in the 7567 for $60. It's much more powerful and very easy to switch.",
  "1999 CAD. Sad :(",
  "I don't know about the local retailers in Canada - if you're only able to shop online, try looking for deal websites or subreddits. Maybe consider ship by proxy services if you're desperate enough.",
  "Yeah... It's Amazon, and I believe it's the only place that sells Helios. Btw for Lenovo Y520, for casual gaming like OW, WOT or sth like that, would a i5-7300HQ works better than i7-7700HQ? If we take battery life into account, is i7 ($135 difference) that important?",
  "For gaming, not worth it - you would be better off spending more for a 1050 Ti configuration of you can.",
  "Help me choose from a few laptops I would like to know if you have any particularly strong reasons for objecting to my choice ( e.g., if I am wrong about something and it's very bad) and veering away towards one of the other choices mentioned. I've posted reviews below in order of preference along with some reasons for such preference, so that you may compare and contrast my reasons with those in the review.\n\nThe specs may diverge in the review but you should know that all of them basically feature an i7, GTX1070, 16 GB RAM and an SSD.\n\nMy criteria for judgement: \n\n**Task being used for**: Primary - gaming. Secondary - programming/engineering/CAD applications.\n\n**Budget**:N/A\n\n**Country**:Slovenia\n\n**Portability**: Preferred to be portable but may be able to leave it on desk more often unless required.\n\n**Playing games (which)**: Yes. Latest AAA releases.\n\n**Battery**: Preferred user removable/replaceable and most efficient/long-lasting/lifetime battery possible (secondary to specs for gaming) in case of use away from desk.\n\n**Expected Lifetime of Laptop**: Don't know. Not a frequent buyer. Will use it till it dies but more probably once every AAA release becomes completely unplayable even at lowest settings. Happened to be ~5-6 years for my current machine.\n\n**User-Serviceable**: Yes. An important part of me using the machine forever means that I should be able to replace the thermal paste if needed and clean dust from the fans, among other things.\n\n**Keyboard**: Standard English Qwerty Keyboard with all the keys being present and well sized.\n\n**Accessories**: Mouse should go on the right hand side.\n\nNote that most don't meet all criteria but I have stated my reasons for why I prefer such\n\nhttps://www.notebookcheck.net/Asus-ROG-Strix-GL502VS-Notebook-Review.171567.0.html\n\nPortable is a huge plus. Good thing if a laptop can be a laptop and I did not see much difference compared to the others in performance and especially fears of temperatures being higher due to less space. Also seems slightly user-serviceable (you can open it up to see the motherboard with CPU, GPU, fans and everything)\n\nhttps://www.notebookcheck.net/HP-Omen-17-i7-6700HQ-GTX-1070-Notebook-Review.181824.0.html\n\nPossibly user-serviceable but may have crude make. It was initially second in my list but I may not consider it due to the lack of quality in materials.\n\nhttps://www.notebookcheck.net/Asus-Strix-GL702VS-7700HQ-FHD-GTX-1070-Xotic-PC-Edition-Notebook-Review.207150.0.html\n\nDefinitely user-serviceable according to review but also has issues with throttling and temperatures.\n\nhttps://www.notebookcheck.net/Asus-ROG-G752VS-Notebook-Review.171608.0.html\n\nhttps://www.notebookcheck.net/Acer-Predator-17-G9-793-Notebook-Review.173668.0.html\n\nCommenting on the above two together since they are pretty much the same. Sturdy and big ****ing laptops (4+ Kg). They have a CD drive so that is sort of a plus. Otherwise, I need to get an external one for the other ones. But its not enough to warrant being further up in the list. That and they require complete disassembly to service. The Asus is above because it performs better but it also has a weird design which does not allow it to fit into standard bags.\n\nhttps://www.notebookcheck.net/Lenovo-Ideapad-Y910.176554.0.html\n\nNot sold on this. Put this in the list just because I was making a list. It has 64 GB RAM but has no other discernible advantage over the others, is a big ****ing laptop and does not really seem worth the 3000 Euros it costs.\n\nI'd like to add that I've discussed this issue elsewhere and I can't make up my mind between the GL702VS and the GL502VS. The 15\" one is lighter, smaller i.e. can fit in places. The 17\" is heavier but only by 0.3 Kg and has better CPU i.e. i7-7700HQ.\n\nThough the real point of contention is because people give me contradicting points. The reviews say the GL702VS has heating and throttling issues whereas people I've been discussing with elsewhere say GL502VS does. I just don't know who is right!\n\nCan you guys please help me decide?\n\nAlso, I can only choose from these, since they are the only ones available for retail in stores in my region and I get a tax rebate when purchasing here, so it would be much cheaper for me to just buy retail here instead of online order, in case somebody would like to suggest that.\n\nI may consider online orders, however, if the suggested machine has minimal shipping costs, arrives soon (leaving in about a month for a few years) and has payment on arrival, I may consider it.\n\nAnd before it is mentioned, Airline travel means I can only use laptops.\n\nThank you!"
]