[
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "New Lenovo Chromebook Plus 14 Review: The laptop for most people This is my review of the new Lenovo Chromebook Plus 14, which has been hyped up as the “supreme being” of Chromebooks thanks to the new MediaTek Kompanio Ultra chip. I’m just a regular tech nerd who loves Chromebooks but can still look at things objectively, especially when something costs close to $800. This is an honest review, no marketing fluff of just reading the specs. I do reviews as a hobby because I genuinely love tech and enjoy spreading the gospel.\n\nWhile I was overall impressed, I think this machine is overhyped, mainly because of the chip. It’s not quite ready for the big leagues in some areas. I’m coming from using devices like my Galaxy Tab S9+ with the Snapdragon 8 Gen 2, which **EATS UP** anything I throw at it (AI, photo/video editing, multi tasking, video calls). That’s my dream: give me that level of power from a Galaxy Tab S series in a Chromebook with a great keyboard with zero compromises.\n\nSo here’s my category breakdown after using the Lenovo Chromebook Plus 14 for a week, alongside my trusty daily driver, the [HP Chromebook x360 14c](https://www.aboutchromebooks.com/hp-chromebook-x360-14c-first-impressions-great-build-quality-in-a-smallish-high-performing-package/) (i3/8GB RAM), which is still a beast since 2021.\n\n**-----------------**\n\n# 🔧 Build & Design\n\nThe Lenovo is thin and light, but solid. It gives off premium MacBook vibes in build quality, especially when typing. It's so light, it almost feels like a dummy unit, but clearly isn’t. It definitely feels like the next generation of Chromebook hardware.\n\nOnly downside? The bottom is plastic, so it lacks that full premium unibody feel. But unless you’re carrying it around a lot, it’s a non-issue. People mentioned keyboard flex but I didn’t experience any in daily use. And I’m a weightlifter and former lineman with 10.5-inch bear paws. I only got flex when I intentionally tried to flex the keyboard by pressing hard.\n\nThe hinge is firm, you can’t open it with one hand, but once open, it holds its position perfectly.\n\nCompared to the HP 14c, the Lenovo is a little longer and wider but way thinner and lighter. My HP is a full aluminum tank, it’s been a champ for years. The Lenovo feels like it’ll hold up, but its lighter build will need to prove itself over time.\n\nhttps://preview.redd.it/7cx1remd5ugf1.jpg?width=3946&format=pjpg&auto=webp&s=88fc512c4967fd3d9b6ea3b537f575ffb690dff4\n\nhttps://preview.redd.it/8m1a8ard5ugf1.jpg?width=3924&format=pjpg&auto=webp&s=efab4b1846b64e7727b72556ddd716a9c3daaf11\n\nhttps://preview.redd.it/cdn5xkwd5ugf1.jpg?width=4000&format=pjpg&auto=webp&s=665327d55e809b4a4685834ce4593af80b4fe985\n\n**Build Grade: A**\n\n**-----------------------------------**\n\n# 🔋 Battery Life\n\nLet’s be real: I never got anywhere near the advertised 17 hours. But that’s OK, because I still got a solid 9–10.5 hours under heavy, real-world use:\n\n* 20–30 tabs open\n* Zoom app + Teams (web)\n* YouTube music streaming\n* Constant typing\n* Screen at \\~70%\n\nCompared to my aging HP, which lasts about 4–5 hours now, this is a major win. For comparison, the [HP Dragonfly Pro ](https://www.aboutchromebooks.com/hp-dragonfly-pro-chromebook-review-the-pixelbook-of-2023/)from 2023 with an i5 is the worst battery life I ever had on a high powered Chromebook that gave me a max of 3 hours. That thing didn’t last the weekend before it went back.\n\n**Battery Grade: A+**\n\n**-------------------------------------------**\n\n# ⌨️ Keyboard, Trackpad & Fingerprint Reader\n\nTyping on this was a breeze, even with my bear paws. No real keyboard flex during regular use. The keys feel a little shallower than on the HP 14c, but once I got into a groove, I had no complaints.\n\nTrackpad is large, smooth, and accurate, feels close to a MacBook in responsiveness. No lag, no misclicks.\n\nThe fingerprint reader? 🔥 One of the best I’ve used on a Chromebook or any computer. I tried to fake it out with weird angles and different parts of my finger, but nope, still unlocked instantly.\n\n**Grade: A**\n\n**----------------------------**\n\n# 🔊 Sound & Speakers\n\nThe Dolby-branded speakers had me hopeful, but they’re great for a Chromebook, but average overall. My HP PC from 2013 would blow these out of the water, so it's nothing special there. They do have more depth than 99% of all Chromebooks and are a little louder overall, it's still Chromebook speakers, so they are decent in a small room.\n\nThe HP DragonFly Pro was also hyped up to have amazing speakers, but again, good for a chrombook, but in real-world usage, they are just ok.\n\n**Grade: C overall | B+ for a Chromebook**\n\n**--------------------------------------------------**\n\n# ⚡ Chip & Performance: Kompanio Ultra 910\n\nHere’s where the hype train slows down.\n\nIn benchmarks (Jetstream, Speedometer), this chip was twice as fast as my HP’s i3. In real-world use? Not really. It’s only slightly faster, like a 0.5-1 second lead in page loads, even for heavy sites like ESPN and data heavy Google Sheets.\n\nYes, it wins technically.... but it was often a photo finish.\n\nhttps://preview.redd.it/erj1q9w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=e9612c64acde7e2224c924ad258d9bfc6a111dcc\n\nhttps://preview.redd.it/u0brf8w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=0cad7a55498ced4378d570f2a42a10285385f394\n\nI **ran into consistent problems** using Teams in the browser. Video calls would freeze, the screen would stutter, and it even blinked to black unless I turned off the camera. Reddit confirms I’m not alone on this. Zoom (via app) worked fine, but Teams was rough. No such issues on my HP.\n\nBut, the Mediatek chip does allow you to download ALL of THE APPS in the Play Store, which opens up the full world of Android on your Chromebook. The i3 in my HP doesnt allow that, and each day more and more apps that I could download are no longer supported, so that gives it the edge to usher in the full Android Laptop experience, as some of the apps would be better on a full-screen computer with a keyboard compared to the phone.\n\nI tried video editing on the Lenovo using my favorite video editing app on Android called [InShot](https://inshot.com/), and it temporarily presented a dream come true, to have InShot on a laptop, not a tablet with an added on keyboard, where I could edit videos comfortably on my lap. But then I tried to edit together 4 different 15-second 4k files, and that's when it went to crap fast. As soon as I added in a transition, it became super laggy and jittery, and adding in more transitions and text almost made the computer quit. So video editing on the Lenovo is not ideal.\n\n**Video editing on this is about as good as a groundhog trying to make a beaver dam; it looks like it should work, and has the same shape and characteristics, but no, it won't do at all.**\n\nAI features like background blur or object removal? Not there yet. Definitely nowhere near Galaxy S phones or tablets.\n\nMy last point about the chip is, why not use past (1-2 year old) true flagship chips that can do it all, like the Qualcomm Snapdragon 8 Gen 2 (from the Galaxy Tab S9 series)? If they are going to charge such a premium price and say it's because of the chip, bring in a true elite chip that can handle everything like AI, multitasking, video editing, and more, all at the same time, and then Chrome OS would be a monster.\n\n**Grade: B**\n\n**--------------------------------**\n\n# 📺 Screen & Camera\n\nhttps://preview.redd.it/8ualptw55ugf1.jpg?width=4000&format=pjpg&auto=webp&s=23693f067cae0fa1665c752c8052afbdcf8eb7f5\n\n\n\nNow this screen, WOW. It’s a 2K OLED panel that’s absolutely beautiful. I watched an [8K Planet Earth video on Youtube](https://www.youtube.com/watch?v=6JWxHy0C_pI&list=RD6JWxHy0C_pI&start_radio=1) and it felt like I could reach into the screen and touch it. The best screen I’ve ever seen on a Chromebook. Also, they list the Lenovo at 400 nits, but it feels much brighter than 400. I kept the screen constantly at 60-70% and that was perfect for me in all of my use cases.\n\nBUT… a few things:\n\n* Some images/web pages looked oversaturated\n* No screen tuning or adjustment in ChromeOS\n\nThe camera is also surprisingly good. Not Galaxy Ultra good, but very usable for video calls even in tricky lighting.\n\n**Grade: A**\n\n**------------------------------------**\n\n# Final Thoughts\n\nThis is a great machine and a peek into the future of Chromebooks, especially with ARM chips. The design is sleek (though I wish they offered a deep gray or navy blue), the screen is stellar, battery is excellent, and it handles most tasks with ease.\n\nFor most users who use nothing but web apps (Google Docs, Office, email, YouTube) this is more than enough. People spending $2,000 for email machines should seriously consider this and Chrome OS as an alternative.\n\nBUT… looking at the complete picture of the Lenovo Chromebook Plus 14, this would be the no-brainer recommendation of the year (for any laptop, especially a Chromebook) at $500, as $750 feels like a reach when you can get a MacBook Air for $850. If Best Buy does their normal act of putting this on deep discount after a couple of months, and this goes down to $450-550 for a new one, **run**, don't walk to get one if you need a new laptop. At that price, this is the no-brainer Chromebook of the decade.\n\n**Overall Grade: B+**\n\nMe and my bear paws are off to test the next device.",
  "This is cool, but for $800, it better deliver without hiccups. Why risk it when you can grab a MacBook Air for a bit more?",
  "I have found my LCP14 to be fast, but I think the glowing performance reviews may be a bit overstated. I get some freezing/non-loading tabs with maybe 7-10 open (some of them being Google Docs or Gmail), which was unexpected. I also noticed it can't handle 16k (4320p) videos with 60fps on YouTube—not that this is a dealbreaker by any means, but I was still surprised. I typically use that as a test for a machine's horsepower.\n\nI assume all this has to do with the ARM processor and the extended battery life, which may come at a cost. The above tasks would never challenge my HP Elite Dragonfly Chromebook, but that machine had historically bad battery life. Overall, I'm happy with the LCP14 so far, but I thought I'd add this context.",
  "This is the review I've been looking for and have been going back and forth with a MacBook Air for the exact reason on price. I don't want to switch my ecosystem so I'll wait for a sale. Thanks for your hard work!",
  "Great review, thanks a lot. Very well written and exactly what I was looking for.\n\nEdit: I have one more question. How well or poorly does the touch display respond? And were you able to test Android games on it? Did they run better or worse than on Intel devices?\n\nTwo questions. Those were two questions. Sorry.",
  "Thanks for the insightful review! One question though, as I couldn't find this information anywhere. How far does the screen open? Maybe show pictures of maximum opening angle or a value in degrees would be fantastic :)",
  "[deleted]",
  "Well for those of us who love Chrome OS, its an alternative to Windows that faster and lighter, but as you mentioned for this price, it needs to be flawless, or we can grab a MacBook \n\nLike I said, for around $500 this is great, at its current price and chip flaws I see why people are taking it back (I have seen this a lot on here)",
  "See, you are a person who has actually used the machine and not just had one tab open and is hyping the machine up.   The Lenovo is fast, but the jitters and lag it has when doing real-world stuff are unacceptable for me at that price.  As I said, comparing it to my HP Chrombook with an i3 from 2021, they are neck and neck in real-world speed tests, but the i3 never stutters with 20 tabs open, playing 4k videos, and video calling at the same time. \n\nYes, the battery life is not great on my older HP, but I never experienced any hiccups like I did on the Lenovo, just doing what we have come to consider basic things, like video calling, when the Lenovo about aborted on me. \n\nI think the Mediatek chip is ok, but it's not as powerful as they make it seem.  As I said in my review, they need to take older top of the line chips like thise from a Galaxy s tab and put it into the Chromebook so that it cna do EVERYTHING with ease, and then it will be perfect.",
  "So which one are you going to get, the MacBook or the Lenovo?",
  "Thanks, I appreciate you!!\nThe touch screen is amazing, no issues the at all and it was good to use at times for certain things but it does leave a lot of smudges on the screen. \n\nGaming I don't do, but there's a video by Lon Sibon on YouTube that he talks about gaming.  Again I'm not sure how it will hold up because the chip is not as strong as they make it seem, you can download all the apps yes, but raw power is questionable in real world use cases as I mentioned.",
  "It goes all the way flat, or 180 degrees and the hinge is very firm  \nThis is not a convertible.  But, Acer is launching a 514 chrombook plus with this chip in it next month that will be a convertible and I think they will have he chip tuned better than I experinced on this Lenovo",
  "I agree with you, and the fact that the chip was struggling with certain task makes it even worse \n\n$450-500 it's a steal, but anything above $550 is a no",
  "I'm leaning Lenovo because of the ecosystem, but the m3 or m4 MacBook Air is on sale for ~$800 and seems like it would have better longevity than what the Lenovo may have (both based on past experience). I have a Lenovo duet 5 now which I love but the snapdragon is feeling a little long in the tooth when I have more than a few tabs open.\n\nI guess my heart says Lenovo but brain said MacBook Air.",
  "Thanks a lot for the feedback! 180 degrees would be perfect for me. I got a Acer Spin 513 (the one with the previous top ARM model) which is a convertible, but it turned out I hardly use it as a tablet. 95% only as a laptop. Having good speakers is a great bonus for the Lenovo for me, as well as a bright screen. Don't need maximum power as for heavy workload I want to rely on remote desktops.",
  "Check your local best buys, in my area (SE Michigan) the Lenovo is on BB as a used excellent for $530 which is the right price point. So see if you can find one in your area for that price",
  "Unfortunately not near me but I'll keep an eye out.\n\nWhat do you think the chances of the kompanio lasting close to apple silicon?",
  "Not sure, thats a ChatGPT quesiton lol \n\nHappy hunting, hopefully you can find one soon.   I hear that they are high-end Chromebooks with Spandragon x Elite processors coming; I'm hoping they are here just before the holiday season.",
  "Ended up with the m4 MacBook air. It went on sale on Amazon for 750(!) and I can't find the Lenovo near me. Also mixed in the surface laptop for fun but the air just seems too good. Thanks again for your help!",
  "How can I manage temperatures on my Lenovo Legion 5i 16\" (Ultra 9 275HX + RTX 5060) when XTU/ThrottleStop don’t work? Hey all,\n\n**Laptop:** Lenovo Legion 5i 16\" Gaming Laptop — Model 83NX0000US \n\n**Specs:** Intel Core Ultra 9 275HX (24C), RTX 5060 8GB, 32GB DDR5-5600, 1TB SSD, 16\" 2560×1600 240Hz, Windows 11 Home, 80Wh, 245W adapter. Retail listing badge: 4.3/5 (14 reviews). Price seen: $1,499.99.\n\n**What I'm seeing**\n\nAfter about 30 minutes in PUBG, my CPU temps spike to 100–104 °C and I'm getting Thermal Throttling warnings in the sensors.\n\nGPU temps seem fine though (60–80 °C), and my Afterburner undervolt/curve appears to be working.\n\nLenovo Vantage performance profiles change things a bit, but Intel XTU power limits (PL1/PL2) just keep reverting back whenever I start gaming.\n\n**XTU messages / logs I saw (what they mean)**\n\n* **Power Throttled** → CPU is hitting PL1/PL2 (long/short turbo power limits).\n* **Current Throttled** → limited by motherboard/VRM amperage caps.\n* **Thermal Throttled** → CPU reached the temp ceiling (\\~95–105 °C), clocks dropped to cool down.\n* **Graphics Current Throttled** → iGPU hit current limit (not really critical for dGPU gaming).\n\nBasically, power, current, and thermal limits are all kicking in—pretty normal for thin laptops under heavy load.\n\n**XTU \"Import Profile\" error I got**\n\n\"This system does not support importing profiles because certain controls required to permit overclocking are inaccessible.\"\n\nFrom what I can tell, Lenovo's firmware (EC) + Intel DTT lock most tuning controls on this Meteor Lake (Core Ultra) platform. What this means:\n\n* A lot of XTU sliders show up but any changes don't stick (or get overridden when you boot/load a game).\n* Undervolting is blocked (Plundervolt mitigation) on most 2023–2025 Legions.\n* ThrottleStop shows \"CPU not supported\" on Core Ultra → basically unusable.\n\n**My test interpretation (XTU + sensors)**\n\nDuring CPU stress: CPU Utilization = 100%, Package \\~71–74 °C, Power Limit Throttling = Yes, Thermal Throttling = No (in that specific run), P-core max dropped from \\~4.59 → 4.21 GHz.\n\nIn actual games (PUBG): later sessions definitely hit 100 °C+ and showed Thermal Throttling events.\n\nSo Lenovo's firmware is actively enforcing these safety caps (power/current/thermal)—the system's not \"broken,\" it's just designed this way.\n\n**What I've tried / current workarounds**\n\n* **Intel XTU:** Setting PL1 \\~65 W / PL2 \\~80 W → gets overwritten back to \\~120–140 W once gaming starts.\n* **ThrottleStop:** Not supported on Core Ultra → dead end.\n* **Windows Power Options:** Setting Maximum Processor State = 99% (and Minimum = 5%) → disables turbo, drops CPU temps 8–15 °C; 95% drops even more but with a bigger FPS hit.\n* **Lenovo Vantage:** Switching between Performance/Balanced/Quiet helps somewhat (seems to flip hidden PL tables), but there are no raw PL1/PL2 sliders visible.\n* **GPU (MSI Afterburner):** Undervolt/curve works; monitored with HWINFO—voltage \\~0.7–0.85 V, clocks \\~2.2–2.3 GHz, temps 60–78 °C.\n* **Cooling:** Elevated rear / cooling pad → small but useful temp reductions.\n\n**My questions (especially for Legion + Core Ultra owners)**\n\n1. Is there any BIOS or hidden Vantage option on the Legion 5i (83NX0000US) to manually set CPU PL1/PL2 or allow undervolting on Meteor Lake?\n2. Is there a reliable way to keep XTU limits from being reset by EC/DTT when a game launches, or is that just not possible on this model?\n3. Are there specific Vantage profiles (Balanced/Quiet/Performance/Custom) that meaningfully lower CPU power/temps in PUBG without a big FPS loss?\n4. For PUBG specifically (CPU-heavy, and those smoke effects spike the GPU), any settings combo that helps reduce CPU spikes? Like View Distance, Effects/Shadows tuning that other owners recommend?\n5. If the firmware locks are hard, are my only long-term options:\n   * Stick with 99% Max Processor State (no Turbo) while gaming,\n   * External cooling pad / repaste (or liquid metal, if I'm feeling brave), and\n   * Keep using the GPU undervolt for efficiency?\n\n**Extra context on GPU curve weirdness (MSI Afterburner)**\n\nI noticed the curve \"re-draw\" itself after Apply/reboot. From what I've read in community threads: that's NVIDIA GPU Boost doing its temperature/load compensation thing with the 15 MHz step behavior—the offset stays, but the drawn MHz shifts a bit.\n\nEven if the editor looks different later, HWINFO shows my voltage/clock under load match the target I set, so the undervolt is definitely applying.\n\n**TL;DR**\n\nXTU/ThrottleStop are effectively blocked on my Legion 5i (Ultra 9 275HX). PL1/PL2 reset under load.\n\nPUBG pushes the CPU to \\~100–104 °C at times → thermal throttle kicks in.\n\nBest results so far: Vantage profile + Windows 99% Max Processor State (no Turbo) + GPU undervolt + cooling pad.\n\nLooking for any owner-proven methods to tame these CPU temps (BIOS/Vantage tricks, practical PUBG settings) without taking a huge FPS hit.\n\nThanks in advance! 🙏",
  "Maby limit cpu power.. and see if no background things , do you hear loud fans .. so u know fans work.. u can use monitoring app...",
  "Have you found solution and issues fixed or not yet ?",
  "Lenovo IdeaPad Gaming 3 15ACH6 – A review and upgrade path First, I’ll tell you about myself. Mainly because it could help you decide on getting the same or a similar laptop if you have similar needs to me. I’m a mechanical engineering student. Currently, I use CAD somewhat frequently for college and \\*very\\* frequently for personal use, so a dedicated GPU was pretty much necessary. A decently Good CPU was also needed for simulation work and \\*very\\* amateurish programming. Video and image editing are also hobbies of mine, but I don’t do anything extravagant so they weren’t really a deciding factor. I also love to be dramatic and firmly believe I am a professional writer. I’m not, so if you don’t like that kind of writing, I’ll leave a TL;DR at the end of this post.\n\nSo, the laptop. The IdeaPad 3 Gaming I bought comes with a wired RGB mouse I will probably not use (it’s still in its sealed bag), some very disappointing manuals and guides (I just downloaded the actual ones from Lenovo’s site) and a 135W AC charger. Internally, it has a Ryzen 5 5600H, a single 8 GB DDR4 SO-DIMM RAM clocked at 3200 MHz, one 512 GB M.2 Samsung NVMe Gen3x4 SSD (model is MZ-ALQ512B), a Nvidia RTX 3050 4GB and finally a 15.6” 1080p 120 Hz display.\n\nI actually wanted to do this just because of this next section: Upgrades. I’ve always been a sucker for high-capacity drives, so the tiny 512 GB of space made me feel uneasy every single time I thought about my locally stored movies, TV shows, comics, games… Point is: I wanted to upgrade. Problem was: I read online that only the 2242 M.2 slot (the one with the stock SSD) could reach Gen4 speeds.\n\nI’ve also read only that this thing would NOT work with a higher than 512 GB drive on the 2242 slot. I just ignored that and got a 2 TB Crucial P310 Gen4 drive. FUCK. YEAH.\n\nI found it on Micro Center for sale at $149.99 USD too. This is important because my third-world mind was already going crazy inside that celestial store. I felt like I was dreaming in that GPU aisle. The custom keyboards too???? I loved every single plack-time I spent in there. My dad (we were on a business trip btw) was searching for a USB to VGA cable and they had it. WHAT. Who even needs that? Truly, an ascending and heavenly experience.\n\nAnyways. I was very worried it wouldn’t work. I already have a fully functional 2 TB NVMe and a 1 TB SATA drive on my PC, so if this didn’t work I just wasted half my salary in something I would 100% not be able to sell at that same price. Not to mention, I still needed an adapter. This thing is 2230, and if you remember correctly, the slot only fits 2242 drives. So…\n\nI’ll go over how good it performs now:\n\n* Gaming\n\nIn the very few games I tested, it was a very good experience. I mostly play only old games, so this might not mean much to you, but Bayonetta, Sonic X Shadow Generations and Rocket League ran perfectly fine. In Bayonetta’s case, it ran even better than on my desktop -$1200- gaming PC, which honestly doesn’t mean much since it barely counts as running in that system.\n\n* CAD\n\nThe most important thing to me. It runs flawlessly. And now, we go back to the Crucial drive! I designed the adapters using Inventor 2025 on the base laptop (as in “stock configuration”). The only problem I could name is that, for some reason, it takes Inventor like a whole minute to load the first project. Be it a fully finished model or just a blank file. It’s very weird.\n\nAfter finishing the model and getting it printed, I was ready to see if my dumb ass would be enjoying two whole terabytes of data on his new laptop.\n\n \n\nIt. Worked.\n\n \n\nI was so stupidly happy. And you know what? I haven’t mentioned that I also installed two 16 GB 3200 MHz sticks. EVERYTHING WORKED WITH NO ISSUES. It felt amazing. The trip to Micro Center, the fact that I was actually upgrading a laptop, the excitement I felt going into the Amazon Locker to retrieve my shiny new 32 gigs of RAM… Truly a wonderful experience.\n\nAfter I installed Windows I decided to check both drive’s speeds, just to be sure. Another big discovery for us; 15ACH6 owners. Turns out that if you only have ONE M.2 drive installed, the drive will run at full Gen3x4 speeds. The damn manual says it runs at Gen3x2, but that is almost a complete lie. Thing is, if you install TWO NVMe drives, the speeds get halved, effectively functioning as two Gen3x2 slots. I’ll add the CrystalDiskMark results as pictures if you want to check them.\n\nTL;DR\n\nI’m really enjoying this laptop. It’s a very capable device. I can confirm that it supports up to 32 GB and a 2 TB NVMe drive and would recommend having just one of those installed to maximize speeds.",
  "hey man, wanted to say I appreciated this review. It made me decide its not for me, but wanted to thank you for the input.",
  "yo may i ask if u did something for the 32gb ram to work? \n\ni tried changing mine from 24gb to 32gb but it seems to have a problem. i always get a blue screen or sudden restarts.",
  "Nothing at all.\n\nDid you enter the BIOS at any point? There might be some setting there.\n\nYou could also change the RAM slots, clean the contacts and try using only one of the two sticks at s time to verify if they work.",
  "what brand are your rams?",
  "Crucial. It's always my brand of choice, though it shouldn't matter if you use any other brand at all as long as it fits the requirements.",
  "any reviews on Lenovo Yoga Slim 7X Gen 9? could anyone who owns this laptop give a brief review on its battery life, noises, and screen (burn in, etc)? \n\ni've seen reviews on just josh youtube and it seems too good to be true for its price, but what's holding me back is that it doesn't have an audio jack nor a USB port.",
  "I think the lack of answers is an answer in itself. I was also interested in this laptop, but I don't think it meets my needs, which may overlap with yours.",
  "i ended up getting an ASUS Zenbook 14 OLED instead hahahaha. but it's been great so far! the battery lasts about 10 hours, there's little to no noises, and i haven't experienced anything unusual with the OLED screen either!",
  "any reviews on Lenovo Yoga 9i 14IRP8 oatmeal? could anyone who owns this laptop give a brief review on its battery life, noises, and screen (burn in, etc)? \n\ni'm contemplating between getting this vs. Lenovo Yoga Slim 7x Gen 9:\n-CPU : Snapdragon X Elite 12 Core\n-Ram : 16GB LPDDR5x 8448Mhz\nStorage : 512GB PCle M.2\nDisplay: 14.5\" 3K OLED Touch\n-GPU: Qualcomm Adreno GPU\n",
  "Review of the Tuxedo Infinitybook Pro 14 gen 9/ Skikk Green 6 AMD/ TongFang GX4IDL I bought this laptop a couple of days ago. I bought the Skikk Green 6 AMD. Short specifications:\n\n* 14\" Matte Retina 120Hz 2880x1800\n* Ryzen 7 8845HS\n* USB-C ports with Displayport 2.1 and USB PD\n* 2 x M.2 2280 Port\n* 2 x DDR4 SODIM slots\n\nThis laptop is the TongFang GX4IDL and it is imported by various companies into the EU under different names. These laptops are typically exactly the same. There could be differences between bootloaders, but I expect not. Companies differ on options like RAM, SSD, keyboards and the included charger.\n\nThese are the variants I found:\n\n* Skikk Green 6 AMD\n* [Tuxedo Infinitybook Pro 14 gen 9](https://www.tuxedocomputers.com/en/TUXEDO-InfinityBook-Pro-14-Gen9-AMD)\n* [PC Specialist Lafite AI AMD](https://www.pcspecialist.co.uk/notebooks/lafite-pro-IV-14M/)\n\nI paid 900 Euro excl. VAT and mine came with:\n\n* 1TB Samsung 990 Pro SSD\n* 32GB 4800MHz nameless DDR5\n\nFor approximately 150 Euro more there is an Intel variant available.\n\nI was in the market for a 13 - 14\" laptop with a powerful CPU and I don't need a discrete GPU. I need 32GB RAM and preferably extendable. I use the laptop mainly in the office connected to USB-C docks and I use Ubuntu. So decent support of USB-C in Ubuntu was a requirement.\n\nAt first I tried to find a Lenovo, Dell or HP, but that would run quickly up to 1500 Euro easily. For the given specifications this laptop is a great deal. The enclosure feels sturdy, little flexing and good looks. It isn't super premium, but certainly not lower consumer grade like Acer, Asus or MSI laptops around the same price point. It is not so sturdy as my previous Lenovo bricks. I dare not to lift the laptop by its screen.\n\nThe retina IPS display is beautiful, vertical viewing angles are good. Horizontal slightly worse, but both very good.\n\nI'm not  a keyboard fetishist so the only thing I can say about the keyboard is that is works well. Unfortunately Skikk only sells the ISO variant of Querty without a Euro sign on the 5. Tuxedo gives you the choice between ISO and ANSI for Querty.\n\nThe touchpad is fine, comparable to higher end consumer touchpads, not even close to Apple. Disable touch when typing is not working great in Ubuntu. I haven't looked into this issue yet.\n\nThe webcam quality is good. IR cam is available for Windows Face ID.\n\nI haven't tested battery life, but my expectations are not high. The battery is small and the CPU power hungry. In Windows the battery charging thresholds can be managed. In Ubuntu unfortunately not. This will degrade the  battery quickly.\n\nWhen browsing the web and using office, the fan doesn't spin up most of the time. When it spins up it is nicely regulated. It only spins up to full speed if you start CPU intensive tasks. The noise is acceptable then.\n\nPros:\n\n* You get a semi-premium laptop with a lot of CPU horsepower for a low price\n* 95% support in Ubuntu\n* 5 USB-ports! (of which one on the back)\n* 2 of the 5 USB ports support Displayport and USB PD\n* Almost no crapware installed out of the box\n* 2 RAM slots which fit a lot of RAM\n* Silent until you release the Ryzen 7 beast\n\nCons:\n\n* No max charge level for the battery in Linux\n* There is only one LED to indicate both running status and charging status. When charging you cannot see the running status\n* When the lid is closed the LED is under the lid and not visible, this is annoying for dock users\n* Skikk offers no ANSI Querty\n* The whole laptop feels a bit warm\n\nTo conclude, I'm pretty happy that I found this laptop. I hope that his TongFang can meet the durability of my past Lenovo laptops.\n\nI took some photos of the laptop, a photo with the webcam and photos of all UEFI boot menus. You can find these photos in [this Youtube video](https://www.youtube.com/watch?v=0lS5pbprS2M)\n\n**UPDATE after 5 months of daily usage:**\n\n* I'm still very happy with this laptop. In the last couple of months I also bought a Lenovo LOQ. The built quality of the LOQ is bad compared to this TongFang.\n* Found a weird bug: If I restart in Windows and then go into Ubuntu during startup (GRUB), then the Wifi card is disabled in Ubuntu. If I shut down in Windows and cold boot into Ubuntu, I never have this issue. So I need to remember not to restart to switch from Windows to Ubuntu.\n* The webcam image quality is pretty bad.",
  "Would have given a double thumbs up if you would have made the Skikk Green 6 AMD text linked to the specific product page ;-) ;-)",
  "How are the WiFi speeds? I read some things about Intel WiFi speeds being better then the AMD chip.\nGoing to use with Arch linux myself though",
  "Could you update how the battery life has been (please mention the OS) and how are you satisfied with the purchase after nearly a month? Any surprises? Any disappointments? Would you buy it again? Would you choose the same config?",
  "thank you for all the tests. I really like the fact that the laptop seems to be running mostly silent, but has a very good cpu if you need it. appreciate your input on this !",
  "Thank you for the review. Does the screen wobble at all, compared to your T480?",
  "thank you so much for this review, have been eyeing this brand for a while now but no recent reviews (only 2-3 year old ones)\n\n  \nwould like to ask if you noticed any performance issues previously reported with the older models - the ones previously came with a barrel DC in and optional USB-C charging, when attempting to use with USB-C charging drastically reduced the performance, however on battery or DC-in barrel charger, there were no issues.\n\n  \nand any serious complains regarding the accuracy of the touchpad and the membrane keyboard?\n\n  \nThanking you in advance!",
  "Hey, any updates on your experience after a few months of owning it?",
  "Hi, thanks for the nice review! I'm a bit late to the party, but were you able to test the quality of the microphone/speakers in meetings?",
  "Thanks so much for the review, I couldn't find any other reviews for this laptop. I'm planning on buying one to run Linux. I have a couple of questions:\n\n1. Is there a way to set the amount of VRAM in the BIOS?\n2. Can you disable \"Secure Boot\" in the BIOS?",
  "Hello, stumbled upon your post. I was wondering if your ethernet is working on Ubuntu? I can't seem to connect mine. I'm using Fedora and can't seem to activate the ethernet even on the net manager.",
  "Thanks for the pre-sales and after-sales support! Very quick and to the point e-mail responses.",
  "Missed opportunity to link it yourself in this comment!",
  "I just did a couple of speed tests. I have gigabit internet, so my internet doesn't cap out my Wifi connection. I have the TongFang and Lenovo T480 side-to-side to each other. The Lenovo reaches 270Mbit/s, the Tongfang 150Mbit/s. Tested three times on each laptop, little variation between runs. So there seems to be an issue with Wifi speeds indeed.",
  "I haven't stressed the battery yet. I use it docked to USB-C 99% of the time. Just some occasional meetings or couch usage. I will run a battery test.\n\nI am still very happy with the purchase. Only downside until now is the slower Wifi. USB-C displayport works nicely under Ubuntu, better than with my previous Lenovo T480. \n\nMy config has 1 x 32GB DDR, I would have preferred 2 x 16GB to enable dual channel. So I'm satisfied so far. No downsides for me except for the ones mentioned in my review.",
  "I did a battery test. I opened the Edge browser in Windows, opened a Youtube 4K playlist and started playing videos. Windows power mode = Best power efficiency. Battery saver disabled. Brightness at 100%. Youtube playing 4k videos, not full screen. Battery drained from 100% to 44% in 4 hours and 15 minutes.",
  "Yes it does slightly. Screen rigidity is better with the T480, which is not strange since it is bulkier and heavier.",
  "With a 65W USB power brick you achieve full performance. Keyboard is fine. Touchpad is average, no complaints.",
  "Yeah, I'm still happy. Love the performance. I recently ran into 2 issues. At its highest speed, the fan makes a high pitched noise. I only noticed it when I was using the laptop on my lap and I was probably blocking the ventilation holes at the bottom of the laptop. Another issue is when playing music at the highest volume, something near the speaker starts resonating causing the audio to sound extra distorted.",
  "I always use a headset during video calls, so not tested.",
  "1. I don't think the amount of VRAM can be set.\n2. Secure boot can be disabled.",
  "I can check this for you tomorrow.",
  "Not fancy to do so! 🙃",
  "Maybe one additional question. Can you charge it with a power supply that is not 100W (5V/20A)? Have you tried with e.g. 65W? Some laptops have a problem with that AFAIK.",
  "Not bad at all! Thank you for testing that!",
  "Thanks! Would you still say that it works 95% in Linux, or has that number changed for you?",
  "Thanks. I ended up buying one and found out that the VRAM can't be changed. I tried using Smokeless\\_UMAF, but this didn't work either (this has worked on all of my previous laptops). I guess I'm stuck for 512MB of VRAM - not that this is bad, I just wish I could bump it up a little more.\n\nI'm using two kernel params on mine:\n\n    acpi.ec_no_wakeup=1 \n    amdgpu.dcdebugmask=0x10\n\nThe first is to fix an issue where the laptop wakes as soon as it goes to sleep when the lid is left open, and the second is to make the graphics a little smoother in 120Hz mode.\n\nI've been very happy with this laptop. I'm using `tuned` (instead of `power-profile-daemon`), and can get around 10 hours of light use (just browsing the web and doing stuff in the terminal). I'm traveling with mine right now, and have been very happy with the battery life (for my use cases).\n\nI'm really loving it - just a nice little light and portable 14 inch Linux laptop, yet powerful enough to handle coding/compiling, running AVDs (Android Virtual Devices) etc...",
  "Thanks man",
  "Just tested this. It charges fine with this [65W USB-C PD charger](https://eleshop.eu/compact-2-port-65w-pd-gan-fast-charging-usb-c-adapter.html).",
  "There are the typical Linux issues you will have with most computers. For example high quality audio over Bluetooth. But aside from those issues it works perfect in Ubuntu. I'm especially impressed with the USB-C compatibility. Much better than the Lenovo T480.",
  "Its not working. I didn't do a deep dive. Network card is detected, but when plugged in it doesn't connect.\n\n  \nMaybe you can do something with the solution here: [https://www.reddit.com/r/tuxedocomputers/comments/1h5mqb8/ethernet\\_on\\_infinitybook\\_pro\\_14\\_gen9\\_amd\\_not/](https://www.reddit.com/r/tuxedocomputers/comments/1h5mqb8/ethernet_on_infinitybook_pro_14_gen9_amd_not/)",
  "So you don't experience any [FPS drops](https://www.reddit.com/r/tuxedocomputers/comments/1544o98/performance_drops_to_30_when_charging_via_usbc/) on USB-C?",
  "Thanks again, will most probably order it as well.",
  "Man, I guess we'd have to try other distors then.",
  "I ran PassMark on battery and on 65W charger and the result is similar.",
  "Does anyone know anything about Lenovo Yoga 7 Gen 9 2-in-1 I was thinking about buying this laptop (all the specs and link below) for Uni. It suits all my needs with perfect display, ram, storage and even the processor is the latest Ryzen 7 8840HS. The only problem is I can't find a lot of reviews online so I am a bit hesitant. This is also my first time buying a laptop. Can anyone help or does anyone own this laptop?\n\n\n\nLenovo Yoga 7 2-in-1 14\" Gen 9\n16/512 GB\nAMD Ryzen 7 8840HS \n83DKCTO1WWSE1\nhttps://www.lenovo.com/se/sv/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7-2-in-1-gen-9-(14-inch-amd)/83dkcto1wwse1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=se:sem:ct8unv&gad_source=1&gclid=CjwKCAjw9cCyBhBzEiwAJTUWNXUrJ5x-w227jxQp2vYnQ71IqP8y5_VG3k3MMfo0Butw24YpmNvpyhoCZbQQAvD_BwE&gclsrc=aw.ds#features",
  "I don't have this laptop but I bought and setup my cousin the previous gen yoga 7i and it looks like a good laptop but I would be a bit hesitant about the amd version solely because for some reason lenovo keeps pairing their amd 2 in 1s with sub par screens and with the current gen 7i also receiving a screen downgrade so I would honestly say get the last gen 7i (the one with the 13th gen intel and oled screen)",
  "How has it been? Im looking at this exact model",
  "I actually just bought this computer for Uni😭really hope its good ill comeback once i receive it this Friday",
  "Ok Thanks. But I think the screen on this one is upgradable to OLED. Also if it's a sub par screen in what ways are they bad as in like would they break easily or?? And I'll check out the last Gen 7i",
  "Just bought this model (Lenovo Yoga 7 2-in-1) when I went in dead set on getting a MacBook. I felt like this was more bang for my buck, they also include Xbox gaming on here, which I am a gamergirl so that's a plus.  Although, upon initial start-up it's seeming like this laptop is kinda slow/buffering? IDK maybe wrong choice of words but definitely have experienced some lagging to where I was like WTF? this is a brand new damn laptop.  I also live outside of the local city, my WIFI is bootycon meaning ABSOLUTE TRASHHHHHH so I am just hoping it's because of that.  I bought this laptop instead of the Macbook for 2 main reasons, the 1TB for roughly $700 & I was spoiled to the touch screen concept. (my other/previous laptop is a lenovo 2-in-1 ideapad? thinkpad? IDK but its a small laptop with google chrome), I needed the upgrade bc my exams are required to be proctored online and google chrome blocks the Guardian browser, which is what they use to proctor), Overall I'm hoping I don't regret this buy.  Any one know how long I have to be able to return for a full refund at bestbuy? \n\n\n\nAlso, if you come across any great pros about this laptop I'm here for it, this thing is apparently capable of alot so I want to reap all of it's benefits.",
  "Lmaoo I found a guy who bought it and was really positive about it...I'll also be buying it once I am back from vacation but lemme know when you get it",
  "Hey man, How is the experience with this PC? any heating / battery issues?",
  "updates?",
  "hey can I get a quick review on it ? performance overall, heating and BATTERY LIFE. How is it?",
  "Screen quality, I ordered one, still havent picked it up, but have heard about it not being very color accurate or bright",
  "hello!! Thinking of buying it, what do u think of it now? I personally also need it for school :) Thanks in advance!",
  "Hmm hopefully its just your wifi, ive read it comes with a lot of bloatware sp maybe that? It does seem the best bang for buck especially for a 2 in 1.",
  "Ciao, anch’io volevo comprare questo modello quindi volevo sapere se ti ha dato problemi fino ad ora. Per il gaming com’è? Poi riguardo al riscaldamento e consumo batteria durante il gaming?",
  "Phew okay what a relief that its a good laptop, it was recommended to me by a best buy employee and yk how they be so i HOPED they where being honest, since I was initially going to get the Microsoft Surface 5. yea ill let yk fs🔥💪🏻",
  "Heyy im back i didnt get the ryzen one but i got the intel one, its a solid computer it can handle games, school work, its not heavy or light its okayy, pretty good for school. I didnt find myself using the folding too much other than for movies. Got any questions? I can prob answer them!!",
  "Yea that's what I also saw somewhere...which screen did you get oled or ips?",
  "[removed]",
  "Hellooo did you buy it?",
  "Yea lol it has amazing specs imo I just wanted some reviews and from that one person it seems to be doing well",
  "hows the battery backup? and heating  \n and do the fans get loud?",
  "how long have you had it for? is there any issues?",
  "Ips, got a really good deal for the specs but idk, might cancel and get a Dell XPS (2022) or M1 Mac air (8gb version)",
  "I personally don't mind the color accuracy, I personally don't edit photos or videos, it's just my work laptop, hell I don't even watch YouTube on it. \n\nSo what are my notes:\nGlass: fingerprint magnet, reflective, makes colors more vibrant\nScreen: too dim for outdoor use, perfect for class/work conditions but not great outside",
  "Looking at this same machine. How did it turn out?",
  "The battery is pretty good depends on what you have it doing obviously but if you are doing homework most of the time you‘ll be good. The fans dont get loud. There is different performance settings when I play games i usually set it high and its not really loud but you could hear it. Its good tbh. Keyboard is fine, screen is good, good computer for a uni student although i recommend you get a mouse just cuz, the pad isn’t bad i just Dont really like pads a lot.",
  "Ive had it for about 7 months",
  "I was thinking about macbook but it's not my thing so imma check out the dell xps as well",
  "[removed]",
  "Love it bro got it like a couple days ago and I am very satisfied",
  "[removed]",
  "Yea it's not mine either but price to performance wise it's a smart buy",
  "Yea fs",
  "[deleted]",
  "Thanks for the response!",
  "Yea it works well i suggest you to buy a type of stylus pen obviously, but yea its works good. Theres prob settings to make it better that I dont know of. But i dont really use it a lot.",
  "[removed]",
  "Hello! Can I ask if you bought it? Im also debating whether I should buy it rn. But a lot of people have been complaining about the battery aswell which I assume you've already seen considering that you're asking about it too lol and how it breaks in just a year or two :') , and how about games too?",
  "They seem fine. Idk about 5-10 years of use but they seem sturdy for now",
  "Laptop for Medical Research & Business Use – Lenovo Yoga 9 vs HP Omnibook Ultra Flip? Hey everyone,\n\nI’m a **medical doctor** looking for a laptop for business and research purposes. My usual workflow involves:\n\n* **Google Chrome with multiple tabs open** (research papers, surgical operation videos, etc.).\n* **RadiAnt DICOM viewer** with **3D rendering** for medical imaging.\n* **Multiple video players running at the same time** (for reviewing surgical procedures).\n* **Occasional movie watching** for downtime.\n\nI’m deciding between these two models:\n\n1. **Lenovo Yoga 9 14IHU9** : 14\" OLED 2.8K Touch, Core Ultra 7 155H, 32GB RAM, 1TB SSD, for **€1.799**  ([https://www.e-lenovo.gr/lenovo-yoga-9-14ihm9-2in1-touch-oled2-8k-coreultra-7-155h-32gb-ssd1tb-w11-pen-3y-premiumcare.html?ref=bestprice.gr](https://www.e-lenovo.gr/lenovo-yoga-9-14ihm9-2in1-touch-oled2-8k-coreultra-7-155h-32gb-ssd1tb-w11-pen-3y-premiumcare.html?ref=bestprice.gr))\n2. **HP Omnibook Ultra Flip 14** : 14\" Touch, Core Ultra 7 258V, 32GB RAM, 1TB SSD, for **€1.809**  ([https://www.eurosupplies.com.gr/ypologistes/laptops/laptop-hp-omnibook-ultra-flip-14-fh0001nv-14-inch-touch-u7-258v-32gb-1tb-ssd-arc-w11h-3y-b4zw9ea-104174/?utm\\_source=bestprice&ref=bestprice.gr&\\_\\_bpgid=MXBpM1Jkb21LSiYsJE0jczBeSldPVA==](https://www.eurosupplies.com.gr/ypologistes/laptops/laptop-hp-omnibook-ultra-flip-14-fh0001nv-14-inch-touch-u7-258v-32gb-1tb-ssd-arc-w11h-3y-b4zw9ea-104174/?utm_source=bestprice&ref=bestprice.gr&__bpgid=MXBpM1Jkb21LSiYsJE0jczBeSldPVA==))\n\nBoth seem powerful, but I’m looking for good thermal management, solid build quality, and reliable performance for multitasking. Battery life and a good display are also pluses.\n\nWhich one would you recommend for my use case? Any insights or alternative suggestions? Thanks!",
  "lenovo yoga 7/9 or hp envy/spectre i want to buy a laptop for uni\n\nthe specs:\n\n  \nAMD7 / ultra 7 processor\n\n1 TB storage\n\nI'm so concerned about the hinges, i want the laptop to last me for manyyy years.\n\nmy first option now is the lenovo yoga 7 , it's the lowest price in all and i think it's a decent laptop however I've seen reviews about the hinges and idk what to doo",
  "upppppppppp",
  "uppppppppppppppppppp",
  "?",
  "Which one would you choose? I had people telling me that Lenovo's not good , and the reviews for Asus show that some of these models have bad power buttons :( ",
  "I am using a tuf dash f15 and have experience with a lenovo legion they are and were both fine. However manufacturing defects occur and pruducts can sometimes go bad quicker than intended. I would go with the asus tuf here i like their branding and have good experiences with them but you‘ll be fine with the lenovo as well but i would choose the 4060 model definitely",
  "Ok, thx,  Asus tuf seems more reliable than Lenovo , from what everyone pointed out",
  "Not necessarily, i just personally have good experiences with asus stuff especially rog and tuf and less experience overall. So i would recommend the tuf because of that",
  " Which is better: Lenovo Legion 5i with intel i7 14650HX or Asus TUF Gaming A15 with Ryzen 9 8945H  https://preview.redd.it/5xoni41ommad1.png?width=906&format=png&auto=webp&s=a7d380d1e3481563378e423d5a06b97d45c2bb4b\n\nI am not sure whether to go with the i7 or the Ryzen 9. The price is roughly the same for both. Which of these is better, the Legion 5 with the intel i7 14650HX cpu or TUF A15 with the Ryzen 9 8945H cpu?\n\nTUF - RTX 4070 8GB GDDR6, 1655MHz\\* at140W (1605MHz Boost Clock+50MHz OC, 115W+25W Dynamic Boost)\n\nLegion - RTX 4070 8GB GDDR6 (140W), 2175MHz boost clock\n\nThis is what I got off the website regarding the gpus.",
  "Ryzen processors are much more efficient than Intel ones, meaning, for the same amount of power, they generally output more performance with less heat. That's why Intel is not that favored nowadays.\n\nThe Legion however, has a much better screen, with higher resolution and a superfast 240Hz refresh rate.\n\nIt would help mentioning the TGP of the 4070s here as well to determine which is more powerful.",
  "Legion",
  "Both have same 8GB 4070s from what I've seen",
  "TUF - RTX 4070 8GB GDDR6, 1655MHz\\* at140W (1605MHz Boost Clock+50MHz OC, 115W+25W Dynamic Boost)\n\nLegion - RTX 4070 8GB GDDR6 (140W), 2175MHz boost clock\n\nThis is what I got off the website",
  "is buying this laptop a good idea? Lenovo LOQ Gen 9 (15\" AMD 7th Gen) heres the link: [https://www.lenovo.com/gb/en/p/laptops/loq-laptops/lenovo-loq-15arp9/83jccto1wwgb1](https://www.lenovo.com/gb/en/p/laptops/loq-laptops/lenovo-loq-15arp9/83jccto1wwgb1)\n\n i've never bought a laptop before so im pretty nervous about getting the right one. i pretty much just wanna play vr games and use fl studio.\n\nthe fact that it's a 'new arrival' and so doesn't have any reviews just makes me a little nervous lol\n\nthanks for any feedback or advice!!!",
  "did you end up buying it? it does look like a good laptop; other LOQ models are just so good that they go out of stock everywhere, only difference with this one is its 105W TGP",
  "its great!! ive had it for about a month and a half and my only complaint is that the battery life is a bit ehhh, but i dont take it many places so its a non issue really. runs perfectly, plays games like Hitman WOA smoothly, as well as vr games. i reccomend it!!!",
  "how meh is the battery? could you test it with light usage in power saving mode?",
  "what's it like for fl studio? can it handle intense projects alright?",
  "Lenovo Yoga Book 9i Review 2024 - (13 Gen 9 Dual Screen 2-in-1) ",
  "Lenovo IdeaPad Slim 9 (withdrawn) Hello,\n\nI wanted to ask if this laptop would be a good purchase? \n\nFull name: Lenovo IdeaPad slim 9 14IT05\n\n\nSpecs:\n14\"\ni7 1165G7\n16 GB Ram\nIris Xe graphics\n512 GB SSD\n\nPrice - 250$ - pre-owned but in relatively good condition \n\nIt is NOT Lenovo Slim 9i.\nI can't find any data about its reviews online so if anyone can help that'd be awesome.\n\nThanks.",
  "ExitReview: Lenovo ThinkPad E495 lasted 1.9 years before it failed ",
  "Just got a new laptop (Lenovo Ideapad 5 Ryzen 4500u) for college, and fiqured I would write a mini review for it!  \n\n**Intro/Summary -** Hey everybody, today I will be reviewing the $650 14’ Lenovo Ideapad 5, with the new AMD Ryzen 4500u processor. I recently purchased this laptop as my full-time college laptop, and have been using it extensively for about a week now. At only 3 pounds, this laptop is easily portable for those who need it. Overall, I am very pleased with this laptop’s functionality and performance, especially considering the price. However, this does not come without a few quirks that a buyer should be aware of before purchasing.\n\n**Screen -** First I want to talk about what is in my opinion the most important part of a laptop for the average user: the screen. In budget laptops, manufacturers often cut corners in this regard, making cheap, low resolution, dim panels. Unlike that however, the $650 model that I purchased comes with a FHD 1920x1080p IPS panel with 300 nits of brightness. The IPS panel will be a blessing for anyone who has not had one before, as it has amazing view angles and little to no glare. While it’s 300 nits brightness is nothing to write home about, it is respectable. The color accuracy is where this screen lacks, at around 55% srgb color accuracy. This means that video editors and graphic designers should look elsewhere, but the average user/gamer should be fine. I will warn you though that it has a noticeable amount of backlight bleed, which may be a big turnoff for some people. However, it is nowhere near debilitating, and is easily overlooked considering the other positives behind this screen.\n\n**Keyboard/Touchpad -** While I do not consider myself very picky towards keyboards in general, in consideration with other reviews and comments made on this laptop, the keyboard is very good. In fact, some very reputable reviewers like Just Josh even said it is the best keyboard they own, up against $1400 laptops! It has a nice clicky feel and sound to it, almost like a mini mechanical keyboard. The layout is great, however if you like a dedicated numpad, you will have to get the 15’ model, as the 14’ model does not have it, as it saves space. The touchpad is hit or miss in my opinion, as I will always prefer to use a mouse over any touchpad. However, if you plan to use the touchpad primarily, it should do the job just fine, and be accurate with its’ Windows precision drivers.\n\n**Ports/Features -** When it comes to ports, this laptop has exactly what you should expect from a laptop of this size and price. 2x USB, USB C charging, HDMI, SD card reader, and a Headphone/Mic aux combo port. I would have liked to see a third USB, but if you need more you can always get a USB hub for your desk or on the go. The laptop also comes with a physical webcam switch for privacy, Fingerprint reader on the power button, Screen lip for ease of opening (yes you can open this laptop with one hand), and dual front facing speakers that aren’t anything special, but get the job done for daily tasks. For gaming, a headset will definitely be appreciated, as the speakers aren’t what you would want for games. It also comes with something that I now consider a must have in any laptop; a backlit keyboard. Once you have one, you can never go back. Even my “casual user” father who has recently just gotten a backlit keyboard says he is a lifesaver in the dark.\n\n**Internals -** Inside this laptop is where things get special, easily and quickly handling day to day tasks such as web browsing, college work, watching videos or writing emails. Equipped with a new 6core-6thread Ryzen 4000u series processor with integrated Vega 6 graphics (512mb Vram) and dual channel 8gb of ram, it has unbelievable power for the price. It can handle any game, albeit with some lower framerates and graphical sacrifices. Games like League of Legends can run 1080p higher graphics at 60+ fps, while games like Call of Duty and Apex will need to see low graphics 720p to have a “playable” framerate of \\~40fps. There is already extensive game benchmarking on youtube, so i will not be covering that in this video. Links in the description for channels that have done that. The Lenovo Ideapad 5 has the expected Wifi 6 card and Bluetooth 5.0. My model came with a 256gb ssd and 3 cell 57WH battery, that Lenovo says lasts up to 14 hours, although i would expect more of a 8 or 9 hour lifespan out of this laptop while doing basic tasks, and even less when gaming.\n\n**Fan Noise/Cooling -** Fan noise and cooling is perhaps the most underlooked part of this laptop. During average use, such as me writing this review, the fans do not even turn on, and the laptop is cool as can be. During gaming, the laptop fans kick on and off, keeping the CPU temperature at around \\~60C, which is shockingly cool, but still can cause some warmth on the keyboard deck. Part of these numbers comes from the stand I have for the laptop, but using it flat on a table should yield similar results. Like any laptop however, using it on a bed or soft surface is not good, as it will cover the vents and suffocate the internals, causing quicker deterioration of the laptop. \n\n**Conclusion -** In conclusion this laptop is stellar for the price, and truly revolutionizes what a consumer should expect from the budget laptop market. A reasonable screen, surprisingly good keyboard, features that even premium laptops can leave out, and shockingly powerful internal components, this laptop is worth every penny. If you are looking for a jack of all trades, professional looking laptop that can low-key handle gaming, the Lenovo Ideapad 5 with a Ryzen 4000u series processor is perfect for you. However, if you are a video editor, content creator, artist, or graphical designer, the poor color accuracy and backlight bleed mean you should look elsewhere for a more suitable laptop.",
  "It seems kind of strange that you would put in: \n“There is already extensive game benchmarking on YouTube, so I will not be covering that in this video.”\n\nDid you make a video about this too?",
  "Ahh I'm so excited to get mine! Should be arriving in a couple of weeks. I ordered a custom 15\" model from the lenovo website (in the UK). I was able to choose a 100% sRGB screen so I'm hoping that'll be good, colour is important to me because i'll probably use it for photoshop, but it won't be a big deal for most people. I also got 16GB of ram so it'll be a beast!\n\nThe price was INSANE for the specs. I was able to knock off about £100 by getting rid of Windows (I'll either use linux or just buy a cheap windows key), so it was only £450! A laptop with those specs would've been hundreds more at retail.",
  "i just got mine in the mail a couple of days ago. i was trying to put in a 2.5\" drive but I couldn't pry off the back panel. I saw a total of 7 screws but now wasn't so sure. did you bump into any problems taking the back off of your laptop?",
  "I was originally going to make a vid, but i fiqured itd be better just as text",
  "It's not available in the UK anymore! You're fortunate to have one on order. \n\nI was considering pulling the trigger on the Lenovo but now have no options for 4000u series machines outside of the HP Envy x360. The Swift 3 isn't available yet either.",
  "Ah. That makes sense.2",
  "Lenovo Yoga 710 14\" Review Video: [YouTube link](https://www.youtube.com/watch?v=Lnk4Jm7l6ds)\n\n**Intro**\n\nUnveiled at MWC in February, 2016, it comes in three screen sizes: 11 inch, 14 inch and 15  inch. The model I bought is the 14 inch variant. This seems to be a successor to the Yoga 700. Even though the specs of the 710 are very similar to the 700, the 700 is currently out of stock everywhere, so it seems Lenovo may have discontinued the 700 a bit prematurely.\n\n\n**Specs**\n\n * Intel (Skylake) 6th generation core i7-6500u processor @2.5 GHz (Turbo boost up to 3.10 GHz)\n * 8GB DDR4 RAM (upgradable)\n * 256GB M.2 SSD on a SATA III interface (upgradable)\n * An NVIDIA GeForce 940MX GPU\n * 14” 1080p touch IPS display\n * 802.11ac (upgradable)\n * Bluetooth 4.1 (upgradable)\n * JBL speakers\n\n\n**Ports**\n\nOn the left side we have a power jack, a charging indicator light, an SD card slot, a headphone/microphone combo jack, and a small pinhole for accessing the recovery mode.\nOn the right side there’s a power indicator light, the power button, a micro HDMI port and two USB 3.0 ports. The last USB port is an “always on” port that you can use to charge your phone even when the laptop is off.\nOn the front there’s nothing and on the back there are plenty of ventilation holes and really solid hinges.\n\n\n**Keyboard**\n\nThe keyboard has two levels of backlighting which isn’t very evident when the lights are on, so one doesn’t really need backlighting in a well-lit room, unlike some other laptops as the key lettering has very good contrast. It is very similar in feel to the MacBook Pro keyboard, with the only quirk being that the right \"Shift\" key is to the right of the arrow keys and is smaller in size. It would take a bit of time to get used to it though.\n\n\n**Trackpad**\n\nThe trackpad is good and recognizes gestures well for the most part. It’s not a glass trackpad unfortunately, but that’s by no means a deal breaker.\n\n\n**Built**\n\nDimensions\nInches: 12.68\" x 8.78\" x 0.68\"\nmm: 322 x 223 x 17.3\nWeight: 3.42 lb (1.55kg)\nBeing a Yoga machine, you can use it in the four \"modes\" that Lenovo calls: Laptop mode, presentation mode, tent mode and tablet mode. Yes, it is a bit heavy for one-handed use and one wouldn't use it like an iPad as a tablet but is quite comfortable in tablet mode when sitting on a couch. \nBecause the entire body is made of aluminium, there’s no flex on the keyboard, or rather anywhere on the laptop. There screen is pretty rigid even when I try really hard to flex it. Same thing goes for the body of the laptop, it’s really well built. It’s got chamfered edges all around, which gives a really premium feel to the laptop and makes it quite comfortable to use in the \"tablet mode\", unlike the HP Spectre X360 which has very sharp edges.\n\nThere’s lots of ventilation, with the intake at the bottom and the exhaust ports at the back, which do a great job of pushing the heat away from the user. Since there are vents even at the top edge, so they won’t get blocked no matter how you place the laptop.\nAnother benefit of the entire body being made of aluminium, is that it also acts as a heatsink, which further assists in keeping the machine cool. There are two fans inside that rarely kick in under light to moderate use and are very silent when the do kick in. The only time the machine gets hot is under extreme load, like when rendering a video in a video editor. Even then the palmrest area and the touchpad are very cool to the touch.\n\nThe two hinges are absolutely solid. They're sufficiently stiff so the screen also doesn’t wobble back and forth much when tapping on in.\n\n**Display**\n\nThe screen is a 14 inch full HD one. Being an IPS display, the viewing angles are great even from extreme angles with no apparent color shifting. It’s not a super sharp QHD one like on the Yoga 900, but the upside of having a 1080p display is that it required much less power, as fewer number of pixels means less power is required. It’s a perfectly sharp display from normal viewing distance of 1.5 to 2 feet from the screen. The brightness gets up to 300 nits and has adaptive lighting which isn’t intrusive at all and can be easily disabled if needed. It supports 10-point multi touch and gestures like pinch to zoom work great. The bezels are super slim, almost like the InfinityEdge display on the Dell XPS 13 and 15. As a bonus, the 720p webcam is placed in the right position (the centre top of the screen). Opening the screen is definitely a two-handed affair as the screen is held down by what seems to be some very strong magnets. For connecting an external display, the micro HDMI port supports 4K displays.\n\n\n**Speakers**\n\nThe JBL branded speakers are downward firing and are decent enough to fill up a 16x12 feet room with sound. They don’t have much in the name of bass though (compared to my old machine: a 2011 Dell XPS L502X). It also comes with Dolby surround software and it does a surprisingly good job of making a virtual surround effect. I didn’t know about this and I kept getting up to look out the window wondering where certain sounds were coming from when I would be watching videos.\n\n\n**Battery life**\n\nThe battery life is really good for the Yoga 710. It comes with a 53 WHr battery. With the screen brightness set at 60% it lasts for over 9 hours with light web browsing (6-8 tabs open), some MS Office work and a few YouTube videos.\nIt has a “express charging” mode that you can enable which charges the battery almost 30% faster than normal. The charger is small and lightweight, making it easy to carry around in a backpack. I wish they would have retained the USB charging port from the Yoga 700 though.\n\n\n**Shortcomings**\n\n* No USB Type-C\n* No full-sized HDMI port\n* Only two USB ports\n* Small right \"Shift\" key\n\n\n**Price**\n\nIt retails for $799 in the US ($899 for i7) and Rs 85,000 in India at launch, which I feel makes it great value for money. \nWhere I live, the lower-spec Yoga 900 retails for $1850 (due to import duties), making it prohibitively expensive. I got the Yoga 710 for $1300 (which is the actual price for the Yoga 900) but I'm still happy with the purchase.\n\nPlease let me know if there are any questions you may have, I'll be glad to answer them.",
  "How's the SSD? Noticed it's only SATA. Also, how upgradable do you mean when you say the BT, SSD and wifi are?",
  "Where did you buy this? I've been looking everywhere for the model that has the nvida and have been unsuccessful. \n\nDoes it have pen support? Also, how well do you think this will fare with video editing?  I'm a film student.",
  "Thanks for the great review! Im wondering if yoga 710 would have such a  **huge** difference without dedicated graphics card? Im not that needy for games, just like to play world of warcraft time by time. What's your thoughts on it? ",
  "Hey man, you still got the laptop? I've had it for a few months now and I really dont like the build quality. Whenever I lift it or generally move it with one hand, or simply move the position of the screen it makes these cheap \"creaking\" noices (sort of similar to when you walk on old wooden floor , just quicker kinda). Like something you would expect out of a cheap plastic laptop. If I lift it up and \"wiggle it\" it makes these small sounds, and if I press the edge on the bottom of the keyboard/touchpad I can clearly hear and even feel it \"depress\" slightly, the metal clearly moves and is not really that stuck and solid. \n\nI love the laptop overall, but the build quality at times worries me. ",
  "The SSD is manufactured by Hynix, and all Lenovo laptops seem to have this manufacturer's components in them. Although I haven't run any benchmarks on it yet, but it seems to be at par or sometimes a bit faster than the Samsung 850 EVO I have in a separate machine, if that comparison helps. It can be easily swapped out as there's just a single screw holding it (as with all M.2 form factor SSDs). The BT and WiFi are on a single Broadcom chip and can easily be replaced as there are just the two cables and a screw holding it in place on the motherboard. I haven't had any issues with the signal and it seems to be doing a better job than the Intel wireless chip I have in my old laptop. The RAM is protected by an electromagnetic shield, which too can be removed by a couple of screws, giving access to the single DIMM memory, which I believe can be increased to a maximum of 16GB. Even the battery replacement (after some years) is extremely easy. I have opened up a fair number of laptops from various manufacturers in the past and this one scores very high on the reparability/replacement factor.",
  "I bought it from India from a lenovo retail store. I hope it becomes available from the website as well or you could try Amazon/Best Buy. \nI haven't been able to test it with any pen input, but since it doesn't come with a digitizer, I'm assuming that it won't really support any pen input, apart from the usual capacitive ones. \nIf portability is your main concern, then this laptop is fantastic, but then it's not a workstation laptop. For film editing, I suppose you could use it, but it's not the same as a dedicated desktop. I used DaVinci for editing a video and I had the free version, so it was a bit slow. I suppose rendering could be improved if I used a better software. But if your primary purpose is film editing, then I highly recommend that you wait a few days (if you can) and get a MacBook Pro. It really flies for video editing. But for all other purposes, I'd prefer a Windows machine. I hope this helps and really sorry for such a late reply.",
  "Thank you so much, I really appreciate it! For light gaming like WoW, I think the on board graphics would definitely suffice and it's not necessary to have a dedicated GPU. On the plus side, you might even get better battery life! ",
  "Hey there! I agree that it must feel really bad to see such issues coming up in such a new machine. I recently went with a friend to purchase the same laptop. When the sales rep opened up the box and started the machine, I could clearly see that there was a huge gap in the chassis, where the keyboard deck and the bottom plate meet. We refused to purchase that particular piece and walked out empty handed. Reading your experience and seeing what my friend almost bought, I consider myself lucky that I'm not facing any such issues. I'm frequently asked if I'm facing an issue with the fan being constantly running even at idle, but that too doesn't happen. Are you facing this particular issue too? \nHappy new year! ",
  "Dude every single thread I read about this laptop there you are, saying the same thing over and over and over again. Get over it. Move on with your life, jesus. ",
  "Thanks for the detailed reply! I think I'll get this whenever I save up enough.",
  "Happy new year to you too! Damn, glad to hear your friend was able to check the laptop before you purchased it! Seems like Lenovos quality control is extremely tacky. \n\nI sorta want to try to get my money back, but I guess the sales rep won't see my issues, especially not in a busy store with a lot of sound so they won't be able to hear the noises anyway. I mean, it really ain't something \"wrong\" as in the product still works, but it is annoying and obvsiouly a fault at production. The problem with getting my money back is that there is no other laptop in that price range that is as good as the 710 has potential to be.  I live the look, size, feel and speed of the 710. Too bad the build quality isn't as good as it should be. Do you not hear any noises at all if you lift your laptop with the corner and shake it a little or when having the screen in one position for awhile and then changing the position of the screen? \n\n\nAnd yes, while I do not have the fan issue was extreme as others, it does turn on fairly quickly even when doing non-intensive tasks. Seems like my laptop also almost always uses at least 50% of the RAM too. \n\n\n",
  "I'm trying to figure of of my unit is faulty or if it simply is badly built. When I pay 1200 dollar for a laptop I don't expect it to have these problems, and need to find out of others have experienced the same. ",
  "Any time! Cheers! ",
  "First Lenovo Ideapad S540 review - Less than 1000€, good gaming perfs, premium looks, 12h battery The first review for the Ideapad S540, which is a laptop that i'm monitoring closely, just dropped [on a Netherlands website](https://tweakers.net/reviews/7260/5/lenovo-ideapad-s540-goedkoopste-gtx-1650-laptop-doet-veel-goed-conclusie.html).\n\nHere's a quick translation i made using DeepL, TL;DR, it's a very good machine.\n\n**Pros :**\n\n- sleek premium design\n\n- great value for money\n\n- solid gaming performance\n\n- insane battery life\n\n**Cons :**\n\n- 4 GB of soldered RAM on all models. Unfortunately limits upgrade potential to a total of 20GB if you replace the second 4GB stick with a 16GB. \n\n**Specs**\n\nHere are the specs for the reviewed unit. **Keep it mind that this is the cheapest configuration, at €799**. It can be upgraded with up to 12GB RAM, a Core i7, and a 1TB SSD.\n\nScreen : 15.6\" FullHD\n\nCPU : Intel Core i5-8265U\n\nGPU : Intel UHD 620 // Nvidia GTX 1650 Max-Q\n\nRAM : 4GB DDR4 soldered + 4GB DDR4\n\nStorage : 256 GB SSD\n\n**Build Quality** : fully made of aluminum, sturdy and premium-looking. Weights around 1.9 kg. Good touchpad and keyboard, there's a fingerprint sensor and a webcam shutter.\n\n**Screen :** 1080p, good quality, very good colors, average brightness (not doing too great outdoors).\n\n**Performance** : Here are the [CPU benchmarks](https://tweakers.net/reviews/7260/2/lenovo-ideapad-s540-goedkoopste-gtx-1650-laptop-doet-veel-goed-specificaties-en-cpu-benchmarks.html) and [gaming benchmarks](https://tweakers.net/reviews/7260/3/lenovo-ideapad-s540-goedkoopste-gtx-1650-laptop-doet-veel-goed-gpu-benchmarks-en-games.html). Performance is generally around the level of the MSI PS63 modern or the Dell XPS15. In game the difference with a \"normal\" GTX1650 is negligible. Reaches 45 FPS in Rise of the Tomb Raider on Ultra Settings, 70 FPS on medium. \n\n**Battery Life :** 70wh battery. Battery tests show results of 12.5 hours of battery life in a web browsing test, and 3.5 hours in the PCMark 8 benchmark (emulates video editing or light gaming). \n\n**Conclusion :** this laptop looks like an amazing product for uni students, interns or young professionals that want a laptop that can be used both in a professional environment and a solid gaming machine if you're willing to either play most recent games below 60 FPS or crank the settings down to high or medium.\n\nThe only drawback i see is the soldered RAM, but is having more than 20GB so important when looking at the rest of the specs ? 256gb of storage is pretty low on the entry model, so i'd rather advise looking at the 512gb and 1tb units.\n\nNow lenovo, get a move on and release this thing in all countries before the end of summer, pretty please ?",
  "Would you recommend upgrading the ram to 20gb or just stay at 8gb?",
  "Do you know if they deliver outside of the Netherlands?",
  "Hi! Thanks for your review. I read that the fan-noise is very high-pitched. Can you confirm this/does it bother you?",
  "Depends on your use, I'd say test out 8gb and upgrade when you feel you need more ?",
  "dunno. The website being only available in dutch really doesn't help. Keyboard layout may be messed up too.",
  "Should I buy this laptop Ive been looking for laptops for a month now and I found This laptop at Costco I was wondering if it is worth it or I should buy another one this is mainly for college and light gaming like Minecraft and some emulators. This deal goes up on Black Friday it seems really good I’m just not sure. ",
  "The hinges are always an issue on these 360 laptop tablets. I personally don't bother with these unless it is a Framework, because repairs will be a nightmare.",
  "No, and you can find WAY better deal online.",
  "No.",
  "No",
  "Ideapad’s power button is prone to break",
  "which one? you can't just post a picture showing several laptops and make little note of which one you're referring to!",
  "You shouldnt even open printed stuff these days.",
  "Definitely NO",
  "Why is everyone saying no? This is a REALLY good laptop, and absolutely worth the price.",
  "Nope",
  "Try finding a refurb latitude with an 11th gen i5/i7 or later. No reason for an IdeaPad to be the same price as a ThinkPad. Avoid anything with AMD or an intel 10th gen or below.",
  "Don’t buy Lenovo, it is trash. Buy HP",
  "I’m sorry for confusion. It’s the Lenovo IdeaPad 5i  It’s the second picture. I’m sorry.",
  "Thank you 🙏 I was really second guessing myself",
  "Because IdeaPad sucks and will break from planned obsolescence just like any other laptop on there",
  "Really good for someone who fixes laptops and will charge you half the price of the laptop itself",
  "3/10 ragebait",
  "Some Lenovo are bad, more hp are bad",
  "Terrible battery removal vs hinge problems",
  "nah you're good, just a bit confusing is all. \n\nAs for your question, the specs on paper seem to be good, but $800 for ANY ideapad is a terrible deal imo, especially with the reputation that they have. This thing might have really good specs, and if you want a laptop that will work fine short term, ig the specs are worth it, but this laptop is not gonna reliably last 3 years with hinge mounts that look like [this](https://download.lenovo.com/Images/Parts/5CB1S05128/5CB1S05128_B.jpg) i'd imagine.",
  "How come between all of the people who say no and this one person who says yes, you go with the yes? Were you just waiting for one person to affirm your want? Genuine question. I’m not judging or trolling, I just want to understand.",
  "Well, go second guess again because, it's not good. You can Get a laptop with a rtx4050 or rtx5050 for that price and do much more than some 'light gaming'",
  "Yeah and basically any new laptop will. Only option left for OP is to buy a used ThinkPad",
  "Goes for any new laptop",
  "I had two Lenovo, both failed within 2 months cannot turned on, thanks to Costco’s return policy, bought two HP no issues",
  "I had battery and keyboard issue with my dell, neither hp has battery nor hinge issue",
  "Im not sure if I responded already to you but I would like to say you’re right I think I was looking for validation since I was so tried of looking but the your comment and the rest of the comments showed me I need to continue looking and I need to except other people’s options",
  "but in a bad formfactor with shit battery life",
  "Or MacBook Air which should last 5-6 years",
  "Don't buy consumer class then",
  "Thank you for your answer. I don’t know anything about buying a laptop. I hope you find what you need and want for a great price 🙂",
  "Expensive",
  "Do macbooks have ports that don't scream android?",
  "What kind industrial grade laptop u use?",
  "MacBook air M4 was 750 on Amazon a few days ago. Brand new",
  "It is limited in ports but if what you want durability, MacBook Air is all metal built.",
  "Thinkpad, latitude, elitebook",
  "8GB RAM and 256GB storage, all obviously soldered. This is shit and not comparable to 32GB and 1TB.",
  "One of mine was latitude and other one was yoga. I won’t trust it anymore",
  "16 gig ram for 750. You can sell the MacBook in a couple of years for 500ish, you will trash the IdeaPad after the hinges break...",
  "So I should get a think pad what’s the difference between the ideapad and the think pad",
  "I avoid Lenovo entirely. I had two vaio, two Lenovo, one acer, two dell and currently using two hp and two dell. Dell is ok, I replaced one battery and other one with keyboard. So far hp is the best brand. I am thinking to get a ASUS or hp gaming laptop this black Friday",
  "So I should get an hp? If you wouldn’t mind could you recommend me one",
  "Lenovo thinkpad E470 review! Just got this stunner of a thinkpad for $1000 CAD! Had for about a month so I decided to write a review as there are not many online.\n\n\n\nSPECS:\n\n\n-i7-7500U processor (3.4GHz turbo) with Intel 620 graphics\n\n\n-Geforce 940MX GPU (2GB DDR3)\n\n\n-8GB RAM (DDR4)\n\n\n-256GB OPAL2 compatible SSD\n\n\n-Intel 8264AC Wifi card\n\n\n-14 inch 1920x1080 IPS display (matte)\n\n\nI found this system to be quite nippy and responsive. I didn't expect Crysis at 60FPS ultra 1080p. Nor did I expect 75 degrees average temps in heavy loads! Cooling was good enough for me to overclock by a touch and still got 77 degree temps on average.\n\n\nCPU and GPU is enough for any light game at 1080p and medium settings. Harder games require lower resolution but still playable. Games like rocket league and CS:GO run well enough for casual play. Don't expect much, but its much better than integrated graphics by a long shot.\n\n\n\nBUILD QUALITY\n\n\nThe reason I bought Lenovo, the EPIC build quality. This is a $600 CAD laptop that is specced out, but still the same chassis as the $600 model...\n\n\nIts remarkable. Almost NO flex on the chassis and keyboard are. Absolutely no flex if you don't deliberately look for it. Low screen flex and a solid hinge make this feel premium, even though it is an entry-level model. \n\n\nKeyboard is a legend... No words can express how good this feels to type with. I got my blackwidow TE sitting in front of me, for my desktop PC. Yet I'm writing this review on the E470... Its good travel mixed with tactile feel, low/no flex... Words can't describe the feeling but my 101 WPM average on typeracer can!\n\n\nTHE LAYOUT! Worried about some weird layouts and key locations, there is none of that. The keys are FULLY spaced, no tiny keys on this keyboard. Big arrow keys with dedicated page up/down keys make navigation a breeze...\n\n\nSPEAKING of navigation, the trackpoint is on point here... Sorry for puns but the trackpoint is good for quick navigation in word files or browsers. I use it extensively in place of a mouse for coding and enjoy how seamless it really is. Accuracy and speed are good, although practice is needed. The buttons underneath is unothadox but loved. Kinda mushy buttons on the touchpad but deep travel and no wobble. The position is great for typing long series of text (Like this review)\n\n\nThe touchpad is good, not great but not bad. It kinda skips to the side if i click occasionally but gestures and scrolling are on point. The clicks get stiffer the higher up you get, annoying but standard. The size is decent but could be taller and wider. The palm rejection is good, but rarely is needed due to its smaller size. \n\n\nThe screen is good. Solid resolution of 1080p. Bright enough with matte display for outdoor use. Colors are a little weak but if you are not a hardcore designer or photoshop warrior, it won't be noticed. Scaling is bad out of the box and needed a couple minutes to get right. Overall not bad for the price.\n\n\nIO is also decent. Learn from this thing apple! 3 USB ports (1 always on 3.0, 1 3.0 and 1 2.0), HDMI (1.4), ethernet, combo jack and SD card reader. Good enough for a screen (also the graphics card helps as you can actually use external high res screens), a mouse (though trackpoint is good), external hard drive/USB. Power input is solid, does not take much force to pull out and the brick is pretty small. Charges VERY quickly, perfect for those on the go!\n\n\nSpeakers are good, a little lacking in bass but enough for watching youtube videos and movies. The indluded dolby audio system is quite capable of sounding great, requirigng no manual tuning.\n\n\n \nBATTERY LIFE/POWER\n\n\nI tweaked many settings around until I got the perfect configuration. Standard battery life is about 8 hours doing web stuff with no GPU, WiFi on, bluetooth on and about 60% brightness. With full load, battery is about 2 hours. Not bad at all! With undervolting and underclocking, I can manage 9 and a half hours of general use. When gaming the system overclocks to about 3.4GHz with NO thermal throttling, GPU is a toasty 80 degrees. \n\n\nNoise is pretty quite. On normal web usage, I hear nothing. SSD also helps this sound like a stealth fighter. When gaming, if you have a headset on, you won't hear this at all. There is only one cooling fan... It gets a little loud. Heat is not bad with 75-degree averages when under loads. The surface is warm but never too hot to touch. \n\n\n\nSOFTWARE\n\n\nHappy to report not much bloatware. Macafee trail run(BOOO!) can be removed easy. The included Lenovo apps SHOULD count as bloatware... But are actually quite useful! \n\n\nTL;DR: Great build quality, specs and value for the price. Lack of Thunderbold 3/Type C is a big con for many. The fit and finish is above and beyond expectations. The keyboard alone would be a selling point. Decent battery life. Decent screen. ",
  "Nice review!\n\nWhere did you purchase this in Canada? Was it through their official site?\n\nI've been looking for a performance laptop with *matte* screen for quite some time. Will check this out further",
  "The configuration options are amazing\n\nIt looks like you can easily slide the back cover off and replace your own hard drive and ram - should provide some cost savings\n\nI'm thinking of\n\nIntel Core i5-7200U Processor +$110  \n14.0 FHD (1920x1080) IPS Non-Touch +$55  \nIntel Dual Band Wireless +$20 (hopefully better for Linux)  \n\n$636.48\n\nWill add my own SSD and memory. That's seriously not bad at all. Hope I'm not missing anything here",
  "Yes, from Lenovo Canada's website. Check out this forum post\n\nhttps://www.reddit.com/r/laptops/comments/5bz1bi/buying_help_for_those_looking_to_lenovo/",
  "Nope, you nailed it. Also has VERY solid build quality for the price and the screen is decent as well. For me it has a 940MX standard, so there is a huge boost to performance",
  "Wow they still work\n\nThis is some sort of leaked company code? Will give it a shot",
  "Thanks for the help. When I configure the 470 I don't see 940MX as an upgrade option?\n\nEdit: oh the upgrade to i7 includes the 940MX wow",
  "Not leaked ;) Got a buddy who works for Lenovo and this is more of a publicity and reputation all thing. Good rep for the company and they still turn a profit. I think the E470 costs like $300 to make or something around that",
  "Yep! It is about twice as fast as the closest IGPU and be activated or deactivated on the fly for battery life or performance",
  "Lenovo yoga pro 9i Aura Edition (Tandem Oled) They just released it, and it looks stunning with its Tandem OLED display, 1,600 nits peak brightness, Ultra 9 285H processor, RTX 5070, and up to 64GB of RAM. It’s like a dream Windows machine.\n\nHowever, why are they still not using anti-reflective coating on their laptops? It doesn’t seem like there will be a matte option for this one either. They claim it's designed for bright environments, but if you're working with a dark-themed interface, the glossy display turns into a mirror.\n\nApple offers a nano-texture option on the MacBook Pro, even though their standard glass already has an anti-reflective coating. Their mini-LED panel is also incredibly bright, yet they acknowledge glare as an issue—just like Lenovo, which provides matte displays on many of its laptops.\n\nSo why isn’t this laptop following the same standard?\n\n",
  "Cuz antireflective coating looks like ass",
  "Just ordered one. Delivery expected in early August though. I am in Canada.",
  "I can’t find it online. Do they have a release date yet?",
  "Any idea when this might be available?",
  "this tandem oled panel seems to be in 2025 legions too right?  too bad they arent as cute as zephyrus and razer (which still use old panel lol?)",
  "Will there be a 14\" version ?",
  "How much power does the gpu have?",
  "The new tandem model is now listed on the Australian Lenovo website. The \"basic model\" has a price tag of AU$3,999 ( Intel® Core™ Ultra 7 255H Processor and 2.8k 120Hz OLED). If you want the 3.2K Tandem OLED then it only comes wih the Intel® Core™ Ultra 9 285H Processor which is an AU$800 additional cost over the Ultra 7 255H.\n\nSo if you really want the tandem OLED display it is AU$5,400 which is an additional AU$1400 just to get the tandem display.\n\n[https://www.lenovo.com/au/en/configurator/cto/index.html?bundleId=83L0CTO1WWAU1](https://www.lenovo.com/au/en/configurator/cto/index.html?bundleId=83L0CTO1WWAU1)",
  "Regarding anti-reflective coating, both the touchscreen models of 2.8K and 3.2K OLED displays ARE anti-reflective. The other two non-touch models are not.\n\nIf you want a glossy screen on a laptop, it is always worth going for a touchscreen model because the anti-fingerprint layer also has built in anti-glossy + anti-scratch resistant feature.\n\nAlso, tandem OLED on Lenovo laptops is absolutely stunning in person.",
  "I could not agree more.  The Dell XPS, starting with 7590 (that I know of) has one of the best OLED anti-reflective treatment.  The recent HP Spectres use the Corning Gorilla DX, which is an anti-reflective variant.  The difference is night and day.  It helps the OLED display work much better and reduce the mirror effect.  \n\nIndeed, the Galaxy Book5 Pro has it too, but the specs are not up to par.  If in fact the Yoga Pro 9i with tandem/touch is like a mirror, that would be a real shame.  I do not know why manufacturers are not including anti-reflective glass.  I'd gladly pay more for it and do not buy computers that don't have it due to my use case.",
  "Hello, I'm torn between the Yoga 7 Pro with an integrated GPU, Ultra 9 185h, and Ryzen 9 Ai 365, and the Yoga 9 Pro with an i7 13705h and discrete GPU, RTX 4050. I won't be gaming much; I'll be using programs like Autodesk, Matlab, and Unity. Which one do you think I should choose?",
  "Did you check galaxy book",
  "On the contrary, they look much better when there is any sign of reflection.  They actually make the computer usable.  I've compared my many OLED laptops side-by-side.  Those with anti-reflective treatment, like the ones with Gorilla DX glass, simply look superior.",
  "🎉",
  "Im thinking about it.  Has everything I want and coupon codes too :)",
  "Yes they are launching in June globally except north america",
  "The earliest will be June if you are not from North America.",
  "I have not read about any other laptop using this panel and reaching this much brightness. Dell has a tandem oled but they have capped the brightness to 400-500 nits. Lenovo might cap at 700 nits or maybe fully unlock upto 1000 nits. Battery life is a concern with high brightness.",
  "Not at all. 14 inches are other variants. You can check them [here](https://news.lenovo.com/pressroom/press-releases/expanding-boundaries-ai-powered-creativity-productivity-and-innovation/)",
  "The specs are totally not out yet.",
  "No matte options wow",
  "hella expensive man",
  "I am very sure touchscreen models have no anti-reflective coating. Matte option is available in non touch model.",
  "I'll know in a few days, but nowhere was I able to find in the specs that the tandem touchscreen is anti-reflective.  I have had several touch OLEDs that do not have anti-reflective.  Their specs show all four display variants use the Dragontrail Glass, which in default format has no anti-reflective.\n\nAre you saying that you have/have seen the tandem touch and compared to a non touch version and the touch obviously has anti-reflective treatment?",
  "the best is I believe is integration of anti-reflective displays in supply chain is still an issue and of course cost is a factor.",
  "Yea Galaxy Books come standard with anti reflective coating and they look amazing.",
  "How much discount per your coupon?",
  "when will north America get ?",
  "And later in the US?",
  "Check the new lenovo legions and in descrivtion it says pure sight true black 1000 so it should be the same tandem oled but nobody speak about it ?",
  "Hi Ok-Algae4024\n\nI was expecting around AU$4,000 which is not unreasonable for a Macbook Pro competitor. However, for my applications the Ultra 9 285H processor is overkill. In fact, the Ultra 7 255H is more than I need. Unfortunately, they have \"bundled\" an $800 extra (Ultra 9 285H) if you want to get the 3.2K Tandem OLED display. I will wait for the reviews WHERE ARE THEY! before I decide if the Tandem OLED is really worth the extra $1,400.",
  "It does. I have the laptop, Yoga 7 16 but with the same OLED touch.",
  "I don't kow about non-touch tandem oled on the Yogas specifically, but I've used several non-touch regular OLED laptops from Lenovo and Asus before which had no coatings. The yoga pro's reduction in reflection is about 40% as effective as a typical Macbook's LCD display. So not quite on the level of a really high-end glossy monitor.",
  "I think it's their patented tech and Lenovo would rather just give an option of matte display than integrating that tech into their supply chain.",
  "Pretty sure june. It's already listed on best buy. As usual, north america will not get the 5070 and 64gb ram variant.",
  "Yes for North America it is scheduled to be launched in the second half of the year.",
  "I don't know where you are getting that info from.",
  "Are there any other windows laptops that are considered MacBook Pro competitors - and out of interest, what makes this model to be one?\n\nI could see details on the Lenovo site about a haptic trackpad etc.",
  "Can you post a review",
  "Hi tinybn\n\nI cannot find a Yoga Pro 7  16 with a tandem OLED display on the Lenovo (US) website. The only model advertised with an Tandem OLED display is the Yoga Pro 9 16 (Part Number 83L0CTO1WWUS1).\n\nCould you please supply a link to the Yoga Pro 7 16 which has the Tandem OLED display.",
  "I just got the Yoga Pro 9i Aura with tandem OLED and touch options.  It is a mirror--just as, if not more reflective than my other most reflective OLED laptop.  Putting it next to a Spectre 16 with Corning Gorilla DX, it is night and day.  The Spectre, though still has some reflection, is very subdued.  The Yoga shows my face and every light source behind me.  Again, this is with tandem and touch.  From my view, there is no anti-reflective treatment whatsoever.  U.S. model.",
  "Per their specs, Lenovo uses the Dragontrail glass, which has an anti-reflective variant.  Corning Gorilla DX would have been another option.",
  "It's not patented, Samsung uses Corning DX. Its basically brands cheaping out by not going for Corning DX. Corning also has DX+. This tech has been available for YEARS.",
  "oh okay cool",
  "[deleted]",
  "Are you sure? The articles I see online say March or Q2 2025?",
  "swear i've seen true black 1000 but now when i check it says true black 600, 500 nits brighnrss\n\nlmao. XD",
  "I really like it. I specifically wanted the Tandem OLED and it's great for watching HDR content after calibration. And unlike the Yoga Pro 9i which has 275H, the Yoga 7 has a 17watt low-power CPU that gives it much longer battery life. I get 8-9 hours browing multiple tabs. \n\nMy only gripe is 4 key rollover across Lenovo yoga series. 120Hz and Intel ARC grapgics are all great for playing high FPS games, except the keyboard doesn't register multiple presses very well.",
  "I am from Europe. In the US, the same display should be available on select models of Ideapad 5 Pro laptop.",
  "[https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb4#tech\\_specs](https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb4#tech_specs)\n\n  \nUK website",
  "Was is bad enough to return it ?",
  "https://www.bestbuy.com/site/lenovo-yoga-pro-9i-16-3-2k-oled-touchscreen-laptop-intel-core-ultra-9-processor-nvidia-geforce-rtx-5060-32gb-ram-1tb-luna-grey/6617152.p?skuId=6617152",
  "[official press release ](https://news.lenovo.com/pressroom/press-releases/expanding-boundaries-ai-powered-creativity-productivity-and-innovation/)",
  "I mean can you make a video about reflectivity and post it on subreddit if it's not too much of a hassle for you.",
  "It was for me. Huge difference from my Spectre and XPS. I really liked the tandem OLED but not enough to offset the mirror.",
  "Nice find!",
  "FYI - The press release says \"Glass / Matte\" for the Pro 9i\n\nHope it's true... Though I've never heard of a matte OLED... have you?",
  "Yeah my thoughts exactly, thanks a lot for inside.  2024 mini led isnt bad at all and I picked it over G16 but its still  pretty much useless outside even at full brightness so tandem or not tandem if it acts like a mirror  its not worth the hassle.",
  "ThinkPads have matte oled and mini led laptops are matte too. This tandom oled is gonna be matte too. Yeaa!",
  "Expect all the options outside of US. Inside US probably just garbage base configurations lol, that's the way it goes with Lenovo.",
  "It's a shame because the panel is beautiful. I do not understand why manufacturers are not using anti reflective glass. Lenovo has anti reflective on some thinkpads so obviously they see the value in it.",
  "ohh really? which ThinkPad exactly?",
  "haha I've noticed that in my worldwide hunt for my perfect spec! \n\nWhich country do you think gets the most options & has the best pricing?\n\nPS - for some reason i seem to see a lot of Pro 9i users from Norway!?",
  "X1 carbon gen 13 aura edition",
  "Need a laptop for returning to school I have a few options but really just need help deciding which one. I don't need anything fancy, just need something for online courses and communicating with professors and peers. Really have no idea which to choose out of the ones pictured. All are within my price range. Please help!",
  "From these second one no contest",
  "Easy, AMD HP - if you're only looking at those 3. You want to avoid Celeron and anything aside from an SSD for your drive. Anything running on a memory card, or hard drive, is usually low quality",
  "If you have to have one of these three the second one is best, stay away from Chromebooks due to application compatibility and RUN away from intel Celerons. I do, however, recommend continuing to shop or spend a little more and get something better.",
  "If you are going to get that. May I recommend this?\nhttps://www.bestbuy.com/site/sku/6549066.p?skuId=6549066\nA little more and you get much faster laptop, fast ssd and more capacity, replaceable ram\nNice ips display. Also touchscreen. Comes with windows 11, It is not 2in1 but I think you get lot more nice features at similar price range",
  "I guess the 17inch Ryzen system. But this is like choosing who’s the best QB on the NY Jets. 17 inch is a back breaker but the other ones are slow.",
  "Avoid celeron and pentiums from intel get a ssd and at least 8gb of ram",
  "It (Chromebook flex) does look good. I did see at Walmart USA has an Acer 315 Chromebook at 199. It looked extremely nice re screen and keyboard.\n\nThey had an Acer Aspire 3 with Intel i5 12 Gen for $400 too.",
  "Definitely don't take Lenovo flex. I had a flex 4 and it has the worst build quality ever. Things started breaking apart under an year",
  "Really depends on what you’re doing. But I would recommend the HP Ryzen, the Ryzen CPU is my favorite and bang for your buck.",
  "Hp 100% - 8gb RAM, AMD ( normal cpu instead of celeron ) and Vega graphics, that is better that Intel HD",
  "Good thing to keep in mind when getting laptops is never consider laptops with pentium or Celeron processors",
  "At this price you can get yourself an excellent used Lenovo thinkpad like the T470, it’s the vest vaue for money you can get at this price range",
  "Number 2  shits on 1 and 3 any day def get it",
  "2nd one absolutely for just school work/light work",
  "Second one without a doubt. It has the best processor and has Windows instead of ChromeOS with what you can do a lot more stuff with than ChromeOS.",
  "If you can, consider getting a refurbished ThinkPad T480/T480s off eBay or Amazon, for example. They are buisness laptops and far more powerful than any of these, plus will have much better keyboards, can be upgraded fairly easily, and will have far better build quality.\n\nThe Chromebooks are very limited and have not great hardware. The HP is not good quality, however has a decent CPU.\n\nPlease avoid all 3 if you can, however if you *must* choose from these 3, then the HP will likely be your best bet.",
  "https://progamerstech.com/product/asus-vivobook-15-laptop-15-6-fhd-1920-x-1080-display-intel-core-i3-1215u-cpu-intel-uhd-graphics-8gb-ram-128gb-ssd-windows-11-home-in-s-mode-quiet-blue-f1504za-as34-2/\n\nAvoid those 3, This is much better",
  "The hp windows, chromebooks are actually terrible and arent worth what theyre sold for",
  "youre not experienced, just ask more friends with help or youre chosen wrong laptops",
  "A Chromebook? No. My 6 year old school laptop will outperform 1 and 3 and it performs terribly. For 2, 8GB of RAM is OK but is becoming obsolete (even for lightweight use) as the years progress. I would recommend splurging a little and getting at least 16GB of RAM if you want it to last more than a couple years. Your price range, even though you're in college, is not quite sufficient in the year 2023.",
  "Emmc is garbage tier",
  "one on the left and right is ewaste, avoid, useless garbage. middle is good budget option",
  "Chromebooks don't deserve to be called laptops",
  "From these, the HP with the Ryzen processor. Avoid chrombooks like the plague for schoolwork. Also, the storage is significantly better and much more worth it",
  "Hp",
  "Hp eyes closed",
  "Please stay away from Chromebooks. Speaking from experience. Grab yourself a nice Windows laptop, such as the second picture",
  "#2. by a long shot",
  "Can you spend a bit more non of these are great number 2 is the least worst one. Look for a machine with attest a core i3 or ryzen 5 ideally a core i5 or ryzen 5, for intel core no older than 12th gen  and amd ryzen no older than 5000 series, 8gbs of ram and if you can 16gbs and 256gb of storage and a 1080p screen, this will find you a decent laptop for the described tasks which should last 5 to 7 years assuming it well looked after.",
  "The HP with Windows 11 and a Ryzen 3",
  "Go with the Ryzen 3 with full windows, nothing against chrome but windows all the way.",
  "Get the HP for sure but I would reinstall windows and use Winaero to clean it up. Mine has a 4500U and 8gb RAM and runs like a dream. I use it for my school audio engineering job as well.",
  "Is this a joke? The sexond one is an obvious win.",
  "The second one because its NOT a chromebook. Plus its a better laptop anyway",
  "Number 2, but try to see if you can get 16gb of ram instead of 8",
  "Man thank you all SO much. Y'all really came through for this clueless gal. I haven't thought about or bought a laptop since 2011, the last time I attempted to go to school lol. I truly appreciate all of your comments. I'm going to either go with the HP in the original post or possibly this one:\n https://www.bestbuy.com/site/hp-envy-2-in-1-15-6-full-hd-touch-screen-laptop-amd-ryzen-5-7530u-8gb-memory-256gb-ssd-nightfall-black/6535748.p?skuId=6535748\n\nGoing to Best Buy after work today!",
  "Disregarding my opinions on the brand, the HP one. So much more power and utility for not a lot more",
  "Clear here. Unless you're fine with an OS that will run a small selection of not that bad but apps, slow unreliable little storage and a cpu that time-traveled from the 2000s, you'll pick the second one. HP\nThe value for money is 0%-200%-0%, the first and third don't justify the money",
  "Gotta pay real close attention to these two acronyms: xxGB eMMC  compared to xxGB SSD.  An eMMC will make you hate the thing. Miserably slow.\n\nBoth of these are not that rugged. Are you careful with your stuff? You say \"professors\" so you're headed to college not high school I assume. Then it's probably OK to get that HP. If you think you need something tougher, you can get off-lease refurbished Thinkpad T or X series from Lenovo that can be slammed around in a backpack a lot more than the two pictured models.",
  "But why do you need a 17 inch laptops to school? Dont you wanna go with 12-14inch?",
  " avoid a chromebook at all costs",
  "The HP has terrible cooling and build quality while the Lenovo has worse specs, both suck",
  "Buy the second one it has a great CPU for the price and will suit your school needs flawlessly, the Ryzen 3 in that laptop is very capable and can get programming, other schools stuff or more demanding stuff like light gaming done at 60 fps",
  "2nd no contest\n\nwhy the fuck do chromebooks have such a big price hike for such terrible performance",
  "The HP blows those Chromebook out of the water. Definitely get the HP while it’s on sale bro",
  "Ryzen 3 over Pentium and especially over a Celeron.",
  "Might I suggest finding a refurbished laptop from a reputable business. Often times you can find quite a steal. I recently got a laptop with an intel i7 16gb of ram and a 512gb ssd for around $150.",
  "Honestly i’d go second hand. These are pretty bad",
  "Never get a chromebook, you’ll regret it later, and in the long run will cost you more. Go with the HP Amd. Its a bit more up front but It’ll last much longer and be much better for general use like streaming, schoolwork, video calls etc.",
  "I’d get an iPad unless you really want a laptop",
  "If you can I'll always recommend the late 2013-2015 MacBook pros. can easily get one for under $300 on ebay with 16gb of ram and an i7",
  "100% the second one. The first one is a Chromebook (they're awful) and the third one would have been okay if the year would still be 2010. The second one isn't particularly incredible either, but for the price it's really good and should perform pretty decent, even in some older or indie games.\n\nOh, and it has an SSD and not eMMC. eMMC is terrible in both speed and lifespan. You can be extremely happy if it lives for longer than 2 years and the r/w are like 100-400 MBs, whilst an SSD has at least 500 r/w.",
  "Maybe controversial but if you just need it for online school stuff get the Chromebook. Cheaper, performant even on dubious hardware because of a light OS, and guaranteed updates for a while",
  "Do not buy a Chromebook",
  "Also the HP has a 3 year refundable(if not used) accident warranty. After you turn on the computer, you can buy it through HP Support Assistant under apps; click on warranty and it will give you options to get the HP Care Pack.",
  "I agree with this. Get at least i3 or ryzen 3 and higher. Anything above 10th gen i3 or after ryzen 3000 is fine. Only some pentium are acceptable, but most are slow.\nAnd at least 8GB ram ( I really like 16GB though), and ssd is a must\n\nAnd IPS display. Oh my I hate TN laptop display 😒",
  "Not really talking about the processor but can't you just install Windows on those Intel Chromebooks?",
  "$220 off, OP your not gonna see a better deal than this",
  "For a new laptop this is very good for its price, hope OP see this",
  "I actually just bought this exact laptop, it’s been great!",
  "I bought a 15iwl with an i5-8265u for $1000 4 years ago and it was shit",
  "Lenovo flexing",
  "How tf they would call it a laptop if it's even slower than most $150 Android phones?",
  "T480 is much more powerful than the T470 and as such will likely be a better choice in the long run. That being said, we daily a T470 and it's a excellent laptop so a T470 is still a great choice.",
  "I wouldn't go with this, it only has a 128gb ssd",
  "Bro what do you think he is doing here",
  "He can just buy another 8GB stick of RAM for about $10-$15 during Black Friday. Upgrades take about 5 min",
  "Well do be careful with that hinge because HP stands for hinge problems.",
  "out of these 3 the second seems the best :)",
  "Pentium Gold might be okayish though, but i3/Ryzen 3 is miles better.",
  "I’m sure there is a way, but Chromebooks normally have less powerful specs, so you’ll be stuck running Windows sub-optimally, and you’ll likely have a bad time",
  "It's a HUGE pain in the ass. You have to open it up and remove a screw to get rid of write protection, then flash a new BIOS. Not suitable for anyone tech-illiterate",
  "You can, but it takes a lot of effort, you have to boot into developer mode (after that point you have to press ctrl + d on startup every time) then disassemble the chromebook, either boot the chromebook without the battery or take out a chip, Unlock the bootloader with a script, then get a USB stick and install windows on the chromebook",
  "Can you?  Maybe.  Should you bother not a chance.  Your looking at maybes at best more often then not they use arm processors which have awful support, and unlike the MacBooks they have no way to run x86-64 code.  Their motherboard are often locked down as well.  (Windows 11 won’t even run right on 4gb of ram either)",
  "It depends.   \nThere's a firmware for many Chromebooks, but that only really guarantees that Linux will run.",
  "The Intel Celeron is the reason you can’t install Windows on it. The CPU is so damn weak it can’t run windows. \n\nI work IT and just had someone complaining about how their computer keeps freezing. Turns out having two open Microsoft edge tabs and a single tab in outlook for emails maxed that CPU out at a constant 100%. Trying to attach anything to an email would freeze the entire computer for like 2 minutes. \n\nIntel celeron is worse than an i3 from 2012. And Windows 11 is so bloated with BS (maybe 10 as well, I haven’t fucked with any since 8) that a CPU from 2012 can’t run it at all. CPU’s from like 2017 struggle.",
  "Quite literally lol. The palm rest and the screen both opened up",
  "[deleted]",
  "If the motherboard supports it then yes you are right",
  "Reasonable 🤔",
  "So looks like it's extremely lockdown? Geez, I thought it's just some laptop with Linux on it, so I assume you can change it easily. (Since you know, ChromeOS is based on Linux).",
  "I've tried my friend's laptop two times (two different friends, two different laptop, but the same Celeron N4020) and Jesus Christ it tooks ages to open File Explorer and the goddamn Network Switcher. The same goes to my (another) friend's laptop with AMD A9. Like geez, how can you guys survive with this kind of crap?\n\nSometimes I hate the fact that I'm still stuck with i5 6th Gen from 7 years ago. But sometimes it also makes me grateful because my laptop is still far far faster and smoother than my friend's newer but crapper laptop.",
  "Not really, an i7-2600 from 2010 runs W11 pretty well with an SSD",
  "the Celeron isn’t the reason. it’s the locked down BIOS + UEFI incompatibility. Windows 10 runs on my dual core 1.6GHz desktop AMD processor and it ran on my old HP Stream with a Celeron N3050 (2.16GHz). newer celerons are *much* better, but still mostly garbage.",
  "Yep I've had a few build quality problems with lenovos over the years, once my grandma picked up my thinkbook from the edge of the screen the entire bezel and hinges came off luckily the screen was ok. The build quality is definitely a bit inferior as compared to hp or dell imo.",
  "Yea, but that's probably an extra 70 dollars on top for a decent 512gb drive",
  "Most motherboards these days support a minimum of 16GB-32GB RAM. I'm confident he'd be fine and that it comes with one stick of 8GB - stock",
  "It's a whole process. The system itself is on two separate write-protected signed partitions that are swapped out on every update. To even get to any semblance of a shell you have to wipe all your data and put it in Developer Mode (which conveniently adds a self-destruct button and an annoying beeper to every boot)",
  "[deleted]",
  "For a excellent 1TB NVMe SSD, you can expect to pay about $60.",
  "Yeah I think you’re right.",
  "Since he's looking for under $350 there's decent chance the MB only has soldered RAM without slots for extras. Especially the Chromebook-style. I would rather get a deal on used Lenovo Thinkpads/Dell Latitude/idk the HP business brand equivalent at these price point.",
  "Geez, what's the reason behind all of this? They're really sure that people's getting locked on an OS which is just a more advanced version of Android lol.",
  "It's also windows in s mode which is bad",
  "🙏",
  "I can almost guarantee you that the AMD HP has at least the ability to expand RAM. Sorry, but I'm not here to argue about something I never said or hypotheticals",
  "I mean, I don't think there's a Chromebook in existence that has had malware worse than a rogue Chrome extension. That's great news for schools.\n(especially since dev mode can be disabled by enterprise)",
  "See [the chromium is doc on security goals](https://chromium.googlesource.com/chromiumos/docs/+/master/security/chromeos_security_whitepaper.md#principles-of-chrome-os-security).   \nIt really comes down to making any user aware of any modifications, and having to reset the device and perform first-time setup and look at a warning screen is a great way to do it.",
  "You can turn it off though.",
  "Fair reason I should say",
  "Costco laptop find opinions I found this computer at a Costco a little while ago that I’ve been thinking about buying. I couldn’t really find many reviews for this specific model, but it seems good enough. \nI just want to know if this would be a good laptop for going into college for computer science and for doing some light gaming (modded Minecraft for the first time baby!).\nAlso give any similarly priced recommendations if you want. (I can go a bit higher in price)",
  "I have the same laptop just diff specs.Its awesome man go get it.dont miss on this deal.Intel arc is pretty decent now, old intel iris xe was trash.But nah u good with this one.",
  "Decent specs but I would suggest finding something with a modern AMD CPU. Their iGPUs are a little better for light gaming.",
  "the 7i auro edition with (i think)more or less the same specs is going on sale weds for the same price",
  "Chicklet keyboard, assume you like that.",
  "The price ending in .97 means its clearance and the * means it wont be coming back so its a pretty solid deal.",
  "old guy. non-techie. need new laptop for 11. Costco offers a Lenovo Ideapad on sale for 700. Just need for internet, no gaming. Is this a gog deal?",
  "old guy. non-techie. need new laptop for 11. Costco offers a Lenovo Ideapad on sale for 700. Just need for internet, no gaming. Is this a gog deal?",
  "I just returned the 16” ideapad with similar specs to Costco last week. Had it for 3 weeks and it crashed twice, plus the trackpad was sticking. Went with an ASUS S15/16 from Newegg (this one: https://www.newegg.com/asus-vivobook-s-15-15-6-non-touch-screen-amd-ryzen-ai-9-hx-370-amd-radeon-890m-32gb-memory-1-tb-pcie-ssd-neutral-black/p/N82E16834236614?item=N82E16834236614&utm_source=transactional&utm_medium=email&cm_mmc=TEMC-Shipping-Notice-USA-_-101929&utm_campaign=TEMC-Shipping-Notice-USA-_-101929 and I’m way happier with it. I felt like the Ideapad keyboard was gonna break every time I typed on it. And then the trackpad did pretty much break within a few weeks. I’m doing light gaming too and mostly internet work (not dissimilar from school demands) and I think I made the right call with the ASUS. I have bought my last 3 laptops from Costco, but in this case Newegg had the winner. At least the Lenovo was easy to return!",
  "Yeah this looks pretty good. No clue why people think Minecraft needs a graphics cards, mods add on CPU and RAM but not GPU. Shaders do that, but not mods.",
  "Looks decent for the price but you should get a gaming laptop if you plan on gaming. Check Best Buy (as much as I hate them they have some good sales this weekend)",
  "No gpu no deal. Get an acer nitro",
  "No dedicated GPU, pass",
  "How’s it holding up? \n\nLooking to buy a quality laptop in the $1k range for personal use (mainly heavy Excel for side projects / consulting work) so not for gaming but occasionally macros and some large Excel files",
  "For $900 i would get one that has a dedicated one, otherwise you don't need to spend $900 for a laptop with 32GB of ram and 1Tb ssd.",
  "I’m not doing it mainly for gaming btw",
  "It has Intel Arc GPU bruh wdym?",
  "Why does he even need a dedicated GPU? he clearly mentioned it’s just for light gaming, and core ultra chips handle that well enough.",
  "Upvoting cuz modded mc",
  "Overall not bad. I need to do some optimizing for the battery life, I haven’t figured it out yet. Feels like it goes from 80-25 pretty quick, but then can be on energy saving mode for over a day and work just fine. Other than that I think all my gripes are actually with Windows 11 and not the machine. It charges quick, is lightweight, has a beautiful screen, and the keyboard feels great.",
  "High build quality laptops are commonly around 1k with no DGPU\n\nLooks average price to me.",
  "Modded Minecraft isn’t something I’d recommend running on integrated graphics.  But you do you",
  "You still can get better laptop for around the same price seriously, this thing is a cash grab.",
  "Its integrated into the CPU. I should have said get a discrete GPU.    \n  \nArc benchmarks at a very slow **5511**.  Spend more if you can and get 10,000 to 30,000. Look more. One year ago I got an AMD Nitro 17\" laptop IPS display, 1 tB SSD with GeForce  4070 and a AMD Ryzen 7 for $880.  Tariffs obviously impact that now to $1200 or so.\n\n[https://www.videocardbenchmark.net/gpu.php?gpu=Intel+Arc&id=4955](https://www.videocardbenchmark.net/gpu.php?gpu=Intel+Arc&id=4955)",
  "Never seen Minecraft mods have ya",
  "Have you heard of Sodium?",
  "Ah so that is what you mean. Well OP likely won’t use the gpu too much since he will only play minecraft and program some, so yeah ARC is not a bad choice for what OP wants to do with his laptop. But if he wants to play with llm and AI stuff then yeah, better to have an nvidia gpu for AI stuff.",
  "Not every mod is about graphics and Vanilla Graphics Minecraft even with 47473824773 Mods runs on every Potato, Graphic wise.",
  "or any of the other minecraft performance mods for that matter",
  "hell, performium a performance mod pack gives me like 700fps when at max it could only run at 120",
  "just a couple of mods (like sodium) managed to get me like 80 fps with shaders with max render distance in 1080p (not bad for a 6 year old rtx 2070)",
  "btw, have you noticed that shaders now have worse performance on newer updates?\n\nI used to be able to use BSL shaders on low at 60fps easily, but now I can barely reach 40.\n\nI think it was on update 1.21.5 where performance decreased.\n\nI tested it multiple times using the exact same mods and settings.",
  "yeah, i use complimentary (iirc) and i used to be able to get over 100fps with it, now i get 80 max (as mentioned prior)",
  "Which one should I get? If any other options you guys reckon tell me (within budget pls)",
  "Msi ? Unless you wanna spend $100 for additional 8 gb ram ?",
  "MSI. But ig check a better 5050.",
  "Which ones has the ram soldered? Buy the one you can upgrade ram down the road",
  "What's the use case? These are meant to be used plugged in.",
  "I have the Lenovo laptop. Very good, but not for 1.5k$. It's a 2024 model that goes for 1k$. \n\nThe lack of integrated graphics is not a problem as I cannot think of a situation where I would want to game on a 2.5kg laptop in a cafe or public transport while it's blowing hot air and making 70db of fan noise.\n\nThe build quality is great. The keys feel great. The screen is very solid. The CPU is great. The performance is great. There is a not a single title you can't run at 1080p60 on High settings. The 24GB of RAM never get maxed out\n\nLook for a version with a 1TB SSD and at a better price (Should be about 1.1k$)",
  "Avoid katanas like the pest. MSI low-mid end is always trash, will turn into a space heater.",
  "i also found that lenovos one doesn't have a igpu meaning it drains the battery way faster but I just reckoned that the build quality on lenovos was much better, so technically If I wanted to spend the extra 100, would it be worth it?",
  "wdym by 5050, sorry i'm a bit slow",
  "I have no idea but if they both were solderable which would you reckon?",
  "Yeah this. People with gaming laptops deplete, charge, deplete again, charge... Cap your battery in Vantage/whatever OEM app at 80% with smart battery charging and always have it plugged in.",
  "alright thanks",
  "Alright so what do you recommend I should get at my budget (1.3K-1.5K AUD)",
  "Tbh dont do 4060 I wont recommend if you wanna game properly unless you are a casual gamer",
  "rtx5050 graphics card. Newly launched. It's slightly less powerful than 4060 but considerably powerful. Also you get better chipsets and tech.\n\nAlso check Lenovo's own website for potentially better priced LOQ (also research about discounts).",
  "Take the part # of the laptop and use it on Kingston Memory or Crucial Memory's websites and you'll see (or not) any upgrade options.\n\nIf both have soldered ram, take the 24gb for a longer lifespan\n\nBTW CPUs are the in the same league: [https://www.cpubenchmark.net/compare/6067vs5283/AMD-Ryzen-7-7435HS-vs-Intel-i7-13620H](https://www.cpubenchmark.net/compare/6067vs5283/AMD-Ryzen-7-7435HS-vs-Intel-i7-13620H)",
  "I don't wanna play any AAA games on my specs, only games to the point where it's stable and a bit overkill just so I'm not putting too much load on it.",
  "I haven't quite seen any at my current budget (1.3k-1.5K AUD) and i'm a bit skeptical going for cheap 5050's as most of them lower costs by using other cheap specs.\n\noverall I just want a laptop that can run well, doesn't need to be exceeding in perfomance but just well round reliable and good build quality",
  "i also got worth that the 7435HS is not Igpu meaning if unplugged would die pretty fast, so that's something i'm scared about but I just need to confirm if thats true.",
  "Which cheap 5050 are you talking about? Gigabyte or so? Fyi MSI is also terrible. Go for LOQ for best build quality in budget or TUF.",
  "No idea but gaming laptops are not known for battery lifespan",
  "anything within my budget? if not I might just go for the MSI and i'll just plug it in my monitor 80% of the time.",
  "I don't know your country.",
  "Oh I mentioned AUD which is Australian Dollars sorry if i didn't abbreviate.",
  "Oh news.\n\nLenovo LOQ 15AHP10 Gaming Laptop I Powered by NVIDIA® GeForce RTX™ 50 Series GPUs | 83JGCTO1WWAU5 | Lenovo AU https://www.lenovo.com/au/en/p/laptops/loq-laptops/lenovo-loq-15ahp10/83jgcto1wwau5\n\nAlmost rtx4070 power with better efficiency. Try getting it around ur budget with coupons and discounts or raise budget, ig. Because this seems very vfm compared to the above LOQ.",
  "Alright thanks",
  "Is this laptop worth it for college? Hey all I'm heading into college next year and was wondering if this laptop would be good for running multiple excel sheets as well as gaming on the side(nothing serious). I'm a little out of it on the newer cpus and gpus so just let me know!",
  "That's probably overkill for college depending on your field but overall solid specs. Not sure how the battery life will be though but seems like a good laptop.\n\nThe Intel processer in that is more efficient than past Intel processors so better battery life than past Intel cpus for sure. 32gb ram is more than enough as is 1tb storage.",
  "It's a bit overkill for most things you'll be doing.",
  "I love this laptop. I’d recommend trying to find it open box, you may have to return a couple but eventually you’ll get one that is basically brand new for a way cheaper price",
  "After my kids cracked my MacBook Pro screen, I bought a refurbished Thinkpad from Amazon. I'm blown away at the quality. I quickly updated it to Windows 11, and it will do more than good enough for school and browsing needs. I want to pass the good word. I'm a teacher and plan on getting started on My Ed.S soon, and I'm more than confident this thing will suit all my needs. \n\n  \n[https://www.amazon.com/dp/B0C8N2H4JN?ref=ppx\\_yo2ov\\_dt\\_b\\_fed\\_asin\\_title](https://www.amazon.com/dp/B0C8N2H4JN?ref=ppx_yo2ov_dt_b_fed_asin_title)",
  "NO PEN FUNCTIONALITY.",
  "Hey, I have the previous generation of that laptop, and it's great. The 3.2k resolution makes a massive difference when reading small text, and the 4050 is still low-power enough to get you through the day but still has decent performance (plus the sweet bonus of having DLSS frame generation). The 32 gigs of RAM is more than enough to handle multiple windows open and the 1 TB SSD should be enough if you don't plan to game too much. It's a great deal, and it'll make studying easier.",
  "I've been testing different configurations of this computer for work (analytics). For your use case (multiple Excel sheets?), it's probably overkill. \n\nThe Yoga Pro 9i gives me the posh feel of a Windows Surface while delivering an experience reflective of and exceeding my M1 MacBook Pro.\n\nThe m1 MacBook can't really keep up with my increasing workload (though it tries valiantly), so I was considering a newer M3 or M4... But couldn't justify the price. \n\nThe Yoga Pro 9i, regardless of config, handles my work tasks pretty easily (and this config with the IPS display is pretty good with battery life too).\n\nIf you'll be doing heavy tasks (or heavy multitasking) it'll definitely be an enjoyable device, but certainly overkill for just Excel and general browser use imo.",
  "I mean of course this will get you through college. Now, if you wanna do the forbidden g word (gaming), I'd be looking for something with a better GPU and a less overkill CPU :)",
  "Little over kill and a 16 inch screen is not great for throwing the computer in your bag for the day and could hurt battery life",
  "Just get a basic laptop for college or like a used MacBook air m1 and get a desktop pc it's a way better option, you can even setup zerotier to remote into your PC if you need.",
  "Can you tell me which site is it if you don't mind, I need to see Something for myself not relevant to your topic",
  "With that price you can consider getting a midrange gaming laptop,   \nand have enough even to get a light on the go 2 in one\n\nfor example you can get   \nLenovo LOQ: $700  \nLenovo flex 5i $400\n\neither of them would be enough for your usecase.",
  "T14 thinkpad",
  "Leaving the pen issue the ams Ryzen 7 version for 549 was a killer deal",
  "You don't need much for college. But when it comes to gaming you'd ideally have a decent GPU, and without knowing what you're playing it's hard to say what would be ideal. \n\n\nFor a slightly lower price you could get this: https://www.bestbuy.com/site/asus-rog-zephyrus-g14-14-oled-3k-120hz-gaming-laptop-amd-ryzen-9-8945hs-16gb-lpddr5x-nvidia-geforce-rtx-4060-1tb-ssd-platinum-white/6570270.p?skuId=6570270\n\n\nBetter GPU, battery life, display, build quality, speakers.",
  "You can get a similar spec but cheaper on an ideapro 5.\n\nThe yogas all have an hinge problem that is made worse by an GPU heating the glue on the joints.\n\nFor college, something sturdy is a factor you have to consider.",
  "This seems way overkill for something you'll be wanting to bring to college. I recommend you do what I did and get a laptop for $300-$400 and then pick up a steam deck which is more than sufficient for non-serious gaming. Obviously that may not be to your taste but if it is then it's definitely cheaper and probably a better experience overall.",
  "Am planning on getting the exact same one, except 7",
  "Everything is worth it if you have the money!\n\n  \nConsidering your pick of 1300$ you have plethora of options in this price bracket and even MacBooks, but first know what you actually will be doing. If not sure, visit initial days of college, meet and greet and get to know what interests you. It will give you a rough idea what specs you actually need. Then get one.\n\n  \nSince you like gaming a bit, go with any windows laptop in market (for casual gaming any low end 2050 or even 3050 series or even Radeon iGPUs and for crisp gaming GPUs as you selected). For multiple excel sheets, RAM is important, 32 GB would be sufficient, but today never consider less than 16 GB I can just advice you if on windows. Regarding CPU [Ryzen AI 9 HX 370](https://nanoreview.net/en/cpu/amd-ryzen-ai-9-hx-370) and [Core Ultra 9 185H](https://nanoreview.net/en/cpu/intel-core-ultra-9-185h) are quite neck to neck, so yeah think about it with AMD being a little better on the battery and iGPU side.",
  "Watch Dave2D.  Practical and excellent advice from him especially in regards to the newer CPUs from intel",
  "hell naw",
  " What games do you play? I mean it comes with a 4050 so if you play 3A games then it’s probably not enough. If you play ligjt games like Minecraft it’s probably an overkill. Also I gotta say that this ultra-9 is actually not too energy-efficient… I had a thinkpad that has this CPU and the battery life is too short. Consider MacBook if your major doesn’t require any application that can’t run on macOS.\n\nEdit: also this CPU might be too powerful for undergrad students. Consider i5 or i7 if your major is not about using compute intensive programs",
  "watch out with yogas, they have a side mounted power button that is very finnicky and prone to failure. Also hit it by accident a lot when picking up etc. Not long ago someone posted this one, his 3rd unit and it had a power button failure.",
  "I have the Slim Pro 9i with the Intel i9. The battery is shit on the laptop. You get 3-4 hours of battery with screen refresh at 60hz, back light all the way down, and on battery saver mode. 1.5-2 hours max if you just run it like you have it plugged in.\n\nIs this the miniLED model? The monitor sucks. It looked awesome, when I first got it... Then the nightmare came. My panel developed pink tinted patches and stripes all over 9 months in... Saw at least 5 others who reported their monitors failing in the same exact way. I think the miniLED technology is too new, and isn't mature. You'll end up being the beta tester.\n\nLenovo's repair process in the US is a nightmare and I went through it in October. 3 weeks no working laptop, 4 repairs, 3 failed repairs, 2 on-site, and 2 depot repairs to swap the monitor. On the 3rd repair, I was literally sent back a laptop without any SSD inside. The factory SSD was unencrypted and they should have known about it since I notified them multiple times on the paperwork they had me fill out. Couldn't get a straight answer out of them past that point and they even tried to claim the laptop never had an SSD in it when they first got it. Their repair depot (CSAT Solutions) tried to charge for both repairs by claiming \"customer induced damage\". Lenovo never owned up to it. I only got some closure on the whole ordeal by doing software forensics on the wiped drive they sent back with the laptop on the 4th repair. When I looked up CSAT Solutions, come to find ex-employees call that place a sweatshop, seen plenty of other repair nightmares from people and that they service Dell, Apple, and Lenovo.",
  "This is the best one I have found after being in the market for months👇👇\n\n\nhttps://www.reddit.com/r/laptops/comments/1jnfyii/best_laptop_for_students_asus_x1505va/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
  "Don't buy a laptop for both gaming and to bring to class. Gaming laptop have a battery life of 1-2 hours even if you're not playing a game. I bought a $300-$400 laptop with AMD integrated GPU and it worked great for school. I never had to sit next to an outlet. Battery life is \\~8 hours.",
  "Those laptops have excellent battery life. Something around 8~10h on your usual usage.          \nProbably 2~3h when gaming. This is their main feature.\n\nHowever, the Intel lineup for this category **sucks a lot**. They're the worst by a mile, in performance and power efficiency, ESPECIALLY the Meteor Lake ones. You're better off by choosing an AMD model (like an AMD Ryzen AI HX 370).         \nIf, for some reason, you REALLY want an Intel, get the ones that are 2xx. The 1xx (like this one, Ultra 9 **185**H) models are Meteor Lake, which are really bad. 2xx models (Like Ultra 9 **288**V) are Lunar Lake, which are still bad, but not as bad as Meteor Lake.\n\nYour options are:         \nQualcomm - Greatest battery life, greatest performance. However only roughly 99% of the apps are compatible with this processor. It uses an architecture similar to Macs and phones, and it's still maturing for the PC platform.              \nIt'd be the Snapdragon X Elite processor. I use this.\n\nAMD - Great battery life (~10% less than Qualcomm), and excellent performance (equal or ~5% less than Qualcomm), but 100% apps are compatible with this processor.          \nIt's the processors with the name \"Ryzen AI HX xxx\", where xxx is some number, like \"Ryzen AI HX 370\".",
  "Keep looking. You can find 4060/70s for less right now",
  "Terrible price🤣I see many on eBay from good companies being less than 750",
  "yoga consumer series is famous for hinge problem.  hope that they solved this problem at least for Pro variants.but they did not change power button design.",
  "[deleted]",
  "Don’t buy anything related to Lenovo until you are a office worker and the company gives it to you. It will not give you the best performance and after a year you won’t be able to open a sheet or in 2 minutes. If you want to use it for gaming and school, you can directly think Asus gamer laptops which is ABSOLUTE best(I am an IT Specialist and currently giving Asus to only architects). It will be around the same price. Lenovo no good for you",
  "Could you recommend me one?",
  "I do have to point out that the battery life can be inconsistent. If you try to combine gaming and studying in one day, you'll get around 4 hours, which is not enough. I recommend also getting a portable, high-wattage power bank (Preferably 100W or above, so as not to impact performance when gaming). They essentially double your battery life, as well has being handy when your phone is about to die too. \n\nThe laptop also does get hot. That is a notable concern, as thermal throttling is an issue, as with any other gaming laptop. The slim especially suffers, with it being so slim and all, leading to it impacting performance and leaving the keyboard hot to the touch. I also recommend getting a foldable metal computer stand.\n\nBattery example (I'm using this one right now): [https://www.amazon.ca/INIU-65W-PD-Portable-Charger/dp/B08VDJP7WN/ref=asc\\_df\\_B08VDJP7WN/?hvadid=706759098190&hvpos=&hvnetw=g&hvrand=18182315529352548771&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9000792&hvtargid=pla-1648626375569&psc=1&mcid=b52a3dfd537f385381cca966f5da5dce&gad\\_source=1](https://www.amazon.ca/INIU-65W-PD-Portable-Charger/dp/B08VDJP7WN/ref=asc_df_B08VDJP7WN/?hvadid=706759098190&hvpos=&hvnetw=g&hvrand=18182315529352548771&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9000792&hvtargid=pla-1648626375569&psc=1&mcid=b52a3dfd537f385381cca966f5da5dce&gad_source=1)\n\nStand example (Not this exact model, but stands in this style. Do be sure to get a metal one as plastic stands can be flimsy and break easily): [https://www.amazon.ca/multi-angle-Adjustable-adjustable-Compatible-compatible/dp/B09JS4L29L](https://www.amazon.ca/multi-angle-Adjustable-adjustable-Compatible-compatible/dp/B09JS4L29L)",
  "Sorry been trying to reply to as many as possible I mean I listed the requirements badly but im going to be going for finance as well as CS so I just tried to find something with a good processor as well as memory it also needs a keypad so the size was required",
  "Best buy",
  "[removed]",
  "More precise the ryzen chips. This is what matters",
  "Just got a Dell g16 with 4070, 32g DDR5, I9 13900HX for the exact same price. Even for 12 months interest free financing 💪",
  "What would he need a 4060/70 for?",
  "That was the case for the 2 in 1 designs. This is the standard one and use a different hinge system which is similar in durability to most premium laptops from other brands",
  "How is this a gaming laptop. top fucking kek",
  "This aint a gaming laptop, god no. Its a 4050 for gods sake, what type of performance are you expecting?",
  ">after a year you won’t be able to open a sheet or in 2 minutes\n\nI really want to see you explaining this part, because it is obviously not true.",
  "General info, judge the model not the manufacturer, if u are talking asus, they also had multiple lawsuits about crappy tech support , with cases of sending the wrong/lower model of the product, in a case they denied sending a replacement to a user cuz of the shipping issue on their side and went the lawsuit route to get it 3 months later\n\nSo here is asus for you, for Lenovo, depends on the model, on the business side, you already have the thinkpad series on top with the highest market share among the companies for a reason, same company makes ideapads, had very bad hinges/bad quality, though in the last generations they got better, like LOQ series are basically ideapads with older gen Legion chassis, and u got the Legions, u got the really sold unit with price cheaper than competition, with a community and support better than competition (due to market share ofc), lots of tweakers out there\n\nSome goes for other companies, hp famous for making laptops that lasts 2 years at most before hinges breaking,\n\nSame company makes Spectre x360 series that my cousin has for the last 8 years and got fked and yet still going, so yeah",
  "Could you suggest me one in the price range sorry I'm not too familiar with laptops?",
  "While I hate Lenovo for losing my SSD on a warranty repair, lying about it, and generally providing shitty aftersales support, I'd like to see some evidence of a Lenovo laptop only running 2 minutes after a year. I'm currently typing this on a 1 year old Lenovo laptop and I haven't noticed any battery degradation.",
  "I have this laptop with the i9 chip and it's branded as the Slim Pro 9i, but it's the same as the Yoga. I would recommend it for general use, stationary gaming, and multimedia applications. It has tons of power, great speakers, and an amazingly vibrant and clear display. HOWEVER, it's probably overkill. It's very heavy and has terrible battery life. So unless you plan to park it on your desk and never move it, get something more portable and whose battery will at least last though the end of class.",
  "I find that any of the Asus Zenbooks are great for school and have great build quality and design. I would go for their mid tier ones or get a slightly older model, they are perfect for school and can handle some editing if you want it to. Search up reviews to understand what I mean.",
  "I have been seeing quite a few comments on this thread where they are either confusing this with the 2023 model, a 2in1 model and some were even referring SKUs with AMD CPUs which this laptop never even had to begin with, so let me clear this up a bit. \n\nI'd like you to confirm one thing, which is whether you'll need a dGPU because if your work doesn't need it, then you can get laptops with similar specs but without the rtx4050 for less than $1000. Not all codes and programming will depend on GPU, most of them only rely on a powerful CPU. \n\nIf you do need a dGPU, then this would be a pretty decent laptop choice for this price, particularly because of the amazing build quality. This has better battery life than the 2023 model, and should suffice for your needs. This is not a Yoga 2 in 1, which usually have weaker hinges like some comments mention. This has a better and sturdier hinge than those. Not the best hinge, but then again, that's the case for all the manufacturers rn except maybe for Apple and this is better than the ones with plastic lids.\n\nHowever there are better alternatives based on your usecases. If you want a touchscreen, then this is the best one for this price unless you go above $1500. Keep in mind that this is ~2.2kg, it is almost the same as the 16\" MacBook Pro for reference, so you have to decide that you are fine with that. If not, go for something like Asus Zephyrus G16 2024 edition, but you'll lose on the touchscreen and numpad. You can also look at Asus Proart P16 which gives you both numpad and touchscreen. You can also look at some other gaming laptops like LOQs and Legions, they will have slightly better performance, however their build quality is lower than this and they have not as good webcam, mics etc and have much worse speakers and similar weight, if not more. \n\nIn comparison, this is a more all-rounder laptop. If you can stay connected to a power source and are fine with a single type c port (which is TB4, so you can still use high speed docks), then you can also look at the 2023 edition (called Slim Pro 9i in US). Best buy has manufacturer refurbished model (so you still get 1yr warranty from Lenovo and all the perks of a brand new laptop) for less than this price and it includes a mini LED screen, which is much better and brighter. \n\nHope this helps 🙂",
  "Legions with AMD HS processors also have great battery life",
  "It has all the specs of a gaming laptop? Are you just saying it’s not a dedicated gaming rig? Ie fans, etc",
  "What are you talking about?",
  "Your acting like its a gt 1030.",
  "Some laptops made about 6 to 8 years old are like non-destructive. Do what you wanna do and they wont even stop spinning fan. \n\nThe thinkpads are really popular and they are cheap because they are sold to companies by qty of 100-200. It comes too cheap when you buy it like this. Currently in our company some of users has brand new model Lenovo’s from 2020 to 2024. Currently they are coming back to us with too many complaints and it is a problem for me too. I am only using Lenovo Servers because its actually IBM. They are the best on servers. But I can’t say that on the laptops. \n\nI had lenovo too and it was the best performance of its time. Which now when you replace the rams for 20 bucks its the best again. But I tried new lenovo and I was able to see how fast its getting hot, dropping performance issues, battery capacity under 1.30 hour and some other problems.\n\nI see the lenovo is a bad computer brand for gaming currently and I have been fixing, using Asus computers. Before the time they were really good at office pc’s and bad at gaming sector. But now they all maintain it on gaming and making some big movements.\n\nSorry if my words seen as like an absolute closed minded. I was not trying to describe it as like that but I can tell I am an ASUS person (Wrote this on a M1 Macbook which has no gpu other than cpu)",
  "So here is the problem, I can’t because im in Turkey. We have prices for real_price * 3 and If I say this one is on that range, it might not be. But here is the model I would recommend for you to search;\n\nhttps://www.asus.com/laptops/for-gaming/all-series/filter?SubSeries=ROG-Zephyrus (This would be the best fit for you in school, I don’t know the price in your country but in here its around 82.000 TL which is around 2100€ )\n\nhttps://www.asus.com/laptops/for-gaming/tuf-gaming/asus-tuf-gaming-a14-2024/",
  "I think you are confusing it with the 2023 version. This was the 2024 version which fixed some of the main issues of 2023 version to some extent by increasing the battery size to 84 Wh, adding a second USB-C port and giving HDMI2.1 instead of 1.4b. Giving he's looking at the LCD version, it should give 2-3 hrs extra battery life.",
  "He's saying a 4050 is shit for gaming...",
  "Ah, you're right. Thank you. I stand corrected. I assume the more efficient Ultra9 185H also contributes to better battery life compared to the i9-13905H.",
  "lol oh. To his point the 4050 isn’t the best, but it is certainly capable of 60 FPS on 90% of games.   A fantastic entry level card.",
  "But you'll only get 53FPS on highest quality brand new AAA games. Literally unusable /s",
  "Games haven't been good for the last 10 years except for a few and this card handles those fine. No everyone wants to play the latest crapware. He will be fine.",
  "Which would you pick for Photo Editing?i I have narrowed down my choices to these two laptops. Anyone have sound advice for which would be better for photo (no video) editing?  I don’t game either. Just Lightroom, photoshop and sometimes Evoto and Topaz. I keep hearing mixed reviews on Asus warranties and support so a little nervous. Thanks for your time!",
  "Neither, I wouldn't get a laptop that has an OLED screen for work. Have you never heard about OLED Screen burn-in? You'll be looking at static elements in your programs, so you'll definitely have screen burn-in. OLED Screens are best suited for gamers or media consumption; if you have static elements all the time like the toolbars/buttons in your programs, those will cause screen burn-in eventually.\n\nLook for a laptop with a Mini LED Screen.\n\nThis is the laptop that I have which I use for work 10 hours a day with some casual gaming on the side:\n\n**ASUS ROG Strix SCAR 16 G635LX** | Intel Core Ultra 9 275HX | SK Hynix 64GB DDR5-5600MHz RAM | GeForce RTX 5090 | BOE NE160QDM-NM8 16\" QHD+ 240Hz Mini LED Display + AOC Agon PRO AG274QZM QHD 240Hz Mini LED Monitor | 2x WD\\_BLACK SN850X 8TB SSDs (RAID 0) | Intel Wi-Fi 7 BE200 WLAN | Windows 11 Pro\n\nIt is more expensive due to the high end graphics card and MiniLED Screen. If you are ok with an IPS screen, theere are cheaper variants of it: [Search results for: 'rog strix g16'](https://www.hidevolution.com/catalogsearch/result/?q=rog+strix+g16)\n\nThose are thick and heavy laptops though with better cooling.\n\nIf you want something lighter, look at the  \n[MSI Stealth 18 HX AI A2XWHG-029US - 18\" QHD+ 240Hz - Ultra 9-275HX - RTX 5070TI](https://www.hidevolution.com/msi-stealth-18-hx-ai-a2xwhg-029us-18-qhd-240hz-ultra-9-275hx-rtx-5070ti.html)",
  "Hey thanks so much!  I thought the OLED burned only if like left open overnight!  I don’t need OLED at all. I just need a ALMOST PERFECT SCREEN with truly perfect colors, fast NVIDIA and good storage etc. I’ll look at your suggestions. Have you had any problems with Asus?  And are you working in photos?  TIA",
  "Do you prefer a mini LED to just a 4k IPS screen?",
  "Mini LED is the closest thing to OLED but is much brighter, which I prefer with no risk of burn-in. See: [Mini LED monitors spoiled me](https://www.reddit.com/r/Monitors/comments/1kix3kq/mini_led_monitors_spoiled_me/)\n\nI only buy ASUS products because in my experience, they've been great and they strike a great price-to-performance ratio. Never had any issues with their warranty or support personally.\n\nI use Adobe Lightroom, Adobe Premiere, AiArty Image Enhancer and Video Enhancer, Adobe PDF Editor, MS Office apps, a little bit of gaming once in a blue moon.\n\nI suggest you buy it from HIDevolution and choose the Tuning and Optimization option located towards the bottom of the laptop configurator if you want the maximum performance and privacy, it makes a significant difference!",
  "Mini LED is the technology, so you have QHD Mini LED and 4K MiniLED. If I had to choose between QHD MiniLED or IPS 4K, I'd go with the Mini LED QHD without thinking twice. The color vibrancy and punch are on a whole different level, and you don't get any IPS Glow (you know when the corners of the screen look a bit brighter than the rest of the screen).\n\nAdditionally, I prefer QHD resolution because it provides the best performance to eye candy. You see, screens look best at their native resolution and if you're using a 4K screen on a laptop, which has a much smaller screen than a conventional monitor, at the native resolution, things would look super small so you have to choose DPI Scaling which artificially enlarges icons and text so that you can see them. The problem with that is that some programs don't play well with DPI Scaling and might display misaligned text/buttons or look blurry. With QHD, that is not an issue, even if you apply a mild 125% DPI Scaling compared to the 200-250% DPI scaling needed to make a 4K screen even visible.",
  "Thank you!  I did look at buying from them but way price alone was much higher even without adding stuff!  Thank you!",
  "Wow you are my hero!  Gonna start shopping today!  Thx!",
  "That's because they don't just grab a box that they got from the manufacturer and send it to you, only for you to discover it has dead pixels, overheating, or things not working. They do a full quality control check and you can configure the laptop to your liking in terms of storage, enhanced cooling, and most importantly, the tuning and optimization + you get lifetime tech support for free.\n\nIf you send them an email with your reddit account they have a 50 USD discount.",
  "Am I about to make a mistake? Lenovo Yoga Pro 7i \nhttps://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nWHY AM I LOOKING AT IT?\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. Presumably that'll eek more time out. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\nWHAT AM I WORRIED ABOUT?\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? \n\n\nSecond thing is overheat potential. Without reviews on this specific configuration, seems a risk the ultra 9 285H might get SPICY. I presume I can maybe manage this by reducing power in the settings...",
  "Idk about this model specifically as I'm researching a 2in1 to purchase, why are all the Lenovo 2 in 1's so much more expensive than their pro counterparts?? My local retailers won't even stock them as their price is just absurd.\n\nAlso, because these brands make multiple laptops of the same format with different specs, usually have to look at them as a whole, then the changed specs individually. Look for reviews on the yoga/yoga pro (compared to other brands, some great reviews and minimal complaints), then make sure the cpu is good.",
  "Hmmm. Interesting. What region are you in? I'm in Victoria Australia and here it seems like the 2 in 1s are pretty affordable, they just use the less heavy duty specs (Vs instead of Hs). \n\n\nBut yeh that's kind of what I've had to make do with RE reviews. Kind of gettins the vibe of similar names and judhing it off that. My exact thoughts on it. The complexity of the seemingly similar but not quite same laptop models with different nearly the same name and completely different specs has made the review space completely fucked to navigate hahaha.",
  "Im in QLD, I should have clarified for the same specs, the 2in1's are more expensive. Currently I'm trying to find specs for a version JB hifi sell but Lenovo have removed completely from their website. Of course they do that and JB don't specify.",
  "To be fair JBs laptop prices are uniformly atrocious hahaha. They charge amounts for specs that are several tiers below what that price point should provide. I think their target market is mostly people who know nothing about computers haha",
  "That's true, but jb for at least one of the models is the exact same price as Lenovo website, without the 3-5 week wait.",
  "Yeh they sometimes might be ok generally, but i notice A lot of the lenovo website prices themselves are inflated. \nLike the one I posted is apparently 40% off, as are other ones im considering which are slightly less speccy, full price of 3.2k or so. But the literal same laptop at a retailer like HN or Office Works is like 2.3k full price. \nSo lenovo website on sale is a genuine sale price but not on sale they're wildly expensive.",
  "Guys which one should I get Guys should I get this Lenovo slim 7i aura edition or the asus Zenbook s16 \nI wanna use it mainly to do schoolwork and game on the go or should I wait for the g14 to get a price drop so it goes down to 1150 ",
  "The g14 would be waaay better for gaming. Otherwise it's a toss up imo, try both in person if you can and see which one you prefer",
  "ASUS",
  "The Asus with r9 will be much more powerful and energy efficient. In addition amd integrated graphics are soo good nowadays that you'll be able to play most games on it.",
  "Get Asus M5506UA for just $650, 8845HS 16+1TB 2.8K 120Hz VESA TRUE BLACK 500 HDR, but no touchscreen",
  "Asus",
  "Is there a reason why you need a touchscreen?",
  "The first one.",
  "Asus",
  "Hold out for the g14",
  "Asus",
  "There are a lot of online comments about the ASUS over heating. If not I'd love to have it. Instead, I bought the Yoga Slim 7i Aura Edition, but I bought it directly from Lenovo so I could buy it with 32gb ram. That spec was about the same price as the Asus, at least when I bought it around black Friday.",
  "Based off those 3 and my preferences, I’d say the Asus Zenbook S16. But outside my of this selection I’d say the [ASUS Vivobook Pro 16X M7600](https://a.co/d/j5p8mLc)",
  "See my post: [Beware of new Intel Ultra Series 2, Yoga Slim 7i Aura Edition : r/laptops](https://www.reddit.com/r/laptops/comments/1hkagox/beware_of_new_intel_ultra_series_2_yoga_slim_7i/)",
  "If I was forced to pick one out of those two, I would pick ASUS. But you got third option to wait when price for g14 drops, just wait until so and buy a G14.",
  "the third one definitely",
  "Dude I just got the Lenovo legion 5i from Costco and I'm never looking back",
  "I got the ASUS one but returned it. It was running hot during the initial windows install. Installing updates helped a bit with image stuttering. Then when watching YouTube it spazzed out and started to overheat itself. Laptop became unresponsive until it ran out of battery. Couldn't shut it down. It was very hot to the touch. All it did was overheat itself and run the fans for hours on a cool flat surface. \n\nI would avoid the ZenBook.",
  "Beware of ASUS warranty rejects through bestbuy. I have a G16 paperweight which was not powering up due to questionable diagnosis. Device protection plan is a must for ASUS",
  "The Ryzen 9AI is way more powerful, energy efficient and copilot+ compatible.",
  "I recently got the ASUS Zenbook and have loved it so far!!",
  "I'll mostly advice against an Intel laptop tbh",
  "Asus with Ryzen",
  "I thought copilot + PC was ARM only",
  "G14 for gaming",
  "The vivobook s16 with similar specs is 999$ in microcenter and the 14 inch version is 999$ at costco",
  "g 14 but if not then zenbook",
  "I sat in best buy and played around with S14 and Aura. The lenovo has better speakers,keyboard, better port selection. The S14 had a better trackpad. The screens even with the S14 having an OLED were pretty comparable. I chose the Aura. performance for my use case is pretty great, even gaming is better than I expected. Under heavy load fan noise is very minimal and this laptop stays pretty cool, even under load. The battery life is insane.",
  "I have the zenbook s16 and it is a great laptop. The first one I had overheated so I got a replacement and realized I just needed to update the firmware which fixed overheating issues. The large 16inch oled screen is beautiful, the speakers are good enough, it gets warm almost all the time, but it doesnt effect pefromace and fans are quiet so that doesn't bother me. It is unbelievably thin which is just nice but also at 16icnhes not very protable.    Battery is good, not great, I get 5-6 hours in light work.    I have had second thoughts however and looking at the slim 7i, It has a bettter keyboard but slightly slower processor and multi core, it has worse speakers, it doesn't have an oled screen, it doesnt have an sd card reader, but it does have better battery.    I am using this for school and some modeling, barley ever game, so battery>peformance for me but I am hesitant about the lcd panel Yall got any advice if i should keep the zenbook or get the slim 7i. I am in my return window for the next 40 days, also slim 7i is just over $1000 for the 32gb ram and 258v lunar lake processor",
  "Asus is engineering crap.",
  "I actually really like the g14",
  "I had a g14 and it was honestly pretty mid. It absolutely got the job done and it was a very decent price point at the time, but the software issues were never ending with the first generation. For most of the enthusiasts it was a new windows OS with an armory crate substitute if you wanted to get the most out of the device. The ports were also really flimsy, they didn't break or anything that I'm aware of, but they had uncomfortable amounts of flex. \n\nI have a blade 16 4070 and it's been a massive step up, it's probably at least 3x faster than my first generation g14 in everything. If you can get a good deal on a blade within the specs and price point your after, I wouldn't hesitate to go with that.",
  "The Lenovo comes with the new Lunar Lake CPU which has even equal efficiency plus even better battery life and graphics. Multi core performance is worse though",
  "Where?",
  "It's actually a nice feature to have. I don't know why OP wants one. My opinion is...\n\nDirect selection for things like YouTube or Netflix, like a tablet.\n\nSometimes when you don't have 10key you can make up for one on the touch screen. \n\nSometimes certain games work very well with it. \n\nAnd many more.",
  "what is the g14?",
  "This seems like a very specific issue, one most people wont run into. I have the Aura and its been nothing short of great for my use case. mostly browser and some app productivity, casual gaming and content consumption",
  "But the asus s16 has more ram",
  "The requirement is to have an NPU capable of at least 40 TOPS and when the Snapdragon X CPUs were first released they were only chips with an NPU capable of 40 TOPS or more so initially Arm laptops with Snapdragon X CPUs were copilot+ PC compliant. When Intel and AMD released their latest power efficient laptop CPUs in 2024 after the release of the SD X series ARM chips they also had NPUs capable of above 40 TOPS and fit the requirements to be a copilot+ PC",
  "Does it game better than the ryzen 370 hx in the Zenbook??",
  "Thank you so much for this response, I’ve already buy the beautiful g14 and I would suggest staying with the Zenbook, since it feels a lot more premium when I tested out.",
  "Then id get the g14 on sale. The next gen version is going to be announced soon early next month though",
  "I have the 2024 G16 Intel version. Just bought the Aura to compare. Obviously gaming is better on the G16 with a 4070. But really this laptop surpasses the G16 is almost every other way. the screens and speakers are closer than people would think. The Lenovo battery can last me two days. the G16 is 6-7 hrs.",
  "ASUS ROG Zephyrus g14",
  "For a very light user it would be great, but so would other several laptops. If you do any type of medium or heavy load, that's when you will start to notice the shortcomings",
  "Yes but it does not have a dGPU. Best option ofcourse is 32gb + 8vram. But 16gb + 8vram works well for most games\n\nOfcourse handhelds dont have a graphics card either and they can play lots of good AAA games with lower graphics, soo if that is enough for you then go with the s16. If you plan on playing on high graphics, or modding a game, when you will need a graphicscard.",
  "> But the asus s16 has more ram\n\nBut it has 24GB which probably means it has 8GB soldered onboard and they added a 16GB RAM stick.  The laptop won't be running in Dual Channel mode so that laptop would be slower compared to a laptop that is running Dual Channel mode.",
  "I'm not surprised ngl. Lunar Lake is leaps beyond Meteor Lake in efficiency",
  "I would disagree, but only interms of what type of tasks you would be doing. The lunar lake CPU only being 8c/8t is were it lacks. If muticore performance is what you are after, then yes this isnt the laptop for you. It's single core and GPU performance pretty good. The Aura edition stays cool and pretty quiet under heavy load.",
  "Which one do you think will last longer as for longevity not battery life s16 or g14",
  "Well, g14 has a dGPU, so it has a lot more fps. \n\nAt some point the APU hx365 will not be able to run graphical games well enough, but the g14 will have a lot more headroom seeing as the 4060 will be relevant for many years to come. \n\nBUT\n\nThe g14 has soldered ram, so i would ** not ** advise buying it with less that 32gb of ram. \n\nIf you need a simular cheaper (but same specs) option, then go for \"tuf A14 - 32gb ram - 4060 - 1tb\".\n\nThat one cost less than the 16GB version og g14.\n\nThe tuf a14 also has an empty m.2 storage slot. \n\nI was thinking of getting myself the g14, but here in norway the 16gb g14 cost 1/3 more (Around 1000usd more) than the 32gb tuf.\n\nSoo im getting the tuf",
  "the g16 has extra components, which gives it a greater likelihood for some type of failure. I have the g16 and I just bought the Lenovo Aura. I am a casual gamer, mostly older triple A's and indies.  The lenovo has great build quality and performance on and off battery and stays cool regardless of what I do on it. If I am just working in the browser and listening to something in the background, I can get two days off a full charge. your use case may vary though",
  "Will the ASUS ROG Strix G16 (2025) Handle My Workload ArcGIS Pro + AutoCAD & Tons of Multitasking? I am looking for a laptop to use as a workstation in case I need to provide my own equipment in the future. I am a Design Engineer working with Aerial & Underground fiber optics in the Telecom field. I mainly use ArcGIS Pro & AutoCAD for drafting & designing routes. While I have one of those programs open, I also must have MS Teams, MS Outlook, MS Excel, Adobe Acrobat, Google Earth Pro, 2 to 3 File Explorer folders, plus a web browser running Katapult + Katapult Photo + Katapult Map + Client Engineering Support Platform + Sharepoint + Smartsheet (around 6-7 tabs depending on Google Earth Pro/Google Maps) all running at the same time. I can get away with Google Maps most of the time. Long story short heavy multi tasking processing is a must.\n\nI do not know much about the difference between AMD & Intel processors but from what I have heard AMD excels at multi tasking & Intel is better at running single tasks. Please correct me if any technical information is wrong. Things have evolved a lot since I last purchased a laptop a decade ago for college.\n\nMy current position supplied me a laptop I am very happy with. Here are the specs:\n\nDell Precision 5690\n\nIntel Core Ultra 7 155H (3.80 GHz)\n\n32 GB RAM Speed 7467 MT/s\n\n1 TB SSD\n\n128 MB Intel Arc Graphics\n\n16 inch touchscreen\n\nI have had bad experiences with the Dell I used throughout high school. After having it serviced 7 or 8 times because of the cheap plastic hinge, I replaced it with an all metal Asus in 2017 when I started college. Here are those specs:\n\nASUS Q504UA\n\nIntel Core i5 7200U (2.5 GHz)\n\n12 GB RAM Speed 2133 MHz\n\n1 TB SSD\n\n128 MB Intel HD Graphics 620\n\n15.6 inch touchscreen 2 in 1\n\nEven though I had bad experiences with Dell in the past, this Precision 5690 is really nice. I like the all metal design for the shell & hinges. My only problems with it is that I have yet to see them go on sale and I hate that it only has USB C ports. The XPS goes on sale from time to time but I do not know if that will give me what I need.\n\nAfter doing research the unanimous answer from coworkers, gamer friends, the internet, & even AI was that the bare minimum I need is 32 GB RAM, 1 TB SSD, an AMD Ryzen 7 or 9 / Intel Core Ultra 7 or 9 / Intel Core i7 or i9 processor, & a dedicated graphics card. Preferably I want something that has an extra RAM slot & an extra M.2 slot so that I can upgrade RAM & storage in the future.\n\nI pulled an all nighter last night going through all of the Best Buy Black Friday deals trying to find THE ONE. I narrowed it down to Lenovo, & Asus. I ended up with three options: Lenovo Yoga 9i Pro, Lenovo Legion Pro 5, & the ASUS ROG Strix G16. All three had 16 inch screens but the Yoga got kicked out because it does not have expandable RAM or storage. That left the Legion Pro & Strix G16. I watched a ton of review & comparison videos, checked rtings, & I think I finally did it. I chose the ASUS ROG Strix G16 based on my personal preferences, AMD over Intel processor, & the nail in the coffin was my childhood friend’s recommendation plus his father’s recommendation. They preferred Asus over Lenovo. His fathet owned a Legion Pro, the best Alienware 16 inch, & recently switched to the Strix G16 & loves it. The only difference between my choice & his is that mine has the RTX 5070 while his has the RTX 570Ti, which in my opinion is not worth the extra 800 dollars which is the current difference with the black friday sale favoring mine.\n\nHere are the specs for the winner:\n\nASUS ROG Strix G16\n\nAMD Ryzen 9 9000 9955HX3D (2.5 GHz with boost up to 5.4 GHz)\n\n32 GB DDR5 RAM (5600 MHz)\n\nExtra SO DIMM slot (tool free)\n\n1 TB SSD PCIe 4.0\n\nExtra M.2 slot (PCIe Gen 5 ready)\n\nNVIDIA GeForce RTX 5070 with 8 GB GDDR7\n\n16 inch 2.5K 240 Hz 3 ms Nebula Display\n\nNow here are my questions for you all:\n\n1) Will this do what I need it to do?\n\n2) Do these laptops last or will it brick in a few years?\n\nI plan on babying this laptop if that helps.\n\n3) Is 20% off the best sale I am going to find for a current generation ROG Strix G16?\n\n4) Do I need an external cooling pad or fan? If not needed, would you still recommend one, & if so which one works best with this laptop?\n\nThis is going to be my personal computer that can double as a workstation if I need it. The fact that it is a gaming laptop is a plus for when I finally make the switch from console. I like the fact there are 2 x USB-A 3.2 in addition to the the 2 x UBS-C ports. I do not know if I will ever be a full PC person since I like being able to move around, laptops are my power meets portability. My job tried to give me a computer but I declined as I visit family and a tower is not a realistic option for me to travel with.\n\nI am sure this is probably way too much information & I might be making too big of a deal out of this. This thing will probably do everything I need & more. I just like doing my homework before sinking a grand or more into something. Buying a new car took years & the only reason I finally did it was because squirrels totaled my old one.\n\nThanks for your help guys and gals I really appreciate it!",
  "Honestly, think about if you actually NEED a laptop. With this budget you can build a WAY faster desktop.\n\nPersonally, I'd build an equivalent desktop which would save some cash, sell my current laptop and use that money to buy like a 4050 laptop.\n\nYou'd have a capable workstation at home, and a machine to get you by during the day.\n\nThat's of course if you don't NEED portability at all times. \n\nIf you do, this should be fine. I know a engineer who uses a RTX 2060 laptop for work to this day. And my dad's company (which is for construction), had some similarly powerful workstations a few years ago.\n\n\n\nTldr; This is fine, but if possible get a desktop + a reasonable laptop, for your use-case.",
  "I would say get intel, it had a lot more cores then amd, but in all fairness the laptop should be enough for all of your tasks, 32gb might not be enough so consider upgrading, but i think you should get the laptop",
  "I appreciate your feedback. I actually did think about it. Right now I'm doing well in my position, just was getting worried about the future. I have that ASUS that still works, & a back up Lenovo that was a hand me down to replace the eye sore that was my old Dell. The 2 in 1 ASUS got me through college using AutoCAD, Inventor, ArcGIS, & Solidworks. I don't think I need a new laptop (or desktop), I may have just been giddy at the prospect of getting a deal. I am a sucker for deals & have been known to be impulsive not to miss out on them. The deal is good for 1 more day so I'm going to sleep on it again tonight, but more than likely I may not move forward on it right now. As long as things are going well with work I don't need a personal work station. If I do need it in the future I will have done all this research & it will be an easier ordeal not having to start from scratch. \n\nThank you for your candor!\n\nEdit: I slept on it. I did some more research based on the other person's comment I looked for more comparison videos between the Intel Core Ultra 9 Series 2 U9 275HX & AMD Ryzen 9 9000 Series 9955HX3D on the ROG Strix G16 (2025). Based on that research I've decided to move forward on my purchase but have switched from the AMD to the Intel processor since the Intel model is newer, has an improved chasis,  & has a lot of newly improved features that support more future proofing and quality of life than the older AMD model. \n\nI am not a desktop kind of guy, portability is more important to me than strictly power & perfomance. I understand PC will outperform & be lower cost when compared to laptops. Also having both isn't a realistic option for me, it would be one or the other. My personal preference or bias is laptop > desktop.",
  "I did more research after posting & it looks like you were right. JarrodsTech compared the Intel & AMD versions. The Intel Core Ultra 9 Series 2 U9 275HX model came out ahead of the AMD Ryzen 9 9000 Series 9955HX3D in most cases. It also has easier access to the internals with a pull tab instead of 12 plus screws just to remove the bottom panel. The Intel model supports the next generation PCIe 5 for future proofing on both SSD ports whereas the AMD only supports PCIe 5 on 1 of 2. The Intel version includes 3 USB A ports where as the AMD only has 2 USB A ports. They have the same number of USB C ports but the port speeds are faster on the Intel than on the AMD model. The Intel also has WiFi 7 compared to WiFi 6 on the AMD.\n\nThe Intel model looks better with the 360° RGB, & it runs cooler thanks to the updated vapor chamber design. It also uses liquid metal & cools both the CPU & GPU, while the AMD version only cooled the GPU. The Intel also support facial recognition whereas the AMD does not. The Intel was more energy efficient and has a 29% longer battery life when compared to the AMD.\n\nI really appreciate your comment because it pushed me to dig deeper and helped me make a better informed decision. I was close to skipping a laptop upgrade this year, but based on Jarrod’s testing & how this newer Intel model performs and looks, I have changed my mind & am going to stop by BestBuy after work today to go ahead and place my order!\n\nIn case you wanted to see the comparison video I was talking about here is the link to it. [ASUS Strix G16 (2025) Review - Intel or AMD? Don’t Choose Wrong!](https://youtu.be/Qd-SXvTEjbk?si=wKORVbO8jDhPyMsf)",
  "I just realized in the checkout that the Intel has the RTX 5060 GPU (the 5070 is available but at a +$400 price hike) vs AMD which has the RTX 5070 GPU. The sale price between these 2 is exactly the same at 1,699. I'm thinking about sticking with the Intel because of the new and improved chasis, both M.2 SSD ports being PCIe Gen 5 compatible, improved cooling, ports, wifi, battery life, energy efficiency, and RGB.",
  "Which one should I get? 1. Lenovo Yoga Slim\n2. Dell 14 plus \n3. ASUS zenbook S14\n4. ASUS Zenbook 14\n5. ASUS Vivobook\n\nOut of these which one is the best in terms of quality?",
  "All are very very good, well built, efficient and trustworthy machines (the dell can't even compare with the other 4), with bright OLED displays. Somethings to keep in mind are:\n\n  \n\\-If you prioritize battery life, go for the Lenovo. It has superior battery life, lasting over 18 hours for office productivity (Marketed hours are always incorrect.) Keep in mind, the Lenovo's chip is designed for efficiency for basic work home or office tasks. Some light games such as minecraft will be able to run on this device due to the relatively good integrated GPU. The Lenovo also remains dead silent in 99% of use cases. If you also prioritize the best keyboard, Lenovo always has you covered there, hands down. The OLED display on this device is great, however, keep in mind that its resolution is only 2k and 60hz, so if you prioritize the quality of the display, then this might be a flag (not a big one though as it is OLED, therefore the color quality is superb). The screen is also touch capable.\n\n\\-The Zenbook (s14) with the same processor as the Lenovo will pretty much be identical, but with a better display and less comfortable keyboard. Its build quality is also the most premium out them all. May not be as well valued as the Lenovo. \n\n\\-If you need exceptional CPU performance, this i9 in the Zenbook (14) will be set, the screen is almost identical to the Lenovo's screen and will sexy in its blue color. Good battery life too. May be overkill. Good battery life. Best value out of them all. \n\n  \n\\-The Vivobook is similar to the Lenovo, good processor for office tasks, web browsing, good battery life, light gaming and good screen. \n\n  \nAs you are concerned about quality, the s14 comes out on top. However the Lenovo, Vivobook and 14 give great value compared to the s14. \n\n  \nHave fun with your new device and I hope you found this helpful!",
  "The Ai 7 or Ultra 5 would suffice for everyday use.  16Gb ram/ 512 ssd should be minimum.  Get a Thinkpad T series with the same specs. Business laptops are more durable. Make sure the ram and storage are upgradeable.  Also always get 3 yr warranty.",
  "Recommend Asus Zenbook S14 for long battery life and OLED screen.",
  "Me, personally, j would choose dell.",
  "Thank you! I really appreciate it",
  "Help me choose between two good options friends ",
  "Asus tuf",
  "Think it's better to go with the Asus one because the GPU isn't all that powerful.  \nHonestly the RAM is one of the best indicators for a worthy upgrade in my opinion. It's been over a decade for laptops to have 16GB of memory RAM, so there isn't much to upgrade and it just becomes spending for almost the same experience.\n\nThe increased resolution with the same GPU also means the overall strain on the GPU will be higher, since it's also a larger monitor.\n\n\"Gaming\" Starts with 70ti series and above for laptops, but it also depends how and what games you want to play.",
  "is that Intel part of the ones with degradation issues?",
  "Its weird. The Legion beats the Tuf on a whole host of stuff, performance-wise. And overall build-quality.\n\nBut where the Tuf beats the Legion is where I actually care the most and it beats it quite handy.\n\nI said I leaned more towards the Tuf. I might have already changed my stance on the two as I have before, multiple times 😄\n\nThe comparison\nhttps://www.notebookcheck.net/index.php?id=127065&specs[]=347144&specs[]=343595",
  "Lenovo all the way. I bought the exact laptop few weeks ago. Best decision ever, especially compared to everything else I’ve owned before. I paid 900€, so you might wait for November to get a good deal.",
  "I own that same lenovo legion with the exact same specs. I'd 100% recommend it. Its the best laptop I've ever used to this day, and the screen is just amazing. Games run smoothly and the temperatures run cold 👌",
  "Any detail on screen srgb? If you use laptop screen a lot and don't hook it up to external moniyor, it might be worth considering the srgb difference.",
  "Legion is the better laptop but the TUF is a far better deal €400 difference for me is what counts:performance should be similar in gaming but not software(intel is faster) but the ryzen is efficient,cooler and more stable(look up raptor lake issues).Go with the better deal.EDIT:I saw in the original post that they were the same price but that TUF came with the 4070 instead of the 4060;in which case my opinion still stands,this just means the TUF is cheaper.Also while the i7 is faster:it may be more issue prone and is certainly less efficient but buy what you prefer-Legion has better reputation,TUF is specced better.",
  "Listen fellow crypto trader ( nice username) any chance you’re in the U.S.? I’ll get you a phenomenal deal on the legion 7. If you’re Interested I can get you specs.",
  "Just based on the specs and price, I'd go for the Asus, that 400€ gives me a ton of extra upgrades for that thing! I'd slap some 64gb of memory in it, some extra storage and a decent backpack.",
  "I am using tuf it performs pretty good if u are looking to play games like league,valorant etc..,\nit will heat up but everything else works fine",
  "The Legion is not worth an extra €400.\n\nThe Legion is a nicer laptop overall. CPU performance is better, specifically multicore performance. Single core should only be slightly better. Display is better. Build quality is slightly better.\n\nThe biggest area where the TUF does beter in is, as you identified, battery life. Build quality is still decent, and the 8945HS is still a high end CPU. The HS CPUs are for more of a balance between battery life and performance, whilst the HX CPUs are for those who just want CPU performance and don't care for battery life. \n\nThe TUF has a better GPU, which is preferable for most games. CIV5 like games that you play are more CPU intensive though, so the Legion may still perform a bit better here.\n\nIn terms of noise, as long as you aren't doing anything too demanding, neither laptop should be a problem. If you're pushing the hardware to its limit whilst you work then expect both to sound like a jet engine.\n\nI'd get the TUF. Better value, better battery life and better GPU. CPU performance is still good even if it isn't as good as the 14650HX.",
  "Definitely the ASUS TUF.",
  "I would like to know more about this display on TUF. I don’t know why people ignore it here in the comments, but I am pretty sure legion has a superior display all the way. Just make sure that you won’t end up with a “meh” display with max 250 nits.",
  "Ryzen 9 tbth rn",
  "thinking netbook with WinXP OS.\n\nwould that work for you?",
  "Yep! I figured I might, for both options, upgrade to 32gb of RAM which, with both options, is easy to do!\n\nWhat you state is also very interesting and hits one of my issues/points of thought.\nIs thr 4070 THAT more 'fututeproof' than the 4060? Because of the VRAM indeed.\n\nLooking into it further Ive seen that the Legion is, in its pricerange, basically the best 4060 laptop.\nBut does that matter with the years? Will the 4060 become useless pretty fast? In your opinion the answer would be a yes?",
  "Rtx 4060 mobile can easily handle any triple A game in 1080p. What are you talking about, man",
  "Eeeeeeh. Degradation issues? 🙃🙃🙃",
  "Thanks for all the comments and advicementaries friends.\n\nI just decided something though\nSomeone mentioned I should wait for black friday\nI didnt want to\nBut I checked the deals they throw here, even in the Netherlands\n\nAnd man.\nYeah its worth to wait. I'd be a thief of me own money if I wouldnt",
  "I was considering waiting on black friday but Im not sure I can. I actually do need a new laptop and 1300 is still a decent reduction of what it normally sells here.\n\nI asked someone else as well, someone also very positive about the Legion;\n\nHow does it do in everyday, not-plugged in life? Size, noise, battery etc.? It will be performing a whole lot of mobile non-gaming tasks. Thanks thanks",
  "Hmmmmm. My biggest regret with buying the Tuf would have been missing out on the screen the Legion has. Among many other things.\n\nIf you use it for everyday tasks, college-like stuff, does it perform well? Not to clunky, not to loud, not to quick to empty? Because thats where the Tuf is REALLY good. Can you, for instance, just let it run on the processor and its internal graphics fine? \nThanks bud",
  "I do not know what screen srbg means exactly hehe.\n\nThis I've found for the Lenovo:\n100% sRGB (Argyll 2.2.0 3D)\n\nThis for the TUF:\n98.5% sRGB (Argyll 2.2.0 3D)\n\nI have considered this, yeah. With the screen of the Tuf being shit, an external monitor comes to mind. I actually read that it has 2 ports to connect to am external screen with. One will always use the AMD Radeon 780M iGPU of the Ryzen 9 and one will always use the RTX 4070. Which sounds pretty dope.\n\nIm going to look up what srgb is now",
  "The deals in the picture arent what I have!\n\nTheeee Tuf and the Legion are both €1300 at the moment and although the Legion is exactly as in the picture, the Tuf actually has a rtx4070 in it.\n\nI just learned about the Raptor lake stuff.\nThe Tuf has become really interesting. \nThe biggest drawback is still the screen it has.\nAs Im not really good at this... how do I found out how the Tuf performs with an external monitor?",
  "Haha thanks my friend but Im not! The Netherlands it is\n\nNicer username!",
  "Btw. The price is actually the same for both in my case.\nThe deals Im looking at have both these laptops, with the TUF having a rtx 4070, at €1300. Talking the Netherlands, stuff isnt comparable to the US or even Germany.\n\nIve said in this thread to wait for black friday but Im actually not so sure. The ASUS-store has this laptop at €1899 normally. They have a flash-sale where its €1599... and I can get it for €1299 + possible tax reductions via my job.\n\nThis is, objectively, price included, a very good laptop right? You'd know! Thanks",
  "Very succint reply friend, thanks. I actually learned a lot in this entire thread. Knowledge I will build on the coming month so I can make a good decision when black friday comes around, lol. Thanks again",
  "Very good point and it is something I have very much considered in everything. Also mentioned in the text. It would be the single biggest thing I miss out on.\nThe screen of the TUF is kinda meh with 300 nits.\n\nBut, and maybe you know how to find this;\nWhat specs determine how good a laptop runs with an external screen? Because that would kinda fix that whole issue.\n\nThe Tuf is really, really good on the go in comparison to the Legion. If it works well with a monitor at home its to me the Tuf that takes it",
  "With all the stuff at intel going on you mean?\nFair",
  "Whadya mean?",
  "There is no futureproof really with laptops, they aren't as big to have drastic performance differences compared to desktop pc.\n\nNo pc even laptops are ever becoming useless, if you want to play new AAA games then you have to spend a lot, there is no other way around it unfortunately.\n\nThe way you have to think about it is, check the benchmarks of the games you want to play currently, and see if they match the performance the GPU can produce to have a decent experience.  \nLike for example I got a Lenovo Y500 (I think, it's been almost a decade) And I see it like a xbox360 console with a set of specific games I can play and run properly.\n\nAs for new AAA games, well... I got a desktop pc for that.  \nThe futureproof exists in the desktop pcs, not in laptops.\n\nThe 4070ti vs the 4060 (Non ti) oh wait, there is no TI version for the laptops lol. Hey it's been a rough year for me over here, war and stuff.  \nComparing the 4070 vs the 4060, according to [https://gpu.userbenchmark.com/Compare/Nvidia-RTX-4070-Laptop-vs-Nvidia-RTX-4060-Laptop/m2033663vsm2040979](https://gpu.userbenchmark.com/Compare/Nvidia-RTX-4070-Laptop-vs-Nvidia-RTX-4060-Laptop/m2033663vsm2040979) the overall difference is about 20% and in laptops that isn't much.\n\nIf you specifically must have the laptop, then you will have to spend on an expensive one.",
  "Not if you call sub 60FPS a decent gaming experience.  \nIf you are fine with lowering the graphics of new AAA game, that completely defeats the entire purpose of playing it to begin with.  \nIf you are fine with slideshow gaming, then that's fine by your standards, not mine.  \nHeck some games you can't even run at 60FPS in any settings they offer. But hey each to their own.",
  "just did some light reading and yea it seems all 13th and 14th gen models are unstable due to physical issues",
  "[Here.](https://youtu.be/H8LrwI-I_fY?si=3vFJlX4PQOrz-61g) I found a pretty brisk and to the point summary",
  "I recommend to also think about the keyboard\n\nLenovo keyboards historically are the best ones in laptops",
  "You’ll be fine if you don’t game while mobile. It’s a very good package overall and the build quality will actually blow you away. At 1300 I probably wouldn’t pull the trigger because you’ll bite yourself when Black Friday comes around and that thing will be under 1000 for sure.\n\nEdit: Size is ok for what you get in terms of gaming performance, the noise is basically not there when you just work and browse.",
  "I got last years model of the legion during Black Friday sales with 32gb ram, a 4070 and the i9 for $1400 down from $2k. And that screen is beautiful btw.",
  "I used it for uni, gaming and office CAD work and rendering. It does great in everything,only complain would be that it gets a bit hot on my hand from the side exhaust if I'm not using a laptop fan.",
  "Srgb determjnes the colorfulness and accuracy of your mobitor i believe . Usually when seller says 99% or 98.5% (slightly less than 100%), it is usually a lot less than that according to what I read from someone else.",
  "read my edit,just my two cents for the price difference just buy a new external monitor-the 4070 will perform better anyways but obviously depends on your use case.",
  "Decent price still, considering it has an 8945HS and RTX 4070.",
  "I am pretty sure it will do just fine with an external monitor.  CPU and GPU are more than good enough for that.",
  "i was joking.",
  "Also I believe the next RAM upgrade for laptops wouldn't be 32GB but 24GB shockingly.  \nWe are back in the tiny baby steps advancement trend in technology...",
  "You can literally run any game 60+ on ultra with 4060. Jesus, there are so many videos on YouTube. Go watch at least one.",
  "Dman okay okay. The plot thickens even more.\nThanks, Ill wach it!",
  "That is verrrrry interesting. Man, okay\n\nI might want to wait till black friday comes around for better deals on different laptops lol.",
  "Thank you thank you for all the info. I might wait for black friday is what Ive learned.",
  "Thats a very good deal for sure! Those are US-deals haha, wont get those here Im afraid.\nHow is the battery for non-gaming life? Thats really the only question Ive got left",
  "Right! Because with my just amassed knowledge that just sounds really strong. And its like a 30% sale already\n\nOne question to put this to bed really;\nAre there specs to know how a laptop handles an external monitor? Because if the TUF does that well a VERY big argument against the Tuf and in favour of the Legion would be gone.\n\nIts just so much better on the road. If it can be used semi like a desktop at home for serious gaming... it really wins to me. And Imma buy it.",
  "Why do you lie?  \nHere look how your 4060 mobile runs Wukong with imaginary 60+ FPS on Ultra 1920x1080.  \n[https://prnt.sc/YXOfIL6tMsnp](https://prnt.sc/YXOfIL6tMsnp)\n\nDo not lead people with your misinformation when they expect something and then getting scammed believing your lies.  \nAnd that's just one of many new AAA games (Some even years old) the 4060 mobile is unable to even pass 28FPS on 1920x1080 Ultra.",
  "Be careful with Lenovo though. I have one and they cut some pretty weird corners to make it cheaper (cooling solutions, storage limitations, power delivery, the included charger not having enough wattage and it losing charge gaming while plugged in). A friend of mine has another similar model which fucked up one of the stock RAM sticks, and only one slot works since putting a stick on the other makes the system bluescreen randomly. I read something similar happening on the Lenovo Legion subreddit. Just my two cents.",
  "Neither laptop should have any issues with plugging in an external monitor. Don't think there are any gaming laptops where it would be an issue. \n\n\nBuying what's appropriate for your needs is always the priority. Since the battery life seems to be useful to you, you might as well go for it.",
  "Dlss is non existent for you? It’s a norm nowadays. Can you please stop lying people about the performance of this gpu? You clearly haven’t done any research whatsoever before. And now you call me a liar? Wake up, not even a 4080 laptop gets 60 stable fps in Wukong in 1080p with dlls off. I suppose 4080 laptop which is btw equivalent or even better than 4070 pc not future proof too by this logic?",
  "I see for you future proof is only those 2-3k $ gpu like 5080-5090. Everything else is just garbage",
  "My sister and I used to have Lenovo laptops (not sure on the model however this was a few years ago) after a bit of using hers the hinge broke somehow then a while after the hinge on mine did too. So id argue that their casing structure isnt the best.",
  "That's why I mentioned that laptops aren't quite suitable for serious gaming.  \nAnd yes you are a liar, you said that a 4060 mobile GPU can run any AAA game on 1920x1080 Ultra, I showed you the benchmark of Wukong that shows under these settings and exact GPU, it can't even pass 27FPS.  \nSo if that's not lying, perhaps you should reconsider looking in the dictionary.\n\nAs I said, laptops don't really have futureproof for new AAA games. And if you enjoy playing in 27FPS, then I'm happy for you. But that's not my cup of tea.\n\nPeople should know what they are considering to purchase, especially these days.",
  "Help, not sure which to buy for my nephew. My nephew is getting into 3D printing and has started the modeling process. He also wants to get into gaming. I wanted to get him a great laptop as a gift. I narrowed down my search to these two dont know know which is the better machine.\n\nhttps://www.bestbuy.com/product/dell-plus-copilot-pc-16-2-5k-2-in-1-touchscreen-laptop-intel-core-ultra-9-288v-2024-32gb-memory-1tb-storage-midnight-blue/J3K4L6XFCG/sku/6620390?sb_share_source=PDP&ref=app_pdp&loc=pdp_page\n\nhttps://www.bestbuy.com/product/lenovo-yoga-7-2-in-1-copilot-pc-14-2k-oled-touchscreen-laptop-amd-ryzen-ai-7-350-16gb-memory-1tb-ssd-seashell/JJGSHC5C4H/sku/11277475?sb_share_source=PDP&ref=app_pdp&loc=pdp_page\n\nIm willing to pay $1100 (before tax) if you guys have any other recommendation.\n\nI wanted the laptop to have\n\n32g of ram\n1tb of memory\nTouch screen (since my work laptop has that feature and I think its great to have, it also means the screen is stronger, I think).\n\nThrough Amazon, I also saw this laptop, but reddit and other reviews mentioned an overheating issue.\n\nhttps://a.co/d/5Xe9o6z\n\nAll three laptops \nAre being sold by the store itself, not a 3rd party.\n\nThank you all for your input. ",
  "That Dell would be a great one in my opinion, but check out the HP OmniBook X Flip. You might be able to get a 32gb memory 2TB for $1k right now for Black Friday. I just paid $1150 recently but I love it!",
  "[https://www.bestbuy.com/product/hp-omen-16-2k-144hz-gaming-laptop-intel-core-ultra-7-255h-with-ai-boost-16gb-memory-nvidia-geforce-rtx-5060-1tb-ssd-shadow-black/JJGH2YRCT5](https://www.bestbuy.com/product/hp-omen-16-2k-144hz-gaming-laptop-intel-core-ultra-7-255h-with-ai-boost-16gb-memory-nvidia-geforce-rtx-5060-1tb-ssd-shadow-black/JJGH2YRCT5)\n\nor\n\n[https://www.bestbuy.com/product/asus-tuf-gaming-a16-16-fhd-165hz-gaming-laptop-amd-ryzen-9-32gb-ram-nvidia-geforce-rtx-5070-1tb-ssd-jaegar-gray/JJGGLH8Y2Z/sku/6617666](https://www.bestbuy.com/product/asus-tuf-gaming-a16-16-fhd-165hz-gaming-laptop-amd-ryzen-9-32gb-ram-nvidia-geforce-rtx-5070-1tb-ssd-jaegar-gray/JJGGLH8Y2Z/sku/6617666)\n\nThey don't have touchscreens but gaming laptops rarely do. These two are much better choices for gaming.",
  "Is this a good deal? Im looking for a laptop for light gaming and productivity would this be enough? Should I wait for more black friday deals?",
  "well what is the price??",
  "Didn't realize its not in the ss lol but its $400",
  "it is okay but I would prob spend 50 more on this \n\n[https://www.costco.com/p/-/acer-aspire-14-ai-copilot-pc-intel-core-ultra-5-226v-wuxga-1920-x-1200-touchscreen-display-16gb-ram-1tb-ssd-windows-11-home-steel-gray/4000344777?catalogId=10701](https://www.costco.com/p/-/acer-aspire-14-ai-copilot-pc-intel-core-ultra-5-226v-wuxga-1920-x-1200-touchscreen-display-16gb-ram-1tb-ssd-windows-11-home-steel-gray/4000344777?catalogId=10701)\n\nmuch more modern proccesor on 3nm node vs 7nm on the 5825u and a better igpu with access to xess which is nice for gaming\n\nAlthough deal wise that is a pretty solid price and hard to beat for that level of performance",
  "Oh bet I appreciate you ill go for that one",
  "Help Me Pick the Ultimate AI/LLM Laptop (Expert Input Wanted, Budget ~Flexible!) Hey all,  \n\nI’m a newly programmer, travel agent, and busy entrepreneur in Ottawa-Gatineau, and I’m ready to upgrade to a serious laptop for heavy AI/LLM work (think: local LLM, ML model training, coding in VS Code, tons of multitasking).\n\nObviously deals are starting to come for the holiday season so I really want to take advantage of the sales!\n\nHere's what I'm currently using:\nMacBook Air M1 8GB , 250GO, 13.3 Inch (and yes... I'm going crazy with that storage space and lack of memory)\nI DON'T use Apple ecosystem for my PC and phone. That MacBook was given to me through an old job.\n\nHere’s what I’m currently considering:  \n- ASUS ROG Strix 18\" (Intel Ultra 9 275HX, RTX 5060, 32GB RAM, 1TB SSD) for $2,899 CAD\n\nBut... I know there are TONS of options: Legion 7i, XPS 16, maybe others I haven’t considered.\n\n**What I need:** (I think? 🫣)\n- Must be able to run AI/LLMs *locally* (preferably with CUDA support, so RTX 4060/4070+ if possible)\n- 32GB+ RAM, 1TB+ SSD (more is better, but not Apple-tax pricing)\n- Portability is a bonus, but not dealbreaker\n- Prefer something robust, well-cooled, that won’t throttle or sound like a jet engine when coding/training models.\n\n**Open to:**  \n- Windows\n- 16-18” screen preferred; not opposed to “gamer” laptops if it gets the job done  \n- Budget is flexible if there’s a CLEAR value/feature win (listed option is $2,900 CAD but can go up/down if needed)\n\nIf you’re running local LLMs/ML or heavy dev tasks, let me know your real-world experience, tests, or recommendations! Feel free to drop links to NanoReview, benchmarks, etc.\n\nThanks in advance! 🙏",
  "https://www.lenovo.com/ca/en/p/laptops/thinkpad/thinkpadp/lenovo-thinkpad-p1-gen-8-16-inch-intel-mobile-workstation/len101t0149\n\nThis should satify your needs, if you absolutely need you AI compute power to be portable. Starts at $3800 i7 model you can configure up too your hearts content. \n\nNote those laptop GPUs are thermally limited and often a gen behind so if you are really serious get yourself a thunderbolt GPU enclosure and workstation GPU.",
  "Since you already have a portable machine, I'd actually recommend setting up a server that you can get at. This will get you a LOT more inference power with the same money.\n\nStart with something like this, but swap out the 5070 they recommend for a 3090 off eBay. [Excellent AMD Gaming/Streaming Build - PCPartPicker](https://pcpartpicker.com/guide/xpkcCJ/excellent-amd-gamingstreaming-build)\n\nFrom there, set up Ollama and OpenWebUI on the machine, and then set yourself up to access it remotely via a VPN app like Tailscale.",
  "> won’t throttle or sound like a jet engine when coding/training models\n\nAbsolutely not possible in a laptop.\n\nIdk what do you imagine training on a single GPU but what's really feasible is likely way smaller. \n\nFor inference, if you prioritise higher parameter models over inference speed, Apple M4 Max with 128GB shared RAM.\n\nIf speed with smaller models is preferred, you want something with RTX 5090 or RTX PRO 5000. Dell Pro Max Plus, Asus ProArt P16, all the gaming themed options.\n\nBut a much more reasonable approach would be a private server.",
  "Can't decide between these 2025 Laptops. Help would be appreciated. I’ve got a great gaming PC at home, but because of work and life in general, I barely get to use it. On the other hand, I recently started having a lot of downtime during night and weekend shifts at work, where I can pull out a laptop and play.\n\nMy current laptop is an old Lenovo with no real GPU. It’s fine for browsing, YouTube, and some light indie games, but it can’t run anything from my actual Steam library.\n\nI never bought a proper gaming laptop before because I didn’t need one and because local prices here are usually insane (Not EU or NA) But this specific Black Friday actually brought some rare, genuinely good discounts on high-end models, so I’m considering grabbing one, especially as with the current increase in RAM and other components, future machines seem to be even more expensive.\n\nRight now I’m looking at: **Asus ROG Zephyrus G16 (2025), Asus ROG Strix SCAR 16 (2025) and Lenovo Legion Pro 7**\n\nAll are running the new Ultra 9 CPU and a 5070 Ti. There are 5080 variants, but the discounts aren’t as good.\n\nThe problem is that reviews are all over the place.  \nThe Zephyrus looks perfect for work, lighter, more professional, way less flashy, but people say it performs very noticeably worse than the SCAR or Legion. On the other hand, those two are huge, heavy, loud, and run much hotter.\n\nGiven my situation, what would you recommend?",
  "I was ready to purchase the Zepher, yes I also read reviews that they have their problems with reliability but I would have chanced it for the sleek modern design and as you say understated looks. My last laptop was a Razer blade 16 with a 3080ti so I am used to the form factor and understand that these thin and light laptops don't quite get everything out of their hardware in the way that the fat boys do, to me, it doesn't matter. Anyway I ended up going for a ProArt P16 which is essentially similar hardware and chassis as a Zepher but even more understated.",
  "Choosing laptop Hi, I am a uni student needs coding and playing games, probably esports game but sometimes AAA. I have searched for some laptops with large screen (>=15\"), portable (probably less than 2.2kg) and wifi 7, including the new processors and a discrete gpu. \n\nThen I have found several laptops with the price I found, all are new and converted to US dollar, price vary by the processor 7 or 9\n\n\\- dell xps 16 9640 core ultra 9 4060: $1300\n\n\\- asus proart p16 4060 ryzen AI 9 $1700\n\n\\- lenovo yoga pro 9i aura edition 5060: $1650\n\n\\- lenovo thinkbook p16 gen 6 core ultra 5060: $1350-1650\n\n\\- lenovo legion 5i gen 10  core ultra 5060: $1300-1400\n\n\\- lenovo legion 7i gen 10 core ultra 5060: $1550- 1650\n\n\\- msi creator a16 AI+ 4060 ryzen AI: \n\n\\- msi stealth 16 AI studio 4060 core ultra 9: $1370\n\n\\- msi summit e16 core ultra 4060: $1650\n\n\\- msi summit A16 AI+ core ultra 4060: $1700\n\n\\- msi prestige 16AI studio core ultra 4060: $1700-1850\n\n\\- dell inspiron 16 plus 7640 core ultra 4060: I have not found one with wifi 7\n\nIf you have used one of these please give me some review about it like the battery the fan noise, GPU (some like the summit e16 has only 55w which may not fully use the 4060),... \n\nAlso, based on the price, with my budget about 1300-1400, which one should I buy, if the laptop worth the price, I would probably raise my budget to $1700-1800\n\nThank you",
  "The thin laptops are going to run hot while playing AAA games due to lack of room for good cooling.\n\nThey will all do well with everything besides the AAA gaming, unless you run lower settings to control the heat and they are all solid laptops.\n\nI have seen a lot of posts about MSI build quality not being great, maybe the business ones are better.",
  "yeah but am looking for a portable laptop as well, I sometimes play AAA games so not that important for cooling",
  "Laptop for college So I am in need of a new laptop for college as a nursing major and needed some recommendations. I saw these two options and wanted to know some opinions on them. I was thinking the Lenovo would be good cause then I would be able to also use it also a tablet if I wanted to use notes or something like that and it is on sale. Or would it just be better to get a m2 or m4 MacBook. ",
  "get the lenovo yoga\n\nbetter performance in games + more options for software depending on mojor",
  "Apple also has a deal for students to get the m4 MacBook  for $900+ AirPods so that’s also an option",
  "Take the Lenovo unless you have a specific need for the MacBook (Battery life would be one of them for a college student)\n\nIt might also be that the major you're taking has specific software that may only work on a Windows Laptop (You'd need to enquire on this) and that would rule out the MacBook anyway.\n\nThat's just my opinion.",
  "Let me get this out of the way first: for nursing, Windows and macOS work just fine. You shouldn’t be running into any compatibility issues, and the computing needs is so low. Even proctored exam sites work perfectly on ARM MacBooks, something that can’t be said about ARM Windows or Android.\n\nThe Yoga makes more sense if you need the tablet feature or touchscreen, though keep in mind the touchscreen has palm rejection issues, so use an artist glove if you need to. The stylus is not included at Best Buy; only on Lenovo’s website does it include the stylus with the laptop. It also has a USB-A port, which is what my nursing program required for lab (specifically for scanners), so you don’t need a dongle. The additional storage is nice to have, and you can replace it anytime you want. The OLED display is also great for media consumption, even if the speakers aren’t a match for the MacBook. I’d argue the keyboard is way better for extended typing on the Yoga thanks to the 1.5mm key travel, and that’s with the chassis rigidity being on par with the MacBook. You can charge the Yoga on either side, something the MacBook can’t do. It’s also x86 Windows, so you get the broadest software library including games. The AMD variant has a tasteful light chassis color, but makes the white LED keyboard lights harder to read due to the lack of contrast. In that regard, the Intel model’s gray color is more functional, as is the black colored keys on the MacBook.\n\nThe MacBook still has better battery life ‘cause the M2 draws less power than the Ryzen 5 340 on idle and light use, even with the Yoga’s larger battery. My classroom has so few outlets, so battery life was particularly important for me. That’s while the M2 has slightly higher single core performance, so this aging 2022 MacBook will still feel slightly snappier than a 2025 Yoga, and zero fan noise due to the lack of fans. The display is higher resolution, so text will look crisper and everything is more functional with the extra pixels. Both laptops have glossy panels, but the MacBook has higher brightness to combat reflections in bright rooms. The integration between Apple devices is mostly smooth, which adds a lot of versatility to your school experience. You can text your friends in class without whipping out your phone, which is handy for sharing notes and thoughts stealthily. It’s also a lighter device, approx. 0.5 lbs lighter than the Yoga, and thinner too.\n\nAs someone who likes to game on occasion, likes to illustrate, and prefers Windows overall, the Yoga with stylus is a natural winner for me (that’s what I ended up buying), but I would shop for the Intel variant first for its superior GPU for games and MacBook level battery life on a Windows laptop, even if it’s pricier than AMD. The 226V Yoga goes for about $700 on a discount at Best Buy (it’s sadly not discounted right now). I got the 256V for $800 when it was on discount. Please do not buy at MSRP. The Intel model gets discounted less frequently, likely due to popularity, so you have to be a patient shopper for it.\n\nTo me, how I rank these laptops for my use case (mainly school), it’s Intel Yoga 7i > M2 MBA > AMD Yoga 7, though weirdly enough this is also coincidentally ordered based on pricing. As some who gets serious FOMO, I personally skipped AMD for this year’s Yoga 7 lineup ‘cause I find the Intel one is better for school for the battery life difference, but otherwise I think the AMD Yoga 7 is still fairly well rounded and great on a tighter budget, and battery life is still decent.",
  "Walmart has the m1 MacBook Air for $599",
  "Considering I also own a gaming pc I’m not rlly gonna be using it for games but thanks for the input",
  "Would that be a better option than the Lenovo?",
  "then cant you just use that?",
  "No, it would be less powerful, have less storage, and less ram. Also a worse display. That being said - it’s still very usable and opens you up to apps that work great on Mac compared to just ok on windows. Also I personally think programming is 1000x more comfortable on Mac instead of windows. Command line on Mac is a godsend compared to windows power shell. A lot of computer courses these days are made with Mac in mind because so many students have them.",
  "What will your major be? Any coding?",
  "It’s a whole setup with the monitor and everything so not very practical to take to class everyday",
  "No my major is nursing",
  "then go for the lenovo",
  "Ok I would say the 599 Mac is fine but I would personally get the slightly newer more expensive Mac if you can afford it",
  "16gb of ram is a big difference compared to 8gb",
  "Lenovo also has 16GB of ram",
  "Getting a new laptop through my work at a discounted price, looking for stylus note taking, modelling, gaming and office use. Help me choose \nI'm able to get one of these laptops through my workplace for a somewhat discounted price with a 3 year warranty. My main use case is going to be writing some notes on the device as a tablet with a stylus, lightish gaming, CAD and video editing. Then some general office and Uni work. So Clair Obscur is a game I want to play, some light modelling in blender maybe or autocad, and editing 1080p footage and possibly short 4k video in Da vinci. Any thoughts? May be able to get others a slightly lower cost than standard but curious to see what people think. Thanks.\n\nMSI Summit E16 AI Studio A1VETG-002, 32GB RAM, 1TB, RTX 4050 – price £792\nSKU # 9S7-159621-002\nMSI Summit E16 AI Studio A1VETG-002UK Intel Core Ultra 7 155H Hybrid (2-in-1) 40.6 cm (16\") Touchscreen Quad HD+ 32 GB LPDDR5-SDRAM 1 TB SSD NVIDIA GeForce RTX 4050 Wi-Fi 7 (802.11be) Windows 11 Pro Black\n \nAsus Proart PX13 32GB RAM, 2TB RTX 4070 – price £1604.40\nModel: HN7306WI\nASUS ProArt PX13 OLED HN7306WI 2-in-1 Laptop | 13.3 Inch 3K OLED Touchscreen | AMD Ryzen AI 9 HX 370 | NVIDIA GeForce RTX 4070 | 32GB RAM | 2TB PCIe SSD | Backlit Keyboard | Windows 11 | Stylus Pen : Amazon.co.uk: Computers & Accessories\n \nLenovo Yoga Slim 7i Gen 9 Aura Edition (15\" Intel) – price £943.20 \nPart Number: 83HMCTO1WW\nLenovo Yoga Slim 7i Gen 9 Aura Edition (15″ Intel) | AI-Fueled Creativity | 83HMCTO1WWGB4 | Lenovo UK\n \nLenovo Thinkpad E14 Gen 7 – price £764.40\nPart Number: 21U2CTO1WW\nThinkPad E14 Gen 7 (14 inch Intel) | Next-Gen AI PC for Business | 21U2CTO1WWGB2 | Lenovo UK \n\nAny particular standout? Very tempted by the Proart but not sure if the £800 extra over the MSI is justified for better specs. The Lenovo are more hoping the IGPU will be enough for me, instead being lighter for portability and better battery. Unfortunately can't find many reviews on the MSI, I know the 4050 isn't great but wondering it it'll do for me. Thanks.",
  "How is lenovo Ideapad slim 5 Ryzen 7 7735HS. If anyone have this laptop i really wanna know the reviews. Nd battery too.",
  "FIrst and foremost doubt. Why is the title and description says 7735HS and the options below says 7735U?\n\nBoth of them are good performers. If we go to specifics, both have same cores and threads, 95% details are same between those twooo.\n\nThe only difference is:\n\n* **7735HS** is 15% better in multi-core performance than 7735U. HS is 15% better in performance than U.\n* **7735U** has better performance per watt, meaning slightly higher battery power than 7735HS. U has better efficency than HS (maybe like 10mins more depending on the usage).\n\nMake sure you are getting the model that you are looking for. The seller might have done the incorrect information, but just to make sure you are getting the same contact with them and confirm once. Just a precautionary.\n\n**Disclaimer:** These are rough calculations.",
  "I prefer to buy from lenovo official website , you get a 3000₹ off on a offer called after10deal it applys after 10 pm and if you use credit card 3000₹ off further,  finally it will be around 56,000₹\n\nIt has a 70Whr battery 100% SRGB display and its 15 inch version  \n\n\nhttps://www.lenovo.com/in/en/p/laptops/ideapad/ideapad-s-series/lenovo-ideapad-slim-5-gen-10-15-inch-amd/83j3003sin",
  "Yes I know this much about it. I'm asking if this is a good option or not?",
  "Fine but I don't want soldered ram does it come in SoDIMM?",
  "Yes yes, OP. Its really a good laptop and your choice.\n\nBattery Life of **Ideapad 8-11Hrs** as per various sources, thats an average. Some even got 12hrs with single charge.\n\nIf you dont mind me saying this, I have the same brand and processor in my notepad list and its only 56K from direct Lenovo site. However, its a ThinkBook and not IdeaPad.\n\n**16\" | 7735HS | 16GB DDR5 | 512GB SSD | Battery: 7-11Hrs | PassMark: 23209**\n\n* ThinkBook 16 (21MW008WIN): [Lenovo ThinkBook](https://www.lenovo.com/in/en/p/laptops/thinkbook/thinkbook-series/lenovo-thinkbook-16-gen-7-16-inch-amd/21mw008win) (₹56,831)\n* Gaming: [https://www.youtube.com/watch?v=ICce-CWxzbQ](https://www.youtube.com/watch?v=ICce-CWxzbQ)\n\n**What’s Included:**\n\n* 1 Year Onsite Warranty\n* MS Office Home 2024\n* Lenovo 39.6cms (15.6) Value Plus Backpack at ₹1",
  "whats your usecase?",
  "The thinkbook u mentioned ppl say it will come max 4hr battery life is it true or false info",
  "Coding, little gaming and vdo editing. \nI'm a cs major student",
  "I promise you, when I first saw this laptop model 5 months ago. Its have very good battery and overall quality. Then, after 2 months I am seeing build quality is not good and its between Ideapad & ThinkPad quality.\n\nBut, seeing its battery capacity as 45Wh, no wonder it has low battery backup. I feel bad now for sharing that shit piece.\n\nFor that 54k price, you can get the ThinkPad though with a bit less performance processor and good build quality as most of them knowns that ThinkPads are build like tanks.\n\n**16\" | 7535HS | 16GB DDR5 | 512GB 2242 SSD | 45%NTSC, 300 nits, 60 Hz | PassMark: 17929**\n\n* ThinkPad E14 (21M3S0FJ00): [Lenovo ThinkPad](https://www.lenovo.com/in/en/p/laptops/thinkpad/thinkpade/lenovo-thinkpad-e14-gen-6-14-inch-amd/21m3s0fj00) (₹55,870)\n* Gaming Test: [https://www.youtube.com/watch?v=-QL41ovz6hc](https://www.youtube.com/watch?v=-QL41ovz6hc)\n\nI hope atleast this one will have a good battery life. I checked the battery reviews from couple of websites and some mentioned it has good battery life and only a couple of people reported defective batteries.",
  "if theyre light games, then yes it is all good",
  "But this also has just 47wh \nI saw this https://share.google/4MdWRKCVp33Zjj2Na\n\nWhich 70wh it goes to 57k sometimes  but I searched everywhere but no review on this specific laptop",
  "I mean gta v for short time",
  "Can I use it for light 2d works? Not heavy ones",
  "So, I was scrolling randomly and saw someone asked for the same thinkbook review. One of the commenters mentioned it was shit...\n\nThey said this: The camera is really bad. Everything else seems to work fine. The battery is small though. 45Wh only (I get around 3.5 - 4hrs of battery under light usage). You can try for IdeaPad slim 3 with r7 8840HS. It has a 60Wh battery. Or IdeaPad slim 5 gen 10 with ai 7 350. The processor and battery combination in this one is deadly (and so is the price). 55k\n\nI think this would help you in picking up a good battery life laptop hopefully.",
  "yes, it should be sufficient",
  "Thank you",
  "Lenovo Yoga 7 Pro vs Asus Zenbook 14 OR Lenovo Yoga 2 in 1 vs Zenbook S14 Hi, so I am looking for a premium thin and light powerful laptop with great battery life in the premium segment. I have shortlisted to 2 categories and 4 laptops which I have mentioned in the title.\nHere are some basic configurations :-\n1) Lenovo Yoga 7 Pro \n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD \n- Aura édition 8853 MT/s\n- Touch\n\n2) Asus Zenbook 14\n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD\n- Normal édition and less than 8853 MT/s\n- Touch and stylus support\n\n-> 3) & 4) Both have Intel core ultra 7 258V processor which I'm worried won't be sufficient for tasks such as light gaming even. \n\nPlease provide your valid inputs with your reviews and also I would consider yoga 7 Pro but it comes in a single color which I found a little bit unsatisfactory than the zenbook's looks.\nInputs are welcome! Thanks\n\nP.S. - I am going to buy the laptop tomorrow so I need quick suggestions please.",
  "I have the Zenbook 14 (mine has the 1920x1200 OLED, otherwise specs as you listed) and would definitely recommend it. In mixed use (some Youtube, web browsing, a couple hours playing 9 Kings) I've been getting 8-9 hours of screen on time out of the battery, and performance has been excellent. Battery might be slightly better or worse on Windows (I am using Debian Linux), but for the performance I think that much battery life is still mindblowing. The hardware is 100% a premium device. If I could do it over, I would buy this laptop again.",
  "Damn, but didnt you consider yoga 7 Pro cuz it has better features otherwise",
  "Been looking everywhere for someone who has this OLED! The 3k doesn’t appear to be available in the UK. Do you have the reported issues with seeing dots on the digital layer for the touch screen? Do you do a lot of reading and typing as supposedly it’s not great for that either?\nFinally, how is wifi 7 card?\nThank you",
  "I did not. The Yoga 7 Pro doesn't appear to be readily available in the US (where I live) in anything close to the spec you listed, so that takes it out of the running for me. I did find a listing for $200 more than I paid for the Zenbook, which doesn't inspire me much. Are the prices for the two similar where you are?",
  "> Do you have the reported issues with seeing dots on the digital layer for the touch screen?\n\nI don't; however, those seem to be reported by people who view a lot of white backgrounds. I just checked out a white background myself to try to look for it and I *think* I saw a little of it on a fully white screen, but frankly the sheer amount of white light was far more offensive than any pattern that may or may not have been there. With anything not majority pure-white I can pretty confidently say it's not an issue.\n\n> Do you do a lot of reading and typing as supposedly it’s not great for that either? \n\nNot sure how a screen would be bad for typing, personally - if this is re: the keyboard, I have found it to be very solid as far as laptop keyboards go. Primary use case for this for me is as a web browsing machine/capable PC on the go, but it is not my main PC. I have not noticed anything that would lead me to say it's not great for reading, though.\n\n> Finally, how is wifi 7 card?\n\nWorks well, though I can't speak to the Windows-specific aspects of it. No complaints once it was up and running (If you're a Linux user, it wasn't detected by the Debian installer, so I had to use a USB-C-to-Ethernet dongle to get the OS installed; worked fine out of the box once the OS install was complete. If you're a Windows user I am sure it will be perfectly fine out of the box.).\n\nOverall, I'm really happy with this laptop. I bought it as a secondary device as mentioned, but I could happily use it as my main PC (outside of graphically-demanding games) if needed. It's got tons of power in an extremely portable form factor with an excellent screen, which is exactly what I wanted from it.",
  "Well well it's even about a 100$ cheaper here the yoga",
  "Really appreciate you taking the time to reply, thank you.\nI think the reading/typing comment was tied to the screen in the sense of it being suitable for that type of work (coding, desktop publishing etc) vs gaming/entertainment, but I’m satisfied hearing from a real world not review world use case. \n\nI’m probably going to go for ultra 7 rather than 9 - my use case won’t really benefit from the extra power when the trade off for the power is slightly less battery time , and more heat and subsequent fan noise. \n\nThat conclusion is also formed from reviews though, so if you’ve an opinion on that I’m all ears! (I will be running Windows)",
  "I may be wrong (going off of the US website as that is where I am based) but it looks like the Ultra 7 variant is the older 155H, whereas if you want the current crop of CPUs the Ultra 9 285H is the only option; from what I was able to find the 155H and 285H get similar battery life, but you get a healthy chunk more performance with the 285H (as you'd hope). If the pricing is similar imo go for the 9. Haven't found heat or noise to really be an issue with this machine anyway (yes the fan can be heard when it's on like any laptop, and yes putting a big fat 16 core CPU into a thin and light chassis like this means the fan will be coming on regularly - that will be the case both with the 155H and the 285H, so I would not consider it a factor in purchase decisions personally). Obviously, if the 155H meets your needs and comes at a decent discount, then it makes sense to go for it.",
  "Need Some Buying Advice I want to take advantage of the Black Friday sales to buy a new laptop, & would like some outside advice.  I've been reading & watching so many reviews that my head is starting to feel like it's overstuffed!  I live in rural NSW & there are no local computer stores for me to test laptops physically.\n\nI use the laptop for HOPA games, browsing & occasionally photo editing. My current laptop is an Infinity S7 (Intel Core i7-10875H, 16 GB RAM, 1TB SSD, NVIDIA GeForce RTX 2070) with a 17.3\" screen, which is 338nits. It has a mechanical keyboard, which I like & its weight is 3.6 Kg.\n\nI'm not concerned about portability or battery life, as I only use the laptop at home, but I don't want the new laptop to be too heavy since it rests on my legs.  My budget is AU$3,000.00 > AU$3,500.00, although I'm fairly flexible about that.  One of my main requirements is a clear, non-glare screen as I've had eyesight problems & I use the laptop in a sunny room.\n\nAfter searching various brands & models, I've been looking at the Lenovo Legion Pro 5 or 5i with 16\" screen.  I'd love to get a 17.3\" screen laptop again, but they seem to be out of favour with the laptop manufacturers. I looked at the Lenovo LOQ 17.3\" but was put off by the reviews talking about its 300nits screen, plastic case & weight.\n\nWhat do people think about the Legion Pro 5 laptops, & do you have any other suggestions?",
  "Black Friday Gaming Laptop Dilemma - Need Advice Hey everyone,\n\nI’m looking for some honest advice on choosing a new laptop during the Black Friday sales. I’m upgrading from an Alienware 17 R5 because I’m starting my Master’s in Architecture and need something much more portable. There’s going to be a lot of traveling involved, plus the usual mix of rendering, design software, and some gaming on the side.\n\nRight now, I’m deciding between the ASUS Zephyrus G16, the Alienware Area-51 16\", and the Lenovo Legion Pro 7i. Each one has something I want, but also something that worries me. The ASUS is super light with that gorgeous OLED, damn good aesthetics and design,but I keep hearing mixed things about liquid metal leakage, and that’s making me nervous about long-term reliability. The Alienware feels like the safe, familiar option but it’s definitely not the lightest, and I don’t know if I should go through the bulk again. Meanwhile, the Lenovo looks like the strongest performer of the three, best value too but its weight might become a problem with constant travel, as i will also have an ipad pro 12.9 inch and few HDD's, headphones with me.\n\nIf anyone uses these laptops for heavy workloads or travels with them often, please share your experience especially with thermals, noise, build quality, and whether portability becomes a bigger deal than raw performance in the long run. Any insight before I pull the trigger would be really appreciated.\n\nTL;DR: choosing between Zephyrus G16 (portable but liquid metal worries), Alienware Area-51 (familiar but bulky), and Legion Pro 7i (best performance but heavy). I’m starting a master’s with a lot of travel what’s the best balance between performance and portability?\n\nAttaching the screenshots for better clarity.  \n  \n**My Requirements**  \nI’m starting a Master’s degree in Architecture, which means:\n\n   * Lots of travel\n   * Need something powerful for rendering, but not a back-breaking brick\n   * Battery life during travel matters, but not a dealbreaker.\n   * Reliability is extremely important since I may travel between countries\n   * I do gaming too forza horizon, COD, AC, RDR2 City Skylines etc. Not competetive purely for enjoyment.\n\nhttps://preview.redd.it/s08hguy06u2g1.png?width=1256&format=png&auto=webp&s=84bf741bf420dc0f7e27291b3f3005f32507ef99\n\nhttps://preview.redd.it/x3cvg8z06u2g1.png?width=1244&format=png&auto=webp&s=e24b24d7690f8d1152463cfaec459cb56eaf8bc9\n\nhttps://preview.redd.it/2t9npsy06u2g1.png?width=1247&format=png&auto=webp&s=3d7b90f950400d98281b359b6d112d50bc743da4\n\n",
  "Laptop Recommendation As per my last reddit post I have narrowed down to the Asus Rog zephyrus g14 but can't decide which is better, there is one with an rtx 4060 and another with rtx 5060. Considering people recommend not to upgrade to an rtx 5060 from rtx 4060 for desktop GPU's. Although still, these are mobile GPU's so should I get this or is there any other in your opinion.\n\nI am mostly looking for thin and small size but with somewhat battery backup like 2-3 hrs which is enough for this laptop. The laptop can be heavy, the weight really does not matter. Although there are better options, one thing that stops me to select those is the small compartment poking from behind of the laptop which is for better air flow. \n\nThe 3rd image shows what I want to describe from a lenovo loq which has this particular thing really long and wide.",
  "Get the 5060 if you want better performance\nGet the 4060 if you want to save some money",
  "When already spending 1,75,000 what's it worth just to spend 10,000 more, thanks bro",
  "Go for it man its an investment if u try to do things like video editing and stuff..i did the same like one was 1 lakh 15 and one was 1 lakh 30 i went for 30 one..it was tuf vs rog strix for me..i chose rog and i dont regret it",
  "What games will u play",
  "Not many games as the best games are expensive but for AI model training, it's just like using chatgpt but having 20-30 windows open at the same time",
  "Tried sailing the seas",
  "What do you mean by that?",
  " p!r@te games",
  "Oh yeah, I have sailed the seas then, Fitigrl and FileCR, GETinto pc, I know all those",
  "So going to p!r@te the games",
  "Yep",
  "Thinkpad or Zephyrus My current laptop (Surface Book 2 13.5) is still doing quite well but I'm looking to upgrade, mostly because of performance restraints and reliance on cloud for ML tasks. I work with applied AI but all the tooling I need from work is provided, but I want to have more power for my tinkering outside of work.\n\nI have narrowed it down to 2 options: The Lenovo Thinkpad P1 Gen 7 or the Asus Zephyrus G16\n\n\n\nThe Thinkpad is on sale for £1800 with the following specs:\n\nIntel® Core™ Ultra 7 165H vPro® Processor\n\n4060 8Gb 60W\n\n32Gb (upgradable, but expensive to do so)\n\n1Tb\n\n16\" 3840x2400 IPS 60Hz\n\n\n\nAnd the Zephyrus G16 is more modern and also not on sale (\\~£2650) with the following specs:\n\nIntel® Core™ Ultra 9 Processor 285H\n\n5070ti 12Gb 120(?)W\n\n32Gb (soldered)\n\n1Tb\n\n16\" 2560 x 1600 OLED 240Hz\n\n\n\nMy usage consists of the following:\n\nMy laptop goes about 13 hours between long charges, with 4-6 of those being light usage (coding/web browsing/reading and highlighting academic papers) and the rest is just idle with screen off and shut. I can charge it with a very low wattage USB-C connection when out. When I'm at home and I have the main charger I will often be hooked up via USB-C to an external monitor, I'll do more coding and web browsing but I'll also be running ML models (mostly Graph Neural Networks and Multi Agent RL - not LLMs). I also don't train locally, but having the ability to prototype small models before I send it up to the cloud and leave it to train would be useful. I do also want to perform data processing with pandas locally. Aside from that whilst I do game it's only League of Legends/Minecraft so I don't need to worry about running AAA games. I'm looking to use this laptop for the next 5+ years so having longevity in mind is important, although if the Thinkpad becomes outclassed because it is cheaper I'd be okay with upgrading earlier.\n\nI haven't been able to see either of them in person to get a feel for them, and I can't decide off of specs and reviews alone, so hoping I can get some help deciding. \n\nOne final and somewhat important point is I am British, I prefer the English UK ISO layout - which means a big enter key, if that is or isn't possible on the laptop that does have some sway in my decision.\n\nI am also somewhat open to suggestions. I have also considered:\n\n\\- MacBook Pro - but I need windows/WSL and x86 (as well as NVIDIA for local CUDA)\n\n\\- Framework 16 - I don't think the 16 system is mature enough yet, especially for the cost",
  "Consider the Thinkpad T1G? It's the version of this year's P1 (Gen 8) with gaming (RTX 5060/5070) graphics cards. Best of both worlds? Unsure how pricing is over the pond.",
  "Laptop thoughts suggestion This is the laptop I’m interested in buying, hoping it goes on sale for Black Friday! I’m curious if there are cheaper laptops that are similar. Conversely, are there more expensive or similar price models that give me more for the money I will be paying? \n\nThe reason I’m interested in this laptop is for the \nOLED (never had an OLED screen before) \n120 hz (that will be new for me for a laptop \n14-14.5 inch is the size I’m looking for\nIndifferent to touch screen, I can live without it \n\nThis model also has 24gb of rams, super interested to have a laptop with lots for ram (I’m think my current one is like 8 or something) \n\nOther laptops I was looking at are \nThe OLED zenbook s14 \nThe Lenovo yoga aura edition (not 2n1 version). It’s seems those only really have 120 HZ in that are 15” models. \n\nAny suggestions? Anyone had personal experience using the vivobook, thoughts? Personal opinions. ",
  "Lenovo Legion Pro 7i (RTX 5070 Ti) @ $1,999 - Worth it or wait for better Black Friday deals? Hey everyone! Content creator here looking for laptop advice. **Zero gaming** \\- this is purely for work.\n\n**My workload:**\n\n* Python automation & AI development\n* Video rendering (DaVinci/Premiere)\n* Running AI models locally (ComfyUI, Stable Diffusion, local LLMs)\n* Text-to-image, image-to-image, image-to-video generation\n\n**Current deal I found:** [Lenovo Legion Pro 7i at B&H - $1,999 (was $2,849)](https://www.bhphotovideo.com/c/product/1875948-REG/lenovo_83f5001bus_16_legion_pro_7i.html)\n\n* Intel Core Ultra 9 275HX\n* RTX 5070 Ti (16GB VRAM)\n* 32GB RAM\n* 2TB SSD\n* 16\" OLED 240Hz\n\n**Questions:**\n\n1. Is this the best deal right now, or should I wait for Black Friday proper?\n2. Anyone seen better early BF deals on comparable specs (especially RTX 5070 Ti laptops)?\n3. Considering Alienware equivalent - thoughts on Lenovo vs Alienware for content creation/AI workloads?\n\nThe 16GB VRAM on the Ti seems crucial for my AI work. Any insights appreciated!",
  "What would be the better option between these two? HP seems to be better value. So I currently have a Lenovo Yoga 7i pretty the much the same specs as the 9i I would just appreciate the OLED screen and 2-in-1 capabilities. My plan was to originally return the 7i and pay the extra $100 for the OLED screen, and 2 in 1 capabilities. But when looking again, I found this HP for even cheaper with seemingly better specs. The 2tb SSD seems pretty sweet plus a slightly more powerful processor. What I'm worried about tho is I hear a lot of talk of HP's software and battery life as well as the build quality not being as good as the Lenovo's, so im wondering how true this is, and if it would be worth it to get the HP for the cheaper price, the Ultra 9, and the extra tb of storage. If it matters im currently in high and planning to use the laptop for an IT degree throughout college. Idk if this is correct or not but I think the HP's have more upgradeability as well? Any advice would be appreciated.\n\nhttps://preview.redd.it/m793hhkm83yf1.png?width=2571&format=png&auto=webp&s=92a036802fc9fab1ad1c4a15553ddafaee6532f4\n\nhttps://preview.redd.it/2fkn1axn83yf1.png?width=1599&format=png&auto=webp&s=95310f5d6b61cc08a71efb02207b0cb8f0a1488d\n\nhttps://preview.redd.it/xjzj0lyo83yf1.png?width=2572&format=png&auto=webp&s=19e472d4a341c1c4337d4bb16c3f59b56ab8b32b\n\nhttps://preview.redd.it/xj3bnlzp83yf1.png?width=1582&format=png&auto=webp&s=8a7f3743189b24c803ded5f7df004fcd34b68cdc\n\n",
  "The discrepancy here is that the Yoga 9i Aura isn't discounted like the OmniBook X Flip is. You never want to purchase a laptop at MSRP 'cause they're all overpriced.\n\nThat said, if these two were similarly priced, you should pick based on display size 'cause that's the biggest difference here; essentially 14\" vs 16\". That, or the stock SSD. I believe both laptops are upgradeable in this department, but you won't need to think about it if you have 2TB.\n\nThe Yoga 9i Aura should beat the OmniBook X Flip in build quality, or just overall quality across the board. The OmniBook X series is a lower mid-range series more comparable to the Yoga 7i (and even in that comparison, the Yoga 7i is considered better built, of the two in 2025), while the Yoga 9i Aura is premium class. The OmniBook Ultra series is more premium than the OmniBook X and broadly comparable to the Yoga 9i Aura.\n\nMy advice is to wait for a discount on the Yoga 9i Aura if you want to upgrade, but that's 'cause I trust the build quality and keyboard quality (coming from a current 2025 Yoga 7i owner), and I'm more partial to a 14\" display.",
  "HP OMEN 16 VS LENOVO THINKBOOK 16PG5 Which is better?\n\nHello, everyone. I am just gonna dive right in,\ncurrently I don't have a notebook. I have been looking for one for 2-3 months and came down to 2 choices.\n\n1) HP OMEN 16 (2025- I think)\n1920x1200 165hz\nRtx 5060 8gb gddr7\n32gb(2x16gb) ddr5\n83wh battery and 230w charger\nIntel Ultra 9 285H\n2.9ghz base to 5.4 turbo ghz\n16 (6P+10E) cores and 16 threads\nArc Graphics 140T igpu\n1TB & 16 inches\n\n2)LENOVO THINKBOOK 16PG5 \n3200x2000 165hz\nRtx 4060 8gb gddr6\n32gb(2x16gb) ddr5\n80wh battery and 300w charger\nIntel i9-14900HX\n2.2ghz base to 5.8 turbo ghz\n24 (8P+16E) cores and 32 threads\nIntel UHD Graphics 32EU\n1TB & 16 inches\n\nI will mostly play Cyberpunk 2077, Hollow Knight, Silksong, Dispatch and modded Total War Warhammer 3. Maybe Hogwarts Legacy.  I will primarily use this to study and programming in R, Python and Matlab especially during my Financial Mathematics masters and risk management while working for some projects.\n\nI have been reading reviews, user problems and just using every website to AI to choose.\nI used notebook check and nanoreview. Don't know if there is any other good one. I'd appreciate your help. \n\n",
  "Lenovo Yoga Pro 7 14ASP9 Hi all\nI'm looking to buy new laptop for myself, i came across this model(32 ram, 1tb ssd, recently 9 365) it looks great to me specs wise considering it can get it for 1k euro with discount. Also i was looking at macs but they're kind of pricey, especially in want to have same storage and ram. I could not really find comprehensive information regarding battery life for this model, either reviewers say it's ok like 7 hrs, or some ppl on reddit say it's abysmal. Is there anyone here who uses it and can share some insights? Also i was thinking of running linux on it, it seems that it's quite compatible and I'm guessing l'l get better battery life?"
]