[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Guys is this genuine? Like seriously 1 rupees? ",
  "likely a phishing page, open a new tab type \"store.lenovo.com\" manually and make sure it's still in your cart there",
  "Proceed with caution. For that price, I'd say to just go ahead and buy it and see what happens, considering you're on [store.lenovo.com](http://store.lenovo.com), but I'm still very suspicious about it. There's no reason they'd actually sell anything for that price, unless it was a mistake on the website. However, if it is a mistake and it lets you place the order, it's possible that they might still honor the purchase and just eat the loss as a result of their mistake and still send it to you. It looks like the actual Lenovo website. Look closely at the URL, and type in the Lenovo website URL manually and navigate there directly to make sure you're at the right place. If you still see it there, maybe try and see if it lets you order.",
  "Try and find . Pay 1 rupee",
  "If this is real some intern finna be fired",
  "Could be an accident. \n\nI found an issue on HPs website once and got some accessory stuff for Penny's on the dollar.",
  "Already seen that on the Lenovo Page. They released a new device and instead of 2000€ it said 200€ the Order got canceled. Might be mistakes or Intention to get intention",
  "Looks like a scam",
  "Whenever I Google the Indian version of Lenovo's website, it takes me to lenovo.com/in/.\n\nFeels like a scam. If you have a prepaid debit/credit card, it may be worth trying. I wouldn't give any information linked to my bank if I were you.",
  "I have orderd 2 of them at 2 rupees , lets see what happens,  haha",
  "Show us the whole url.\n\nIf that's phishing, all they needed were your payment credentials.",
  "Well Rupees are a fictional currency from The Legend of Zelda video game series so I’d say it isn’t genuine.",
  "Next time just order it and don't post it on places like this",
  "they brought the store down since",
  "Do you think it can be true?",
  "Happened to me. Threatened them with commerce commission and they gave it to me",
  "Its a phishing site, just went to it myself, its pure fishy. Also look at the copyright in the bottom",
  "Just got a new pc! For some reason, every time I try to launch steam, it keeps giving me the error message \"Glory to the CCP.\" Any fixes?",
  "Go for it, the worst that can happen is you lose 1 rupee, the best outcome, you effectively get a free laptop, just make sure to use a single use card number (like zip pay single use card, or something similar)",
  "Use a throw away card from Walmart",
  "Check the website, yours might be fake.",
  "Make sure it's the actual site 1st and not just some phishing website to take your credentials and payment information",
  "How?\n\n**Edit:** I found the same bug. Placed an order. Few minutes later some guys from the store called and said they cannot sell it for ₹1 and cancelled the order.",
  "1 rupee and you still asking \"is this genuine\" how old are u boy?",
  "i think OP has done inspect element   \nhe just wanted some attention",
  "This is a scam for sure  it’s just a copy site and it’s even in html 🙃\n\nOfficial site : https://www.lenovo.com/in/en/laptops/",
  "Guys here is the url \nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Run it with PayPal and just see",
  "Bhai 2 4 mere liye karde paise deta mein",
  "Buy 2.",
  "Tip\nIf its too good to be true, its fucking scam.",
  "try to trace and get the complete URL and look for signs the website might be a phishing site.\n\nor you just found a pricing error and started chaos",
  "Checked. Website is genuine, having Google sign in option as well. The item looks like a wrong entry.. They will correct it and cancel orders before shipping.",
  "I haven't seen any malware that attacks android phones and modify the webpage content / hosts file to redirect you to a phishing page. Looks like a real website, but the pricing is definitely a glitch, which they would either honor it as another redditor mentioned, or cancel the order if you place it. Yet - the company has all rights to cancel an order at anytime and refund you the money. \n\n  \nI'd go for it and see what happens if I were you, no harm in losing a rupee. Virtual cards are best, I remember SBI had this feature at least 10 years ago but not sure now. Proceed with due diligence.",
  "It's only 1 ruppee... Plus shipping maybe? Not the worse scam I've ever seen. Because that's barely a profit",
  "Try and see if it actually arrives",
  "Make a rando paypal, add one dulla to it, disconnect your all your stuff form it, buy.",
  "It is just a glitch, but with a credit card and make sure they charge 1 r",
  "I'll take 8000. I can't figure out how to get the page OP is on though.",
  "hold on i gotta place that order",
  "Scam Alert ❗❗❗",
  "Why is that website so sketchy?  Visiting from the US and it still gives me info as if I'm in India?",
  "First you should paste the link so that other users go try it out. \nSecond you buy it and choose the shipping method as STORE PICKUP. \nLastly DON'T GIVE ANY BANK DETAILS EVEN IT'S FREE (they surely want consumers to prepay it).",
  "Not too sure but could of just been a fuck up on their end when pricing. Had it happen a few times on websites, once at JD sports with some AF1 marked down to $20 instead of $200 but they ended up refunding everyone lol and once with a skate deck that was FREE, again they just emailed me saying lol no 😂",
  "Rupees? Yeah totally legit. No scams ever.",
  "I have bad vision but it can’t be this bad to see 1 rupee",
  "It seriously went out of stock lmao",
  "What's the harm in trying bro",
  "Make sure that's really the store site (security certificate and all that).  It might be bait to get you to enter your credit card details.",
  "I guess not..",
  "For me it shows 137k",
  "I think it depends on your country's law system. For example, in Mexico, we have a consumer protection enforcer, which forces the seller to honor their stated price, even in case of human error or similar snafus. This has led to several incredible bargain stories over the years.",
  "Share us the laptop link",
  "I checked it. does show just 1 but currently out of stock. Update us OP",
  "[deleted]",
  "This happened with me too and then they cancelled the order after 2 days",
  "Looks like someone turned friendly fire on.",
  "Back end website error. Some one pushed a change to the store front and really fucked up. Lucky for you. Hope they don't catch it before it ships. Ive worked on retail websites and seen this happen.",
  "[store.lenovo.com](http://store.lenovo.com) its a malicious site nor official one, don't fall for it.",
  "It happened in my country once, and they honored the purchase. Mistakes happen sometimes.",
  "Think you cut out the banner there that should apply to you right?!\n\n[imgur](https://imgur.com/a/04Bwbtx)",
  "Aaw a similar thing for legion go for 90quid didn't trust it as the reservation counter always update over and over again.",
  "Go for it, but you might want to use a virtual credit card using for example Revolut. So you won't leak ur credit card info if this turns out to be fake :)",
  "Any updates?",
  "That's probably a colored cardboard brother...",
  "At best you get an almost free Thinkpad, at worst you're on a spoofed website that's collecting your credit card details. What could go wrong?",
  "Did you buy it or not?",
  "https://privacy.com\n\nNo reason to not give it a go. Use a burner card from above. First twelve each month are free.",
  "It’s an obvious scam jfc",
  "It's out of stock now 😭",
  "Better order 10 more",
  "Keep us updated OP!",
  "Bro at least sign in \nThen check the price",
  "That website looks suspicious to me.Your card might get blocked or u might get scammed.Lenovo website is secured website while the website you are showing is not secured.I would not make the payment.",
  "Credit card sir",
  "Please update us if it actually comes through",
  "You should not have posted this. You should have tried first. .\nExpect the order to be cancelled",
  "I am really interested to know if you really got it",
  "Just buy it whats the worst that can happen",
  "Order it but make sure you're at a public place and not near/at your house",
  "Link ?",
  "Pay with a throwaway account or if none make a virtual debit card from your banking app, set the lowest possible limit on it so it can't be used for scam, use it, purchase, receive and then delete that card.",
  "I would definitely take the bait",
  "Phishing or error.\nEither you get scammed or you get refunded",
  "So any update?",
  "In Germany it's a different shop. https://www.lenovo.com/de/de/d/sale/\n\nI would be careful",
  "They just want your bank details. Check at the end of website is it really lenovo website or a fake one",
  "i often buy mispriced products on aliexpress, and about 30% of the time i actually get them.",
  "Update us if it gets delivered",
  "They didn’t honour their error in my experience. I purchased a machine on a fantastic sale. The website said that they had it in stock. They in fact did not have it in stock. I only learned this after a month of waiting for it to arrive and it being in the ready to ship stage, still showing that they had stock. When the error was discovered they offered to cancel my order and find a machine that “fit” my needs at whatever price they were selling it at. No, I wanted a machine with the closest specifications at the price that I ordered and paid for the first one that you said you had in stock. They didn’t budge at all. I ordered a machine at $250, the next one that had the closest specifications was $750. The original price of the machine I ordered was $950. Some brands are better than others when it comes to errors. Lenovo isn’t one of them.",
  "i dont remember lenovo's official site looking like this. There was no green color, all the accents were black or red in my memory",
  "I had the same bug on the HP website, €1 for a computer that is worth €1,400, I paid but after a few hours my order was cancelled. They'll probably do the same to you, it must be a bug in the site.",
  "Order it I guess but pay with PayPal or something",
  "Could be a pricing error too. Order it",
  "Which store was it?",
  "Get one for me 😜",
  "If the website is legitimate I'd fuck around and find out 😂",
  "Is store.Lenovo.com strictly for India? I’m in Canada and it’s showing me rupees",
  "What do you fucking think?",
  "Well probably a key logger that want's your card details.",
  "Just create an internet bank account, deposit a small amount of money and purchase it. Simple, end of story.",
  "Yeah, genuinely stealing your personal information.",
  "Could be a price mistake. If you want try it out with a safe payment method",
  "link??",
  "any update what hapeend ,i am curious......................:;:::::",
  "obviously not legit. \n\nThe real website link is lenovo.com\n\nnot site.lenovo.com",
  "Plot twist...\n\nOP made this site so people go and buy/log in and THEY are now stealing your info. This seems way to scummy/scammy. \n\nWeblink isn't true. Copied page.",
  "Be careful could be a wrong Site or sometimes Like Amazon a Price Tag was wrong I could buy it but often the offer was then canceld",
  "Seems like that one incident where the gas prices were mistaken at a station and one comma was off (10 times cheaper price).\n\nAnd some dude was filling like the back of his truck with gasoline. Not sure how specific the action was, but basically they were taking advantage of the situation.",
  "RUN",
  "SCAM!!!!",
  "Purchasing a product at the advertised price isn't illegal. Not selling you a product for the advertised price is illegal in a lot of places. Hopefully in your country too.",
  "Use a burner card if you can. Doesn't hurt to try it.",
  "Is like one of those amazon errors where some products are like 1 dollar",
  "Send me the full link pls",
  "Well this is because the prices are set by the individual store owners. Something like that happened with me too. A laptop I wanted to buy was showing for 50% less at only one lenovo store. It was hella skeptical. I contacted that store and they clarified that is not the correct price and will be changed that morning. ",
  "Why is it when I go to [store.lenovo.com](http://store.lenovo.com) that it instantly sends me over to India?  I live in NY, USA.  That seems suspicious.",
  "cod karwa le",
  "https://ibb.co/7xSwZjMb\nhttps://ibb.co/Pz17nqVC\n\nCheck these links store .Lenovo.com seems to be a fake site. The actual one is Lenovo.com",
  "Try without keeping more than 5 rupees in your account. If it goes you are super lucky !",
  "Shouldn't have posted it on Reddit",
  "Make a wallet like family pay and pay 1 rupee with that and never use it again",
  "Use a prepaid one use Revolut card",
  "Store.Lenovo isn’t owned by Lenovo.",
  "Website copyright 2021 - Almost real. Its a scam don't fall for it.",
  "that is the Shipping price",
  "Hmm low risk...",
  "Never heard the phrase if it’s to good to be true it’s not?",
  "Is it's in India, everything is a scam, they even spread to other countries",
  "Link ?",
  "Link ?\n\nIf possible let us know if order",
  "Well, it's been 3 days, have you purchased it already? If so then no problem but if you're still planning to, then I would say they likely have corrected this mistake by now, or even earlier, like 10 hours after you saw it",
  "Might as well give it a shot lol",
  "Link shared by OP seems to be individual local store link and they are free to set their prices so someone probably made a typo. Ordering it will likely result in the local store cancelling it as 'Out of Stock' and 1 Rs. refund.\n\nHere's the online store link: https://store.lenovo.com/in/en/nb-yg-slim-7-14ill10-u7-32g-1t-11s-83jx001min-2191.html",
  "It's sketchy my malwarebytes browser protection on an android phone blocked it when I turned the protection off the page loaded. It's a phishing page.",
  "Any updates on what happened?",
  "It's a scam, check the cert\nThe main page is a wild card, the store subdomain is a free SSL cert from last week. Someone has poisoned the DNS most likely and stolen the sub domain? Lenovo has a year long cert from a different company and wouldn't be using a free public cert from last week.",
  "Naah.\nPricing issue maybe",
  "Naah, pricing issue maybe",
  "Browser inspect element go brr",
  "bro found the deal every parent is haggling for",
  "prolly not but 1 inr, might as well",
  "how to avail this offer, bro😭",
  "soon as you make an account or log in... it's likely gonna change the price. that shit happens all the time with aliexpress too",
  "Paid for my laptop 2 years ago\nAll fine, still have it\nIf tis official website youll be fine",
  "Buy it and see why happens!",
  "Had something similar happen with HPs website a few years ago - sadly my order got cancelled :(",
  "Pay with a gift card",
  "From my understanding, it seems that this site is acting as a marketplace where the verified Lenovo stores are adding their inventory and setting their prices based on their offers/etc. So, it might be that this particular seller listed this product at a mistake price.",
  "Any update?",
  "If it looks like a scam and sounds like a scam.....",
  "I guess he didn't get it.",
  "Use a through away virtual card with a limite and get it",
  "Did you ever get it",
  "Intern: oh shit i'm in danger",
  "This looks like either a pricing glitch or a placeholder/test price. Big brands don’t just sell ₹1.8 lakh laptops for ₹1 unless it’s some promo for employees or a contest. If it actually lets you check out and ship, you’re extremely lucky — but 99% of the time the order gets cancelled or refunded",
  "100% legit. Good deal",
  "probably phishing website \ntry to copy past the URL into different word processing apps like notepad and more > check carefully for discrepancies like ś that might pop out.",
  "Do it.\nWhat's the worst that could happen?",
  "do it bro",
  "[Real link.](https://store.lenovo.com/in/en/nb-yg-7-2-in-1-14ill10-u7-32g-1t-11s-83jq000nin-1525.html) \n\nPrice is showing up as ₹137,490.00 for me\n\nI would scan your shit for anything malicious",
  "scam, there ain't no fucking way lenovo giving out cheap ass price's, let alone a laptop.",
  "Obviously not",
  "In Brazil we have a saying that roughly translates to \"When the offering is too good even the saint gets suspicious\"",
  "Thats literally a fake single page , go to original lenovo website and compare with it . Don't be dumb Nothin ever gonna be free",
  "Too good to be true",
  "scam.",
  "A general life lesson is:  if it seems too good to be true, it probably is.",
  "Is it even logged in brother? It still shows sign in option . I suppose u can't order without signing in . Or u can ??",
  "[deleted]",
  "No",
  "100% scam. \n\nDone very convincingly but it's not the official lenovo India. \n\nLike someone else said the official lenovo site doesn't start with store in the url.",
  "Lenovo's store is not [store.lenovo.com](http://store.lenovo.com)\n\nThe whole website is a scam\n\nLenovo's actual store website is [https://www.lenovo.com/gb/en/d/sale](https://www.lenovo.com/gb/en/d/sale)\n\nGo to [lenovo.com](http://lenovo.com) | Click \"Products\" and look at the URL\n\nWhole website seems to be a scam, the only thing different should be the location and Language after [**lenovo.com/**LOCATION/LANGUAGE](http://lenovo.com/LOCATION/LANGUAGE)",
  "What do you think bro?",
  "Bro that's not official lenovo website",
  "It's still there lmao 😭.",
  "Did you got the laptop",
  "Wait... I just went to [store.lenovo.com](http://store.lenovo.com) from the USA and I'm getting a bunch of ads talking about how many INR (Indian Rupee?) discount I'll get.\n\nWTF?",
  "They're not gonna eat the loss just because it's their mistake.",
  "uppercase i and lower case L look alike so they might have switched them to make it look like the official Lenovo website while it's actually ienovo website :b",
  "Lenovos webshop has been notorious for having odd bugs, my father purchased a laptop years ago and for some reason the payment failed so he got pissed off and went to a store and bought one. Like 2 weeks later he got 2 laptops from Lenovo and a reminder in his email that his laptop is waiting for payment to be shipped out.",
  "From just the image I can't see the whole link. It looks like a / at the end indeed, so it might be safe. But it's also possible the website can look like this: \"store.lenovo.com_custom_link.net\" be careful about these kind of links. I encountered one like this saying they are airbnb.",
  "You cannot see if they are on store.lenovo.com - they could be on store.lenovo.communityscams.in",
  "Lenovo sold me a defective laptop and then refused to replace it, instead offering a refund and a discount on future purchases that was less than the discount I'd bought the defective laptop with \n\nThey don't care about honouring shit",
  "Happend to my brother on an other site for idk which item, and they did not honor the purchase",
  "I once found a mistake where they sold a 4tb m.2 ssd for like 50 bucks. I bought 2 and 2 days later got an email that the order was canceled due to pricing mistake.\n\nLuckily for them the ssd was not in stock for about 1 week so they had time to fix it. But if they sent it then I'm pretty sure they would have to eat the loss.",
  "it could be a pharming scam so it even has the same URL but is in reality a different site, scan your pc for malware",
  "Sacaría todo lo q pueda de la tarjeta registrada (dejando solo un poco de dinero) o la cambiaría para luego comprar   \nCuestión de no perder en caso de reclamos.  \n  \n(Escribo en español)",
  "could be a risk, whole account might be swiped clean",
  "Well I ig thy already did cause it isn't showing now",
  "If an intern even had the access needed to do such a thing its not the intern that needs to be fired",
  "Ohh lucky you!",
  "Same, had an infinite amount of 50€ off vouchers, vot a backpack, mouses, speaker, storage with it",
  "lucky guy. My order got cancelled.",
  "Excuse me here, but how the hell can a subdomain of a **genuine** lenovo site be a scam?",
  "That's a legit site and ig the product entry was incorrect I don't think they'll shop it but if they do let me know brother and congrats if that happens ",
  "Really? Did it say \"Only 3 left\" when you ordered them?",
  "any updates?u got laptop?",
  "How did you guys order",
  "https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F\nWell I barely have around 150 in my bank account 😅",
  "Real talk: My brain immediately thinks of Zelda instead of India when I hear “Rupees”",
  "[deleted]",
  "U ain't tuff my guy!",
  "I loaded it myself earlier and saw the same thing.",
  "Nah it was real and a tech-error",
  "I don't have PayPal",
  "Also shows copyright from 2021. while other lenovo domains like psref.lenovo.com have it at 2025.",
  "Really?",
  "!RemindMe 1 week",
  "No",
  "It didn't allow me to make the payment",
  "This is exclusive store site",
  "I didn't buy",
  "Here is the url-\nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Here's the link or if u find this sus u can google lenovo official store new bel road and try  https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Somebody needs to learn how domain names work.",
  "LoL there is a thing called dns you should learn it",
  "Are u dumb?\nIt's a Fcking subdomain of lenove. It can't be a scam unless someone has Fcking access to the Lenovo domain or is doing. Mitm attack on opm",
  "What makes you think so? Like this is from official website! Unless it might be some glitch or smtg",
  "Well it's from lenovo exclusive store website and search for the branch new bel road",
  "You don't know how subdomains work.",
  "[deleted]",
  "The site has enough reputation to show up in google searches for \"store lenovo\". It wouldn't be the first time someone both hijacked a subdomain and also got it into a google search.\n\nThe cert is signed by Lets Encrypt instead of Lenovo's cert which is just what a scam site would do.\n\n*edit* store.lenovo.com/in/en has been in use since 2023. \n\nhttps://web.archive.org/web/20230314012913/https://store.lenovo.com/in/en/",
  "Entirely true : entered the url store.lenovo.com and arrived on an Indian version while living in Europe.\nVery few redirection links working. \nProbably a scam to steal credit card informations.",
  "But u can find the same from lenovo exclusive store website and search for new bel road branch",
  "[deleted]",
  "Seems like they've taken down their online store, when I just visited there was no way to buy online",
  "They may not even catch it. The order is probably processed by a computer and then packed and shipped automatically.",
  "They are many reasons they might eat it, particularly because it may be too much work to undo.\n\n*EDIT* If 1000 people start ordering it, they'll notice and cancel them all. OP you blew it by telling the rest of us.",
  "A little bit unrelated. I went to buy some expensive craft beer at a local shop and it was extremely cheap for some reason, like the whole thing cost less than the bottle. Cashier called the manager about it and they clearly stated that it is not what it suppossed to be, they can't do anything about it and they let me buy all of them for that very low price. Felt like winning the lottery.",
  "Had the same thing happened to me, they just sent a follow up email saying the price was a mistake on their end and they won't process the order.",
  "You can go to consumer court. They have to honor the purchase. You can’t just back out of contracts when the contract becomes a loss for you.",
  "Loss?",
  "The margins on these things are insane, my company buys their devices and they pay 20% of the public retail price. They make billions, it's probably not worth making the customer unhappy",
  "Most of the time they will, my boys in a telegram group where they post all types of these website bugs where the price is stupid low, all the guys on that telegram including my mate all buy and resell the shit they bulk buy off these websites and they pretty much all clear and get delivered",
  "It has happened before. I remember when a code was floating around for free Razer stuff, including laptops, and they said it was their mistake and honoured the orders.",
  "in eu they are required to sell it to you at the price its posted, i bought a portable AC from a site in slovenia because some fked up and instead of 450€ it was posted for 45€ and i got it for 45",
  "Sennheiser did when HD 600 were selling for 50$ instead of 500$",
  "One time I caught designer jeans they missed a 0 on. They sent it and fixed the price after. ",
  "Lenovo while not being an American company does a lot of business here, and one of their dual hqs are here, so legally, if they fucked up, they have to eat the loss, if any corp sends you something you didn’t order or they wayyy undersold it to you(like this case) legally you can view it as a gift and are under no obligation to return it, it happens with apple all the time where someone orders an iPhone and they get 5 instead of",
  "In germany if they send it out to you before realizing the mistake it's yours for that price so worth trying i guess",
  "Have you ever worked retail?",
  "Social media clout init",
  "Yes they will. I got a 3k laptop for under 300 dollars because they ate the loss. I did have to speak to someone on the phone, but I was polite and assertive about it. All in all, less than twenty minutes.",
  "Depending on region, ie. Quebec, they're legally required to honor the list price and eat the loss. Even outside of Quebec the amount of times I've gotten something better than what I actually ordered on Amazon is impressive Amazon always ate the loss. There's a good chance Lenovo just eats the loss.",
  "Second this. Currently dealing with Lenovo trying to return a laptop I bought that was advertised as having a feature I wanted, and shock horror, it doesn't. Their only response has been 'we know it can be upsetting to not get what you expected'. Can confirm they will refuse to eat the loss of their mistakes.",
  "They have to....",
  "They will, if you order from the EU. The fine they would pay otherwise due to consumer protection laws will be devastating.",
  "You can't have uppercase urls.",
  "That's a good idea. You could get like a visa gift card and order it with that.\n\nI'm writing in English.",
  "but the website is legit [store.lenovo.com](http://store.lenovo.com) \n\nu/Inevitable-Owl-550  you should log in with the same account in another device and then pay and see what happens",
  "People still keep all their money in an account linked to a card???\n\nMy pay goes into a secondary account with no cards linked to it, if I want to spend money, I manually transfer it, if someone steals my wallet, or a phishing site gets my card number, the most they'll get out of me is about $50 (which is all I keep in there for convenience)",
  "google pay then or single use card.",
  "Keep 2 rs in the account",
  "Upi lite se karo payment",
  "Bro your should have just ordered it, and if they didn't honour the purchase you can easily file a case against them",
  "I’m curious whether this was a scam link (My personal knowledge says that’s not possible coz store.lenovo.com seems legit, and doesn’t make sense to be a scam in terms of how DNS works) or the real store but someone messed up prices",
  "Did you buy it?",
  "Dude next time just go for it. Don’t let Reddit talk you out of a good deal. It’s the legit Lenovo website you scored yourself an absolute steal.",
  "Yeah but that's not how the corporate world works unfortunately",
  "Check the URL Certificate attributes and certificate chain. It will or should have Issued to as Lenovo.",
  "Domain takeovers exist, and through some VPN, Proxy, Public WiFi, really anything between you and the server can redirect to a scam server instead of loading the real page.",
  "[DNS Hijack, for example](https://www.imperva.com/learn/application-security/dns-hijacking-redirection/)",
  "they didnt confirm the order, looks like incorrect entry.",
  "u/U_GET_ME yes now its only one left, but order is not showing in **my order** sections",
  "No , it was just an entry mistake by a store owner in Karnataka. Order was cancelled by their side",
  "If I'm you, I'd probably buy it using my virtual card and limit the transaction to 1 rupee then lock the card and generate a new one after purchase.",
  "It isn't working now.\n\nDid you order it?",
  "Yeah no shit lol",
  "Does Indian credit cards have protection against fraud or are you out the money if your card gets stolen",
  "I will be messaging you in 7 days on [**2025-08-29 06:58:15 UTC**](http://www.wolframalpha.com/input/?i=2025-08-29%2006:58:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/laptops/comments/1mwcbkj/guys_is_this_genuine_like_seriously_1_rupees/na17fd3/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Flaptops%2Fcomments%2F1mwcbkj%2Fguys_is_this_genuine_like_seriously_1_rupees%2Fna17fd3%2F%5D%0A%0ARemindMe%21%202025-08-29%2006%3A58%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201mwcbkj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
  "Unfortunately it's not, no green color is used on the checkout page for me anyways",
  "Im unable to open the website so probably a scam",
  "... yes, it's right there.",
  "Please explain",
  "[deleted]",
  "This isn't helpful.",
  "Go ahead and try it then I guess 🤷‍♂️",
  "Yeah some people can be quite rude and dismissive in here",
  "Please explain",
  "Provide a link for that please.",
  "But it's a phone",
  "I see the same product using my Macbook.",
  "OP is clearly on a phone though",
  "Bruh unless it’s modifying webpages locally, it’s still a price served from Lenovo server.",
  "uppercase letters aren't allowed in domains",
  "Yeah I'm sure that's much more likely than a simple pricing mistake that happens all the time and would never ship",
  "This is what I'm thinking. Not that they'd do it intentionally, but the order would probably just get entered into their automated system to process it and the request to package and ship the laptop would be passed into their fulfillment/shipping department and someone there might ship it, not knowing or caring what people paid for anything.",
  "Yea, like my dad saw a wrong price on jbls site, 0 euro soundbar, and he ordered one, but then he ordered 15 more. Im pretty sure thats the reason that they catched it. A while ago i saw a wrong price on jbls site, 25 euros for a flip 4 camo. I ordered one and actually recieved it",
  "Most likely true. I work at a very large company and work in picking and shipping orders, and it's generally the same for every company. If a product is in stock and is purchased, the order is automatically added to the queue and dropped in the next wave of orders for the warehouse workers to pick and ship it. \n\nMany times the packlist/order receipt will show the total price of the order, but nobody really pays attention and even if a warehouse grunt sees it, they will assume nothing and still send it out. No managers or financial workers will see the order until well after it is shipped and delivered in most cases",
  "I have worked at a popular grocery store for over a decade. In the U.S. if a store has a price sign in front of a product that indicates an incorrect price, we have to honor it. Otherwise it’s called bait and switch. I have no idea how this is handled online or internationally however.",
  "They don’t. Law undergraduate here. This falls under contract law. A website listing or product is considered as an **invitation to treat**, and not an **offer**. To define an offer, I will quote it from the case of Preston Corpn Sdn Bhd v Edward Leong: An offer is an intimation of willingness by an offeror to enter into a legally binding contract. Its terms either expressly or impliedly must **indicate** that it is to **become binding on the offeror** (buyer) assoon as it has been **accepted by the offeree** (seller).\n\nEven if the customer were to send an offer (by checking out), a **binding contract** is not yet formed because Lenovo has yet to accept that offer and they can choose to back out as there is no **legally enforceable agreement** yet. (A confirmation email is also not signifying of acceptance of order!)\n\nA similar example to this would be Chwee Kin Keong v Digiland Mall Pte Ltd. TLDR is that an employee keyed in a pricing for a product at $66 instead of $3,854 (MSRP) and the company obviously didn’t want to fulfil orders that were made and got taken to court. Court ruled in the company’s favour.\n\nIn consumer court, courts do consistently rule in favour of the seller during obvious pricing mistakes like a $1 phone etc. because they take the view of a **reasonable person in consideration and apply the objectivity test**. \n\nFor example, in this case, the court said:\n“I find ... that the plaintiffs, given each of their backgrounds, would in any event, each have separately realised and appreciated, before placing their purchase orders,that a manifest mistake had occurred – even if no communications on the error had taken place between them. Further, the character of the mistake was such that **any reasonable person** similarly circumstanced as each of the plaintiffs would have had every reason to believe that a manifest error had occurred.” . \n\nOtherwise, the court would also simply treat it as a **clerical or unilateral mistake** and not punish the seller. Similarly in this case, Lenovo would win.\n\nIf there’s any Law graduates reading this and want to improve on my stand, please do! I’m still studying and open to improvement",
  "Nope where it's clearly a mistake and you know it, they don't need to honour it",
  "They are not and three seconds of googling will support that. Just because you once managed to slip one through doesn’t mean that’s the law.\n\nImagine a computer store mislabelling a €4000 laptop at €1 and a large amount of units are ordered overnight while nobody’s at work. Your argument is that EU law now effectively forces this company into bankruptcy by being required to honor these sales that were clearly made exploiting an error in pricing?",
  "No....",
  "Depends on the Ts and Cs",
  "Yeah.... depends on if that's enforceable to a website in another country.... Much like the GDPR fines the EU charges.... a US website isn't subject to that....  even if they decide to keep data on you... because they're not breaking THEIR laws.",
  "had this happen in the us with a 5000 dollar tv listed for 5.\n\n  \nthey cancelled the order and gave us a 20 dollar off of 100 or more coupon.\n\n  \nthis was on Samsungs website a few years back.\n\n  \nmaybe the uk is protected against this somehow but I’m almost positive there’s some loophole that companies could take advantage of to cancel it. regardless, it’s worth a try if it’s from the legit website",
  "Well it's the same in other accounts too",
  "This is the way to do it imo.",
  "I don't think that's how it works. Especially considering that OP is checking it on a phone. Like imagine if disc.google.com could be swapped by something malicious? \n\nCorrect me if I'm wrong, but aren't sites check response and then send info about a site, judging from 1) the subdomain, 2) the page (/in) and then parse arguments passed in the url if there are any? It's server-client thing – client sends response (get/post etc.), site's backend transfers specific data to the client (rendering the page if needed and so on). Done.",
  "you really think that there is a malware that will only affect lenovo's website dns? Most stupid way to snatch someone's credit card infos.",
  "Yup as expected ",
  "Bro i also paid but it shows incorrect entry and it got cancelled 🤣",
  "overthinking final boss",
  "[deleted]",
  "And look at the Lenovo logo, the padding is absolutely way off",
  "It took me about 30 seconds to load.\n\nThe first time it came up I had the same 1 rupee deal. I reloaded and it's gone. They may have just found it.",
  "Can u google lenovo official store new bel road and check?",
  "store.lenovo.com is a subdomain of lenovo.com, which is Lenovo's parent public domain.\n\n*anything*.lenovo.com is legitimate Lenovo.\n\nDomains are ordered right-to-left. \".com\" being the top level, \".lenovo.com\" being Lenovo, and anything else is just a host or subdomain belonging to Lenovo.\n\nWhat you need to watch out for is what is *after* the \"company\" up until the first \"/\". So for instance;\n\n- https://store.lenovo.com is the store at Lenovo.com.\n- https://lenovo.estore.net is \"Lenovo\" at eStore.net.\n\nAnything after the \"/\" is just a path to a file on the host. So;\n\n- https://store.lenovo.com/in is the \"in\" folder on whatever resoirce store.lenovo.com points to. In this case, it contains the India version of the store pages.",
  "Cant say about the India site but yeah, Lenovis site in general is pretty garbage.",
  "Well yeah if you're wrong. Learn about DNS.",
  "[deleted]",
  "Android run on a version of Unix, which contains a hosts file that can technically be edited to redirect specific URLs to a specific IP address.\n\nThis is technically a way you could target someone, but would be a weird angle of attack honestly \nThere are better ways to fake a website.",
  "They gave out a free $350 tablet when I bought a $400 phone last month so they might just be trying to dump old inventory and they don't care about taking a loss.",
  "Completely understandable. My situation was a bit different though, the product had the correct price sign and it became extremely cheap when it got scanned by the cashier.",
  "I’m fairly certain we have the same rules here in the Netherlands (from the law classes I’ve had during my first year of business admin)",
  "Depende del país y de muchas cosas q poco importa lo que cites",
  "I didn't read the wall of text, but I meant if they accept the order and send a confirmation email then they have to honor it. Obviously if they don't accept the order they don't have to to honor it.",
  "Not just that, but if you know that it's an error and you accept it, they can claim it's theft because you should've known that the price was an error.\n\nAn example often give is when someone sets the gas pump price accidentally to $0.32 USD when it should've been $3.20/gal USD.... if you fill up at $0.32/gal, you can technically be charged with theft.",
  "bamkrupcy? because of a couple ten thousand dollars ? bro you have no idea how companies finances work",
  "Well.. retail eats cost for mistakes all the time. If we have an outdated sign that didn’t get removed for a sale and a customer complains or seems upset we give it to them instantly no questions asked. Especially customer service oriented retail.",
  "Not really, you can't sign your rights away. At least in the EU.",
  "Not true. It's a common misconception. I",
  "u/Inevitable-Owl-550 i have ordered 2 of them, if i actually get , i will send you one",
  "the certificate is the first thing that is being validated, after opening a tcp connection to https, even before sending commands to the web server.",
  "Trust chain will be broken in that case. This validation happens even before the API call could be made, as a callback. There is no way to bypass it other than manually adding the root certificate to trusted root authority which I did not do, in every other case it will not qualify as HTTPS. Even if I manually add it, even then it will be not a real HTTPS and a warning will be displayed when I open the site for HTTPS containing a self signed certificate. \n\nPS : I work in security domain.",
  "I'd imagine if you do this type of attack you'd likely try to redirect as many possible large sites as you can (banks, large companies, big retailers, etc), so it wouldn't have to be this one specifically, but it is plausible if they failed to hijack more",
  "Are you aware of jokes? Jesus Christ lol",
  "I googled it and it works so this must be a phishing website",
  "Oh, I see. Thanks for the explanation.",
  "Thats such an unlikely attack vector lol. Why would you even suggest this?",
  "is it rooted",
  "Only modifying the hosts file would show dire HTTPS warnings in the browser because the site certificate wouldn't match.",
  "Bro be quiet it is 100% a glitch on the website, since it is on offical lenovo website he should buy it and if it charges full price then just refund lmaoo",
  "Or it can configure private dns to do the same thing. No root required.",
  "Good lord, I very much doubt the guy has such a threat model someone is going to do that.",
  "Keeping said inventory is probably losing them more money",
  "Oh yeah, that’s a weird one! Lucky purchase!",
  "We don't. Webshops have to honor the order, unless the error they made was big enough for the buyer to know beforehand that is was a typo. So in this case, yes, they would not have to honor it, but they have to honor the agreement generally when you purchase something on their website.",
  "True, but I was just giving an example to explain. However, if we look at it in layman terms, the universal legal principle will be the same. You simply cannot reasonably expect to enforce a contract based on a price that is **obviously an error**. So in any jurisdiction, I’m highly confident that Lenovo would win should this be taken to court. \n\nIf you search up similar topics, you will find that across common law (Singapore, UK, US) and civil law (France, Germany, EU), the courts follow the same reasoning:\n1.\tObvious pricing errors = no binding contract.\n2.\tBuyers cannot exploit a mistake they recognize.\n3.\tThe worst that happens to the retailer is refunding the money.\n\nHowever, if we are referring to say, a $599 MSRP laptop being listed erroneously at $499, the court may order the seller to honor some of the orders, which has happened in many jurisdictions before, since borderline errors (e.g., 10–25% off normal price) can be interpreted as a discount/promotion and would lead a reasonable person to believe that there is no mistake in pricing.\n\nIn this case though, it’s a laptop for $1. So it’s pretty obvious and no court would side with the buyer.",
  "Incorrect.\nTL;DR Lenovo (and most other companies) explicitly states that a confirmation email does **NOT** signify acceptance of the order. **No acceptance = No contract.** (This clause is commonplace for every business) Consumer will lose if he tries to go to court, even if he has the best lawyer. Below, I will cite Lenovo.\n\n**Full explanation:**\n\nA confirmation email, if you dig deep into any businesses’s Terms and Conditions (the thing that everyone ignores), has built in protective clauses in their Terms of Sale, and they’re not obliged to provide the consumer with any goods or service with a confirmation email alone. **Confirmation email ≠ acceptance.** A confirmation email only signifies that they have **received** the order.\n\nHere, I will specifically cite for this case, Lenovo. Under their T&Cs, it clearly states that **a confirmation of Lenovo receiving and/or processing your order does not constitute acceptance of the order.** (1.2)\n\nSource: https://www.lenovo.com/au/en/legal/new-products-and-warranty-services/?srsltid=AfmBOop9YcXqtlgbWWSEtLd4WCy7paTFtCMABKIs8xZmfYyPvIBRyTbc&ut\n\nIt also states under 1.1 that:\n\n1.1) **No contract** for the purchase of Products or Services will be formed until Lenovo accepts your Order by **one of the following**:\n\n**(a)** shipping the hardware Product and sending you a shipment confirmation email; or\n\n**(b)** making the software Product available to you; or\n\n**(c)** providing the Service to you.\n\nTherefore, that confirmation email is **not a binding acceptance** and is more of an acknowledgment that they’ve received your order and are processing it. Until shipping occurs (or software is delivered, etc.), Lenovo **reserves the right** to cancel or adjust your order **even if** you’ve already received a confirmation email or any other form of confirmation.\n\nI personally think that TV shows these days make the law seem very shallow to the average person, like; “Little guy sues company and wins!”. \n\nThe reality is, that every business has multiple built in protective and failsafe clauses layered into their contracts etc. to make sure that real consumers **will never win against them** in court. I feel like the average person should read more into the T&Cs so they know what they’re getting themselves into, but we don’t, so companies take advantage of that; and that is why we have lawyers :)",
  "Do enlighten me. 99% of companies in the EU are labeled “micro scale”. And also, way to deflect from the question about legislation ;)\n\n“A couple ten thousand dollars” in this case would be 5-10 laptops sold at the wrong price. You can see from this topic that ppl flock to these things like moths to a flame.\n\nMy most commonly used online computer store typically has a stock of about 50 of each gaming laptop, do the math on a say 5 of those products being mislabeled overnight and each those selling out at a €3999 discount. That’s about a million euro lost on a clear database error. “Just suck it up, it’s the law”, yeah not so much bro.",
  "Perfectly legal to have Ts and Cs that reserve the right to cancel orders where there has been made an obvious mistake",
  "Give an update if the order actually gets processed. Unlike what others said, the website itself is not a scam for sure. The items listed by that seller is controlled by them afaik, so either it is their mistake and they will simply not process the order, or, if you're lucky, there must be some kind of flash sale for a few units and they might actually give it.",
  "How were you able to order it ?\n\nDo you have a link for the page ?",
  "Update if you get it",
  "Mind helping me out as well?👀",
  "did u get em",
  "See dm",
  "[removed]",
  "what’d they say",
  "They wouldn’t dare go through the Ardennes /j",
  "Have to redeem themselves when they were wrong the first time lol",
  "I agree, but like... The laptop is not one rupee..",
  "Wow. Someone here finally has some common sense.",
  "[deleted]",
  "you dont know where im from, my country has 2 million pop.. the site in question gets about 5 thousand people traffic everyday.. and the amount of people looking for acs is like 100 every day, there were only 30 of those acs in stock..thats 12 grand and yes statistics matter and not every error is amillion loss dude, get over yourself",
  "this is how Samsung weaseled out of a similar pricing mistake a few years back. both us and eu orders were cancelled ( this was around 10 years ago tho)",
  "Depending on place it might be even law. In Poland for example it's literally in civil code.",
  "Website might be a scam. The copyright is linked to 2021.",
  "It's over bro , was a technical error",
  "See dm",
  "happy cake da",
  "[deleted]",
  "LOL he deleted it?! He legit thought I was serious when I was saying Rupees are a fictional currency from Legend of Zelda and when I said no shit he still thought I was being serious. Social IQ of a dead tree I guess.",
  "twice",
  "exactly, like nobody cares about this bla bla bla rooted phone host files like man he tried other things and it was was the same, it's just a damn glitch.",
  "to be correct: a non rooted phone also has a hosts file \\^\\^",
  "We’re not talking about that specific site though, are we? Nor are we talking about your country. You brought up EU law and some fantasy story that they have to sell it at the shown price no matter what it is. Apparently you’re more interested in arguing than taking a minute to check the applicable rules, have fun with that and have a good night.",
  "Did they say it's been cancelled or that they'd honor it lol?",
  "I don't see ur DM",
  "dm me",
  "People on reddit\n\n50% chance it's a scam\n49.99% chance you're the target of elite state sponsored cyber attack. \n\n0.01% chance it's a genuine error / mistake. \n\nPeople have lost all sense of logic nowadays!",
  "Exactly I 100% agree with you, the dead internet theory is real.",
  "My Portable Game station setup Lenovo Legion Pro 7 Razer blade 18 ",
  "This man is hitting three cartridges while gaming on two laptops",
  "Why two laptops?",
  "How do you like the Legion's OLED screen? I'm kinda hesitant to get one because of the reflections.",
  "looks good!",
  "Yezzir 🤟🏽",
  "Kinda out of the blue but has your Zephyrus been reliable and performed well with no issues ? Im asking a lot of Zephyrus owners to get a better picture with so with so many horror stories such as liquid metal leakages, coil whine etc Im trying to find the good in all the negativity since I need a portable MacBook like device but with gaming capabilities so has it been reliable and easy reformer well ? ",
  "lol why not",
  "its a 10/10 G colors just pop! HDR and 1000 true black is so satisfying to see",
  "sorry my guy thats a different brand i dont own a asus grand laptop, but the legion pro not to expensive as the other brands and performance and thermals are great for longevity",
  "No coil whine and I don't believe this one has liquid metal, so no leakage issues there. Overall, it's been great. The build quality is pretty solid, but it's not as good as the MacBook or the Razer Blade I had. However, Razer got rid of the glass on their displays, which has led to them feeling lower quality to me, and lesser in comparison to the Macs that still use glass. The bottom panel is a cheap plastic one which again, feels lesser in quality vs those other two, but it's not something I notice in my regular usage because it's either docked or on a desk and then going in and out of a bag. \n\nIt has a minor issue on the trackpad, but it's still very usable, just annoying. Since I rarely use the trackpad and use external M&K when at home, or a mouse and the built-in keyboard while traveling, it's not a big deal. \n\nPerformance-wise, I'm still able to max out all of my games on absolutely Ultra settings including Path Tracing on Cyberpunk 2077 and Alan Wake 2 with good frame rates on my external 34\" Ultrawide. When playing on the 2560x1600 internal display, performance is obviously even better. \n\nI bought this because I needed the absolute most power possible in the lightest, most portable package possible. I traveled for work weekly for the past few years, and I travel regularly, so having this has been a godsend. I remember playing Warzone in LaGuardia at one of the bars when my flight got delayed and blowing off steam was great. I took this to QuakeCon for 3 years now, and the ability to pack more power than my desktop into something that fits in my backpack is amazing.  \n\nComing from a Mac, probably your biggest hurdle is going to be battery life, but the latest CPUs are supposedly much better in that regard (though we hear that every generation so YMMV).",
  "ever considered add a monitor with a bigger screen?",
  "Cost, managing files and games between two computers, weight for transporting them, etc. etc. etc.",
  "I have an OLED TV so I know how great OLED looks. My question is more about how reflective the display is, because no matter how good it looks, it doesn't matter if you can't see shit because you're staring at a mirror.",
  "Why do u call it true black or whatever? the pixels are literally off..",
  "I was replying to the other guy who has a Zephyrus not you but thanks for the reply! ",
  "i got asus oled dual mode 4k.240hz 1080.440 hz back home its fire thinking bought shipping it to where im at now",
  "i travel for work all over the place can u imagine shipping a expensive desktop on the plane having people toss around yo setup like its a bag of candy or just shipping a pc state to state lol so i put my laptops in my backpack hop on a plane an call it a day.",
  "5k for the razer 2.7k for legion, weight probley 9pounds with chargers and got 3tb in legion 2tb in razer",
  "well i wear transition lenses so i dont have those problems but no crZy glare i see",
  ">i travel for work all over the place \n\nGreat. So do I. I also travel frequently around the US and internationally for pleasure. I took my laptop to Europe for 5 weeks earlier this year, to QuakeCon in August. I took my Razer Blade around the world for 9 months. \n\nThat doesn't clarify the two laptops angle. \n\n>can u imagine shipping a expensive desktop on the plane\n\nHaving shipped my desktop for a family member, yes. Again, what's the point of this? It has literally no relevance to the question on why you want *two* laptops. \n\n>so i put my laptops in my backpack\n\nI'm going to give you the benefit of the doubt and assume English isn't your first language and there's a language barrier here. ***Nobody*** is asking why traveling with a laptop is easier than a desktop. The question is why you have *two* high performance laptops instead of *one* high performance laptop and maybe a good external screen.",
  "bro i got multiple cars multiple vapes multiple everything what else u want to hear 😂 thats just me i guess",
  "I get having multiple laptops, I have 3 that I use regularly but more then one gaming laptop seems a bit unnecessary.  I like having non-gaming laptops because they are really cheap and durable so I don't have to worry.  But I guess if money isn't an issue I can see it.",
  "What do you think about the new Lenovo IdeaPad Slim 5 Gen 10?  Ryzen AI 7 350, OLED and 32Gb RAM for 900€ ",
  "I have one but with sadly a ryzen 7 7735hs and not an AI 7 350. But I have all maxed out options.\n\nIt's an absolute BANGER of a laptop. It's very light and thin, build quality is pretty good and the OLED is really bright. \n\nPerformance wise it performs as you'd expect from the specs as far as mine is concerned, but i can't tell for the RAI7 version obviously. \n\nKeyboard is good as well. The integrated microphone is *extremely* good for a laptop, hands down best laptop mic I've heard. I'm running Linux on it, it's very well supported and everything works as expected except the mic which needs a kernel edit to work (I've sent a patch a month or so ago, but i think it got forgotten :/ )\n\nIn the bios you can dedicate from 256mb to 4gb to the igpu. However the bios is fairly limited in terms of what you can do in it.\n\nNow that I know the ryzen ai 7 version exists I'm sad I didn't wait :( \n\nOh and one last thing, at least with mine I bundled a 2year accidental damage warranty for 35€ which is nice, idk if that's still available but it's a nice to know.",
  "[removed]",
  "I got the Ideapad Pro 5 version, I believe Slim is a bit less sturdier. That cpu is slightly better than the 8845HS, but the graphics are worse (780M>860M). Screen is absolutely gorgeous. I would recommend mine, this one probably is also fine (If it has 2.8K 120hz oled, if it doesn’t then an Ideapad Pro 5 would be better in this case)",
  "does it have a haptic trackpad? I can't stand the trackpad on the yoga aura 15 edition",
  "Hi, I just ordered mine ;)  \nSpent some time comparing and looking through different laptops and ended up filtering the lenovo PSREF.  \nthe fact it has  \n\\- 2\\*SODIMM RAM (user swappable DDR5)  \n\\- 2\\*M.2 SSD Slots (2242 preinstalled, 2280 free) => added a 110€ 2TB  WD\\_Black SN7100  \n\\- full aluminium body (unlike previous ideapads)  \n\\- oled   \n\\- the newest gen ryzen with Ai dedicated core architecture  \n\\- 2\\* USB-A + 2\\*USB-C  \nwere my reasons to got for it. The only thing I'm worried about is the lack of a 40Gbit usb port. It looks like it has only 2\\* 10Gbits so I wonder if I it'll work if I try to use it on a dock with 2\\*4K @ 60 Hz\n\n[https://psref.lenovo.com/Product/IdeaPad/IdeaPad\\_Slim\\_5\\_14AKP10?tab=spec](https://psref.lenovo.com/Product/IdeaPad/IdeaPad_Slim_5_14AKP10?tab=spec)\n\nHW-maintenance manual showing the 2\\*SSD + 2\\*SODIMMs: [https://pcsupport.lenovo.com/us/en/products/laptops-and-netbooks/ideapad-s-series-netbooks/ideapad-slim-5-14akp10/document-userguide](https://pcsupport.lenovo.com/us/en/products/laptops-and-netbooks/ideapad-s-series-netbooks/ideapad-slim-5-14akp10/document-userguide)",
  "I'm so confused between this one and MacBook air m4 16/256 :(((\nWhich one should I go for?",
  "Hy , can u provide the link ,\nAnd is the storage upgradable?",
  "You get a think pad for same price but base ram",
  "Is the one you have with amd radeon 660m version? Im looking to buy this model for around 700 euros where I live. I really want a portable lightweight laptop with a nice oled screen, I only play Runescape which is like a 20 year old mmo. And mainly gonna use it for multimedia like youtube and netflix.",
  "what about the hinges? i've read bad reviews about it",
  "Hi man, I am considering buying the same laptop, I would like to know how’s the battery life? Do you have the 13” or 15” inch one? Thank you",
  "Hey mate, i got the same one , waiting for delivery. In this price range I doubt you get anything better.\nHow is the fan noise? I'm a little worried as there are so many people complaining about it and even returning it. Cheers",
  "could you tell me how to increase igpu allocation? I got mine with 24 GB of ram specifically so I wouldn't struggle on light games like minecraft and it's coming in a month or so but I wanna know how to do it",
  "How is it with casual gaming like Roblox and others in the same level? Even if I wouldn't go for AAA gaming I might go for it takes two. Do you think it could run those?",
  "hi, how's going today after 5 months? would you still recommend it? I'm planning to get a 15\" Ideapad Slim 5 with 7735hs and 16/512Gb with an IPS display for 680€.",
  "Have you every noticed any PWM flicker when using it on low brightness?",
  "You're Australian I believe",
  "jesus christ i dont even know what to say..",
  "How's the battery life? I'll use it for programming and/or heavy browser-work",
  "Hey, I am considering getting one myself. Got the Gen 9 just a couple of weeks ago for my wife, and for the price it's really great.\n\nJust wanted to add, that the ram is soldered, not swappable by the user as u stated. Check the Lenovo Product website. It was soldered in Gen 9 as well. You can change the SSD(s) and the Wifi Card. Gen 9 only had one ssd slot for 2242 btw. So that's definately a plus having 2 now.\n\nAh and btw, it has 2 USB-C 40 gbit ports, just like Gen 9 did. From the Lenovo Product Website \"Ports2 x USB-A (USB 3.2 Gen 1) + 2 x USB-C (USB4, 40Gbps, DP2.1, PD3.0) + 1 x Novo Button + Audio Jack + HDMI 2.1\"\n\n\nEdit, sorry. Thought you guys were talking about Ideapad 5 Pro 14.... ",
  "same! what did u end up going with?",
  "Thinkpads are just not worth it brand new, stop recommending those. They’re just absolute trash for their price. Lenovo is surfing on their name.",
  "r7735hs has rx680m",
  "They're fine as of now, they don't feel too flimsy unlike some HP or MSI pos, but they're not the strongest hinges ever compared to the ones of an xps or high end thinkpad. Not super good, not bad, just okay",
  "Hii\n\nIf you're on linux the cpu won't even go above 40°c for general desktop use so the fan won't even spin. It's however not the quietest if you're loading the cpu hard (compiling code, virtual machines or heck even games since the 680m can game pretty well), but nothing too terrible. \n\nOverall on linux it's not even making any noise for most tasks.\n\nAnd yeah, you're not getting anything better for that kind of money. I recommend getting the fat (70wh battery) for best experience.",
  "It's in the bios is dont recall the settings name but you'll find it easily",
  "Is the ram upgradable upto 32 gigs ?",
  "Yeah for sure, the radeon 680m is more than capable for those. But I'd suggest getting an actual gaming laptop if you're only doing gaming.",
  "Hi,\n\nYeah for sure. Still a great laptop. I'd recommend getting the OLED screen if your budget allows for it, it's really worth it in my opinion. Also since the memory is non upgradable getting the 32 gigs of ram is not a bad idea either (and if you can't get both the oled and the ram, get the ram) especially if you're running windows",
  "[removed]",
  "Something around 5-8 hours ? I get 5 because I’m always on HDR at 120hz with the ram set to 7500MT/s (they added a setting in the bios to change it), but I remember getting closer to 7 hours before I did all that, even 8. So with web browsing and programming it’ll last you half a day maybe. It also charges pretty pretty fast.",
  "hi, can you explain why? i've seen a lot of people recommending thinkpads, so i was considering it",
  "hey, could you tell me if the hinges have held up. i have had lenovos before and the hinges are awful , they usually fail in 1-2 years.",
  "Thanks for the detailed reply.\nI'm on Windows. Hopefully it's gonna be manageable, im pretty sensitive to loud fan noise especially for no reason ... Have a good day",
  "It has SODIMM so yes",
  "is the keyboard satisfying enough? I come from a Matebook D 14 2020, which has a great keyboard.\n\nMy main use would be office 365 suite, videocalls, powerBi, so the Oled screen could be risky due to the Burn-in to me... am I right?\n\nComing to the Ram, if I choose 32gb, I also have to choose the OLED screen; budget is not a problem, the fact is that the size of this laptop is perfect for me and I love the 16:10 form factor on a 15\" display.",
  "is the keyboard satisfying enough? I come from a Matebook D 14 2020, which has a great keyboard.\n\nMy main use would be office 365 suite, videocalls, powerBi, so the Oled screen could be risky due to the Burn-in to me... am I right?\n\nComing to the Ram, if I choose 32gb, I also have to choose the OLED screen; budget is not a problem, the fact is that the size of this laptop is perfect for me and I love the 16:10 form factor on a 15\" display.",
  "LMAO",
  "Dang that's great battery life!",
  "Hello, i want to buy a YOGA with either a 256v or a ryzen ai 350, i want a good battery life. i mainly want to use the laptop for websufring and media consumption (streaming and local), which would be the good choice ? thanks",
  "Old ones okay maybe if decently priced. Problem are new ones, being super overpriced while offering very little. An example : A mid range T14 G5 with a core ultra 5 125U, 60hz 1200p sRGB IPS display, 8gb of ram and 256gb of storage, which for those two are getting below today's standard, is priced at 1200€. Those are specs you'd find on a 600-700€ laptop, not a 1200€ laptop. At 1000€ you can already get something well built with a Ryzen 7 8th gen, 32gb of ram and 1tb of storage (Asus Zenbook, HP Elitebook, etc). In this case that laptop OP showed was a pretty fine deal, but if you took a Thinkpad for the same price you'd have an E14 Gen 6 with even worse specs. They stay good, don't get me wrong : but at any price range there's pretty much always a better deal.",
  "They still good",
  "Unfortunately windows randomly spikes the cpu even on idle so a same pc can sometime run *MUCH* hotter on Windows...\n\nBut im confident it wont be too bad, just not as good as on linux.",
  "I am less sure the RAM is upgradeable depending on the model actually. Just double check I'd say.",
  "Keyboard's alright. As for the burn in, I think it'll be fine, especially if you don't run max brightness (the screen is very bright, even half brightness is much brighter than most laptop screens) and auto hide taskbar. Bonus point if you use a OLED friendly theme (iirc the O365 suite has one where the background and ui is pure black). Those are only preventive measures and not really 100% necessary unless you're really scared.",
  "Yeah, I think it’ll perfectly suit your use. You can even play games on it like Fortnite at native res with amd adrenaline’s capper on 75 at 70 fps, Minecraft at 100 fps, the 780M is great.",
  "The AI 350 is slightly better, but the 256v does it all at 17W. Normally the Intel one should have better battery life. Will very easily handle what you said, even some more intensive tasks like gaming.",
  "Hi dear, how about the fan noise? Do you often hear them?",
  "Strangely it's hard to find an 8845hs or 8840u ddr5, good battery life + screen laptop here in India without overpaying a lot. \nBut I found an almost equally good Ryzen 7 AI 350 laptop with 860M igpu, 32 GB ddr5 5600 MT, 60wh fast charge. I think that'll be almost equally good as your laptop?",
  "so the intel would be the better choice ? between it doesn't have the multi threading capabilities, that's why i hesitate",
  "The ai 7 350 has a weaker iGPU but is normally slightly better than the 8845hs, would be close or even better since it also consumes less.",
  "Eh, won’t affect much.",
  "Lenovo Legion Pro 7, RTX 5090 Buy it or not!!! I am able to get Lenovo Legion Pro 7 with below specs at the price of 3.62 L. should I take this deal or not? Any other suggestion than this?? My usecase is gaming only.\nSpecs:\nMicrosoft Office Home 2024 India\n• 64 GB DDR5-6400MT/s (CSODIMM) - (2x32GB)\n• 1 TB SSD M.22280 PCle Gen5 Performance TLC\n• NVIDIA® GeForce RTX™ 5090 Laptop GPU 24G...\n• 5MP with Dual Microphone\n• 4 Cell Rechargeable Li-ion 99.9Wh",
  "You can’t ask for something better 🙂",
  "looks great if u have the money :(",
  "no there are build quality and qc issues, i bought the 5080 version",
  "Great deal but use discounts like student, credit card cashback, affiliate, coupons. Whichever you can.",
  "can you help me where can i get the affiliate discount coupons and other coupons as well",
  "Man, this is where it kills me on someone asking if he should build a pc or get a laptop\n\nIf laptops had full size pcie port (gen 5x8), it would have the best option to consider for people like you, could have get a rtx 5080 24gb gpu and a ultra 9 laptop as igpu have got enough powerful for low level tasks",
  "I have this exact spec laptop also bought India \nWorks great \nOiled gloss might be issue for some users\nPerformance is any game max\nNo regrets\n\n3dmark score is 24448 , gfx score 26120 and cpu score 17942\n\nI haven’t had issues with my build and I also use a stand initially for a month just to raise it and it was fine unless super long gaming session in like ghost of Tsushima after maybe 4-5 hours intense keyboard also gets toasty. But with cooling pad now it’s pristine .",
  "I am confused whether i should go for this one or should build a pc?? also i have seen in some videos tgp of rtx 5080 and 5090 laptop is same so should i go for rtx 5080 laptops then??",
  "so should i go for 5080 or 5090? is there any major changes in 5090 laptop over 5080??",
  "from where you bought it? and am i getting a good deal or should I buy it from elsewhere",
  "A pc will always be superior to a laptop when it comes to performance",
  "Check mobile vs desktop score. Mobile unfortunately is fake 5080/5090 due too pwr and cooling limitations 🤌🏼",
  "No the issue is with the chassis and quality control at lenovo both 5080 and 5090 come in the same chassis, i bought mine 5 days ago and i filed a ticket for replacement, lets see what they will do, but if you ask me i’d rather buy an asus rog strix its at a similar price point",
  "Bought it from Lenovo India site. Offline stores charge 20k more so I’d avoid the stores. Sites price is still about same as at launch. Maybe can get a bit more if you ask the sales team. Best discount is if someone has the Lenovo employee discount code. But if someone offers you that here they generally want some money for it. So idk if worth. Also if you do order it the shipping details date and all which they give will keep changing up and down and won’t update properly. Just save yourself a headache and assume it will come between 20- 30 days.",
  "but what are the extra charges i have to pay for it?? can it be build with same config within rs4L that is my budget",
  "You’re downgrading to a 5080 from a 5090? Is that right?",
  "The extra charge is now you have a desktop instead of a laptop. For the same amount of money, you can always get a desktop that will perform better, but you can't exactly take the desktop with you everywhere you go.",
  "the laptop comes with an option to select 5070ti or 5080 or 5090 i got mine with a 5080",
  "Lenovo legion pro 7 gen amd 16\" Hi guys, i got an offer on this laptop with ryzen 9 9955x3d with 5080 rtx along with 32gb ram and 1tb ssd oled screen for 3464CAD before tax. Is this a good deal?",
  "Hey everyone any thoughts on this deal!",
  "Its atleast 20 percent to expensive.",
  "But the laptops with these specs are going over 4500$ ",
  "https://www.bestbuy.com/product/msi-18-gaming-laptop-3840-x-2400--amd-ryzen-9-9955hx3d-with-64gb-memory-geforce-rtx-5080-2-tb-ssd-core-black-black/J3P7TXR2LR",
  "This one is more expensive but it has double the ram and double the storage and is a bigger screen. What is the refresh rate on the laptop your interested in?",
  "Brother that's USD price if i convert it in CAD its 4600 before tax",
  "The laptops you suggested are beasts but they are all in USD if i try to buy them in Canda they are over 4500 which is way beyond my budget ",
  "Because of tariffs?",
  "https://www.bestbuy.ca/en-ca/product/hp-omen-16-max-16-gaming-laptop-shadow-black-intel-core-ultra-9-275hx-64gb-ram-2tb-ssd-geforce-rtx-5090/19195151\n\n\nThis is the omen one that you provide the link for 😂",
  "No brother tariffs are not the problem, it's the exchange rate , sales tax and import costs.",
  "Hp omen max with 5080 or Lenovo legion pro 7 with 5070ti Pretty much the same price on black Friday deals. I have no experience with gaming laptops but this is where I’ve narrowed it down. \n\nThe specs would say probably HP, I think the ram speed is a little slower on the hp but that’s it. Build quality, experience with one or both, or just opinions would be welcomed",
  "Tough one the 16 go of vram vs 12 on the legion but I would compare the cpu and screens. Do you have the details?  Not all  hp omen max come with oled screens, so that’s a plus for the legion. Plus the legion typically uses the faster ddr5-6400 ram.  I have a legion pro 5 and have been really happy and typically online reviewers prefer the legions over hp.  Is there a store you can go look at em? The touch of the keyboard or track pad might be an instant no go.",
  "Yeah I realized after posting this that the omen doesn’t have the oled screen. Got caught spec chasing and didn’t realize. Now I’m trying to decide whether to get the 5070ti legion with intel i9 or 5080 with amd 9950hdx",
  "Got a Lenovo IdeaPad Slim 5 Gen 10 for ~₹72,848 after credit card cashback , student discount and ecoupon. Is this a steal? (16-inch, 120Hz OLED, Ryzen AI 7 350) Here are the detailed specs of what I got:\n\nModel: Lenovo IdeaPad Slim 5 Gen 10, 40.64cms (16-inch)\n\nProcessor: AMD Ryzen Al 7 350\n\nDisplay: 16-inch 2.8K (2880 x 1800) OLED, 120Hz refresh rate, 500 nits brightness, 100% DCI-P3 color gamut\n\nIncluded items: 3Y Accidental Damage Protection Add On, Lenovo 15.6\" Laptop Everyday Backpack B510\n\nFinal Price: ₹72,848.85 (after all discounts and cashback)\n\nThe estimated shipping date is October 10th. I've heard that Lenovo's delivery can sometimes be slow. Has anyone had any luck getting their order shipped faster? Is there a way to request an expedited delivery, or is it just a waiting game?",
  "Is this ready to ship model or customized one?",
  "And also how much ram and storage you got",
  "Ready To Ship",
  "24 Gb Ram 1 Tb ssd",
  "Then you will get it before time. I also got it before expected delivery date.",
  "Est. Ship Date is 06/10/2025 But Waiting to be shipped",
  "Yes it will be shipped before that. If you are from north India then it will be shipped from Noida(most chances).",
  "I Am From Maharashtra",
  "I have college from Monday (6th Oct) in another city, so I'm hoping to get it earlier",
  "Ok then maybe from Bhiwandi warehouse.",
  "\"Lenovo Ideapad Slim 5 Gen 10 (Ryzen 7 7735HS) — Powerhouse or Just Hype?\" So I am considering this laptop as a cse student for coding and other stuff not for gaming, this is the 15.3 inch model not that 13.3 one ..\nThis is the link : [link](https://www.lenovo.com/in/en/p/laptops/ideapad/ideapad-s-series/lenovo-ideapad-slim-5-gen-10-15-inch-amd/83j3003sin)\nPart no: 83J3003SIN\n\nHere are some questions:\nHas anyone bought it from lenovo website, if yes then how many days it took to reach at your address\nHow is the laptop,  give it rating and how is it's hinge?\nAlso give some coupon codes for lenovo website\nShould I buy this one\nThank you",
  "At sea level and 15°C (59°F), the standard density of air according to the International Standard Atmosphere (ISA) is 1.225 kg/m³\n\nDo you believe that this 'laptop is lighter than air'? That should answer your question regarding hype.",
  "https://www.reddit.com/r/Lenovo/s/KHJmDKLDVD 💀",
  "Electronic waste, as usual in the ideapad series.\n\nI also advise you to pay attention to the third digit in the processor name: 3 = zen 3, 4 = zen 4, so look for r7 7840hs or r5 7640hs, etc.\n\nBecause r7 7735 is zen 3.",
  "only for coding !! then I think you should go for it. But it's better to find other laptops of same price range to compare it with.",
  "I've heard nothing but bad things for the Slim models of the Ideapad. I mean like multiple stories of folks getting it and their drive corrupts, bad VRM's or bad RAM with in 10 days of owning it. The RAM is soldered on the board too, so you can't even just change it out. If this meets your needs and your budget, then go for it, but I would consider other options if you have others that you were looking at.",
  "buy i thinkpad.Lenovo idepad pad stands for the biggest garbage from lenovo",
  "Zen 3+\n\nDon't know how much of a difference it has with Zen 3 tho.",
  "Ram is not soldered what are you talking about",
  "ideapad doesn't stand for anything, it just so happens to be attached to the lowest end consumer grade Windows laptops sold by Lenovo.",
  "It literally says it in the screen shot. 16 GB LPDDR5X 6400MT/s (Soldered) \n\nMeaning you cannot swap it or replace it.",
  "Yea but that’s not the new model so why say all ideapads are bad",
  "Consumer grade laptops are all bad. All of them. They are designed that way though from the top of the industry. They are designed to have some issues within a couple of years, and they won’t sell you parts, so you have to rely on a 3rd party manufacturer and hope it works. \n\nAlso any soldered RAM on a board is bad. This one in specific is bad. If your RAM has issues, most people don’t know how to swap a motherboard in their laptop and are stuck paying $500+ for the manufacturer to fix or just buy a new one. And that cycle continues. \n\nBuy business class ultrabooks if you can. Or Framework.",
  "Haha insanely overpriced and not all laptops break down if you care correctly and know a few things about computers you wo t have a problem",
  "What I do know is if the RAM is soldered and something happens to the RAM, I’m not allowed to fix it.",
  "MacBook Pro vs Lenovo Slim 7 So I’m going to uni for CS and need a new laptop. I’m buying from Australia so options aren’t that great compared to the US but I’ve narrowed it down to the MacBook Pro M4 16/512GB and a Lenovo Yoga Slim 7 with Ryzen AI 7 350 16gb RAM and 1tb storage. I’m so confused on what to get and was hoping for some help. \n\nP.s I don’t really upgrade tech that often. I use the same thing for like 5-7+ years",
  "OP, MacBook Pro M4 is better for long-term performance, battery life, & macOS ecosystem, while Lenovo Yoga Slim 7 offers more ports, a brighter OLED screen,&  better multi-core CPU power for a lower price, choose MacBook for longevity & Lenovo for Windows flexibility and display.",
  "For CS you'll be better suited with a Mac due to its \\*nix/BSD foundation.",
  "The main problem with Windows laptops in general is that the build quality isn’t that great compared to Apple and after like 2-3 years of use the battery degradation kicks in full force like I barely get 40mins of light use on my Windows nowadays.The Ryzen might have better multi core performance but Apple’s M4 is just so efficient and powerful for some reason. Istg the only deciding factor here is the price, I could get the Lenovo for much cheaper but am I gonna pay for choosing the cheaper option long term?",
  "Ok so come back I just found a better version of the Lenovo with 32gb of Ram and 1tb storage so now I really don’t know",
  "I’ve heard people say the Unix terminal is better but hardware wise the Lenovo is giving me 32gb ram and 1tb ssd which is double the M4’s (16/512)  and the Lenovo costs less so now I’m really f’ing confused",
  "Okay I'm a CS grad as well, with industry and research experience so let me give you my opinion on this. \n\nThe nix shell or the posix shell is better yes and you'll be better suited with it, but considering budget and pragmatism,  you can also use windows subsystem for linux or wsl. So right now, the main deciding factor for you should be which os you're more comfortable with? Hardware specs are one thing but if you have to sacrifice years of workflow and familiarity it's not worth switching. So if you're on Windows now, stay on Windows. If you've been on macOS, stay on macOS. \n\nAnd obviously cost is a no brainer. If you want more bang for the buck and the Windows machine does your job, why not? \n\nP.S. - 32 GB should make it a breeze to run WSL as the underlying VM takes up about 4GB and you can shut it down when you don't need it. (Automatically shuts down after a while of inactivity)",
  "Thanks for the advice but I think I’ll switch to MacOS because I used my brother’s MB Air a few times and it was the best laptop experience I had and I think I also want to explore other options apart from Windows. I’ll only be using it for 4 years then after graduation I’ll return home where I can build a desktop with better specs!",
  "Great! If macOS works for you,  just get it XD",
  "Is lenovo legion 5 pro worth for 1.6 Lakh INR or 1790 USD -40.64cms (16) WQXGA (2560 x 1600), OLED, Glare, Non-Touch, HDR 1000 True Black, 100%DCI-P3, 500 nits, 165Hz, Low Blue Light. , Intel® Core™ Ultra 7 255HX Processor ",
  "Stuck Between Asus 14 Vivobook Ultra 7 s14 and the Lenovo 14 Yoga Slim 7 Ryzen Ai 7 Has anybody had any experience between the two? Do they both last long and is there any major differences between the two? Its going to be used for Uni, the casual light gaming, light editing, and just the usual researching and Youtube Watching. Though in the future, it could be used for a higher workload then now. Help me here im stuck lol.",
  "Happy black week ! Asus Zenbook A14 or Lenovo Yoga Slim 7 ? Hello people and Happy Black Week!\n\nI’m starting medical school in January and I also do programming, so I’m looking for a laptop that’s portable, reliable, and good for both study and coding. I’ve narrowed it down to two models, but they’re so similar in price and features that I can’t decide. If anyone has experience with either of these, I’d really appreciate your advice!\n\nASUS Zenbook A14 (Snapdragon)\n\n- 14\" OLED\n- Snapdragon X-series (ARM)\n- 18 GB RAM\n- 512 GB SSD\n- 0.98 kg\n- claims excellent battery life\n- Aluminum body\n\n\n Lenovo Yoga Slim 7 AI (Ryzen AI 5-340)\n\n- 14\" OLED\n- AMD Ryzen AI 5-340 (x86)\n- 16 GB RAM\n- 512 GB SSD\n- 1.19 kg\n- claims excellent battery life\n- Aluminum body\n\n\nSo both claims to have beautiful OLED screens, good battery life , similar storage and both are discounted and almost the same price. I’m mainly looking for something that will last through med school and handle my programming work smoothly. Also I am very afraid of accidents. I try to not mess up but yk shit happens, so tell me which one in your experience is more accident-proof, more durable,  faster and holds charge better , also which one is deemed more repairable? \n\nIf you have personal experience with these laptops, or can recommend something better in the same price/spec range, I’d love to hear your thoughts. Thank you! ^^",
  "[India] ~ ₹95,000–₹1,00,000 budget – Is the Lenovo Yoga Slim 7 Gen 10 good enough for neuroscience research + coding + 5-6 years of use? **Total budget (in local currency) and country of purchase.**  \nAbout ₹95,000–₹1,00,000 in India (after discounts). Equivalent to \\~$1100 USD.\n\n**Are you open to refurbs/used?**  \nPrefer new. Not open to used/refurb unless the deal is significantly better.\n\n**How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?**  \nPerformance > Build quality > Battery life > Form factor  \n(I want something powerful and future-proof for 5–6 years, prefer a normal ultrabook instead of 2-in-1.)\n\n**How important is weight and thinness to you?**  \nModerately important, I carry my laptop daily for study/research, so <1.5 kg preferred.\n\n**Do you have a preferred screen size? If indifferent, put N/A.**  \n14 inches preferred.\n\n**Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.**  \nNo CAD. No heavy video editing.  \nMostly: MS Office, research PDFs, datasets, neuroscience research tools, coding (Python, R), Jupyter notebooks, and possibly light ML workloads in future.\n\n**If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?**  \nI have my PS5 for that, so I won't need my laptop for it.\n\n**Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?**  \nGood keyboard and reliable build quality are important.  \nOLED display is nice but not mandatory.  \nPrefer good battery life.  \nFingerprint reader not required.\n\n**Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**  \nI’m currently using a Lenovo IdeaPad 5 with a Ryzen 7 5700U, and it’s starting to feel limiting.  \nI’ve shortlisted the Lenovo Yoga Slim 7 Gen 10 with: Ryzen AI 7 350, 16GB LPDDR5X RAM, 1TB SSD, 14” 2.8K OLED, integrated graphics, 70Wh battery. I would prefer Lenovo as I've used Lenovo laptops for nearly a decade now and really like them. But would be open to hearing thoughts.",
  "I need a Lenovo brand computer. I’ve had good experiences with them and am loyal. I have an older legion gaming laptop for the past 4-55 years that runs almost 25/7 ",
  "Lenovo Yoga Slim 7 - Asking for tips and advice to keep the performance quick. Hey everyone. I'm okay with tech but I've changed careers and now rely heavily on laptop use daily. I use it for spreadsheets, Adobe, documents, online working and applications, I've got dual monitors running off it constantly and USB hubs. I'm hoping for tips and tricks to help keep the performance and memory manageable so it doesn't get laggy and slow and overheat. Any advice or software to help keep it clean? Thanks in advance!",
  "How is lenovo Ideapad slim 5 Ryzen 7 7735HS. If anyone have this laptop i really wanna know the reviews. Nd battery too.",
  "FIrst and foremost doubt. Why is the title and description says 7735HS and the options below says 7735U?\n\nBoth of them are good performers. If we go to specifics, both have same cores and threads, 95% details are same between those twooo.\n\nThe only difference is:\n\n* **7735HS** is 15% better in multi-core performance than 7735U. HS is 15% better in performance than U.\n* **7735U** has better performance per watt, meaning slightly higher battery power than 7735HS. U has better efficency than HS (maybe like 10mins more depending on the usage).\n\nMake sure you are getting the model that you are looking for. The seller might have done the incorrect information, but just to make sure you are getting the same contact with them and confirm once. Just a precautionary.\n\n**Disclaimer:** These are rough calculations.",
  "I prefer to buy from lenovo official website , you get a 3000₹ off on a offer called after10deal it applys after 10 pm and if you use credit card 3000₹ off further,  finally it will be around 56,000₹\n\nIt has a 70Whr battery 100% SRGB display and its 15 inch version  \n\n\nhttps://www.lenovo.com/in/en/p/laptops/ideapad/ideapad-s-series/lenovo-ideapad-slim-5-gen-10-15-inch-amd/83j3003sin",
  "Yes I know this much about it. I'm asking if this is a good option or not?",
  "Fine but I don't want soldered ram does it come in SoDIMM?",
  "Yes yes, OP. Its really a good laptop and your choice.\n\nBattery Life of **Ideapad 8-11Hrs** as per various sources, thats an average. Some even got 12hrs with single charge.\n\nIf you dont mind me saying this, I have the same brand and processor in my notepad list and its only 56K from direct Lenovo site. However, its a ThinkBook and not IdeaPad.\n\n**16\" | 7735HS | 16GB DDR5 | 512GB SSD | Battery: 7-11Hrs | PassMark: 23209**\n\n* ThinkBook 16 (21MW008WIN): [Lenovo ThinkBook](https://www.lenovo.com/in/en/p/laptops/thinkbook/thinkbook-series/lenovo-thinkbook-16-gen-7-16-inch-amd/21mw008win) (₹56,831)\n* Gaming: [https://www.youtube.com/watch?v=ICce-CWxzbQ](https://www.youtube.com/watch?v=ICce-CWxzbQ)\n\n**What’s Included:**\n\n* 1 Year Onsite Warranty\n* MS Office Home 2024\n* Lenovo 39.6cms (15.6) Value Plus Backpack at ₹1",
  "whats your usecase?",
  "The thinkbook u mentioned ppl say it will come max 4hr battery life is it true or false info",
  "Coding, little gaming and vdo editing. \nI'm a cs major student",
  "I promise you, when I first saw this laptop model 5 months ago. Its have very good battery and overall quality. Then, after 2 months I am seeing build quality is not good and its between Ideapad & ThinkPad quality.\n\nBut, seeing its battery capacity as 45Wh, no wonder it has low battery backup. I feel bad now for sharing that shit piece.\n\nFor that 54k price, you can get the ThinkPad though with a bit less performance processor and good build quality as most of them knowns that ThinkPads are build like tanks.\n\n**16\" | 7535HS | 16GB DDR5 | 512GB 2242 SSD | 45%NTSC, 300 nits, 60 Hz | PassMark: 17929**\n\n* ThinkPad E14 (21M3S0FJ00): [Lenovo ThinkPad](https://www.lenovo.com/in/en/p/laptops/thinkpad/thinkpade/lenovo-thinkpad-e14-gen-6-14-inch-amd/21m3s0fj00) (₹55,870)\n* Gaming Test: [https://www.youtube.com/watch?v=-QL41ovz6hc](https://www.youtube.com/watch?v=-QL41ovz6hc)\n\nI hope atleast this one will have a good battery life. I checked the battery reviews from couple of websites and some mentioned it has good battery life and only a couple of people reported defective batteries.",
  "if theyre light games, then yes it is all good",
  "But this also has just 47wh \nI saw this https://share.google/4MdWRKCVp33Zjj2Na\n\nWhich 70wh it goes to 57k sometimes  but I searched everywhere but no review on this specific laptop",
  "I mean gta v for short time",
  "Can I use it for light 2d works? Not heavy ones",
  "So, I was scrolling randomly and saw someone asked for the same thinkbook review. One of the commenters mentioned it was shit...\n\nThey said this: The camera is really bad. Everything else seems to work fine. The battery is small though. 45Wh only (I get around 3.5 - 4hrs of battery under light usage). You can try for IdeaPad slim 3 with r7 8840HS. It has a 60Wh battery. Or IdeaPad slim 5 gen 10 with ai 7 350. The processor and battery combination in this one is deadly (and so is the price). 55k\n\nI think this would help you in picking up a good battery life laptop hopefully.",
  "yes, it should be sufficient",
  "Thank you",
  "Lenovo Yoga Slim 7 charging issue \nHey so I bought a brand new yoga slim 7 and just used it for 4 days and it's already having battery related issues . At first when I would connect or disconnect the battery the screen would go black for a 2 to 3 seconds but after researching about the issue I came to know it happens due to sudden Powe changes . Last 2 days after a full charge the battery would just last for 3 to 4 hours even with proper ventilation . And from the last few hours when I am connecting the charger it would just blink and won't connect properly and the screen would black for every 10 seconds or so interval . I restarted my laptop but it won't work and also left the charger as well as laptop aside for 15 min and then tried to plug it in but still nothing . I connected the laptop to another charger and it works fine ( just the another charger I have is a mobile phone charger with much lower power output so it doesn't charge the device) and I tried charging my phone through the original lenovo charger and it charges the phone without any issue but when I pair the lenovo charger and laptop in boom it doesn't work 😑.  Like wtf should I do.",
  "Lenovo yoga slim 7 vs Hp omnibook x flip 2 in 1 Hello I’m a college student trying to get my first laptop. I’ve checked the specs of both of them and I’m confused about which one I should get. What do you recommend? \nThank you",
  "Hi, completely new to laptops, want to know if this one is worth it/ if there are any better alternatives for a similar price (Lenovo Yoga Slim 7 14\") PRICE : £550 (723 usd)\nC/GPU :Intel Core Ultra 125H (integrated Arc graphics)\nRAM: 16GB LPDDR5X (7467MHz) \n512GB SSD\nDisplay: Fully HD+ OLED 60Hz 400 nits\n\n\nSo I'm a student who's going into uni, mainly planning to use it for microsoft excel/ppt/word etc with some visual novels and very light gaming (mostly 2d platformers), is this good value for a laptop/ what aternatives are there?",
  "Lenovo Legion 7 Help!!!! ",
  "Brand new Lenovo Slim 7 at 90K(INR) I have one Lenovo slim 7 14ILL10 with CPU: Intel Core U5 226V, RAM: 16GB, Storage: 1TB SSD, GPU: INTEGRATED. The current cost at any store or online is 1.3Lakhs however It is available for just 90k. If anyone is interested, you can Let me know and I would love to hook you up with this beast.",
  "need some help with lenovo legion slim 5 settings hi. i recently got a lenovo legion slim 5 laptop, but i have an issue that i don't know how to resolve. whenever i have any game open, the laptop seems to focus on the game only, and whatever app i have in the background just refuses to work properly. for example: while i'm playing something i decide to open a chrome tab and it will take ages for it to load fully. i've tried turning off game mode, hardware-accelerated gpu scheduling, changing priorities in the task manager, changing some nvidia control panel settings...\n\nif anyone knows how to fix it please reach out i would really appreciate it!",
  "Which laptop to buy after the Lenovo Yoga Slim 7 14ARE05 (ideapad) ? Hello !  \n5 years ago I bought a Yoga Slim 7-14ARE05 Laptop (ideapad) - Type 82A2 and it has been a blast. It has perfectly fullfilled what I was expecting it to do which is :  \n\\- coding (low level programming like kernel stuff and a bit of AI running)  \n\\- movies/series  \n\\- small gaming on not so demanding games like World Of Tanks or League of Legends\n\nPlus I thought it looked really cool with the metal case.\n\nHowever I am now looking to buy a new one and can't manage to find another one that fits as well as it did, eventhough it was 5 years ago. I went through the Lenovo store and didn't manage to see something that looked to be as good, but maybe I overlooked something.  \nI'm not sure to want a Macbook either since I got comfortable on PCs (and need a decent amount of storage)  \nMy price range can go at maximum to 1200.\n\nWould anyone have any recommandations ?",
  "Did you look for Yoga 7i pro Aura Edition? It comes in either Ultra 7 or 9.",
  "I have yes ! But it is a bit above the price range I can afford (I found it around 1400€).\nThanks for the advice !",
  "Lenovo Yoga Slim 7 arrived today!! 4800u, 16gb at 4266Mhz, 1TB ssd. I love it! ",
  "Jeez that’s some fast ram",
  "Verstappen makes the SSD faster. I can confirm.",
  "Man, I can' find those anywhere, even in the lenovo store... I feel like I'm being forced to buy the Intel option.",
  "Where are you from? I'm from Australia and the only available option is the top spec AMD option (pictured).",
  "As a Formula One fan, I approve of your desktop background.",
  "Great laptop to view, but stickers are awefully placed.",
  "I paid 800 euros for the 4700u variation. Bad thing is that it arrives next month because it was out of stock.",
  "That keeb fresh tho",
  "public complete sink cough physical wrench steep jar safe smoggy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
  "What is the battery widget? Can you tell , thanks .",
  "When an Ultrabook has faster Ram than my 2019 Legion Y740  (•́  ‿ ,•̀)",
  "is that a CTRL keyboard i see?",
  "Anyone know where i could buy this laptop in Canada",
  " BBBBBBBBBRRRRRRRRRRRAAAAAAAAAAAPPPPPPPPPPPPPPPPP   snnnnniiiiiiffffffffffff...oh yes my  dear....sssnnnnnnnnnnnniiiiiiiiffffffff....quite pungent indeed...is  that....dare I say....sssssssnniff...eggs I smell?......sniff  sniff....hmmm...yes...quite so my darling....sniff....quite pungent eggs  yes very much so .....ssssssssssssssnnnnnnnnnnnnnnniiiiiiiffffff....ah  yes...and also....a hint of....sniff....cheese.....quite wet my  dear....sniff...but of yes...this will do nicely....sniff.....please my  dear....another if you please....nice a big now....   BBBBBBRRRRRRRAAAAAAAPPPPPPPFFFFFFFLLLPPPPPPFFFFFFF  Oh yes...very  good!....very sloppy and wet my dear....hmmmmm...is that a drop of  nugget I see on the rim?...hmmmm.....let me.....let me just have a  little taste before the sniff my  darling.......hmmmmm....hmm..yes....that is a delicate bit of chocolate  my dear....ah yes....let me guess...curry for dinner?....oh quite right I  am....aren't I?....ok....time for  sniff.....sssssnnnnnnniiiiiiiiffffffff.....hmmm...hhhmmmmm I  see...yes....yes indeed as well curry......hmmm....that fragrance is  quite noticeable....yes.....onion and garlic chutney I take it my  dear?.....hmmmmm....yes quite.....   BBBBBBRRRRRRRRPPPPPPFFFFFFFFFFFFFFFFFFFFFTTTTTTTTTTT  Oh I was not  expecting that…that little gust my dear….you caught me off guard…yes…so  gentle it was though…hmmmm…let me taste this little one…just one small  sniff…..sniff…ah….ssssssnnnnnniiiiiffffffffffff…and yet…so  strong…yes…the odor….sniff sniff…hmmm….is that….sniff….hmmm….I can  almost taste it my dear…..yes….just…sniff….a little whiff more if you  please…..ssssssnnnnnniiiiiffffffffff…ah yes I have it now….yes  quite….hhhhmmmm…delectable my dear…..quite exquisite yes…..I dare  say…sniff….the most pungent one yet my  dear….ssssnnnnniiiifffffffffffffffffffffff….yes…",
  "Nice! What kinda keyboard is that?",
  "Yo got a link for that background?",
  "What is that keyboard",
  "Lucky people!",
  "We love itt too ❤️",
  "That ram",
  "Is that graphic card better than gtx 1660 ti?",
  "Max verstappen <3",
  "This looks neat asf",
  "How big is the screen?",
  "Pretty keyboard too ;) Where are the keycaps from?",
  "It.s a little bit sad cause with a dedicated graphic card the laptop would be powerful than that radeon vega...",
  "I am just about to return this. Chassis too weak etc..\nWhat is your battery wear level?",
  "Better get a cooling pad for it",
  "Im going to cum on your keyboard",
  "It has this feature where it detects if you looked away or not. How do you turn it off?",
  "Ah a man of culture! I love max",
  "So, you've used your new yoga for 2 weeks. How's your experience?",
  "Mine arrived with a 1tb lexar SSD, such sad :(",
  " Hey! Nice buy!\n\nCould you do me a favour and check fan behaviour while watching a stream on [twitch.tv](https://twith.tv/)   or Netflix, etc. when you attach the charger? Mine is completely  silent  on battery mode, but as soon as i attach it to the charger the  fans  kick in and won't stop.\n\nWhen  I limit the max. CPU state to 99% the fans stay silent - but at the  same time, this disables the Turbo Boost and that's no acceptable  solution to me.",
  "maxmaxmaxsupermaxmaxsupersupermaxmaxmaxsupermaxmax",
  "Any idea where I can find this today?  In USA.",
  "How does fusion 360 run on it? I'm thinking about getting one for engineering school :)",
  "Good luck with the Chinese spyware.",
  "That's Lpddr4x Ram. From what I have heard its a low powered ram and not as fast as 3200MHZ regular RAM.",
  "Super Max technology ain't no grandma.",
  "That explains Ricardo's wallpaper.",
  "I’m from Australia as well but I can’t seem to find it anywhere. Could you send a link?",
  "Yeah the placement isn't good with any of the stickers.",
  "Do people actually leave those on?",
  "Yea I would remove the one near the trackpad and move the amd to the right side but thats just my ocd",
  "*hopefully\n\nI'm still waiting for stuff i bought in june.",
  "It's part of the Lenovo software in the laptop... I'm unsure if you can find it outside of Lenovo products",
  "Lenovo Vantage",
  "No it's a sk64... similar to the gk61 if you've heard of that",
  "Yes mate",
  "I think it's the sk61.",
  "[deleted]",
  "I think it's the sk61",
  "No, it has integrated graphics. No dedicated graphic card.",
  "14in",
  "The keeb is a sk64... I'm not sure where you can find the keycaps as they came with the board",
  "I know you can turn off the camera in the software, but I'm not sure if it turns off that detection feature",
  "Haha it's a fantastic laptop... The battery life is probably the most notable feature becuase it can last a full weekend with low demand tasks like word/ Google and emails using the 'intelligent cooling' setting. \nSomething that I really like about it is just how quiet it is. Most of the time the fans do not spin - which honestly makes it a joy to use in comparison to my previous laptop (Dell inspiron 14 7000 w/ i7 8550u). I cannot stress enough how cool it is to lift the laptop up and see the fans not spinning and the machine cool to touch.\nThe integrated keyboard is nice after getting used to and feels slightly clicky.\nI also want to mention that the build quality is superb and the finish on it is really nice. \nAlso the speakers are fantastic and are comfortable when watching Netflix or YouTube. They made me realise how bad speakers detract from the experience.\nAll in all its a really nice product. No buyers remorse here. \nThanks for asking!",
  "I haven't had this happen to me and I can't imagine why it would be happening... Have you told Lenovo about this?",
  "I havent tested it yet!",
  "[deleted]",
  "It actually is faster than 3200mhz. Memory bandwidth at least is.",
  "It also downclocks when the dGPU isn't active",
  "That ain't him chief. Its Verstppen",
  "Its available at Harvey Norman. I got it for 2300 but it's gone up in price for whatever reason...\nhttps://www.harveynorman.com.au/lenovo-yoga-slim-7-14-inch-r7-4800u-16gb-1tb-ssd-laptop.html",
  "I never bother to remove. But this one makes me rethink",
  "This is why i didnt buy straight from lenovo.",
  "ahh ok. cool keyboard tho. (:",
  "Awesome, thank you!",
  "Nice thanks man",
  "Yeah sk64",
  "Thank you very much for your feedback. 🙏You helped me make my decision to buy this model. 😄",
  "This spec should outlast the solder",
  "Thanks,\nJesus its so high right now.",
  "Upgrading for Engineering College - would the integrated graphics of the Intel Core Ultra 7 w/ 140v Intel arc be enough for CAD, light-mid gaming, and heavy video and photo editing? (Laptop - Lenovo Slim 7i) Hello! My current laptop (Colorful X15 AT - Chinese gaming laptop) really sucks for everything except gaming (which is what I bought it for as a younger, more stupid self.) No surprise, its louder then my AC, cant hold a charge, and is 8 pounds. Not great for bringing anywhere. \n\n  \nI'm looking at the Lenovo Slim 7i (https://www.costco.com/lenovo-slim-7i-14-oled-touchscreen-copilot-pc---aura-edition---intel-core-ultra-7-processor-258v---windows-11---32-gb-ram---1tb-ssd.product.4000362052.html) which Costco has on sale for 900. My only issue is that it doesn't have a dedicated graphics card, but I'm seeing good things about the 140v Arc as being capable for most engineering college + general workstation level tasks. Any experiences with this laptop or this CPU specifically? \n\n  \nThanks! If there are any other suggestions for good engineering laptops, I would really appreciate if you let me know about them. ",
  "[deleted]",
  "thanks! Im always shocked on how quickly integrated graphics have become both cheap and comparable to the dedicated graphics I fawned over as a kid.",
  "Lenovo Slim 7 laptop sending Ctrl-D commands every few seconds As the title says my Lenovo Slim 7 laptop sending Ctrl-D commands every few seconds. It has Win 11 installed. It started last week.  So far I have:\n\n* Cleaned and blown out the keyboard with compressed air (no keys are sticking)\n* Made sure Sticky Keys are off\n* Ran malware checks Defender and Malwarebytes - they found nothing\n* Plugged in an external keyboard - still happens\n* Enabled the on screen keyboard, and can watch the Ctrl key deploy on screen without touching anything\n* Reset the laptop keeping my files\n* Reset the laptop erasing my files\n* Installed the latest firmware updates from Lenovo\n* Deleted the keyboard drivers and let them reinstall on reboot\n* Installed Linux Mint (overwriting the internal drive)\n* Removed the hard drive and booted from a USB drive (thinking maybe something was loading from the boot sector\n* Opened up the case and disconnected the keyboard ribbon file, plugged in a  working external keyboard, and booted from a USB\n\nIt still is sending Ctrl-D commands.  What is left?  Any ideas what is going on?   It is out of  warranty by about 6 mos. \n\n  \nThanks.",
  "So weird.\nBut how do you know it is Ctrl-D?",
  "A couple of ways.  First, I had my email client open and it started deleting emails.   Second, I can see the Ctrl key being deployed in the on screen keyboard.  Third, I opened a command shell to try and enter commands and strings of \"ddddddd\" fill up the screen.",
  "At this point the only theory is that the keyboard controller chip on the motherboard is defect. Can you reach Lenovo customer to see if there's anything they can help? If not then your only choice is to bring it to a shop that can do component-level fix.",
  "If that is the case, do you think it is worth fixing?",
  "If it just a faulty chip and can be replace easily then yes. At its current state there's no better use than scrape it for parts which is a huge waste in my opinion. Try to get it diagnose and a quote then you can decide.",
  "Thanks.",
  "Here is an update on this.  After reattaching the keyboard ribbon cable the problem continued.  I detached it again and just let the laptop sit unplugged for a few days.  Not intentionally,  I was stewing about this.  Last night I put it back together to take it to the shop and it is now working fine.  I am not sure if there is a buffer or a battery that was keeping this routine running that finally discharged, or if the ribbon cable was previously askew (it didn't look like it), but it is working fine now.  Thanks for your input, without which this would have gone to a landfill.  Cheers.",
  "Lenovo Yoga slim 7 pro X ",
  "Laptop Lenovo yoga on slim 7 doesn’t charge stuck at 0% As soon as I unplug the charger it takes 30 sec to die. It was working fine a few days ago. Tried different cables no help. Using the original cable. Ports been cleaned. Any help would be appreciated ",
  "Lenovo Legion Pro 7 (RTX 5070 Ti, OLED) vs HP OMEN MAX (RTX 5080, IPS) - which one? ",
  "Lenovo Slim 7i 14\" OLED Touchscreen Copilot+ PC - Aura Edition - Intel Core Ultra 7 Processor 258V - Windows 11 - 32 GB RAM - 1TB SSD | $900 Costco This seems like a solid deal at Costco right now: \n\nhttps://www.costco.com/.product.1966999.html?sh=true&nf=true\n\n",
  "Lenovo IdeaPad Slim 5 AMD Ryzen 7 8845HS - Is this a good purchase? Hi all! \n\nI am looking to purchase a new laptop prior to starting my 2nd year of grad school, and new help deciding if the Lenovo IdeaPad Slim 5 AMD Ryzen 7 8845HS is a good idea based on my intended usage (which is mainly work/school).\n\nFor some context, I am an engineering student, and I am looking to purchase a new laptop that can sufficiently run (without noticeable lag or issues) MATLAB, RStudio, NIMAX/LabVIEW, and CAD software. Currently I have the M2 MacBook Air from 2022 (which works great!), but I am looking to get a windows laptop to be able to avoid using a virtual machine (VM) to run CAD and NIMAX. \n\nMy budget is anything less than $700 (not that great of a budget, but student loans really stretches discretionary spending thin), so I found this laptop on costco (link below) which seemed like a good, cost efficient purchase.  \n\nMy main points of purchase is that: \n\n1. It can run the softwares listed above sufficiently while maintaining a relatively fast usage speed while use (hopefully nothing that would remind me a slow VAIO computer from the 2010s).\n2. Battery life is also kinda important, but I am almost usually sitting near an outlet that I can charge my laptop from while using.\n3. It would be a bonus if this laptop can also run some games (not really a gamer but sometimes I like to play Minecraft or maybe Age of Empires 3-4) but this isnt totally necessary! \n\nThe specs for the laptop in question are as follows:\n\n  \n**Processor & Memory:**\n\n* AMD Ryzen™ 7 8845HS (8-Core) Processor\n* 16GB LPDDR5x 6400MHz RAM\n\n**Drives:**   \n\n* 1TB PCIe NVMe™ M.2 Solid State Drive\n* No Optical Drive\n\n**Graphics & Video:**\n\n* 16\" Touchscreen IPS WUXGA (1920 x 1200) 300-Nits Display\n* Integrated Intel Graphics \n\n**Operating System:**   \n\n* Microsoft® Windows 11 Home (64-bit)\n\n**Communications:**\n\n* Wi-Fi 6 (2x2) and Bluetooth® 5.2\n* Integrated 1080p Webcam with Privacy Shutter\n\n**Audio:**   \n\n* 2x 2W Speakers\n\n**Keyboard:**\n\n* Backlit Keyboard\n* Fingerprint Reader\n\n**Ports & Slots:**\n\n* 2x USB 3.2 Gen 1 (Power Delivery 3.0, DisplayPort™ 1.4)\n* 2x USB 3.2 Gen 1 \n* 1x HDMI Out\n* 1x MicroSD Card Reader\n* 1x Headphone/Microphone Combination Jack\n\n**Battery:**\n\n* 3 cell 57WH Lithium-Polymer Battery\n\n**Additional Information:**\n\n* Dimensions: 12.28\" L x 8.70\"W x 0.67\"H\n* Approximate Weight: 4.39 lbs\n\n**Model Number:** 83DD002JUS\n\n  \nThe laptop also comes with a 2 year warranty and free McAfee Total Protection if that matters. If this laptop doesn't quite fit the bill, I am more than open to suggestions on where to buy a laptop!\n\n**Laptop listing link**: [Lenovo IdeaPad Slim 5 16\" Touchscreen Laptop - AMD Ryzen 7 8845HS - WUXGA (1920 x 1200) - Windows 11](https://www.costco.com/lenovo-ideapad-slim-5-16-touchscreen-laptop---amd-ryzen-7-8845hs---wuxga-1920-x-1200---windows-11.product.4000253721.html)",
  "Do you have any updates on using the laptop? I'm interested in buying it, same specs but no touchscreen.",
  "I assume it runs Radeon igpu graphics. I think that would be good. I have liked the build quality on ideapad 5 models for being in the budget class. The cpu is the same Lenovo sometimes uses in their gaming laptops. So, the battery life  might not be amazing, but I sometimes read PC World. When they tested Legion 5 slims with Ryzen 7 hs cpus and turned off the gpu, they got decent battery life like 4.5-5.5 hours. So, it seems this is a solid pick.\n\nI am not expert. I just bought something a year ago, and I sometimes like reading PC Magazine or PC World because their reviews are short but kind of interesting.",
  "Did u buy this? Any update?",
  "I just chose this exact laptop as an electrical engineering student. My logic is that the more powerful CPU will allow me to run CAD but battery life wouldn't be compromised due to igpu. I also asked a few informed people who said it's a good deal if you get it on sale. Which I did (800 CAD).",
  "The graphics on there are great, better than 2050 laptop by far. It has Ryzen 780m integrated graphics. Also the build quality is great for the price and performance",
  "I just bought this laptop with 32gb ram, integrated graphics and opted for the larger 76wh battery. I just took a zoom call for an hour and killed my battery from 71% to 50%. Nothing else was running. No touch screen. Seems a bit excessive?",
  "I just bought this from costco - it was for $550. Couldn’t find an equivalent laptop with a cpu with such impressive benchmark scores for this price range - comparable laptops were in the 650-700 range, so I’m happy with my $550 purchase",
  "I’m looking to buy this too. Newbie question, does Costco sell the annual (15 month) Microsoft Office subscription?  Thanks",
  "I am looking at a similar laptop for grad school for data analysis. Any update?",
  "I don’t know much about computers, but my sister has this laptop and it can handle pretty graphically intensive stuff",
  "hello. i wanted to ask hows it running so far, any issues? ive seen alot on this sub and the lenovo one regarding the slim 5",
  "no touch screen is better quality with 400nits and true black 500 oled screen. Also comes in full aluminium",
  "Hey thank for the quick reply! No worries, expert advice isn't my first choice. I'm just looking for some informed people to provide their opinions and ideas. \n\nBut yeah I would assume that it has Radeon igpu graphics as well since a previous version of the Lenovo IdeaPad Slim 5 had Integrated AMD Radeon™ Graphics, but that was with different specs of  \n\n* Processor : AMD Ryzen™ 7 7730U Processor (2.00 GHz up to 4.50 GHz)\n* Graphic Card : Integrated AMD Radeon™ Graphics\n* Memory : 16 GB DDR4-3200MHz (Soldered)\n* Storage : 512 GB SSD M.2 2242 PCIe TLC\n\nA battery life without charging of like 5hrs isnt that bad, since the grad classes usually run for like 3hrs, but bringing a charger with me to class isnt the end of the world. Thank you for sharing!",
  "I buyed the 14'' version and the its good.",
  "How long does the battery last for you?",
  "Does it get uncomfortably hot?",
  "That's a Zoom issue, not a hardware issue.",
  "How long did it take for delivery? I've ordered a gen 9 AMD ryzen 7 8845 HS, 32gb ram/512SSD, customised piece.",
  "I'm about to purchase it too! Seems like one of the best deals I could find with exactly the specs I'm looking for.",
  "I noticed some come lifetime office",
  "Hey there. I just graduated so I can finally provide an honest review of the laptop. Depends what type of data analysis. I used this laptop for some 3D modeling work like CREO and solidworks, and for coding in MATLAB and R Studio. Honestly no complaints after prolonged use. Its a good budget laptop imo, things could be faster but its definitely not slow. Also I recommend using a wireless mouse with this laptop as the track pad feels weird",
  "Hey there friend! I graduated from my program, so I can say that it can run most of the programs I needed pretty decently. It wasn't slow by any means, but it wont be able to perform certain simulations and shader based 3D modeling in solidworks (graphics limited) but very decent computer nonetheless. My only \"issue\" is that the vents are on the bottom of the laptop, so if you don't have some cleared between the laptop bottom and the ground, you can expect for the fan to turn on and for it get hot... especially if you want to run some more battery-draining programs. Let me know if you have any specific questions!",
  "The second one looks good for my uses I work in the legal field. I don't do anything too crazy, but I sometimes have to reorganize these extra large pdfs of 1200 pages. This cpu seems handle anything like that fine because of a good turbo mode. The battery life is really good. I have worked from home more because of a few medical issues, but I can easily get 7.5 hours off the battery if a work for a neighborhood coffee shop, which good for a cpu that seems pretty quick. I do a lot of video conferencing with a bunch different services Cisco webex, Zoom, and Jurislink (federal courts approved for jail and prisons). These all load super fast, which makes my life easier. With my old terrible laptop, for a while I had log on 10 minutes early for some these meetings.\n\nIf you thought that some of the software suggested a gpu. I did see this Acer at Costco USA. It looked really nice and all things considered not that expensive.\n\n[https://www.acer.com/us-en/laptops/aspire/aspire-intel/pdp/NX.KSVAA.001](https://www.acer.com/us-en/laptops/aspire/aspire-intel/pdp/NX.KSVAA.001)",
  "How long have you had it? No problems with the hinges?",
  "How long have you had it? No problems with the hinges?",
  "I just bought 5days ago, everything is perfect for me but it has like higher fan noise even in balance mode.  Now, I'm considering to return it back this Friday but first, I would be happy to hear from you about the noise.",
  "Depends on usage but I'd say 8h with just text base stuff and like 5h if heavy internet use +streaming. It's honestly not great. ",
  "Not at all",
  "Good point, I'll try the same with the mac and see what happens. Zoom has become a hog....",
  "Delivery was about a week from China.",
  "Hi, can you share from where you got the 32gb ram version? \n\nI can't find any that come with 32gb.",
  "I considered the $700 swift go with ultra 9 185 processor and 32gb ram. Similar processor, better ram, but upgraded wifi 7 vs wifi 6.\n\nI struggled to justify an extra $150 for what is intimately going to be a laptop that will barely be used for anything other than normal everyday usage.\n\nI do have a wifi 6e set up in my house so the 6ghz band would have been useful but at the end of the day it’s a 1 gbps internet so the 6ghz band in my home is functionally equivalent to the 5ghz bands\n\nSo basically i cheaped out and saved money",
  "We will have some large data set with R Studio on the machine along with possible other software. I  just started so I’m not sure at this point. I will definitely use a wireless mouse. I think it’s a good budget option. It’s either the Lenovo or the Dell 3520 with the AMD Ryzen 7 processor.",
  "Thanks for the reply. Id like to know about the battery timing on that, like when not running a heavy load and when we would be",
  "So far it's running fine both in Linux and windows. No hinge problem, I heard somewhere that they fixed it in 23,24 models. I hope so this is right.",
  "I don't have any fan noise in balanced or intelligent mode. Even in performance mode it doesn't go any higher that it's troublesome for me. I mostly use it with an energy saver(windows , tlp- Linux ) on so it feels like a laptop without a fan.",
  "i was planning to buy 57Wh model now i will go with 84Wh",
  "Which country?",
  "Hi, which country are you in? I ordered mine in India as a CTO- customised version from Lenovo. It's sadly showing unavailable on Lenovo India now.",
  "Yeah I definitely think it's good for R Studio analysis",
  "I just bought 5days ago, everything is perfect for me but it has like higher fan noise even in balance mode.  Now, I'm considering to return it back this Friday but first, I would be happy to hear from you about the noise.",
  "After just completely installed the updated winnows and the Lenovo things, mine is also doing so great. The battery stays for about 10+ hrs. I was worrying in the beginning but I'm finally happy. Thank you very much.",
  "You have that option? I think it's only withbthe pros",
  "Australia",
  "Yeah,saw that. I am in India. I went with the 2 in 1 option that had the 8845hs cpu.",
  "What settings are you using I'm getting only 6-7 hours",
  "right, Ideapad Pro 5 comes with 84Wh battery",
  "Oh ok",
  "Well, I mean that, it is when I'm reading or using simple tasks. I set the the Power Mode into Best Power Efficiency and also the keyboard light into automatic.",
  "Where you",
  "India",
  "Optimizing Ryzen 7 7735HS on Lenovo Legion for CPU-Intensive Games ",
  "Optimizing Ryzen 7 7735HS on Lenovo Legion for CPU-Intensive Games ",
  "Lenovo slim 7 vs Asus Zenbook 14 I am looking to buy a laptop for my masters in Ai. I know these are not best laptop for theis but I am on a tight budget and need it now. \n1) Lenovo yoga slim 7 has amd 5 340 with 16 gb ram and 512 SSD. Screen is 2.8 k. Price is 880 euros.\n2) Asus Zenbook 14 has amd 7 350 with 16 gb ram and 1 tb SSD. Screen is 3k. Price is 800 pounds.\n \nI am looking to buy one of these which should I choose. \nIf there are any other deals in Germany or UK please let me know. Thanks in advance.",
  "M4 Macbook Air 13.6\" (512GB, 16GB RAM) VS Lenovo Yoga Slim 7i Aura Gen10 (Ultra 7 258v, 14\") I found both laptops for a similar price and I am very torn between them. I am a computer science student who needs it mostly for programming plus general use.                                                                           **Lenovo specs:**  \nUltra 7 258v  \n32GB RAM  \n1TB SSD  \n2.8K 120Hz OLED display\n\n**Macbook Advantages:**  \n\\-Significantly better CPU performance  \n\\-Slightly better battery\n\n**Lenovo Advantages:**  \n\\-Significantly better display (OLED, 120Hz & preferred size                                                                               -Better ports (HDMI & USB-A)  \n\\-Windows (Prefer the idea of using windows although never used macos before)                                                      -More RAM (32GB instead of 16GB)                                                                                                                    -More Storage (1TB instead of 512GB) although 512 would likely still be enough\n\nI would love to stick to windows, and I find the better screen & its size really important. And im interested to know whether the ram increase on the lenovo makes up for the performance deficit a bit in terms of usability. But I know how much better the M4 chip is (20-30% faster), making it a really hard choice. Any advice, and any considerations I have not made yet would be really appreciated!\n\nI guess also the question for me is whether the Ultra 7 will be more than fast enough for the vast majority of work anyway. Is that the case?",
  "Would Go with the Lenovo Yoga slim 4 compability and the ram",
  "Better speakers, trackpad also",
  "Noted, thanks for the response",
  "the macbook I presume?",
  "Nevermind I thought the yoga has 2 speakers but it turns out it also got 4 speakers like the MacBook",
  "Impression + AMA - Core Ultra 7 258v VS Ryzen 7 AI 350 for a casual user (feat. Lenovo Yoga Slim 7 Gen 10) Hello there! Just a quick introduction to explain why I'm making this post: I'm currently in the market for a new laptop (coming from a Blade 14 2021 w/ RTX 3070). Here are my requirements:\n\n* Thin and light\n* Decent battery life (doesn't need to exceed 10 hours)\n* Most importantly, good unplugged performance\n* Casual gaming (mostly indies)\n* Quiet and at least not hot to the touch\n\nMy Typical Usage:\n\n**Two Browsers** – about 20–30 tabs each\n\n* **Browser 1** – TradingView, multiple crypto trading exchanges\n* **Browser 2** – Messenger, WhatsApp, X, Telegram, Discord, Databricks, Reddit, YouTube, Chatgpt etc.\n\n**Other apps (background + foreground)** – Spotify, Outlook, Teams, ShareX, OneDrive, Steam, Excel spreadsheets (2–3 at least)\n\nSo, I narrowed my choice down to the Lenovo Yoga Slim 7, but I have a big dilemma due to the CPU choice—Intel 258v vs. AMD AI 350. Naturally, being an AMD fanboy, I would have picked the AI 350 without question, especially since AMD has usually been the battery champ in Windows laptops over the past few years. After doing further research into Lunar Lake, I'm very intrigued by its efficiency but wary about the lack of multithreading.\n\nThe problem is that there isn't a review out there that really focuses on actual unplugged user experience in terms of performance and multitasking. Most reviewers dish out raw numbers like everyone is a content creator or something. Sure, user experience is rather hard to quantify, but I need a laptop that feels smooth in daily use.\n\nTherefore, I decided to take matters into my own hands. I went to my local retailer and ordered both models. They just arrived today, so now I have the AMD model with a touchscreen in Tidal Teal and the Intel model without a touchscreen in Lunar Grey. After setting them up and playing around for a few hours, here are my early impressions (mind you, these are not scientific results).\n\n**Performance (Unplugged) – Nitpick Alert**\n\nNo, I don't run benchmark scores—you can find those online easily. I care more about actual system responsiveness: how the laptop feels in day-to-day use and under light loads.\n\n**Intel 258v** – To my surprise, the 258v delivers much better responsiveness. I'm talking about switching windows, animations, moving things around the screen, having multiple windows open, and running background apps during my typical workload. Additionally, it’s able to handle everything I need without a single lag—I even had a 4K YouTube video playing in a floating window while working. Even in 'Best Power Efficiency' mode, the scrolling animations remain smooth, which is a nice touch. Sure, my workload isn’t the heaviest, but this is an ace in my book. One thing to note: I started noticing slight sluggishness in animations when the battery falls below 15%.\n\n**AMD AI 350** – While the AI 350 can also do everything without slowing down, the general animations aren't as smooth as the 258v’s when unplugged. Things like minimizing/maximizing windows and bringing up the quick menu feel less fluid. This is particularly noticeable in 'Best Power Efficiency' mode, where I lose the smooth scrolling animation while charting on TradingView. It’s not bad or slow per se—it works fine—it’s just that the 258v keeps things consistently smooth across all settings.\n\nI'll run some games during the weekend and see how it goes. However, gaming performance is not my main requirement—nice to have, but not a must-have. You can find plenty of benchmarks online anyway.\n\n**Noise & Heat**\n\nAnother win here for the 258v. Aside from the initial setup, the fan rarely ramps up. While running my typical workload, it gets just a little warm at the top left corner of the keyboard—not bothersome at all. Otherwise, it remains cool and quiet. \n\nThe AMD AI 350 also fares pretty well—it gets *slightly* warmer than the 258v, but I'd say it's negligible. The fan kicks in more often than the Intel 258v’s, though. However, I'd say both can achieve silent performance.\n\n**Battery Life**\n\nToo early to tell, as I haven't gone through a full battery cycle on either laptop yet. First impressions suggest both are neck and neck. I'll update the post once I have more results.\n\n**Build Quality**\n\nNormally, they should be the same, but I noticed a few differences worth reporting. The AI 350 has some backplate creaks—it makes a slight noise when picking the laptop up or moving the lid. Meanwhile, the 258v feels more solid, but it has a rattly touchpad, which kind of drives me nuts at times. Lenovo's QC seems poor here.\n\nI find this surprising since I usually hear Lenovo has the fewest RMA cases—or maybe I just have the worst luck.\n\nAs of now, the Intel 258v is more likely to stay with me. I'll update this post once I have more testing results. **AMA!**",
  "Well, the Intel Is Better in every category except multi core performance, battery Life Will be mutch Better(around 15% more), if you want tò go amd with some reason tò not go with Intel you should get a ryzen 9 365, or if you do not care using Intel the ultra 7 258v or if you want also multicolore performance (loosing the bonus battery Life ) the 255h",
  "I'm having the same experience as you with a new AMD AI 350 Laptop (HP OmniBook X) that for some reason doesn't feel as smooth for casual use which is surprising coming from a Ryzen 5 5600H as reference.  I'm not sure if it's the HP bloatware and I should try a fresh windows install before returning. \n\n\nI'm getting in the meantime a Lenovo Yoga Slim 7i with the Core Ultra 7 258v so I will be able to compare between those.",
  "I'm thinking about whether it's worth paying $200 more for the 258V?",
  "I'm planning to upgrade from my Lenovo with a 5500U because it's starting to feel a bit slow in everyday use nothing heavy, mostly just browsing. I was leaning towards AMD for the performance, but your comparison really got me thinking, and now I'm considering the 258v. Did you end up keeping it? How’s it been after using it for a while?",
  "Hey mate, what did you notice with the battery life?",
  "Any updates on the battery life?^^",
  "How did it go?",
  "I guess this really depends if you need that 32GB. As far as I know, there isnt too much CPU performance different wbeen 256v vs 258v but yeah the price different is rather steep.  \nPersonally, I only upgrade my laptop like after 5 years or when it dies, so 32GB could futureproof'' things down the road for me.",
  "Ended up getting a HP Omnibook Ultra with the Intel 258V. So far way smoother experience than the Omnibook X with the AI 350 for some reason even though the specs of the AMD sounded better. The Yoga Slim 7i was equally smooth experience when I tried but found a great deal on the HP.",
  "Sorry, I meant that I'm also looking at the Lenovo Yoga 7i and the Intel version with the 258V is $200 more than the Ryzen 7 AI 350.",
  "And how is the battery in comparison?",
  "sorry i misunderstood your question.  \npersonally I would, considering Im only mostly doing light but moderate multitasking, I dont need that extra horsepower considering the 258v has plenty for me.\n\nMoreover, the extra battery life, silence and lower temp gives a nice feeling.\n\nBut anyway, I've returned both of the laptop due to build quality issue.\n\nI've just picked a 2024 Omnibook Ultra Flip 14 on sales, 10% less than what I paid for the yoga 7 258v, which has way better build quality. However, the Yoga has better screen quality though as the screendoor effect on the HP is crazy.",
  "Hye, any update on the battery life comparison? Did you test it out completely before returning them?",
  "yes please any battery life updates? what are your thoughts",
  "Lenovo Yoga Slim 7 won’t do triple monitors? I have a triple monitor setup at home that I use with both my work and personal laptops.\n\t•\tWork laptop: HP EliteBook 830 G9\n\t•\tDocking station: HP G5\n\t•\tMonitors: 3 external monitors\n\nWhen I connect the EliteBook, everything works perfectly—dock drives all 3 monitors with no issues.\n\nBut when I connect my Lenovo Yoga Slim 7, it only detects 2 monitors max. The third monitor never shows up no matter what I try. I’ve updated drivers, swapped cables/ports, adjusted display settings, restarted, etc. Nothing helps.\n\nThe Yoga Slim 7 will happily run 2 external monitors + its own built-in screen, but not 3 externals through the dock.\n\nSo is this just a limitation of the Yoga Slim 7’s GPU/USB-C output, or is there a workaround I’m missing? Anyone else run into this?",
  "Could be that you're hitting the bandwidth cap on the USB4 Gen 3 ports or maybe even on your iGPU. What are the resolutions of your monitors and what is the CPU in your Yoga?",
  "So I have a snapdragon(R) X Elite- X1E78100- Qualcomm 3.42ghz. My monitors are set up to 1920x1080. I just noticed when I have my laptop screen open it detects my 2 external and the laptop screen so I am able to extend it to 3 screens. However I need my 3 external screens to work as my laptop is normally shut.",
  "I think the Snapdragon X Elite may not be able to extend up to 3 external displays. I'm seeing some conflicting stuff online, but a lot of people report only being able to extend to 2 displays, which has made some people think the \"3rd display\" is the laptop screen itself. Weird. This would mean the Adreno GPU engine is not able to support 3 displays.",
  "So you think getting a Lenovo thunderbolt doc won’t fix the issue?",
  "I don't think it will if its a limitation with the iGPU. Unless someone else knows for sure what's going on.",
  "Title: 7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Says It’s a Game Changer in 2025 🎮 Hey everyone,\n\nI just read this review titled *“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025”* and thought it’d be worth sharing/discussing. (Link included below.)  \nHere’s a quick breakdown + my take — would love to hear what you all think:\n\n# 🔍 Key Highlights from the Review\n\n1. **Top-tier graphics & processing** – It leans on Intel + latest RTX (5000 series) hardware for serious gaming punch.\n2. **Stunning OLED 240 Hz display** – Crisp visuals, high refresh, rich colors.\n3. **Performance & cooling optimized** – Good thermal design (especially on a stand) helps sustain heavy loads.\n4. **Strong build quality & premium feel** – Materials and finish got good praise.\n5. **Quiet / balance modes are effective** – You don’t always have to blast full power.\n6. **Decent audio & ports** – For a gaming laptop, it doesn’t skimp too much.\n7. **Some compromises & trade-offs** – Battery life is underwhelming, smudge-prone surfaces, and the new port layout (sides vs back) isn’t ideal for everyone.\n\n# My Thoughts & Questions\n\n* This looks like a beast if you mostly use it plugged in — for gaming, video, creative work. But if you're mobile and need long unplugged sessions, the battery life sounds weak (which echoed in other reviews too).\n* The OLED + 240 Hz combo is tempting, but in bright environments, reflections may kill the vibe.\n* Side instead of rear ports is a controversial change — ergonomics over aesthetics?\n* I’m curious: for folks who’ve tried it, how is it in real-world use (noise, heat, battery wear)?\n\n**Link to full review (for reference):**  \n“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025” [mesnbot.com](https://mesnbot.com/7-powerful-reasons-the-lenovo-legion-pro-7i-gen-10-review-proves-its-a-game-changer-in-2025/?utm_source=chatgpt.com)",
  "ChatGPT review lol",
  "want review on Lenovo V15 AMD Ryzen 7 7730U i have my eye on the laptop on this upcoming diwali sale - Lenovo V15 AMD Ryzen 7 7730U 15.6\" (39.62cm) FHD 250 Nits Antiglare Thin and Light Laptop (Free MS Office) Lifetime (16GB/512GB SSD/Windows 11/Iron Grey/1.65 Kg) 1 Year Brand Warranty, 83CRA01SIN ..... i am willing this laptop to last until my phd for research purposes as i am a Environmental science student ... ",
  "ryzen 7 7730u with 16gb ram and 512gb ssd is solid for research and long term use but the screen and battery are weak points so if you can get the ips version it’ll be much better for phd work",
  "It is possible to bend back and this Lenovo slim 7 laptop’s metal chasis I had dropped the laptop a few times and it still works but has suffered pretty bad physical damage and I want to know whether I can even bend it back. Thanks, I can show the inside later  if needed but I’m physically away from the computer and I wouldn’t be till a few hours later",
  "Sorry that I can't help on this matter but how exactly do you DROP A LAPTOP???",
  "Obviously you can't do it yourself \n\n1: somehow getting repaired \"usable\" enough \n\n2: replace the complete down case",
  "For the future, you can bend it back by not dropping it on the concrete from the get go.",
  "Well the first time I had the laptop in a backpack but I forgot to close it so when I dropped something and went to pick it up the computer followed and hit the concrete floor. The other like two falls came from someone in my family just tripping on the charging cable and since it’s on a chair it moved far enough to fall on the hard tile floor",
  "Thanks jackass",
  "help deciding between lenovo yoga 7 ryzen 7, lenovo yoga slim 7i and lenovo yoga slim 7i aura edition hello! ill hopefully be going to university this september and I'm looking to buy a decently well-built, durable laptop that can last me the whole 3 years of my course and maybe some time after that. \n\nmy budget is between £850 - £950. can't really go over that..\n\n2 of my friends have the lenovo yoga 7i and they're enjoying it a lot but im not 100% sold on it because I've heard mixed reviews, especially about the hinges. They've only had them for a couple months each so I don't think they can answer my questions from a long-term perspective, if you get what I mean.\n\nanyways, i would mainly like to use this work school work along with streaming movies, watching YouTube and hopefully being able to play games. the games i would like to play on this are roblox, valorant, overwatch 2 and some story games (lis, tlou2, rdr)\n\nill copy and paste the links below so the full specs can be seen:\n\nhttps://www.currys.co.uk/products/lenovo-yoga-7-14-refurbished-2-in-1-laptop-amd-ryzen-7-1-tb-ssd-blue-very-good-condition-10269152.html\n\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOTNJgM_IosqUGJRGjYPUOxOOeO0JrO77bafqzhQ8iQtmdFR4KC1lBsaAmvtEALw_wcB ",
  "definitely the yoga slim 7i aura edition from lenovos website \n\nit would have the best battery life and igpu out of all these. the core ultra 226v and the 200v series processors are REALLY good at everything. tlou2 and rdr might be fine, if i remember correctly it should be fine at 1080 low/medium. search for some gaming benchmarks on youtube for this. roblox/valorant/ow should be fine \n\nonly problem is 16gb of ram which might struggle in gaming but for everything else itll be fine. the oled screen will be really nice for watching movies",
  "ooh okay, thank you!!\n\nin the specs of the slim 7i aura, it says 16GB (memory on package) instead of (soldered)\ndoes this mean i would be able to change the memory to 32GB? i don't actually know how to do this yet, but would that be possible?\n\nalso, is it worth getting any security software (norton) or should i just leave that",
  "That's what I just got (I'm in Italy)  Nice machine but a bit disappointed with battery life (I bought this notebook almost exclusivley for its battery life but in 3 days I have done 8 htrs at the most (with most settings to minimum included 60hz)",
  "nooo dont get norton, windows defender is perfectly fine\n\nand no sadly the ram isnt upgradeable. with the new core ultra chips, the ram is soldered (memory on package is another way of saying it), so that the ram has higher speeds=better performance especially for the igpu\n\nand clicking on the build your pc option, it seems like we cant even get 32gb which sucks\n\nthe only option with 32gb ram is the core ultra 7 258v, which seems like it is an extra 110 in total. if youre willing to spend that much, its gonna be worth it (better cpu and gpu performance+more ram).",
  "ohh okay then, i won't.\n\naw, that sucks. i don't have the money to buy anything over 1k :( so ill stick with the 16gb\n\nalso, im really stuck on something. on the website there's this other lenovo yoga 7i slim 7 aura edition gen10\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb5?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOQtLrzWLnEL9t1kRgkhS7z0s-S_GgUHqP0wj2K2ZpTkXXNkhQq7-WkaAgcdEALw_wcB\n\nthere's a £20 difference but i can't see any differences between them? im comparing them on the website but i don't see anything.. maybe im blind but is there any difference or can i just take the cheaper option?\n\nand have you ever bought from the lenovo website yourself?",
  "everything seems to be the same other than the fact that the 20 cheaper has no premium warranty?\n\n[https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html](https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html) \n\nanother option is this\n\nthe ryzen 9 365 is really good, its oled, the vivobook s15 is made of metal so it feels premium, display is also 120hz instead of 60 and importantly, its 32gb of ram!",
  "ooh okay, ill check it out! pretty expensive tho😭\n\nis there a major difference in quality between the yoga slim 7 and the aura edition? i know they can both handle basic things like writing documents, but streaming and gaming wise? im feeling anxious about spending almost 1k on a laptop so should i just go for the cheaper option..? im assuming the slim is better than the regular yoga 7i so im not asking about that (could be wrong tho ofc)",
  "you mean the yoga 7 from currys? its refurbished and the cpu is a rebadged older processor. if youre gonna use the laptop for a couple years imo it is worth spending more for the aura/vivobook",
  "i meant this slim 7i\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\ndoes the fact that it's ultra 7 mean it works faster/better than ultra 5? \nwould this not be able to last for at least 3-4 years based on how ill be using it?\ni only got this money bc of a scheme in the uk called child trust funds and i got 1k and some change so i feel anxious to spend all of it on a laptop yk?",
  "Ohhhh for 700 its good. yeah the core ultra 7 155h isnt as efficient as the newer 200 series processor but performance is on par and the igpu is actually better\n\nso yeah I would say this will still be good to go for 3-4 years",
  "ooh okay so does that mean it can handle games and streaming better?\n\ni will probably get this one instead then!",
  "Lenovo IdeaPad Slim 5 13ARP10 (Ryzen 7 7735HS) ",
  "Lenovo Yoga slim 7 Any thoughts on this laptop I am considering buying core ultra 7 version.",
  "LENOVO Yoga Slim 7 14\" Laptop - Intel® Core™ Ultra 7, 1 TB SSD, Grey for Uni student? Planning on getting this £700 laptop to use for my university studies. Is this a good laptop for its purpose? ",
  "Macbook Air M4 16gb RAM 512gb SSD 1385$ CAD vs Lenovo Slim 7i Aura 14 Core Ultra 7 258V 32gb RAM 512gb SSD 1203 CAD$ Title says it. Will be using it for my computer science program at college, learn machine learning and data science and casual gaming.\n\nWhich one would be a better choice? I usually keep my laptops for 3-4 years.",
  "Hi! I'm deciding between these exact same two machines for similar purposes. Can I ask which you ended up going for and if you're happy with your choice? I'm also curious where you found those prices, both are slightly lower than what I'm seeing today, but that could just be how the sales are going.",
  "I went with the Mac and I’m extremely happy with it. I ordered both of the machines and tested them for a week. I was impressed by how much more premium the mac is compared to the lenovo.\n\nNot only the mac is super smooth and snappy with any kind of work i do, the build feels much more sturdy and premium. The lenovo felt a little bit cheaper and the hinges were not accurate (it was swayed more to the left and not in the center).\n\nAlso everytime i used both the laptops, the mac felt significantly faster when not plugged in while the lenovo dropped in performance.\n\nThe only thing that was better with the lenovo was the oled display. Even the 32gb ram wasn’t as appealing cause when using the mac i realized it manages its memory way better than windows and end of the day it doesnt matter.",
  "Thanks for the quick reply. I'm glad you don't feel hampered by the 16gb ram in the Macbook Air, that's what I was most worried about. Was the screen difference that noticeable? I have an OLED display on my current laptop and I'm worried it will be difficult to go back to non-OLED.\n\nOrdering both machines is a good idea, maybe I'll try that.",
  "The difference is not that extreme and trust me the mac already has a great display, its just that the blacks do not appear as black as it does in a dark room compared to an oled screen. Other than that color accuracy and all that is negligible and you wouldnt notice a difference on daily usage.",
  "IPS vs OLED ? - Lenovo slim 7i 15\" core Ultra 7 258V Aura Looking at this laptop:\n\nhttps://www.lenovo.com/au/en/configurator/cto/index.html?bundleId=83HMCTO1WWAU1\n\nCurrently priced at $1999 AUD, I’m debating whether to upgrade to an OLED display for just 30$ or stick with IPS.\n\nI’ve heard that OLED screens can suffer from burn-in, where static images leave a ghost imprint over time (not sure what it's called exactly). As a uni student, I use apps like Excel, Tableau, Notion, and my browser—mostly in dark mode whenever possible—but lectures and my uni’s website are super bright and white \n\nI’m a bit concerned about OLED’s lifespan. Is burn-in really a big issue for my use case? I also heard that this laptop is quite reflective and I wonder if OLED would better against that. \n\nWould an OLED upgrade be worth it, or should I just stick with IPS?\n\nAppreciate any advice!",
  "OLED DOES NOT have touchscreen.\n\nI would get oled tho",
  "oled burn in is way overhyped, it doesnt really exist you can check some youtube experiments. i would  def get oled for $30, its actually worth like $200",
  "People are crazy. OLED burn doesn't happen in 5 minutes. It happens when you have static image for several hours.",
  "OLED is objectively wrong for your use case, unless you're OK risking having to replace your screen after a few years.\n\nThere will always be people saying they didn't experience problems in X amount of time. That's just anectodal, doesn't help you.\n\nAlso you will have shorter battery life, if it has any importance to you.",
  "Why so?",
  "Thanks for sharing :)",
  "but the taskbar is there for hours, word doc navigation pane and browser tabs are as well",
  "Thanks for sharing!",
  "I was mostly worried about the reflectiveness of this laptop screen that's why I considered an OLED to make it better. \n\nI tested the IPS in store and I would not choose to have it any less than 100% screen brightness at anytime due to the reflection. \n\nI would consider other models but I struggled to find one with the size/CPU and performance at that price point.",
  "Are you fine with no touchscreen",
  "The laptop should have built-in software that has pixel shift technology as well as screensavers if the images are on for too long.",
  "Hide your taskbar and everything if you want to use OLED long term, even then color degradation and overall brightness reduction over time is inevitable due to organic materials nature.",
  "Don't care. A cool feature that I won't use haha",
  "Probably a fun thing for the first week or so but I'll probably forget about it. Because you can't bend it outwards like a tablet, it's inconvenient hanging my arm over the keyboard, so naaah",
  "OLED looks so much better, and is more durable most of the time (I tested myself). Burn in isn’t an issue unless you read 12 hours a day non stop.",
  "Then buy oled",
  "Nah not that much haha, but the student nature means I do read and watch a lot, word excel white stuff yeah",
  "What about that screen issue I mentioned? Is it not a concern?",
  "Trust me its fine",
  "It will be fine, do you read a static image for 5 hours straight.",
  "Nope",
  "Confused between lenovo aura yoga slim 7i (ultra 5 228v processor) vs aura yoga pro 7i(ultra 7 255H processor) please suggest ",
  "even I'm looking for this, may i know which laptop you bought?",
  "Yoga pro",
  "Are you happy with the laptop? how is the battery back up, performance and build quality?",
  "Yes , its good , battery backup is not that great 5-6 hours you can expect on moderate usage other than the battery backup,  everything is solid",
  "I am looking to sell my laptop (Lenovo Ideapad slim 5, Ryzen 7) DELHI NCR",
  "Lenovo Legion Slim 7 resale value? Hello. How much should I reasonably expect to get for this laptop through private selling on FB or what have you. Thank you. \n",
  "800-900"
]