[
  "Am I about to make a mistake? Lenovo Yoga Pro 7i \nhttps://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nWHY AM I LOOKING AT IT?\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. Presumably that'll eek more time out. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\nWHAT AM I WORRIED ABOUT?\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? \n\n\nSecond thing is overheat potential. Without reviews on this specific configuration, seems a risk the ultra 9 285H might get SPICY. I presume I can maybe manage this by reducing power in the settings...",
  "Idk about this model specifically as I'm researching a 2in1 to purchase, why are all the Lenovo 2 in 1's so much more expensive than their pro counterparts?? My local retailers won't even stock them as their price is just absurd.\n\nAlso, because these brands make multiple laptops of the same format with different specs, usually have to look at them as a whole, then the changed specs individually. Look for reviews on the yoga/yoga pro (compared to other brands, some great reviews and minimal complaints), then make sure the cpu is good.",
  "Hmmm. Interesting. What region are you in? I'm in Victoria Australia and here it seems like the 2 in 1s are pretty affordable, they just use the less heavy duty specs (Vs instead of Hs). \n\n\nBut yeh that's kind of what I've had to make do with RE reviews. Kind of gettins the vibe of similar names and judhing it off that. My exact thoughts on it. The complexity of the seemingly similar but not quite same laptop models with different nearly the same name and completely different specs has made the review space completely fucked to navigate hahaha.",
  "Im in QLD, I should have clarified for the same specs, the 2in1's are more expensive. Currently I'm trying to find specs for a version JB hifi sell but Lenovo have removed completely from their website. Of course they do that and JB don't specify.",
  "To be fair JBs laptop prices are uniformly atrocious hahaha. They charge amounts for specs that are several tiers below what that price point should provide. I think their target market is mostly people who know nothing about computers haha",
  "That's true, but jb for at least one of the models is the exact same price as Lenovo website, without the 3-5 week wait.",
  "Yeh they sometimes might be ok generally, but i notice A lot of the lenovo website prices themselves are inflated. \nLike the one I posted is apparently 40% off, as are other ones im considering which are slightly less speccy, full price of 3.2k or so. But the literal same laptop at a retailer like HN or Office Works is like 2.3k full price. \nSo lenovo website on sale is a genuine sale price but not on sale they're wildly expensive.",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "ASUS Zenbook S14 vs. Lenovo Yoga Slim 7i Aura 15 vs. LG gram Pro 16/17 - which would you choose? I have been looking at these three laptops and am beginning to feel as though there isn't much difference beyond the screen size and whether it's OLED or IPS. Is there anything I'm missing? Would you choose one over the other for reasons beyond screen size preference, and if so, why? Would you not recommend anything about these processors or specs for any reason? How about OLED - is it worth it at these screen sizes and is it even noticeable? TIA!\n\n[ASUS Zenbook S14 - $1,499.99](https://shop.asus.com/us/90nb14f4-m00620-asus-zenbook-s-14-ux5406.html)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.65 lb - 12.22\" x 8.45\" x 0.47\"\n* 2880 x 1800 resolution (OLED)\n* 100% DCI-P3 coverage, Pantone-validated\n* 1,000,000:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 72Whr battery, 21 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[Lenovo Yoga Slim 7i Aura 15 - $1,422.99](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/83hmcto1wwus1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 3.2 lb - 13.53\" x 9.27\" x 0.55\"\n* 2880 x 1800 resolution (IPS)\n* 100% DCI-P3 coverage\n* 1,500:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 70Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[LG gram Pro 16 - $1,550.00](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)  |  [LG gram Pro 17 - $1,596.98](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.96 lb - 14.08\" x 9.9\" x 0.5\"  |  3.16 lb - 14.91\" x 10.19\" x 0.7\"\n* 2880 x 1800 resolution (OLED in 16\", IPS in 17\")\n* 100% DCI-P3 coverage\n* 1,000,000:1 contrast ratio\n* 400 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 2 USB-A ports, 1 audio jack\n* 77Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W two-piece charger",
  "## Amazon Price History:\n\n**LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - AI-enabled Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display**\n* Rating: ★★★★☆ 4.0 (6 ratings)\n\n* Current price: **$1699.99** 👍\n* Lowest price: $1299.99\n* Highest price: $1999.99\n* Average price: $1749.61\n\n| Month  | Low  | High | Chart             |\n|--------|------------|------------|------------------|\n| 02-2025 | $1628.95    | $1881.52    | ████████████▒▒  |\n| 01-2025 | $1621.11    | $1920.67    | ████████████▒▒  |\n| 12-2024 | $1299.99    | $1919.95    | █████████▒▒▒▒▒  |\n| 11-2024 | $1299.99    | $1999.99    | █████████▒▒▒▒▒▒ |\n| 10-2024 | $1658.17    | $1999.99    | ████████████▒▒▒ |\n| 09-2024 | $1699.99    | $1986.64    | ████████████▒▒  |\n| 08-2024 | $1562.65    | $1999.99    | ███████████▒▒▒▒ |\n| 07-2024 | $1562.27    | $1999.99    | ███████████▒▒▒▒ |\n| 06-2024 | $1568.64    | $1938.55    | ███████████▒▒▒  |\n| 05-2024 | $1651.81    | $1999.99    | ████████████▒▒▒ |\n| 04-2024 | $1799.99    | $1999.99    | █████████████▒▒ |\n| 03-2024 | $1939.85    | $1999.99    | ██████████████▒ |\n\nSource: [GOSH Price Tracker](https://gosh.app/?utm_source=redditbot&utm_medium=laptops&utm_campaign=2025-02-19)\n\n\n^(Bleep bleep boop. I am a bot here to serve by providing helpful price history data on products. I am not affiliated with Amazon. Upvote if this was helpful. PM to report issues or to opt-out.)",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display \n\n>**Company**: LG\n\n>**Amazon Product Rating**: 4.0 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 4.0\n\n>**Analysis Performed at**: 02-19-2025 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lg-gram-pro-16-inch-thin-and-lightweight-laptop-intel-evo-edition-intel-core-ultra-7-32gb-ram-1tb-ssd-with-oled-display) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "Advise: Yoga Slim 7 Pro X or Vivobook 14X OLED K3405VC Hi, I am looking for a 14\" laptop for uni. Other than browsing, watching youtube, and note taking, I think about gaming (a bit) and video editing (since my major is marketing). Here are a few things I would like to have:  \n\\- Portability (1.7kg or less)  \n\\- Battery life (5-6 hours on average)  \n\\- Heating issues (able to work with a laptop on couch or lap)\n\nI feel like these two below are the most **affordable** ones with **a decent discrete GPU**. So which one do y'all think is a better option, it would be helpful with an explanation too :')  \nI also wonder how the **Ryzen 7 6800HS** compares to the **i5-13500H**?\n\n[Lenovo Yoga Slim 7 Pro X ](https://www.lenovo.com/us/en/p/laptops/lenovo/lenovo_slim_series/lenovo-slim-7-pro-x-14-inch-amd/len101l0011?srsltid=AfmBOorlYAuBM1c5taFwsZ8TM7z_KYWPqw9GFvGYl2KjudQH-qjfZdlq)  \n\\- 14.5\" IPS 3K (3072x1920) Touchscreen  \n\\- AMD Ryzen 7 6800HS Creator Edition Processor 3.20 GHz (up to 4.70 GHz Max Boost, 8 Cores, 16 Threads, 16 MB Cache)  \n\\- NVIDIA GeForce RTX 3050 4GB GDDR6  \n\\- 16GB Soldered LPDDR5-6400  \n\\- 512GB SSD M.2 2280 PCIe® 4.0×4 NVMe  \n\\- Fingerprint ❌  \n\\- 1.45 kg  \n\\- 70 Wh Batter\n\n[ASUS Vivobook 14X OLED K3405VC](https://vn.store.asus.com/laptop-asus-vivobook-14x-oled-k3405vc-km006w-k3405-13th-gen-intel-core-i5.html)  \n\\- 14\" OLED 2.8K (2880 x 1800)  \n\\- Intel Core i5-13500H Processor 2.6 GHz (18MB Cache, up to 4.7 GHz, 12 cores, 16 Threads)  \n\\- NVIDIA GeForce RTX 3050 4GB GDDR6  \n\\- 16GB: 8GB DDR4 on board + 8GB DDR4 SO-DIMM  \n\\- 512GB M.2 NVMe™ PCIe® 3.0 SSD  \n\\- Fingerprint ✅  \n\\- 1.40 kg  \n\\- 63Wh Battery\n\nThanks a lot!",
  "[removed]",
  "Thank you for your detailed list and preferences it makes it really easy to compare! Notebookcheck made a comparison of both laptops, and I think they will be really helpful for you. [Asus review.](https://www.notebookcheck.net/Asus-VivoBook-14X-OLED-K3405-Laptop-Review-No-frills-multimedia-laptop-with-Core-i5-13500H-and-vibrant-2-8K-OLED-display.726592.0.html) [Lenovo review.](https://www.notebookcheck.net/Lenovo-Slim-7-Pro-X-laptop-review-The-Asus-VivoBook-14-alternative.697031.0.html#nbc_nbcompare_div) \n\nThe Asus' advantages are much better battery life (8 hours vs 5 on Lenovo) and an HDMI port. The Lenovo has a better screen, thermals, fan noise, and build quality. In terms of performance, the Asus has noticeably higher CPU performance than the Ryzen 9 according to the review. Since you are considering the Ryzen 7, this will be an even larger gap. However, Lenovo has noticeably better GPU performance.\n\nI would personally choose the Asus between the two, since battery life and CPU performance is really important, and the GPU is only 10% behind. But the biggest factor would have to be QuickSync, which is some magic Intel hardware acceleration that [beats the Desktop RTX 3090 in some cases of video editing.](https://www.youtube.com/watch?v=4ovRtmTxjuE) And since you will do video editing, getting Intel will be much better. \n\nSince you say you work on your lap, these laptops get really hot on the bottom (50 for Lenovo and 54 for Asus). This is the case for most laptops with a dGPU. I really don't know the situation in your laptop market, but why don't you consider getting a Lunar Lake laptop? You will get respectable iGPU performance since the 3050 is not that strong anyway. You will also get much better CPU performance, portability, thermals, battery life, and build quality.",
  "Hi, can u share why tho?",
  "Lunar Lake one? I mean the price..."
]