[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Lenovo Thinkbook 16p Gen 6 (2025) Hello everyone, for those who have the Thinkbook 16p Gen 6 (2025), can you give us a brief review on perfomance, display, keyboard, constructive quality and of course.. some photos?\nThank you",
  "Hey recently I bought it from china will use it and let yall know \n\nSpecs \nUltra 9 275HX\n32Gigs of ram\nrtx 5070\n1 tb ssd",
  "I am also interested to know more about this product.",
  "Greattttt",
  "Hey so here are my thoughts on my laptop.\n\nI also do not know anything about its gaming capabilities as i have only played Forza horizon 4 on it and its an absolute breeze but I believe the 5070 will hold up\n\nSo my main use case is on Ansys mechanical and Optislang so I don’t find delays of any sort and also when using the GPU acceleration my simulations run pretty quickly as compared to my previous laptop which had a i5-1240p with no graphics card and the difference is astronomical especially all CAD tasks are smooth as butter with that said I do feel that the battery like could be improved as on a single charge it only lasts about 4.5 hours  and prolly 6 hours of light usage and also the magic bay i have not used it but i feel it is not really required.\n\nThe build quality is top notch\nThe keyboard is also good but not thinkpad p1 level \nAnd display is actually pretty good\n\nAlso there is little to no thermal throttling so far and the fans don’t even spin at light use cases\n\nAnyways my verdict is that it’s a really good laptop go for it if your budget allows you to. It costed almost  $1900",
  "Thanks for sharing! Can you add a photo or better a video of it just to see IRL how does it appear?",
  "Sub recommendation for full post :) r/LenovoThinkBook",
  "New Lenovo Chromebook Plus 14 Review: The laptop for most people This is my review of the new Lenovo Chromebook Plus 14, which has been hyped up as the “supreme being” of Chromebooks thanks to the new MediaTek Kompanio Ultra chip. I’m just a regular tech nerd who loves Chromebooks but can still look at things objectively, especially when something costs close to $800. This is an honest review, no marketing fluff of just reading the specs. I do reviews as a hobby because I genuinely love tech and enjoy spreading the gospel.\n\nWhile I was overall impressed, I think this machine is overhyped, mainly because of the chip. It’s not quite ready for the big leagues in some areas. I’m coming from using devices like my Galaxy Tab S9+ with the Snapdragon 8 Gen 2, which **EATS UP** anything I throw at it (AI, photo/video editing, multi tasking, video calls). That’s my dream: give me that level of power from a Galaxy Tab S series in a Chromebook with a great keyboard with zero compromises.\n\nSo here’s my category breakdown after using the Lenovo Chromebook Plus 14 for a week, alongside my trusty daily driver, the [HP Chromebook x360 14c](https://www.aboutchromebooks.com/hp-chromebook-x360-14c-first-impressions-great-build-quality-in-a-smallish-high-performing-package/) (i3/8GB RAM), which is still a beast since 2021.\n\n**-----------------**\n\n# 🔧 Build & Design\n\nThe Lenovo is thin and light, but solid. It gives off premium MacBook vibes in build quality, especially when typing. It's so light, it almost feels like a dummy unit, but clearly isn’t. It definitely feels like the next generation of Chromebook hardware.\n\nOnly downside? The bottom is plastic, so it lacks that full premium unibody feel. But unless you’re carrying it around a lot, it’s a non-issue. People mentioned keyboard flex but I didn’t experience any in daily use. And I’m a weightlifter and former lineman with 10.5-inch bear paws. I only got flex when I intentionally tried to flex the keyboard by pressing hard.\n\nThe hinge is firm, you can’t open it with one hand, but once open, it holds its position perfectly.\n\nCompared to the HP 14c, the Lenovo is a little longer and wider but way thinner and lighter. My HP is a full aluminum tank, it’s been a champ for years. The Lenovo feels like it’ll hold up, but its lighter build will need to prove itself over time.\n\nhttps://preview.redd.it/7cx1remd5ugf1.jpg?width=3946&format=pjpg&auto=webp&s=88fc512c4967fd3d9b6ea3b537f575ffb690dff4\n\nhttps://preview.redd.it/8m1a8ard5ugf1.jpg?width=3924&format=pjpg&auto=webp&s=efab4b1846b64e7727b72556ddd716a9c3daaf11\n\nhttps://preview.redd.it/cdn5xkwd5ugf1.jpg?width=4000&format=pjpg&auto=webp&s=665327d55e809b4a4685834ce4593af80b4fe985\n\n**Build Grade: A**\n\n**-----------------------------------**\n\n# 🔋 Battery Life\n\nLet’s be real: I never got anywhere near the advertised 17 hours. But that’s OK, because I still got a solid 9–10.5 hours under heavy, real-world use:\n\n* 20–30 tabs open\n* Zoom app + Teams (web)\n* YouTube music streaming\n* Constant typing\n* Screen at \\~70%\n\nCompared to my aging HP, which lasts about 4–5 hours now, this is a major win. For comparison, the [HP Dragonfly Pro ](https://www.aboutchromebooks.com/hp-dragonfly-pro-chromebook-review-the-pixelbook-of-2023/)from 2023 with an i5 is the worst battery life I ever had on a high powered Chromebook that gave me a max of 3 hours. That thing didn’t last the weekend before it went back.\n\n**Battery Grade: A+**\n\n**-------------------------------------------**\n\n# ⌨️ Keyboard, Trackpad & Fingerprint Reader\n\nTyping on this was a breeze, even with my bear paws. No real keyboard flex during regular use. The keys feel a little shallower than on the HP 14c, but once I got into a groove, I had no complaints.\n\nTrackpad is large, smooth, and accurate, feels close to a MacBook in responsiveness. No lag, no misclicks.\n\nThe fingerprint reader? 🔥 One of the best I’ve used on a Chromebook or any computer. I tried to fake it out with weird angles and different parts of my finger, but nope, still unlocked instantly.\n\n**Grade: A**\n\n**----------------------------**\n\n# 🔊 Sound & Speakers\n\nThe Dolby-branded speakers had me hopeful, but they’re great for a Chromebook, but average overall. My HP PC from 2013 would blow these out of the water, so it's nothing special there. They do have more depth than 99% of all Chromebooks and are a little louder overall, it's still Chromebook speakers, so they are decent in a small room.\n\nThe HP DragonFly Pro was also hyped up to have amazing speakers, but again, good for a chrombook, but in real-world usage, they are just ok.\n\n**Grade: C overall | B+ for a Chromebook**\n\n**--------------------------------------------------**\n\n# ⚡ Chip & Performance: Kompanio Ultra 910\n\nHere’s where the hype train slows down.\n\nIn benchmarks (Jetstream, Speedometer), this chip was twice as fast as my HP’s i3. In real-world use? Not really. It’s only slightly faster, like a 0.5-1 second lead in page loads, even for heavy sites like ESPN and data heavy Google Sheets.\n\nYes, it wins technically.... but it was often a photo finish.\n\nhttps://preview.redd.it/erj1q9w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=e9612c64acde7e2224c924ad258d9bfc6a111dcc\n\nhttps://preview.redd.it/u0brf8w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=0cad7a55498ced4378d570f2a42a10285385f394\n\nI **ran into consistent problems** using Teams in the browser. Video calls would freeze, the screen would stutter, and it even blinked to black unless I turned off the camera. Reddit confirms I’m not alone on this. Zoom (via app) worked fine, but Teams was rough. No such issues on my HP.\n\nBut, the Mediatek chip does allow you to download ALL of THE APPS in the Play Store, which opens up the full world of Android on your Chromebook. The i3 in my HP doesnt allow that, and each day more and more apps that I could download are no longer supported, so that gives it the edge to usher in the full Android Laptop experience, as some of the apps would be better on a full-screen computer with a keyboard compared to the phone.\n\nI tried video editing on the Lenovo using my favorite video editing app on Android called [InShot](https://inshot.com/), and it temporarily presented a dream come true, to have InShot on a laptop, not a tablet with an added on keyboard, where I could edit videos comfortably on my lap. But then I tried to edit together 4 different 15-second 4k files, and that's when it went to crap fast. As soon as I added in a transition, it became super laggy and jittery, and adding in more transitions and text almost made the computer quit. So video editing on the Lenovo is not ideal.\n\n**Video editing on this is about as good as a groundhog trying to make a beaver dam; it looks like it should work, and has the same shape and characteristics, but no, it won't do at all.**\n\nAI features like background blur or object removal? Not there yet. Definitely nowhere near Galaxy S phones or tablets.\n\nMy last point about the chip is, why not use past (1-2 year old) true flagship chips that can do it all, like the Qualcomm Snapdragon 8 Gen 2 (from the Galaxy Tab S9 series)? If they are going to charge such a premium price and say it's because of the chip, bring in a true elite chip that can handle everything like AI, multitasking, video editing, and more, all at the same time, and then Chrome OS would be a monster.\n\n**Grade: B**\n\n**--------------------------------**\n\n# 📺 Screen & Camera\n\nhttps://preview.redd.it/8ualptw55ugf1.jpg?width=4000&format=pjpg&auto=webp&s=23693f067cae0fa1665c752c8052afbdcf8eb7f5\n\n\n\nNow this screen, WOW. It’s a 2K OLED panel that’s absolutely beautiful. I watched an [8K Planet Earth video on Youtube](https://www.youtube.com/watch?v=6JWxHy0C_pI&list=RD6JWxHy0C_pI&start_radio=1) and it felt like I could reach into the screen and touch it. The best screen I’ve ever seen on a Chromebook. Also, they list the Lenovo at 400 nits, but it feels much brighter than 400. I kept the screen constantly at 60-70% and that was perfect for me in all of my use cases.\n\nBUT… a few things:\n\n* Some images/web pages looked oversaturated\n* No screen tuning or adjustment in ChromeOS\n\nThe camera is also surprisingly good. Not Galaxy Ultra good, but very usable for video calls even in tricky lighting.\n\n**Grade: A**\n\n**------------------------------------**\n\n# Final Thoughts\n\nThis is a great machine and a peek into the future of Chromebooks, especially with ARM chips. The design is sleek (though I wish they offered a deep gray or navy blue), the screen is stellar, battery is excellent, and it handles most tasks with ease.\n\nFor most users who use nothing but web apps (Google Docs, Office, email, YouTube) this is more than enough. People spending $2,000 for email machines should seriously consider this and Chrome OS as an alternative.\n\nBUT… looking at the complete picture of the Lenovo Chromebook Plus 14, this would be the no-brainer recommendation of the year (for any laptop, especially a Chromebook) at $500, as $750 feels like a reach when you can get a MacBook Air for $850. If Best Buy does their normal act of putting this on deep discount after a couple of months, and this goes down to $450-550 for a new one, **run**, don't walk to get one if you need a new laptop. At that price, this is the no-brainer Chromebook of the decade.\n\n**Overall Grade: B+**\n\nMe and my bear paws are off to test the next device.",
  "This is cool, but for $800, it better deliver without hiccups. Why risk it when you can grab a MacBook Air for a bit more?",
  "I have found my LCP14 to be fast, but I think the glowing performance reviews may be a bit overstated. I get some freezing/non-loading tabs with maybe 7-10 open (some of them being Google Docs or Gmail), which was unexpected. I also noticed it can't handle 16k (4320p) videos with 60fps on YouTube—not that this is a dealbreaker by any means, but I was still surprised. I typically use that as a test for a machine's horsepower.\n\nI assume all this has to do with the ARM processor and the extended battery life, which may come at a cost. The above tasks would never challenge my HP Elite Dragonfly Chromebook, but that machine had historically bad battery life. Overall, I'm happy with the LCP14 so far, but I thought I'd add this context.",
  "This is the review I've been looking for and have been going back and forth with a MacBook Air for the exact reason on price. I don't want to switch my ecosystem so I'll wait for a sale. Thanks for your hard work!",
  "Great review, thanks a lot. Very well written and exactly what I was looking for.\n\nEdit: I have one more question. How well or poorly does the touch display respond? And were you able to test Android games on it? Did they run better or worse than on Intel devices?\n\nTwo questions. Those were two questions. Sorry.",
  "Thanks for the insightful review! One question though, as I couldn't find this information anywhere. How far does the screen open? Maybe show pictures of maximum opening angle or a value in degrees would be fantastic :)",
  "[deleted]",
  "Well for those of us who love Chrome OS, its an alternative to Windows that faster and lighter, but as you mentioned for this price, it needs to be flawless, or we can grab a MacBook \n\nLike I said, for around $500 this is great, at its current price and chip flaws I see why people are taking it back (I have seen this a lot on here)",
  "See, you are a person who has actually used the machine and not just had one tab open and is hyping the machine up.   The Lenovo is fast, but the jitters and lag it has when doing real-world stuff are unacceptable for me at that price.  As I said, comparing it to my HP Chrombook with an i3 from 2021, they are neck and neck in real-world speed tests, but the i3 never stutters with 20 tabs open, playing 4k videos, and video calling at the same time. \n\nYes, the battery life is not great on my older HP, but I never experienced any hiccups like I did on the Lenovo, just doing what we have come to consider basic things, like video calling, when the Lenovo about aborted on me. \n\nI think the Mediatek chip is ok, but it's not as powerful as they make it seem.  As I said in my review, they need to take older top of the line chips like thise from a Galaxy s tab and put it into the Chromebook so that it cna do EVERYTHING with ease, and then it will be perfect.",
  "So which one are you going to get, the MacBook or the Lenovo?",
  "Thanks, I appreciate you!!\nThe touch screen is amazing, no issues the at all and it was good to use at times for certain things but it does leave a lot of smudges on the screen. \n\nGaming I don't do, but there's a video by Lon Sibon on YouTube that he talks about gaming.  Again I'm not sure how it will hold up because the chip is not as strong as they make it seem, you can download all the apps yes, but raw power is questionable in real world use cases as I mentioned.",
  "It goes all the way flat, or 180 degrees and the hinge is very firm  \nThis is not a convertible.  But, Acer is launching a 514 chrombook plus with this chip in it next month that will be a convertible and I think they will have he chip tuned better than I experinced on this Lenovo",
  "I agree with you, and the fact that the chip was struggling with certain task makes it even worse \n\n$450-500 it's a steal, but anything above $550 is a no",
  "I'm leaning Lenovo because of the ecosystem, but the m3 or m4 MacBook Air is on sale for ~$800 and seems like it would have better longevity than what the Lenovo may have (both based on past experience). I have a Lenovo duet 5 now which I love but the snapdragon is feeling a little long in the tooth when I have more than a few tabs open.\n\nI guess my heart says Lenovo but brain said MacBook Air.",
  "Thanks a lot for the feedback! 180 degrees would be perfect for me. I got a Acer Spin 513 (the one with the previous top ARM model) which is a convertible, but it turned out I hardly use it as a tablet. 95% only as a laptop. Having good speakers is a great bonus for the Lenovo for me, as well as a bright screen. Don't need maximum power as for heavy workload I want to rely on remote desktops.",
  "Check your local best buys, in my area (SE Michigan) the Lenovo is on BB as a used excellent for $530 which is the right price point. So see if you can find one in your area for that price",
  "Unfortunately not near me but I'll keep an eye out.\n\nWhat do you think the chances of the kompanio lasting close to apple silicon?",
  "Not sure, thats a ChatGPT quesiton lol \n\nHappy hunting, hopefully you can find one soon.   I hear that they are high-end Chromebooks with Spandragon x Elite processors coming; I'm hoping they are here just before the holiday season.",
  "Ended up with the m4 MacBook air. It went on sale on Amazon for 750(!) and I can't find the Lenovo near me. Also mixed in the surface laptop for fun but the air just seems too good. Thanks again for your help!",
  "Best laptop stand for a 16\" Lenovo ThinkBook (2kg) without external keyboard? Hi all,\nI’m using a Lenovo ThinkBook 16\" that weighs around 2kg. I want a laptop stand that’s stable, ergonomic, and comfortable to type on since I won’t be using an external keyboard. If anyone has good suggestions for stands that work well for this kind of setup, please share.",
  "I like the metal feet from the first pic. I have them on 2 laptops and they are pretty convenient. ",
  "https://a.co/d/9Q3k86x\n\nMOFT one is good",
  "A better financial decision would be to buy a laptop cool.\nU can get a cheap one for around 400 to 500 rs.\n\nAnd your laptop can be placed at an angle and it can be used on ur bed/laptop without blocking the intake/outake system.",
  "Thanks man 🙏 ❤",
  "Hey i use my laptop mostly on bed idk which stand should I buy , laptop is 15'6 inch 2.1kg any recommendations",
  "3rd one seems nice, it has a good number of positive reviews.",
  "Planning to buy above Lenovo ThinkBook 16 laptop. Any suggestions? ",
  "HP OMEN 16 VS LENOVO THINKBOOK 16PG5 Which is better?\n\nHello, everyone. I am just gonna dive right in,\ncurrently I don't have a notebook. I have been looking for one for 2-3 months and came down to 2 choices.\n\n1) HP OMEN 16 (2025- I think)\n1920x1200 165hz\nRtx 5060 8gb gddr7\n32gb(2x16gb) ddr5\n83wh battery and 230w charger\nIntel Ultra 9 285H\n2.9ghz base to 5.4 turbo ghz\n16 (6P+10E) cores and 16 threads\nArc Graphics 140T igpu\n1TB & 16 inches\n\n2)LENOVO THINKBOOK 16PG5 \n3200x2000 165hz\nRtx 4060 8gb gddr6\n32gb(2x16gb) ddr5\n80wh battery and 300w charger\nIntel i9-14900HX\n2.2ghz base to 5.8 turbo ghz\n24 (8P+16E) cores and 32 threads\nIntel UHD Graphics 32EU\n1TB & 16 inches\n\nI will mostly play Cyberpunk 2077, Hollow Knight, Silksong, Dispatch and modded Total War Warhammer 3. Maybe Hogwarts Legacy.  I will primarily use this to study and programming in R, Python and Matlab especially during my Financial Mathematics masters and risk management while working for some projects.\n\nI have been reading reviews, user problems and just using every website to AI to choose.\nI used notebook check and nanoreview. Don't know if there is any other good one. I'd appreciate your help. \n\n",
  "Lenovo ThinkBook 14 Gen 6: First impressions I purchased the Lenovo ThinkBook 14 G6, model 21NQCTO1WWBR1 on July 2025 and would like to make my impressions about this product:\n\nDESIGN AND BUILD: We don't have much to comment on the design, as it's quite minimalist. We're surprised that not all the keyboard keys follow Lenovo's signature layout, as is typical on IdeaPads, but at least the Ctrl and Fn keys are in their traditional positions, unlike ThinkPads. The light color isn't bad, but it's a shame there wasn't a darker color option (not black, which is typically only seen on ThinkPads, but a darker gray would have been nice). The touchpad is a good size. We found the number of ports interesting, but the Ethernet port's position wasn't particularly helpful, being on the right side. It's interesting that it also has an SD card reader. The number of LEDs also caught our attention, with one next to each USB-C port, in addition to the power button itself (which we really like being separate from the keyboard). We liked the backlit keyboard and the dedicated \"?\", \"/\", \"°\", and \"Menu\" keys, although they sacrificed one of the Ctrl keys. At least it didn't come with the \"Copilot\" shortcut. We didn't really like the notch in the webcam area and found it a rather questionable design decision, but we understand its usefulness. We also liked that it came without those infamous labels on the palm rest, just the Intel seal.\n\nSCREEN: We liked the quality of the IPS, but we were disappointed that the screen had excessive IPS Glow at the bottom edge, quite visible with the screen on a black background even in bright light. My brother was okay with it, but I didn't like this defect at all, which I'm already accepting is quite common in current LCD screens, as I've also seen notebooks and even smartphones and tablets from other brands with this issue. It shouldn't happen, but we've come to understand that IPS Glow is now part of the experience of having an IPS LCD screen, which is unfortunate. At least we like the thin bezels.\n\nSOUND AND WEBCAM: Neither impressed in any aspect, but neither disappointed.\n\nBATTERY AND CHARGING: The USB-C charger is interesting. My brother tested it by playing YouTube videos in 1080p with maximum brightness, and it lasted over 5 hours unplugged. For a 60Wh battery, it's an okay battery, but it could be better.\n\nPERFORMANCE AND USABILITY: Regarding performance, considering its specifications, I consider it okay. It worked very well even for running virtual machines via VirtualBox. We didn't notice excessive heat on the keyboard when heavily loaded. My brother installed the Big Linux distro, and in testing, it has worked well, including mirroring the laptop screen to our Smart TV wirelessly. My brother was unable to get BlissOS, based on Android 13, to work, as it didn't recognize Wi-Fi, but emulating Android on Big Linux with WayDroid has worked well most of the time.\n\n**Have you also purchased a Lenovo ThinkBook? Share your experiences with it in the comments below.**",
  "Looks cool",
  "I got the same laptop, with 8gb of RAM, and im quite satisfied with it. I use it mainly for college stuff, and it can handle an entire day of coding, browsing the internet and even playing some light games (such as Horizon Chase). \n\nBattery life on it is quite impressive on linux. I get 6-8h of usage with it. That's more than i get with Windows (i have no idea why i just get 3-5 hours on Windows), but i've seen some minor compatibility issues on linux, such as the mute key not lighting up or the volume keys getting \"sticky\" (if i hold it a little bit, it goes to max volume or 0), but overall, the laptop is very usable.\n\nI plan to upgrade to 16gb soon, because on my use case, 8gb is too low, especially when i get 16 tabs open for research + some niche software from 10 years and VScode.\n\nOBS: Você é o CAVBR do fórum Adrenaline, não é?",
  "What cpu is in there? Seems like an older one",
  "So, how are you liking it after 2 months?\nI'm between this one, Yoga 7i and Vivobook s 14, but there are not many reviews on this thinkbook.",
  "Isso mesmo.",
  "Intel Core i5-13420H.\n\nIn other countries, Lenovo has already launched ThinkBook Gen 8, but in Brazil (where I live), curiously, it recently launched Gen 6.\n\nIn fact, while in most countries, they're already launching models with the new Intel Core Series 1 and 2, in Brazil, the number of laptops with Intel Core 13th Gen has now increased.",
  "O meu irmão está usando, e não está reclamando. Só por ter como atualizar os dois pentes de RAM, ficaria com o ThinkBook.",
  "Valeu!",
  "Can a User of Lenovo ThinkBook 16 G6 please give a honest review of this laptop? And if the price of good? 📌 \\*\\*Lenovo ThinkBook 16 G6 (AMD) \\~\\*\\*438.06 **U**SD  \n💻 *Model: 21KK008F*AK\n\n* **CPU:** AMD Ryzen 5 7430U (6C/12T, up to 4.3GHz)\n* **GPU:** Integrated AMD Radeon™ Graphics\n* **Display:** 16\" WUXGA (1920x1200), IPS, 300 nits, anti-glare\n* **RAM:** 16GB DDR4 (Upgradeable)\n* **Storage:** 512GB PCIe 4.0 NVMe SSD (Upgradeable)\n* **Ports:** 2x USB-A, 2x USB-C (incl. USB4), HDMI 2.1, Ethernet, SD reader, audio jack\n* **Battery:** 45Wh, USB-C 65W charger\n* **Other:** Backlit keyboard, fingerprint reader, Wi-Fi 6E, 1.7kg",
  "im using 7530u variant for last 1 year, u can go for it. put a cloth when closing the lid, otherwise keys will have contact with the display.",
  "Ryzen 5 7430U should be around or less than 400 USD",
  "Cannot say something to this configuration but we had around 15 intel and amd based g6's in my company. Great devices except for one thing, around half of the devices had problems with the integrated webcam. Some of them in the first months, some of them after several months. The case was that that the system was loosing the physical connection to the webcam module again and again. ",
  "What about Ryzen 3 7335u version ? Thinkbook 16 g7 , I will be using it for coding and study related (cs student)\nOr should I opt with Ryzen 5 version?\nBudget is tight so can only go with Ryzen 3\nCan you suggest me if Ryzen 3 would work or else I should go with Ryzen 5 ?",
  "This is cheapest one I could find in the entire country.",
  "    As far as I remember, Asus Vivobook Go OLED with this processor was available for around INR 35,000 (USD 408) last year.",
  "I have used Thinkpads and Dell Latitudes, and Asus build quality feels awful.",
  "Lenovo Thinkbook 14 Is it worth it for (1) Adobe Apps, (2) Video Editing, (3) Light gaming like roblox? ",
  "Help choose between Hp Victus, Lenovo ThinkBook 16, and ThinkPad E16 G2 Hello Redditors!\n\nI'm looking for advice choosing between 3 laptops for mostly in-home use.\n\nKey uses: regular dev work (anaconda, code), multitasking, image editing (Darktable + GIMP) but not business grade, and occasional light gaming. Priorities are build quality, thermals, Linux compatibility, and overall longevity.\n\nAll three have DDR5 16GB RAM, here are the CPU details:\n\nHP Victus 15 – Ryzen 5 8645HS | Windows 11 Home\n\nLenovo ThinkBook 16 G7 – Ryzen 5 7533HS | No OS (I’ll install Linux), have an option of 100% SRGB screen here.\n\nLenovo ThinkPad E16 G2 – Ryzen 5 7535HS | No OS (Linux install planned)\n\nVictus leans more toward gaming/consumer, while the ThinkBook and ThinkPad are business-focused. I’m comfortable setting up Linux myself and don’t need Windows. Which one would you recommend for my use case?\n\nDo ThinkBooks last? Do they cause issues like MoBo and other h/w level issues?\n\nNote: I don't want to go for U series processors. Have used them in budget laptops and experience for my use case hasn't been smooth.",
  "How is Lenovo thinkbook as compared to Lenovo slim? Hey all,\nI am considering of buying Lenovo thinkbook with Intel i5 (13gen P processors).\n\nBut I see Lenovo slim 3i in similar price range, and available on Amazon, whereas lenovo ThinkPad after having better specs as well, isn't much popular over flipkart / amazon.\n\nAm I missing something??",
  "ThinkBook is the more sturdy built and reliable business series. IdeaPad Slim is the more sleek and modern looking, but also more frail consumer design. The \"general\" modern consumer prefers a slim and sleek look over performance and durability these days. That's why ThinkBooks are less popular.",
  "Ok, but when I read about thinkbook, posts in reddit mention it's not that sturdy, as compared with ThinkPad.\n\nAny thinkbook reviews here?",
  "That's because there's a large, devout and old ThinkPad following. And the laptops used to be really solid. But if you check out the r/thinkpad sub, you'll find that the recent years ThinkPads, especially the slimmer designs, have as many complaints as their consumer Yoga or IdeaPad line.\n\nHaving said that the ThinkBook line has also gone through a big transition. Everything approximately before Intel 12th gen was a lot more experimental. The last two years, however, have significantly improved on design and usability. So, the current ThinkBook line (from Intel Ultra and AMD Zen 4+) exemplifies again what a good workstation level laptop should be like. Check out reviews yourself on YouTube.",
  "Thinkpad is a different class, it is sturdier, yes, but it is more expensive, obviously.\n\nHowever! Keep in mind that if you don't expose your laptop to frequent shocks and bumps and drops.. a regular Thinkbook will be just fine, it is not a fragile laptop by any means, it's just that Thinkpads are more massive and heavy.. at least the ones I owned until several years ago..\n\nMy advice - don't go for the most expensive with durability in mind! Laptops can fail you regardless of their price! Go for the cheapest that fulfills your configuration requirements. If it breaks, it breaks.. but chances are it will last just as long as a much more expensive one. As I said, I owned multiple Thinkpads.. yes, they feel (and Are) sturdy.. but the hardware (e.g. motherboard) can give up the ghost just as easily as a cheap one....\n\nI've recently bought the Lenovo V15 G4 IRU... 400 euros... i5-13420H... not the prettiest of the bunch, but .. it just works, the CPU is fantastic, IPS display... And it works well.. stays cooler than most of their 2-in-1 or slim laptops because of poor cooling in such small form factors. And if it fails down the road a few years from now... I won't regret the investment... but as I said... laptops are pretty much the same on the inside.. don't pay insane prices just because the outside is metal or other \"mil spec\" features... it's just a case, a housing... the inside is more or less the same.",
  "Thank you very much for the detailed review, I checked the reviews on YouTube, it was slightly confusing, thanks for clarifying.",
  "Good to know someone bought in my range as well.\nWill surely keep your points in my mind.",
  "Pre-owned Lenovo ThinkBook 14 G2 Hi, posting from India. Is the above mentioned ThinkBook with i7 11th gen, 16gb ram, 512gb nvme and built in iris Graphics, a good deal at 29k INR or ~343 usd? ",
  "Do you know which panel it has?  The FHD TN, FHD IPS 250-nit, FHD IPS 300-nit, or FHD IPS 300-nit 100% sRGB?",
  "The seller is claiming 1080p FHD IPS with 100% srgb. I will have the option to test the device physically  before paying the money.",
  "Didn't mention the brightness though.",
  "If he's correct, then it's worth that price.  The only panel available with 100% sRGB was a 300-nit one.  Not like a GREAT deal IMO, but it's at least worth it.  The 100% sRGB isn't a bad display, rated at 1200:1 contrast, so 300-nit 1200:1 w/ 100% sRGB is a nice looking screen.",
  "Is there any way to check if it's really the 100% srgb they're claiming or not in the laptop itself?",
  "Not REALLY, at least not easily.  You could check what the LCD used is (sorry, don't know how to find this in Windows offhand) and then look it up on [panelook.com](http://panelook.com) to find out it's stats.  But that's not a simple 1 click thing.",
  "Will there be any particular model number on the laptop itself by which I can check?",
  "Probably not, no.",
  "I don't mean the make and model of the lcd panel itself, but there should be some unique model number for the laptop right? By which I can search the internet.\nEdit: or the model number for all the lcd panels are the same? Then that will be a difficult issue.",
  "Well, the problem with using the model number is that only common prebuilt full model numbers will be in the Lenovo psref.  CTO options will not.  So if this was originally a CTO option, the full model number will simply not exist in Lenovo's documentation.",
  "Maybe I can try hwinfo, otherwise I am basically just left to trust the person blindly! Which is not at all a very good place to be in!",
  "Got the Lenovo Thinkbook 16P G2 for $1300! Loving this beast so far (Ryzen 5 5600H, 16gb Ram, RTX 3060) ",
  "I honestly get jealous of people who can earn and spend in dollars. At 1300 this is such as a steal. My Flex 5 cost me a month's salary.  Beautiful machine.",
  "Nice deal bro. Lenovo does make some tough machines",
  "How's the Ryzen 5 under heavier game loads? I know people prefer the Ryzen 7 or 9 but the 5 seems to be getting popular again",
  "2560 x 1600 is a odd resolution unless i looked up the wrong ver or model",
  "What's the difference between RTX 3060 mobile and RTX 3060 studio?",
  "How can I get such a good deal from ebay without getting scammed or something? Lol\n\nI'm always reluctant from using ebay tbh and I'm really in need of a good laptop right now without having to spend too much x)\n\nEnjoy yours and have fun with it :)",
  "Nice!  I was just checking that one out on the Lenovo website.  Sweet machine.",
  "It's so good.",
  "Did you purchase it through their website or got it from a retailer?",
  "I really like the look of this. Nice mix between a thinkpad and a legion.",
  "Hi, I wanted to buy a laptop with Ryzen 7 and RTX 3060 6GB. I wasn't so sure because it would be my first gaming laptop and I am afraid of the fps. I am looking forward to playing Rust, The Forest, GTA V, Rainbow, Six Siege, PUBG, Rocket League, and maybe Forza Horizon.\n\nOn medium-high settings. Do you think this configuration would be a good idea?",
  "If I didn't know any better I would have guessed this was a legion.  I really love lenovo's subdued aesthetic even on their gaming laptops.  I use mine for work and no one bats an eye.",
  "Nice machine can't do much wrong with Lenovo Think(xxxx) range.",
  "Yeah.  I have fallen in love with lenovo. With my legion 5 .  Best choice i made with my minimal budget.",
  "The Lenovo key caps are solid.",
  "I'm just confused as to why the directional buttons are out of place and not uniform with the rest of the keyboard. It looks weird.",
  "Its basically the non gamery version of the legion 5 pro",
  "How’s the fan noise under regular use? I’m supposed to get mine soon !",
  "Look sleek \n\nBtw it's nice to see Leatherman there. r/EDC love them",
  "Thank you, you dont have to be jealous because to me the Flex 5 is well worth the money. It even looks better than mine.",
  "Any “5” CPU (Ryzen, Intel) that’s newer gen should be perfectly fine. It’s the GPU that you gotta worry about,",
  "I was able to run RDR2 max settings at 60+ fps so that says something.\n\nGames like Iron Harvest also runs max setting at stable 60.\n\nYeah honestly it was a bummer I got the 5 instead of 7, but mine is zen 3 so it's not that bad.",
  "That resolution is great! Apple has used it on their 13\" MacBooks for years and it is very nice. Also, the 16:10 is the superior aspect ratio.",
  "Yeah it is correct. I dont see any issue with the display tbh.",
  "The mobile is a bit less powerful.\nHere is you can compare them both [RTX 3060 Mobile vs RTX 3060](https://technical.city/en/video/GeForce-RTX-3060-mobile-vs-GeForce-RTX-3060)",
  "The seller I bought from has very high ratings so I wssn't worried. But yes usually I don't buy expensive stuff from ebay.",
  "*Did you purchase it*\n\n*Through their website or got it*\n\n*From a retailer?*\n\n\\- Met4Zer0\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
  "I bought it from a seller on ebay. $1295 total out the door.",
  "Exactly what I thought! It is a mix between a thinkpad and a legion, maybe with a bit of an ideapad.",
  "Yeah most games you listed should be able to run on highs settings at stable 60fps",
  "Yeah Thinkpad and Thinkbook are good lines.",
  "To me the Legion line is the best looking gaming laptops. Mine is basically a Legion inside as well.",
  "Because they go full sized keys in my opinion. I actually find that practical and it doesnt bother me one bit. I prefer full sized keys.",
  "I agree. Someone said it's identical of the legion 7 slim.",
  ">I was able to run RDR2 max settings at 60+ fps so that says something\n\nAt native resolution or 1080p?",
  "I looove 16:10 for laptops. I don't have a gaming laptop but the aspect ratio is great for  productivity",
  "I meant the studio version and not the desktop version.",
  "I’m not a fan of many Lenovo designs but they nailed it with this one. Hope you enjoy it! I recommend switching to the game ready driver if it came with the studio driver.",
  "You totally get",
  "It doesnt look like legion slim 7",
  "I think it’s the same chip but different drivers. The studio ones are more optimized for multimedia apps like photoshop cad, etc. Mobile is more gaming oriented.",
  "Lol me too. I'm not a fan of the thinkpad and ideapad design principle either. \n\nSounds stupid but how do I switch between drivers?",
  "they meant the internal, but yeah they could be wrong.",
  "In GeForce experience app open the Drivers Tab, then click the tree dots and you can change the driver options there. \n\nNote: you can't install Game and Studio Driver in the same machine.\n\nimo studio driver it's good dor gaming too, u can check this post:\n\n[Switching Drivers](https://www.reddit.com/r/nvidia/comments/qo0ebn/switching_between_studio_and_game_ready_drivers/)",
  "Oh I see",
  "Thats helpful thank you!",
  "Finally a review was posted on the 2025 Lenovo Thinkbook 14+ and the 16\" version https://youtu.be/1G_xM0qxA-8?si=EtM9GkFz-JXeAtsM",
  "ASUS Zenbook S14 vs. Lenovo Yoga Slim 7i Aura 15 vs. LG gram Pro 16/17 - which would you choose? I have been looking at these three laptops and am beginning to feel as though there isn't much difference beyond the screen size and whether it's OLED or IPS. Is there anything I'm missing? Would you choose one over the other for reasons beyond screen size preference, and if so, why? Would you not recommend anything about these processors or specs for any reason? How about OLED - is it worth it at these screen sizes and is it even noticeable? TIA!\n\n[ASUS Zenbook S14 - $1,499.99](https://shop.asus.com/us/90nb14f4-m00620-asus-zenbook-s-14-ux5406.html)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.65 lb - 12.22\" x 8.45\" x 0.47\"\n* 2880 x 1800 resolution (OLED)\n* 100% DCI-P3 coverage, Pantone-validated\n* 1,000,000:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 72Whr battery, 21 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[Lenovo Yoga Slim 7i Aura 15 - $1,422.99](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/83hmcto1wwus1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 3.2 lb - 13.53\" x 9.27\" x 0.55\"\n* 2880 x 1800 resolution (IPS)\n* 100% DCI-P3 coverage\n* 1,500:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 70Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[LG gram Pro 16 - $1,550.00](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)  |  [LG gram Pro 17 - $1,596.98](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.96 lb - 14.08\" x 9.9\" x 0.5\"  |  3.16 lb - 14.91\" x 10.19\" x 0.7\"\n* 2880 x 1800 resolution (OLED in 16\", IPS in 17\")\n* 100% DCI-P3 coverage\n* 1,000,000:1 contrast ratio\n* 400 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 2 USB-A ports, 1 audio jack\n* 77Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W two-piece charger",
  "## Amazon Price History:\n\n**LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - AI-enabled Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display**\n* Rating: ★★★★☆ 4.0 (6 ratings)\n\n* Current price: **$1699.99** 👍\n* Lowest price: $1299.99\n* Highest price: $1999.99\n* Average price: $1749.61\n\n| Month  | Low  | High | Chart             |\n|--------|------------|------------|------------------|\n| 02-2025 | $1628.95    | $1881.52    | ████████████▒▒  |\n| 01-2025 | $1621.11    | $1920.67    | ████████████▒▒  |\n| 12-2024 | $1299.99    | $1919.95    | █████████▒▒▒▒▒  |\n| 11-2024 | $1299.99    | $1999.99    | █████████▒▒▒▒▒▒ |\n| 10-2024 | $1658.17    | $1999.99    | ████████████▒▒▒ |\n| 09-2024 | $1699.99    | $1986.64    | ████████████▒▒  |\n| 08-2024 | $1562.65    | $1999.99    | ███████████▒▒▒▒ |\n| 07-2024 | $1562.27    | $1999.99    | ███████████▒▒▒▒ |\n| 06-2024 | $1568.64    | $1938.55    | ███████████▒▒▒  |\n| 05-2024 | $1651.81    | $1999.99    | ████████████▒▒▒ |\n| 04-2024 | $1799.99    | $1999.99    | █████████████▒▒ |\n| 03-2024 | $1939.85    | $1999.99    | ██████████████▒ |\n\nSource: [GOSH Price Tracker](https://gosh.app/?utm_source=redditbot&utm_medium=laptops&utm_campaign=2025-02-19)\n\n\n^(Bleep bleep boop. I am a bot here to serve by providing helpful price history data on products. I am not affiliated with Amazon. Upvote if this was helpful. PM to report issues or to opt-out.)",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display \n\n>**Company**: LG\n\n>**Amazon Product Rating**: 4.0 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 4.0\n\n>**Analysis Performed at**: 02-19-2025 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lg-gram-pro-16-inch-thin-and-lightweight-laptop-intel-evo-edition-intel-core-ultra-7-32gb-ram-1tb-ssd-with-oled-display) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "Deciding between Lenovo V15 G2 ALC and ASUS Vivobook 15 Notebook/M1502YA-AB74 for new laptop ",
  "I'm mainly looking for general use, lower end gaming (mainly emulation), and coding/post grad CS research/experimentation. I'm leaning more towards the Lenovo V15 G2 ALC but if you have any suggestions/feedback please let me know.",
  "Check price on Costco and ebay.\n\nI think some of the asus ones come with a 1tb ssd as well.",
  "2nd one has a better processor, but if you are doing hardware intensive coding, maybe try an m1 macbook air used? Or a used gaming laptop?",
  "MacBooks are generally outside of the price range (~550) and want something with at least 16 RAM. Also, I’m primarily want general use and coding with lower-end gaming and emulation on the side.",
  "Razer blade 17 vs lenovo yoga/legion vs hp spectre/omen Hi, looking for a new laptop and would love some help. Got a spectre from 2018 and battery been replaced twice... Looking for something new that has the best 4k/UHD resolution ideally, and can be great for AAA games, and also a powerhouse for work/processing bunch of software/tabs/etc... Saw this seemingly great deal but I'm not that sharp about if this is actually a good deal or not... I like the idea of touchscreen and 2 in 1 but not bound to it... Most important is visual quality and processing capability... TIA! ",
  "Not this one a 3070ti is not enough you can find a laptop with a 4080 is you shop around at this cost",
  "I'm not too sure on the US side of things but the laptop you showed in the screenshot seems like a pretty good price. Personally, I stick to Asus for my gaming laptops but if I were to choose another brand, it would 100% be razer",
  "Fuck omen, honestly it's such a pain in the ass. Stick to razer",
  "Ordered the legion on sale at Walmart right now thanks everyone",
  "Thanks, what's the difference?",
  "What's the pain of it?",
  "Which one",
  "50%+ performance is the difference",
  "Much more powerful GPU and can handle up to 4k gaming performance. Its really just overall better and anyway you can imagine. With the current sales going on you can have the 4080 for this cost and maybe cheaper not to mention is it the current generation of GPU until the next new thing come to bare",
  "The usual HP problems- hardware failure, fragile, probably bad thermal performance",
  "Poor cooling, Build quality is lacking, Super loud.  I was never fully comfortable using my omen for the 4 years I had it. It always had something wrong with it",
  "[removed]",
  "Gotcha, yeah wound up getting the legion pro 4070!",
  "Seems like the best deal under 2k right now",
  "I got a legion pro too when my omen kicked the bucket. Its such an awesome laptop!. But word of advice, get a laptop stand so you can lift it a bit since the exhaust can release hot air on your hand from the side. Using a stand completely fixes the issue 👌",
  "Pretty good one",
  "Nice! Yeah already got one, got a 55 ark screen coming too, maybe switch to keyboard and prob put laptop to the side... I'm new to having a good setup lol",
  "The legion pro screen is already super nice. But going that route would be cool as hell too.\n\nEnjoy it !",
  "New laptop! Lenovo ThinkBook 14 IIL I love this thing. What do you guys think?\n",
  "It has a Core I7-1065G7, and Iris Plus graphics.",
  "Too old.  \nAbout 2020 model.\n\nCheck its warranty, whether showing correct or not.",
  "Has anyone bought the Lenovo Thinkbook Plus Gen 3 Dual Display 17.3\" I am in the market for a new computer. I REALLY want that wide screen. I use programs regularly that feel limited by the width I am used to with my 17.3\" 16:9 screen.\n\nHowever...it maxes out at 32gb of memory. PLUS I want to create a dual drive so I can pop in my old computers'\n\nWDC  WDS200T2B0B-00YS70 (1.8TB) memory with all my docs, and keep a 1TB memory for the OS and other use.\n\nAnd I would have to start working with Windows 11 (which I am not prepared to do right now). \n\nI JUST got a Dell Precision 7740 with 64GB and 1TB with a AMD Radeon (TM) Pro WX 3200 Graphics, and Central Processing Unit (CPU): Intel(R) Core(TM) i7-9850H CPU @ 2.60GHz for $1150\n\nI don't really like this computer's keyboard, and sound. Im not sure if I want to keep it, or get another one, a used z-book like the one I used to have but a newer version with a better screen.\n\n",
  "is this a good laptop for a long run as a college student? (lenovo thinkbook 14 gen 7 amd) [Lenovo ThinkBook 14 Generation 7 AMD](https://preview.redd.it/y2c7ilafgvld1.png?width=1920&format=png&auto=webp&s=2ff5702bd12b7900b40c57648e99aed99c13053b)\n\nI'm planning to purchase a new laptop and found this laptop that interest me. The laptop specs that I have customized and choose are as follows:\n\n* CPU: AMD Ryzen™ 7 7735HS (8 Cores 16 Threads)\n* GPU: AMD Radeon™ 680M\n* RAM: 8GB upgradeable until 64GB @ DDR5-4800\n* Storage: 512GB\n* Ports:\n   * SD card reader\n   * USB-A (USB 5Gbps)\n   * Ethernet (RJ-45)\n   * Kensington® Nano Security Slot™\n   * USB-C® (USB 10Gbps), with USB PD 3.0 & DP 1.4\n   * USB-A (USB 5Gbps), Always On\n   * HDMI®\n   * USB-C® (USB4® 40Gbps), with USB PD 3.0 & DP 1.4\n   * Headphone / microphone combo jack (3.5mm)\n\nI'm planning to use this laptop for my computer science studies and continue using it afterward at my workplace as a software/network engineer. The variety of I/O ports make it suitable for long-term use, imo. And from what I heard AMD tends to use less power and less heat which makes the battery life longer compared to Intel cause I need a better battery life for long classes while maintaining a decent amount of power. I also plan to play some light games on it, definitely not AAA titles. Some of the games I have in mind are Cuphead, Cult of the Lamb, Astroneer, No Man's Sky, and Fortnite.\n\nFor some reason, I haven't found many reviews on YouTube about this laptop, which is kind of odd. So, for those who already own it or have experience with it, in your opinion, is this a good laptop for college and work?",
  "Anyone using Lenovo Thinkbook 16 g6 in this sub??? If yes then drop your review \nPros and cons in the comment",
  "Lenovo Thinkbook G5 (R3 7330U) or Ideapad Slim 3 (R5 5500U) ?? Buying a laptop for my father, entry level, fast and good battery, mainly used for minor office tasks and media streaming. These two on shortlist                                                                                                                                        1. **Lenovo IdeaPad Slim 3 R5 5500U 15.6\" IPS LCD (16 GB/512 GB SSD/Win11 Home, MS Office)** *@ 32500INR/380USD* and                                                                                                                                                                  2. **Lenovo ThinkBook 15 G5 R3 7330U 15.6\" TN FHD (8GB RAM/512GB SSD/Win11 Home/Fingerprint)** *@ 27000INR/320USD.*\n\nAppreciate great metal body of thinkbook and nicer cpu but deal breaker for me is the awful *TN display* with disaster viewing angles and colors. biggest plus point on ideapad is being *only IPS in range*, rest is better on thinkbook. also going to look at screen all the laptop's life, movies or work so it is kinda major point. But in a dilemma after reading reviews on quality of ideapad. laptop is going to be safely used for normal tasks, low to none gaming, so okay with 5000 series processor.                                                                                                              others on list were *Lenovo IdeaPad Slim 3 Intel Core i3 1215U* and *ASUS Vivobook 15 (2024) Intel Core i3 1215U*\n\nEmphasis on build quality, cpu and display.\n\n**Will need quick decision as need to buy asap.**",
  "Elukotronics RP-12 G2 Ryzen 7840HS + RTX 4070 + 64 gb + 2 tb Review Bought me a RP-15 Generation 2.\n\nRyzen 7849HS with RTX 4070 (for $200 more than 4060 - 4060 was $1199).\n\nRan Cinebench (CPU), Superposition (GPU), and Cystaldiskmark right off the bat while re-installing my games on steam.\n\n7042 Read, 6487 write for the SDD\n\n15743 for Superposition on the 1080 high (Direct X), 9454 for (Open GL).\n\n16649 pts on multi-core, and 1750 for single core.\n\nThe screen is 165hz QHD with anti-glare 100% sRGB and when you do vibrant setting, it's quite nice at 350 nits - I don't really care, since it's gonna sit most of the times.\n\nI bought a MAX-17 magnesium laptop four years ago? 17\" screen at 240 hz, 1080P (FHP- anti-glare). I-710875H with RTX 2070 max-p (65w I think). 2TB and 32gb ram. Had them do liquid metal on CPU, and it costed $2600 or so?\n\nI paid $2700 (tax and stuff) for the MAX-17 and half of that for RP-15 g2.\n\nReview:\n\nI must say, the RP-15 g2 is lighter, better display, and faster. The part that is really stupid is, although I use my Dell mechanical keyboard from 15 years ago (because it's perfect), the keyboard on the RP-15-G2 is so much better. I grew up and went to school on Macbook pro, and this is the best keyboard I had in a while - including lenova. The travel is unreal.\n\nThe good things:\n\n1. apparently, with the right plan, you can get 8 hrs of battery time on a gaming laptop. I'm an old school - Alienware, MSI, tons of Asus... unheard of with the Ryzen processor\n2. The fan isn't so loud. Not sure what they did - used a fan that's not as loud?? It feels like it's spinning as fast, but not as loud on Beast Mode.\n3. I was worried about the screen, but it's super nice. It sucked before I went to the setting to pick the Vibrant function - sure, more battery life sucked out of it, but with the battery savings with Ryzen, I can afford it.\n4. I am use to carrying bricks for AC Adaptors (Alienware 18 that I use to have had a brick that was a workout). This laptop has one that looks like something from a Dell laptop. Super light.\n5. They finally added the white to the RGB light. I'm staying with that.\n6. The software has improved dramatically. When you tell them what to do with the lights, and what not, they do it.\n7. Not really that fingerprint magnet. I don't have any fingerprints yet, and I've been playing with it for about 5 hrs.\n8. Good touchpad. They have the  double click mouse pad disable thing.\n9. There is a large border underneath the mouse, and I like that. They lift up the screen and you get use to it after few minutes.\n10. As always, I use this for work as well, so this looks more professional when I take it with me to work. Nobody knows what laptop I have since there are no logos.\n11. I was surprised at how light this was compare to my Max-17. But I was surprised as how light my Max-17 was against this plastic (resin)/aluminum version.\n12. Fullsize SD card slot.\n13. Very tight USB slots.\n14. Performance is ok, but it's not so bad for the price.\n15. Stays very cool - running bunch of benchmark tests, they stayed relatively cool.\n16. I love the default angle for typing. I mean, it's perfect.\n17. They finally put the camera on the top of the screen (Max-17 had it on the bottom - made me look like a fatass).\n18. I must say, the RP-15 g2 is lighter, better display, and faster. The really stupid part is, that although I use my Dell mechanical keyboard from 15 years ago (because it's perfect), the keyboard on the RP-15-G2 is so much better. I grew up and went to school on Macbook Pro, and this is the best keyboard I had in a while - including Lenovo. The travel is unreal. eal.\n19. Better Bios setting.\n20. Better light control.\n21. Much better cooling - I had to buy something to lift the back of the Max-17, but RP-15 Gen 2 comes with thick rubber paddings on the bottom and the air flow seems very good compare to the Max-17.\n22. They put 2tb pcie m2 on one of the slots. I ordered another 2tb 990 pro for $129 for the other slot. (Haven't tested the ram but from the looks of it, they'll turn out ok - 32gb per slot).  Max-17. be updated on Friday, I received the laptop on Friday after getting the status update on Thursday night.\n\nNow the bad things:\n\n1. The screen wobbles when you type. It's too light. I don't mind it that much though.\n2. No IR Hello face recognition.\n3. I had to reset a lot of my passwords.\n4. Middle of the road performance marks - which I'm happy with. I'll get a desktop with Threadripper and 4090 if I ever need to kick that 15-year-old's ass on a game. You did not sleep with my mother.\n5. DP to USB-C from my monitor didn't work. Not sure what's wrong with it. Worked fine with my Max-17 for years.\n6. Eluktronics charged me $22 for one broken keyboard on my Max-17. That's criminal.\n\nHonestly, this laptop feels amazing in the keyboard department than the older Max-17 I had, but it does feel slightly cheaper. But I'm ok with it. It's lighter, easier to work with, and everything works now- (Max-17 had issues with sleeping - it would not sleep, or turn off no matter what I did).\n\nThis weekend, I'll take it apart to put the M2 990 pro, I'll post some pix.\n\nI decided to buy this and not Acer Helios 16 or MSI or Razer Blade or Alienware M16 is because, not only was this laptop so much cheaper, and I had bad experience with my Alienware M18 previously, bad experience with ASUS (x2), yet I honestly didn't even need to purchase this laptop since my Eluktronics Max-17 ran flawlessly for the last 4 years AND STILL GOING is where it mattered.\n\nDon't buy it. I want them to try harder for me.\n\n(Tongfang chassis  - modified by Eluktronics - they get their money, pays off for good customer service - I think that's a win-win situation). I just wish they wouldn't charge $22 for ONE KEYBOARD.",
  "Here are some screencaps:\n\nhttps://ibb.co/hHhC6hH\r  \nhttps://ibb.co/0hcqnw8\r  \nhttps://ibb.co/FYx3VmZ",
  "Should I get this laptop or the Lenovo legion 5 pro with the same specs except  it goes down to a 4060 gpu",
  "Choosing between Asus X515, Lenovo ThinkBook 15 G2 and Dell Vostro 3500. Hello,\nA friend of mine wants to buy an used laptop which will be used primarily for Photoshop editing and possibly some video editing as well. The budget is really tight and from looking online these three are the best offers we could find. \nAll have i7-1165g7 processor. The Asus has 8Gb of RAM while the other have 16Gb, but it is possible to upgrade to 16Gb.\nI would be thankful if you could give advice about more hidden specs - display quality, build quality, battery life, etc.\nThanks in advance.",
  "Undecided about which laptop to choose. (HP 255 G10, Lenovo ThinkBook 14, Samsug Galaxy Book 3 or Microsoft Surface Go 3). Hello, I am electrical engineering student, recently I have been offered one laptop of the following:\n\n&#x200B;\n\nHP 255 G10 (AMD Ryzen 5-7530U, 16 Gb ram, 512 Gb ssd)\n\nLenovo ThinkBook 14 (Intel core i5-1135G7, 8 Gb ram, 256 Gb ssd)\n\nSamsug Galaxy Book 3 (Intel core i5-1335U, 8 Gb ram, 256 Gb)\n\nMicrosoft Surface Go 3 (Intel Pentium Gold 6500Y, 8 gb ram) with keyboard\n\n&#x200B;\n\nIt will be used mostly for word and excel, and some light programs psim, femm, lt spice. \n\nIt will be good if it could run Matlab for simple simulations in simulink (for more complex simulations I have a good PC in my house and in the university I can use a remote desktop) and some old games like Morrowind, Hearts of iron 3, Hoi darkest hour, fallout 2... (If anyone could move Hearts of Iron 4 it would be great, but I doubt it) but  it's not a necessity.\n\n   \nI only take into account the surface because with a digital pen can be used to take notes and its portability, because I think the CPU is underpoweret even for use office and edge at the same time.\n\nI think in general the best option is the HP 255 G10 because it has more RAM and ssd storage and the i5-1335U is only a bit better than Ryzen 5-7530U (from what I have seen on the internet) but   \nI've heard people complaining that HP computers are flimsy, especially the ones that aren't high-end and for a laptop that  is going to be used every day outside the home, and I am going to carry it in my backpack with a cover, I am worried that it could be damaged or broken. \n\n I have looked for reviews of the hp, but I have not seen the exact model, so if any of you have used this laptop  and can tell me what the build quality is like or think that one of the other laptop is better    \nI would appreciate the help.\n\n&#x200B;\n\nSorry for my English, I know it's pretty bad, but I'm trying to improve it.",
  "Lenovo Thinkbook 15 G2 vs ASUS Vivobook 15 K513 Which one is better in the long run and what's your feedback if you own one.\n\nLooking for a budget-friendly metal build laptop primarily for coding, studying and casual gaming.",
  "I've used the Thinkbook T- line for years. They've been incredibly durable. I've dropped a couple of them from 3 feet (caught on the cord) and not a problem. They are significantly more durable than the Elitebook line from a few years ago (I bought one for my wife and it just didn't hold up). I don't have any experience with the Vivobook.",
  "Budget? Which games?",
  "Command & Conquer \nBlack Ops 2\nBlur\nValorant \nEtc.\n\nBudget 600 - 700 USD",
  "Is having number pad a requirement?",
  "Its not the numberpad its the size i feel 14 inches is a bit small",
  "I was gonna suggest \"Asus VivoBook Pro 14\" because it has the best display and build quality in that price range.\n\n[https://www.walmart.com/ip/ASUS-VivoBook-Pro-14-OLED-K3400-14-WQXGA-OLED-Intel-Core-%5B%E2%80%A6%5Duiet-Blue-Windows-10-Home-K3400PA-WH51/194597162](https://www.walmart.com/ip/ASUS-VivoBook-Pro-14-OLED-K3400-14-WQXGA-OLED-Intel-Core-%5B%E2%80%A6%5Duiet-Blue-Windows-10-Home-K3400PA-WH51/194597162)\n\nThe regular Vivobook Pro 15 (K513) has a nice display but an all-plastic build. Idk which ThinkBook 15 model you looked at, but on the most recent model [displays](https://psrefstuff.lenovo.com/syspool/Sys/PDF/ThinkBook/ThinkBook_15_G3_ACL/ThinkBook_15_G3_ACL_Spec.pdf) are pretty bad.\n\nI still think Asus is better because of how good that walmart deal is. But for 15\"+, there is one called \"Lenovo Ideapad 5 Pro 16\" which checks most boxes.\n\n[https://www.newegg.com/gray-lenovo-ideapad-5-pro-16ach6-work-business/p/1TS-000E-0W890?Description=ideapad%205%20pro%2016&cm\\_re=ideapad\\_5%20pro%2016-\\_-9SIB293GZ12526-\\_-Product&quicklink=true](https://www.newegg.com/gray-lenovo-ideapad-5-pro-16ach6-work-business/p/1TS-000E-0W890?Description=ideapad%205%20pro%2016&cm_re=ideapad_5%20pro%2016-_-9SIB293GZ12526-_-Product&quicklink=true)\n\n[https://www.ebay.com/sch/i.html?\\_from=R40&\\_trksid=p2380057.m570.l1313&\\_nkw=lenovo+ideapad+5+pro+16&\\_sacat=0](https://www.ebay.com/sch/i.html?_from=R40&_trksid=p2380057.m570.l1313&_nkw=lenovo+ideapad+5+pro+16&_sacat=0)",
  "Thanks bro",
  "Lenovo Y740 17\" Review (8750H, 2080 Max-Q) Good afternoon Reddit!\n\nI recently just got in my Lenovo Y740 17” (8750H, 2080 Max-Q, 16GB Dual Channel) and just got done running some benchmarks and so forth in an effort to shed some light on this enigmatic model, as the  15” variant gets \\~95% of the coverage in terms of reviews and user anecdotes.\n\n**Chassis and Physical features**Pictures of all the I/O and interior/exterior found [here](https://imgur.com/a/s0wqMQz).\n\nIt weighs about \\~6 lbs., and is actually pretty thin, just under 1 inch thick (or \\~23mm). The keyboard deck has a bit of flex when pressing down with force, but given its size, it’s still pretty sturdy. Trackpad uses Precision drivers, but is WAY too small given the area Lenovo had to work with. The dedicated mouse buttons are okay; they just get the job done. The exterior has a “butt” that protrudes outward and houses the majority of the I/O and 4 exhaust vents. This does not fit in my 15.6” laptop bag (it is not deep enough, but does fit width-wise).\n\nThe bezels are a bit larger than the 15” brother, but they did move the webcam back to the top, so no more nose-cam! Very happy about that. The screen is a 144Hz IPS G-Sync panel, and gets reasonably bright compared to the competition, \\~300 nits. My unit has very minimal backlight bleed, but that does vary heavily from unit to unit.\n\nKeyboard layout is great, but “feel” is, well, okay. Nothing special, nothing awful. Feels like one of Lenovo’s IdeaPads or something. I wish it felt more like their ThinkPad lineup, but not sure how that would look on a gaming laptop. I did however hit close to my typing speed record on my second try with it (104 WPM)\n\nOverall, I’d give the unit a 7/10 for build quality and design, docking points for wasted space on the keyboard deck, thick-ish bezels and some flex around the unit. I do love the minimalist design otherwise.\n\n**Performance/Thermals and Noise**\n\nNow, this is where this beast really shines. All benchmarks are run with max-fans and -140mV core/cache undervolt.\n\n[UserBenchmark link](https://www.userbenchmark.com/UserRun/18724106)\n\n[Heaven Unigine Benchmark Score](https://imgur.com/Bqs6qqT)\n\n[FireStrike Scores](https://imgur.com/a/ik5Y4DX)\n\nI won’t go into detailed game benchmarks, as I don’t have a full Steam library to do so, but I can tell you all this: the temperatures on this thing are **insane.**\n\nI ran three loops of Heaven’s benchmark with uncapped FPS and **didn’t see above 63C on the CPU and above 60C on the GPU, even with a +100MHz OC.** I have yet to mess with the voltage curve to really maximize the potential of this 2080 max-Q.\n\nCineBench R15 on repeated runs stays in the 1200 range, and the CPU can pull \\~60W when the GPU is not also under load. Highest core temperature was 65C after 3 runs, the rest were 61-63C.\n\nWhile using the laptop with normal tasks, it’s almost completely silent; I can only really hear the whirr of the HDD. Max fans is also much quieter than I anticipated. Notebookcheck’s review shows it maxing around 45-47dB, which is twice as quiet when compared to most 15-inch gaming notebooks with similar or worse specs, which are in the 54-56dB range. (TIL that every 10dB is equivalent to doubling the sound intensity or perceived increase in volume)\n\nSimply put, 10/10. Could not ask for better thermals given its performance output in <1” footprint.\n\n**Misc. (I will add to this to answer questions about things I may have forgotten)**\n\nBattery life with G-Sync enabled is about 2-3 hours. Without, 4-6 hours depending on how aggressive you are.\n\nRunning on BIOS revision 1.07, preserving the ability to max the fans with FN+Q.\n\nFeel free to ask questions and I will try to answer them!",
  "Thanks for taking the time to post this review. It sucks there has been so much focus on the 15\" and not as much on the more powerful 17\" version. \n\nAny chance you could install the free version of 3dmark Firestrike? I would love the see the scores you hit with the undervolt. \n\nI am torn between this and the MSI GS75. I know the GS75 is a sexy beast with a smaller footprint, but I like the style on the Y740 as well. Have you had a chance to check out a GS75? I'd love to know how the build qualities compare.",
  "How are you able to you Max fans as the latest BIOS removed Max fans feature?",
  "Hey everyone! I added my FireStrike score to the post :)",
  "What’s your average clocks on the 2080 and what wattage is the card + what drivers does it run?",
  "where you able to squeeze more performance out of the GPU? Did you OC it with afterburner?",
  "Both have okayish build quality. stiffness is a little weak compared to other brands, but still no real reason to complain.\n\ni would strongly reccomend the Y over the GS tho, its cooling system is simply SO MUCH ahead of any other manufacturers cooling solutions that its downright ridiculous to not chose the Y, no matter what other gaming notebook in this category you compare it with.\n\nI would love to see an overclockable HK processor in this thing, just to see how much you can get out of this baby.",
  "I have the gs75 with the same cpu and gpu. The temps get really high that causes it to thermal throttle 90-95 degrees under load with max fan curve. I did a repast and undervolt now I’m sitting at 75. Y740 has better cooling but the gs75 looks a bit better on design.",
  "I just bought the y740 with a i7-9750H and rtx 2060. I was considering an MSI, but the end decision was more with the thermal and overall quality seemed to be a lot better. MSI is good, don't get me wrong, but the cons seemed less ideal for MSI than Lenovo Legions. Plus I didn't want to be that kid to haul out a loud ass spaceship in class. \nCheck out this review: \n https://www.youtube.com/watch?v=bTUytmEYx6s&feature=share",
  "I purposely disabled automatic updates when I received mine, and it was on BIOS build 1.07, so I still have that ability.\n\nI'm going to update the post to include my BIOS revision.",
  "Without tweaking the voltage curve in Afterburner, I’m in the 1500s usually. It is an 80W variant, but running on max fans allows it to pull 90ish Watts. \n\nI have to get back on the Drivers when I get back home!",
  "Where did you go to turn off auto-updates?\n\nYour post made me decide to go ahead with my purchase. I'll be ordering one this weekend. I downloaded a copy of the 1.08 bios in case I need to revert it from 1.09. I cant seem to find 1.07 anywhere online though.",
  "Nice, its better to avoid that latest BIOS unless Lenovo fixes it",
  "Lenovo Vantage software!",
  "Ordering for Lenovo is a little janky, fyi. They're backlogged on orders rn so you'll have to wait a couple weeks and they're payments won't seem logical, but it should all work out on its own.",
  "Yeah, I did some reading prior to getting the laptop and the first thing I planned to do was prevent a BIOS update if it was older than 1.09, or do a flashback lol",
  "Lenovo ThinkPad X13 Gen 2 or HP EliteBook 845 G8  ThinkPad could either be a Yoga with a Intel Core i7-1165G7 processor or a regular X13 with a Ryzen 7 5850U processor. Both have 16GBs of RAM.\n\nThe EliteBook has a Ryzen 7 5850U processor and 32GBs of RAM.\n\nEvidently, the EliteBook has better specs, though I'm concerned largely here with build quality, emissions, and battery life. Information on the EliteBook is sparse and data related to the ThinkPads seem to be inconsistent (i.e. reviews claiming it has between 3 and 14 hours of battery life while streaming), so I'm wondering if anybody here might have some insight on either.\n\nPrice is not a consideration.",
  "Zen 3 mobile (5000 series) is decently well optimized in laptops on average in terms of performance and efficiency (especially thermals as well), so in my personal opinion (and from experience with using them at my workplace, a computer repair store), I trust the battery life of laptops with Ryzen CPUs inside more than those with 11th or 12th gen Intel CPUs.\n\nMost manufacturers set the default power limits too high for an otherwise modern ultrabook class of computer, just to eke out as much performance as they can in exchange for momentary bursts in temperature and power draw, compared to computers in the past.\n\ntl;dr: Elitebook 845 G8 is better because of the CPU it uses which offers both better performance and power efficiency over \"equivalent\" Intel offerings.\n\nHP also uses a mostly metal chassis as well, which are built fairly sturdily/solid from experience of using them, while recent ThinkPads tend to default more towards hard plastic for a good portion of laptops, if not, then a hybrid between hard plastic and magnesium/aluminium, (mixed experiences, some models have varying levels of chassis flex while others are fine).",
  "Looking for opinion of laptop: Lenovo ThinkPad L13 G2 + 3 other devices As it is, this laptop is a strong contender for me and my budget currently. The specs of the configuration I'm looking at currently includes:\n\n* Ryzen 7 5850U processor w/ Vega 8 graphics.\n* 16GB RAM.\n\nAs for my reservations, I'm mainly concerned about two things and am wondering if anybody might be able to explain these things to me. Most of the information I'm referencing is from [NotebookCheck](https://www.notebookcheck.net/Lenovo-ThinkPad-L13-Gen2-AMD-laptop-in-review-Fast-enduring-Ryzen-ultrabook.605249.0.html).\n\n* TDP. NotebookCheck states that the device is \"limited to 15 watt TDP\" which, based on what I've heard about TDP, does not seem like even barely enough to power this system with all its hardware. Is this wattage configurable? Does it actually affect performance that much?\n* Battery life. Despite seemingly long run-times, this device is only equipped with a 43wH battery. This leads me to question how such a small battery can get up to 12 hours of websurfing time. It also makes me question whether the aforementioned TDP is involved and if (shall it be possible) increasing it would lead to significantly worse battery life.\n\nIf both of these end up being major hinderances, I'm wondering if there are any opinions on these laptops as well:\n\n* Dell Latitude 7420 (i7-1185G7)\n* HP ZBook Firefly14 G8 (i7-1185G7)\n* Lenovo ThinkPad E14 (Ryzen 7 5700U)\n* Edit: HP EliteBook 845 G8 (Ryzen 7 5650U)\n\nLargely interested in the performance differences between the Ryzen 7 and Core i7 shall my choices be whittled down to these 4 options.",
  "Would lenovo thinkbook 16 allow for 32 gb ddr4 module + 8 gb soldered? For a total of 40gb?\n\nSpecifically this model:\n\n[https://www.lenovo.com/ca/en/laptops/thinkbook-series/ThinkBook-16p-G2-ACH/p/20YM001FUS](https://www.lenovo.com/ca/en/laptops/thinkbook-series/ThinkBook-16p-G2-ACH/p/20YM001FUS)",
  "Yes",
  "The major headache of something soldered with a low capacity RAM is the ability to run out of dual channel memory bandwidth quickly. I would recommend looking around for a different laptop with more memory available or a laptop with dual memory slots.",
  "Asus Vivobook 16x Oled vs Lenovo Thinkbook 16P, which one should I get? I'm torn between these 2. My purposes are mainly for school stuff, coding, video editing, movies, and gaming (I play every kind of games from oldschool to modern AAA)\n\n**Asus Vivobook 16x Oled:**\n- $1550 total\n- Oled screen, 4k 16\"\n- Ryzen 7 5800H\n- RTX 3050 Ti\n- 16gb Ram (cannot upgrade)\n- 1TB SSD (1 more slot)\n- Touchpad is placed in the center\n- only 1 USB C port and cannot be used to charge\n- Heat exhaust below the lid, blows at the screen\n\n\n**Lenovo Thinkbook 16P G2:**\n- $1300 total\n- IPS 2k 16\" screen\n- Ryzen 5 5600H\n- RTX 3060\n- 16gb Ram (upgradeable)\n- 512gb SSD (1 more slot)\n- RTX 3060\n- 2 USB C ports, can be charged\n- Can open lid 180 degrees\n- No HDMI\n- Heat exhaust in the back",
  "&#x200B;\n\n&#x200B;\n\nRecommend Lenovo but this one is better.\n\nhttps://www.bestbuy.com/site/hp-omen-16-1-qhd-gaming-laptop-intel-core-i7-16gb-memory-nvidia-geforce-rtx-3070-1tb-ssd-ceramic-white/6479084.p?skuId=6479084",
  "Lenovo ThinkBook 15 G2 ITL 15.6 \"\n\tWindows 10 Home\nRam 8gigs\n\tIntel Core i3\n \tIntel UHD Graphics\n \tSSD \nCOST: 577 Bucks",
  "Lenovo Thinkbook 15 G2 ITL battery life question Hello,\nI've purchased this laptop and it's battery life is awful, it roughly completes 3 hours on a single charge from 100% to 20% doing nothing but browsing using chrome, battery is 45wh battery, 16 GB of Ram, i5 1135g7 equipped with nvidia mx450, has any one purchased a similar thinkbook and what are your experiences with battery life? Also if anyone has any tips to increase battery on this laptop that would be much appreciated.\n\nThanks",
  "bought a Lenovo V15 G2 ITL, i3 11th Gen , 4GB ram , 1TB HDD and 128 GB SSD and the battery life is awful , even when i use it only for simple tasks such as browsing , \n\nsometimes it helps when you reduce the brightness , \n\nalso \n\nuse earphones or speakers if u can.",
  "I've had my ThinkBook 15 G2 ITL for two years. I just replaced the battery and it drained 40% in the first hour doing nothing.",
  "Lenovo thinkbook 15 g2 -- white light dims on black/dark backgrounds [https://youtu.be/tSVBRkG27xQ](https://youtu.be/tSVBRkG27xQ)\n\nThis issue is really bumming me out, guys. I uploaded it on youtube, so you can see clearly what I am talking about. I even don't know, what the issue is so I can google it. Just white dimming appears on dark/black backgrounds.\n\n&#x200B;\n\nI uploaded video on youtube because on reddit, video looks fine, so no one can tell a difference.\n\nEdit: I just found out that If charger is plugged in, somehow this issue gets resolved. What do you think. Is this an hardware issue?",
  "Eluktronics Mech G2 vs Lenovo Y740 Hello,\n\nI wanted to ask for your expertise and experience in helping me choose a new laptop! I've been using a 10 year old desktop for gaming so I'm basically limited to only League right now.\n\nI've been following deals on laptops for the past couple of months and got a deal on the y740 with the rtx 2070 for $1500. I just saw a deal on the Eluktronics mech g2 for $1500 with a 2070 as well. Which one is the better deal?",
  "It’s funny, at one point I was considering these exact two laptops for myself. I haven’t made a decision yet but I think I will be going with the Y740 as well, but the 17-inch model. Sorry for the upcoming wall of text, I’ve been spending a lot time researching these two laptops over the past 2-3 months. \n\nThat being said, the Y740 has g-sync and I like the aesthetics of it better. However with the 15-inch model I know people have returned it due to the macro keys on the left side being annoying (which is why I’m going with the 17-inch model) and there have been claims of bad backlight bleed in some instances (obviously this can vary). The Y740 does have Thunderbolt-c while the G2 does not, if that matters to you.\n\nI’ve read that the G2 supposedly has better thermals but have not done the research to confirm it myself and it has a mechanical keyboard, which again is preference. \n\nYou should get similar performance out of both assuming they’re spec’d the same way and you can undervolt on the Y740 to help with temps. Both should also be easily upgradeable. \n\nIIRC the Y740 has better battery life especially when g-sync is turned off. However, the power brick is HUGE, much bigger than the G2’s. \n\nI’ve read Eluktronic’s customer service is not so great but heard good things about Lenovo’s. This could just be a case of one person having a bad experience and spreading it though. I’ve found that you will often hear from people who have bad experiences but rarely from those who had good ones. \n\nTLDR; Both seem to be great laptops and you probably can’t go wrong with either. It’ll really come down to preference because each offers a few things that the other does not, but if I were in your shoes I would have gone with the Y740 as well.",
  "I have the mech-17 with a 2070 i freaking love it, plays everything on ultra.  the only thing i dont really like is the gaming center app that controls lights and fans it could use some work",
  "There's a big difference in performance since the Mech comes with a 2070MP/N (Laptop version of 2070) whereas the Y740 uses a 2070MQ.",
  "How are the thermals and the battery life? Also how much did u get it for?",
  "Thermals have been fine I can game all day with no throttling, not really sure on battery life I always have it plugged in   I picked it up for $1900ish I ordered it barebones through the eluktronics website, and put my own 32 gigs of RAM and a 1 TB m.2",
  "Sorry but this is my first time with a gaming laptop but what's m. 2 and is it cheaper to put it yourself, and based on your opinion which one would you suggest between Y740 and mech?\n\nThanks",
  "Or anything else for that matter that can cost less than 1800$ with discounts and everything",
  "m.2 is a type of harddrive, yes it is cheaper to buy your own and install it.  with your budget i would do what i did and order it bare bones you can buy your own memory and m.2  if your buy the mech 17 with nothing but the upgraded paste, the free 120 gig m.2 and the 2070 it comes out to $1525 you can get a 500 gig m.2 hard drive for 125 on amazon and and 16 gigs of memory for $85  and windows keys can be bought for cheap on ebay and kinguin.",
  "i would buy the mech again also the max-q version of graphics cards are just weak",
  "Thanks a lot, regarding the recommendation it would be mech right ?",
  "yeah the MECH-17 G1R  they have them on amazon and the eluktronics website,  looks like you can get a 16 gig 2070 pre built on amazon for right around 1800  make sure you get the upgraded paste it will really help with the temps",
  "Experience with Lenovo V15 G2 Hello,\n\nso I've been looking at Lenovo V15 G2 Ryzen 5 5500u and 7 5700u models and I can't find any reviews.\n\n I'm wondering how does V15 G2 Ryzen 5 model compare with IdeaPad 3 with same cpu.\n\nAnd how does V15 G2 Ryzen 7 model compare with Asus Vivobook S14 with Ryzen 7 5700u.\n\nI'm wondering about overall performance and experience and do they have good thermal performance.",
  "MSI Alpha 17 or Lenovo Legion 5i Hey guys,\n\nI can't find any reviews of the alpha 17. So I'd thought I give it a go and ask here\n\nI want to buy my thirst gaming laptop.\nCan't decide between 15 or 17 inch, I think I'd be happy with both eventually.\n\nLenovo Legion 5i\nI5 10300h\nRtx 2060\n16gb ram\n1024 GB SSD\n144hz ips panel\n \nPRICE: 1150€\n\n\n\nVs\n\n\nMSI Alpha 17\nAMD 4800h\nRx 5600m \n16GB ran \n512gb SSD \n144 Hz ips panel\n\nPRICE: 1200€\n\n\nI guess my question is which notebook is the better bang for the buck. Id like to know how the cooling on die alpha 17 is. The legion 5i has really good reviews in terms of build quality and cooling",
  "I don't know about it's availability to you but this seems like a better deal.\n\nhttps://www.newegg.com/black-msi-gl-series-gl75-10sfk-029-gaming-entertainment/p/N82E16834155401?Item=N82E16834155401",
  "Would recommend the Legion 5 15\" with 4800H + RTX 2060. The 2060 in this particular model is 115W, meaning it is more powerful (gaming-wise) than other similar-specced laptops.",
  "Unfortunately they don't ship to my country.\nI already looked up all my available options and found legion 5 and alpha 17 to be the best. Can't find anything on the alpha 17 though and thought there might be someone who tested or owns one",
  "USB Type-C port doesn't work as intended on my Lenovo ThinkBook 15 G2 ITL Laptop I have recently purchased a new USB hub for my laptop that runs through a Type-C connection with my laptop. The hub seems to work well on other devices (like my phone) but when I connect it to my laptop the USB hub seems to keep turning on and off (I know this because it has a flashing light, that usually remains turned on when the connection works well).\n\n&#x200B;\n\nDoes my laptop have a specific problem in regards to the hub or is it a widely known problem that most laptops have? \n\nIs there maybe a failsafe system that runs through the laptop's software for it to not let me use specific USB hubs/accessories that connect through a Type-C?\n\nI have also recently installed a new NVMe SSD that is located near the two Type-C ports, which might be a problem although the actual installation turned out great and the SSD is 100% usable.\n\n&#x200B;\n\nIn case you have watched the attached GIF:\n\nThe first cut showcases the blinking with the HUB connected in the first port.\n\nThe second one showcases the blinking with the HUB connected in the second port (designed to charge the laptop but also usable for accessories).",
  "Lenovo Yoga 710 14\" Review Video: [YouTube link](https://www.youtube.com/watch?v=Lnk4Jm7l6ds)\n\n**Intro**\n\nUnveiled at MWC in February, 2016, it comes in three screen sizes: 11 inch, 14 inch and 15  inch. The model I bought is the 14 inch variant. This seems to be a successor to the Yoga 700. Even though the specs of the 710 are very similar to the 700, the 700 is currently out of stock everywhere, so it seems Lenovo may have discontinued the 700 a bit prematurely.\n\n\n**Specs**\n\n * Intel (Skylake) 6th generation core i7-6500u processor @2.5 GHz (Turbo boost up to 3.10 GHz)\n * 8GB DDR4 RAM (upgradable)\n * 256GB M.2 SSD on a SATA III interface (upgradable)\n * An NVIDIA GeForce 940MX GPU\n * 14” 1080p touch IPS display\n * 802.11ac (upgradable)\n * Bluetooth 4.1 (upgradable)\n * JBL speakers\n\n\n**Ports**\n\nOn the left side we have a power jack, a charging indicator light, an SD card slot, a headphone/microphone combo jack, and a small pinhole for accessing the recovery mode.\nOn the right side there’s a power indicator light, the power button, a micro HDMI port and two USB 3.0 ports. The last USB port is an “always on” port that you can use to charge your phone even when the laptop is off.\nOn the front there’s nothing and on the back there are plenty of ventilation holes and really solid hinges.\n\n\n**Keyboard**\n\nThe keyboard has two levels of backlighting which isn’t very evident when the lights are on, so one doesn’t really need backlighting in a well-lit room, unlike some other laptops as the key lettering has very good contrast. It is very similar in feel to the MacBook Pro keyboard, with the only quirk being that the right \"Shift\" key is to the right of the arrow keys and is smaller in size. It would take a bit of time to get used to it though.\n\n\n**Trackpad**\n\nThe trackpad is good and recognizes gestures well for the most part. It’s not a glass trackpad unfortunately, but that’s by no means a deal breaker.\n\n\n**Built**\n\nDimensions\nInches: 12.68\" x 8.78\" x 0.68\"\nmm: 322 x 223 x 17.3\nWeight: 3.42 lb (1.55kg)\nBeing a Yoga machine, you can use it in the four \"modes\" that Lenovo calls: Laptop mode, presentation mode, tent mode and tablet mode. Yes, it is a bit heavy for one-handed use and one wouldn't use it like an iPad as a tablet but is quite comfortable in tablet mode when sitting on a couch. \nBecause the entire body is made of aluminium, there’s no flex on the keyboard, or rather anywhere on the laptop. There screen is pretty rigid even when I try really hard to flex it. Same thing goes for the body of the laptop, it’s really well built. It’s got chamfered edges all around, which gives a really premium feel to the laptop and makes it quite comfortable to use in the \"tablet mode\", unlike the HP Spectre X360 which has very sharp edges.\n\nThere’s lots of ventilation, with the intake at the bottom and the exhaust ports at the back, which do a great job of pushing the heat away from the user. Since there are vents even at the top edge, so they won’t get blocked no matter how you place the laptop.\nAnother benefit of the entire body being made of aluminium, is that it also acts as a heatsink, which further assists in keeping the machine cool. There are two fans inside that rarely kick in under light to moderate use and are very silent when the do kick in. The only time the machine gets hot is under extreme load, like when rendering a video in a video editor. Even then the palmrest area and the touchpad are very cool to the touch.\n\nThe two hinges are absolutely solid. They're sufficiently stiff so the screen also doesn’t wobble back and forth much when tapping on in.\n\n**Display**\n\nThe screen is a 14 inch full HD one. Being an IPS display, the viewing angles are great even from extreme angles with no apparent color shifting. It’s not a super sharp QHD one like on the Yoga 900, but the upside of having a 1080p display is that it required much less power, as fewer number of pixels means less power is required. It’s a perfectly sharp display from normal viewing distance of 1.5 to 2 feet from the screen. The brightness gets up to 300 nits and has adaptive lighting which isn’t intrusive at all and can be easily disabled if needed. It supports 10-point multi touch and gestures like pinch to zoom work great. The bezels are super slim, almost like the InfinityEdge display on the Dell XPS 13 and 15. As a bonus, the 720p webcam is placed in the right position (the centre top of the screen). Opening the screen is definitely a two-handed affair as the screen is held down by what seems to be some very strong magnets. For connecting an external display, the micro HDMI port supports 4K displays.\n\n\n**Speakers**\n\nThe JBL branded speakers are downward firing and are decent enough to fill up a 16x12 feet room with sound. They don’t have much in the name of bass though (compared to my old machine: a 2011 Dell XPS L502X). It also comes with Dolby surround software and it does a surprisingly good job of making a virtual surround effect. I didn’t know about this and I kept getting up to look out the window wondering where certain sounds were coming from when I would be watching videos.\n\n\n**Battery life**\n\nThe battery life is really good for the Yoga 710. It comes with a 53 WHr battery. With the screen brightness set at 60% it lasts for over 9 hours with light web browsing (6-8 tabs open), some MS Office work and a few YouTube videos.\nIt has a “express charging” mode that you can enable which charges the battery almost 30% faster than normal. The charger is small and lightweight, making it easy to carry around in a backpack. I wish they would have retained the USB charging port from the Yoga 700 though.\n\n\n**Shortcomings**\n\n* No USB Type-C\n* No full-sized HDMI port\n* Only two USB ports\n* Small right \"Shift\" key\n\n\n**Price**\n\nIt retails for $799 in the US ($899 for i7) and Rs 85,000 in India at launch, which I feel makes it great value for money. \nWhere I live, the lower-spec Yoga 900 retails for $1850 (due to import duties), making it prohibitively expensive. I got the Yoga 710 for $1300 (which is the actual price for the Yoga 900) but I'm still happy with the purchase.\n\nPlease let me know if there are any questions you may have, I'll be glad to answer them.",
  "How's the SSD? Noticed it's only SATA. Also, how upgradable do you mean when you say the BT, SSD and wifi are?",
  "Where did you buy this? I've been looking everywhere for the model that has the nvida and have been unsuccessful. \n\nDoes it have pen support? Also, how well do you think this will fare with video editing?  I'm a film student.",
  "Thanks for the great review! Im wondering if yoga 710 would have such a  **huge** difference without dedicated graphics card? Im not that needy for games, just like to play world of warcraft time by time. What's your thoughts on it? ",
  "Hey man, you still got the laptop? I've had it for a few months now and I really dont like the build quality. Whenever I lift it or generally move it with one hand, or simply move the position of the screen it makes these cheap \"creaking\" noices (sort of similar to when you walk on old wooden floor , just quicker kinda). Like something you would expect out of a cheap plastic laptop. If I lift it up and \"wiggle it\" it makes these small sounds, and if I press the edge on the bottom of the keyboard/touchpad I can clearly hear and even feel it \"depress\" slightly, the metal clearly moves and is not really that stuck and solid. \n\nI love the laptop overall, but the build quality at times worries me. ",
  "The SSD is manufactured by Hynix, and all Lenovo laptops seem to have this manufacturer's components in them. Although I haven't run any benchmarks on it yet, but it seems to be at par or sometimes a bit faster than the Samsung 850 EVO I have in a separate machine, if that comparison helps. It can be easily swapped out as there's just a single screw holding it (as with all M.2 form factor SSDs). The BT and WiFi are on a single Broadcom chip and can easily be replaced as there are just the two cables and a screw holding it in place on the motherboard. I haven't had any issues with the signal and it seems to be doing a better job than the Intel wireless chip I have in my old laptop. The RAM is protected by an electromagnetic shield, which too can be removed by a couple of screws, giving access to the single DIMM memory, which I believe can be increased to a maximum of 16GB. Even the battery replacement (after some years) is extremely easy. I have opened up a fair number of laptops from various manufacturers in the past and this one scores very high on the reparability/replacement factor.",
  "I bought it from India from a lenovo retail store. I hope it becomes available from the website as well or you could try Amazon/Best Buy. \nI haven't been able to test it with any pen input, but since it doesn't come with a digitizer, I'm assuming that it won't really support any pen input, apart from the usual capacitive ones. \nIf portability is your main concern, then this laptop is fantastic, but then it's not a workstation laptop. For film editing, I suppose you could use it, but it's not the same as a dedicated desktop. I used DaVinci for editing a video and I had the free version, so it was a bit slow. I suppose rendering could be improved if I used a better software. But if your primary purpose is film editing, then I highly recommend that you wait a few days (if you can) and get a MacBook Pro. It really flies for video editing. But for all other purposes, I'd prefer a Windows machine. I hope this helps and really sorry for such a late reply.",
  "Thank you so much, I really appreciate it! For light gaming like WoW, I think the on board graphics would definitely suffice and it's not necessary to have a dedicated GPU. On the plus side, you might even get better battery life! ",
  "Hey there! I agree that it must feel really bad to see such issues coming up in such a new machine. I recently went with a friend to purchase the same laptop. When the sales rep opened up the box and started the machine, I could clearly see that there was a huge gap in the chassis, where the keyboard deck and the bottom plate meet. We refused to purchase that particular piece and walked out empty handed. Reading your experience and seeing what my friend almost bought, I consider myself lucky that I'm not facing any such issues. I'm frequently asked if I'm facing an issue with the fan being constantly running even at idle, but that too doesn't happen. Are you facing this particular issue too? \nHappy new year! ",
  "Dude every single thread I read about this laptop there you are, saying the same thing over and over and over again. Get over it. Move on with your life, jesus. ",
  "Thanks for the detailed reply! I think I'll get this whenever I save up enough.",
  "Happy new year to you too! Damn, glad to hear your friend was able to check the laptop before you purchased it! Seems like Lenovos quality control is extremely tacky. \n\nI sorta want to try to get my money back, but I guess the sales rep won't see my issues, especially not in a busy store with a lot of sound so they won't be able to hear the noises anyway. I mean, it really ain't something \"wrong\" as in the product still works, but it is annoying and obvsiouly a fault at production. The problem with getting my money back is that there is no other laptop in that price range that is as good as the 710 has potential to be.  I live the look, size, feel and speed of the 710. Too bad the build quality isn't as good as it should be. Do you not hear any noises at all if you lift your laptop with the corner and shake it a little or when having the screen in one position for awhile and then changing the position of the screen? \n\n\nAnd yes, while I do not have the fan issue was extreme as others, it does turn on fairly quickly even when doing non-intensive tasks. Seems like my laptop also almost always uses at least 50% of the RAM too. \n\n\n",
  "I'm trying to figure of of my unit is faulty or if it simply is badly built. When I pay 1200 dollar for a laptop I don't expect it to have these problems, and need to find out of others have experienced the same. ",
  "Any time! Cheers! ",
  "Lenovo Thinkbook 14s  \n\nHello, i live in argentina and I am a computer engineering student. I will use my laptop mainly for coding and i plan to install ubuntu in a virtualbox vm.\n\nI came across the lenovo thinkbook 14s with 16 ram and 512gb storage at an excellent price. I was wondering if anyone here has tried it and knows if it is good.\n\nMy top pick was a thinkpad x1 carbon but due to importation problems in my country they only have the 8gb ram version and the price is almost twice as the thinkbook 14s'.\n\nI saw on some reviews that the display is a bit dim so I want to know your comments on that.\n\nWhat about the battery? How long does it last?\n\nThanks :)",
  "I've had my 13S for about a week now and battery has been ridiculous. Very happy with it. I could imagine that the 14S has similar or bigger battery. Check to see what CPU you have, if it's the i7 10th gen - it should have even better battery life than what I have (i7 8th gen)",
  "Thanks for your answer friend. orderer the 14s a week ago so im looking forward to trying it :)",
  "I bought it yesterday and somehow exploded! What a pity!",
  "OP, how has your initial experience been with the laptop?",
  "Amazing. First day of use and everything is awesome. If you have any questions just ask!",
  "Lenovo Thinkbook 15 G2 ITL vs IdeaPad Gaming 3i (15\" Intel) I am looking to help buy a laptop for my girlfriend. Our budget is around £650 but we could go to £750 if needed.\n\nShe has recently started making youtube videos so needs something to edit on and I found these two laptops:\n\n&#x200B;\n\nLenovo IdeaPad Gaming 3i (15\" Intel):\n\nCost: £650\n\nProcessor: 10th Generation Intel® Core™ i5-10300H Processor (4 Cores / 8 Threads, 2.50 GHz, up to 4.50 GHz with Turbo Boost, 8 MB Cache)\n\nStorage:  256 GB M.2 2242 SSD\n\nRAM:  8 GB SO-DIMM DDR4 2933MHz\n\nGPU:  NVIDIA® GeForce® GTX 1650 4GB GDDR6\n\n&#x200B;\n\nLenovo Thinkbook 15 G2 ITL:\n\nCost: £700\n\nProcessor:  11th Generation Intel® Core™ i5-1135G7 Processor (4 Cores / 8 Threads, 2.40 GHz, up to 4.20 GHz with Turbo Boost, 8 MB Cache)\n\nStorage:  512GB SSD, M.2 2280, PCle Gen4x4 NVMe, TLC\n\nRAM:   16GB (8GB Onboard+8GB SoDIMM) DDR4 3200MHz\n\nGPU:  NVIDIA® GeForce® MX450 2GB GDDR6\n\n&#x200B;\n\nWhich would be a better choice or do you have any other suggestions?",
  "The IdeaPad Gaming is a better choice. RAM and storage can be upgraded down the road if needed. Also, I highly suggest the Ryzen 4600H or 4800H variant, it has superior performance. Helped my gf choose her laptop, and bought the IdeaPad Gaming you mentioned, but with the 4800H and I can tell you that it's a wise choice in that price segment",
  "Lenovo ThinkPad T460 vs Lenovo T460p vs HP ProBook 650 G2 Hello,\n\nI have 3 laptops to choose from:\n\n1) HP ProBook 650 G2\n\n2) Lenovo T460p\n\n3) Lenovo ThinkPad T460\n\n&#x200B;\n\nWhich one you would choose and why?\n\n&#x200B;\n\nThanks!",
  "Hi,  HP ProBook 650 G2  will be fine option. I am using HP Probook series laptop as well that's why suggesting you this. Happy Shopping.",
  "Question: Lenovo Legion Y740 (15\") or MSI GE75 (17\")?  I am going back and forth on which laptop to get. My goal is to find a good gaming / everyday / photoshop laptop. Both of these laptops are similar in price and are about the same size and weight. The specs are below. I have been looking at every review I can find and I just cannot make a decision. I see pros and cons for both of them. Would love to hear opinions. Thanks in advance.  \n\n\nMSI GE75 Raider 10SF  \n\n\n* 10th Gen Intel® Core™ i7-10750H Processor 2.6GHz\n* 32GB DDR4 2666MHz RAM\n* 17.3\" FHD (1920 x 1080) 240Hz 3ms Display\n* 8GB NVIDIA GeForce® RTX 2070 SUPER Graphics\n\nLenovo Legion Y740  \n\n\n* 9th Gen Intel® Core™ i7-9750H (2.60GHz, up to 4.50GHz with Turbo Boost, 6 Cores, 12MB Cache)\n* 32GB (16GB + 16GB) DDR4 2666MHz\n* 15.6\" FHD (1920 x 1080) IPS, anti-glare, NVIDIA® G-SYNC, Dolby® Vision HDR™ 400, 144 Hz, 500 nits\n* NVIDIA® GeForce® RTX™ 2070 with Max-Q 8GB",
  "MSI",
  "[REVIEW] Lenovo y740 17'' (i7-8750h - RTX 2080 Max Q) Hi ! My review of the Alienware M15 was appreciated on this sub, so I though why not do one for the y740 ? I'm a little late, but the i7-8750h and the i7-9750h are pretty much the exact same, so it doesn't really matter which one you get in my opinion, except 9th gen has better temps and just a tiny bit more performance !\n\n&#x200B;\n\nSame as the m15, I purchased this laptop with my money and I'm not sponsored or anything.\n\n&#x200B;\n\nLike my previous review, I'll split everything in categories, and if you want benchmarks I'll answer, but there's enough in my opinion so I won't do all of them. This is my second unit, as I had to return the first one due to a faulty battery, and both have the same performance, so I think any y740 with these specs should be expected to perform similarly.\n\n&#x200B;\n\n**Build quality & design**\n\n&#x200B;\n\nI really like the design and build quality, this laptop is made of aluminum & plastic (mainly the raised back is plastic, but it's sturdy and very convenient, that's a smart cooling solution) and it look very professional, it doesn't have a ''gamer'' aesthetic. The upper lid has decent flex but it feel fairly sturdy (sturdier than the Alienware m15 at least).\n\n&#x200B;\n\nKeyboard is decent, I read some people dislike it but it's good for me, feels like any membrane keyboard. The touchpad is fine, it's fairly big so you have room to move and I like the addition of physical buttons, many laptops don't have that and for me it's a negative.\n\n&#x200B;\n\nThe laptop has 1 NVME m.2 slot and one 2.5'' HDD/SSD slot. Nothing much to add there, I personally changed the NVME SSD to a 1tb one (came with a 256gb for me) and the 1tb SSHD for a 2tb SATA SSD.\n\n&#x200B;\n\nCooling is very good, it only has 2 heatpipes from what I could see, but it somehow keep the laptop cool, probably due to how open the back and side are, there's room for good airflow. It's also super light (for a 17'' laptop in my opinion), which is impressive and might explain why they went with less heat pipes.\n\n&#x200B;\n\n**Cooling**\n\n&#x200B;\n\nLike I said above, the cooling is great, CPU stays below 80c when fan ramp up and the GPU is not suffering from thermal issues either. Even with 2-3 hours of AIDA64 extreme, the CPU stays at around 77c. This is with the latest BIOS update, while it disable the option to ramp up the fans to max, I like that you can now choose what ''performance'' mode you want easily without going into lenovo vantage.\n\n&#x200B;\n\nUndervolting didn't really change temperatures and since it was already cool enough I didn't bother, but you could probably cut a few degrees by doing it with throttlestop or another program.\n\n&#x200B;\n\n**Performance**\n\n&#x200B;\n\nFor me performance are very good, I'm getting around 8200-8400 on 3dmark TimeSpy benchmark, and this is with very few tweaking (one of the benchmark: [https://www.3dmark.com/spy/7072459](https://www.3dmark.com/spy/7072459) ), the card has a decent room for overclock and Lenovo didn't put the power limit super low like other manufacturers, which allows you to almost match a desktop 2070 or 1080 in performance, considering the price this is great value in my opinion. The laptop also has G-Sync so you can play any titles at 1080p-144fps no problems, and if you have drops G-Sync will compensate for that and you won't notice the FPS drops.\n\n&#x200B;\n\n**Battery life**\n\n&#x200B;\n\nWith the hybrid mode you can expect around 5 to 6 hours, without hybrid maybe 2 hours at most. It's nice that even with G-Sync you ge to disable the GPU to save battery life, I think lenovo is the only manufacturer offering this. Don't forget to turn off hybrid when gaming however because you're losing some performance when G-Sync is disabled.\n\n&#x200B;\n\n**Conclusion**\n\n&#x200B;\n\nIf you need a great value laptop with good performance, the lenovo y740 is an amazing option, however lenovo doesn't have 0 interest financing like Dell (where I'm at least) so while you pay more for the Dell, you could consider this. The warranties are a LOT cheaper with lenovo however and customer support was good when I needed them. \n\n&#x200B;\n\nIf you're looking for a ''gaming'' laptop I think the y740 is really hard to compete with for other brands.",
  "Lenovo goes through a 3rd party to finance in US. Just pay it off before 12 months and you won’t have to pay 20% interest.",
  "That Time Spy score is seriously impressive!",
  "Lenovo ThinkBook 14s reviews Does anyone have any experience with the Lenovo ThinkBook 14s? I'd appreciate a small overall review of what the keyboard is like, it's strengths/ weaknesses, etc.",
  "I know this is entirely missing the point of your question, but in case you haven't seen this, it might answer some questions (it's for the smaller 13s)\n\n&#x200B;\n\n[https://www.notebookcheck.net/Lenovo-ThinkBook-13s-Laptop-Review-A-Business-Laptop-but-no-TrackPoint.428235.0.html](https://www.notebookcheck.net/Lenovo-ThinkBook-13s-Laptop-Review-A-Business-Laptop-but-no-TrackPoint.428235.0.html)",
  "Lenovo Legion Y740, MSI P75 Creator or Gigabyte Aero 17? Hi there!\n\n&#x200B;\n\nim a young architect who likes to game from time to time, and im looking to upgrade my **5 years old MSI GS60-2PC** (i7-4700HQ, GTX860M) with a budget of **1500-2000€ in Germany**. I will use it for **casual gaming** (Total War Three Kingdoms, Assassins Creed Odyssey, Cities Skylines, Planet Coaster, Fifa 19...) -right now with low settings but would like to try high/ultra for 2-3 years at least - and for personal architecture projects which involves **2D/3D modelling + renderings** (Autocad, Photoshop, Rhino, 3DS Max + Vray, Revit) and some video editing with Premiere.\n\n&#x200B;\n\n**Expectations: i7-8750H/9750H, RTX2060-2070Max-Q, 16GB Ram, 512GB SSD, +3h battery for movies (not gaming),and a nice cooling system. If possible 17\" in compact size body and <2.5kg**\n\n&#x200B;\n\nAfter a long research im doubting between:\n\n&#x200B;\n\n**Lenovo Legion Y740** \\- cheapest (1600€ RTX2060, 1800€ RTX2070MaxQ), i7-8750H/9750H, 17,3\" FHD IPS 90% sRGB 144Hz Nvidia G-Sync + Optimus, realy nice cooling system, big size (412.6 x 304.9 x 23mm), a little heavy (2.8kg), bad battery (max. 3h),  backlight bleed issues**86% notebookcheck** [https://www.notebookcheck.net/Lenovo-Legion-Y740-17ICH-i7-8750H-RTX-2080-Max-Q-Laptop-Review.410791.0.html](https://www.notebookcheck.net/Lenovo-Legion-Y740-17ICH-i7-8750H-RTX-2080-Max-Q-Laptop-Review.410791.0.html)\n\n&#x200B;\n\n**Gigabyte Aero 17** \\- expensive? (price unknown - july), nice specs, 17,3\" FHD IPS 100% sRGB 240Hz,  middle size (396 x 270 x 21.6 mm) and weight (2.5kg), bad temperatures und noisy?\n\n**87% notebookcheck** (little brother Aero 15 Classic XA) [https://www.notebookcheck.net/Gigab...0H-RTX-2070-Max-Q-Laptop-Review.420747.0.html](https://www.notebookcheck.net/Gigabyte-Aero-15-Classic-XA-i7-9750H-RTX-2070-Max-Q-Laptop-Review.420747.0.html)\n\n&#x200B;\n\n**MSI P75 Creator** \\- expensive (RTX2060 2000€ or RTX2070 Max-Q 2500€), 17\" FHD IPS 100% sRGB, RTX2060 or RTX2070 Max-Q, compact size (396.1 x 259.5 x 18.95 mm) and light (2.25kg), good temps + good battery\n\n**89% notebookcheck** (little brother P65 9SF) [https://www.notebookcheck.net/MSI-P65-Creator-9SF-i9-9880H-RTX2070-Max-Q-Laptop-Review.422968.0.html](https://www.notebookcheck.net/MSI-P65-Creator-9SF-i9-9880H-RTX2070-Max-Q-Laptop-Review.422968.0.html)\n\n&#x200B;\n\nSo the MSI P75 Creator wins in compact size, weight, battery and better color reproduction in comparison to the Lenovo Legion Y740...but it costs approx. **+500€** ...is it worth it? Also considered the Razer blades, TongFang GK7CP7S/Recoil III/Mech 15, Asus, etc, but not interested on them for different reasons.\n\n&#x200B;\n\nSo after the long analysis just 3 questions:\n\n\\- Which one would you recommend me?\n\n\\- Will the **+2GB VRAM** of the RTX2070 Max-Q help in the future 3-5 years while playing next-gen games or for 3D Modelling? or does the RTX2060 offers a better value?\n\n\\- When is it expected the new **Intel 10mm CPU** to be released? still 2019? could the wait worth it?\n\n&#x200B;\n\nMany thanks for your help!  :)",
  "Even though there hasn't been reviews of the P75 and Aero 17 yet, there's a few things I can tell you:\n\nAll three laptop models you've listed have 90-100% sRGB coverage so their color reproductions are very similar. \n\nThe Aero 17 will have the largest battery at 94 wh and hence best battery life compared to the other two. (Both MSi and Lenovo models have \\~80 wh). \n\nThe new Aero 17 also has a different chassis and much better cooling compared to the Aero 15 Classic XA you just linked. \n\nThe P75 creator is the lightest however that's because it uses a thin aluminum casing like the P65, GS75/65. \n\n2070 Max-Q performs only slightly better than a laptop 2060 but the extra 2 gb may come in handy in the near future. \n\nAero 17 will have a fixed webcam on the base and has a shutter for it.\n\nBoth the Aero 17 and P75 have fingerpint sensors.\n\nP75 is a more mature looking variant of the GS75 (exact same chassis but the GS75 is cheaper due to lack of fingerprint sensor).\n\nLenovo constantly has sales for their laptops on their websites which includes the Y740. \n\n&#x200B;\n\nTo answer your questions if I were to make an immediate choice I would go for the Y740 however I personally would wait until the reviews have come in. The 2060 is obviously a better value as of now and you should expect intel's 10nm cpus within the next year or 2.",
  "What would be the better buy? I want to get one for my school work but I'm not sure which is better, all help is appreciated!",
  "So...  \nThe Acer one will run smoother cause [the CPU](https://www.techpowerup.com/cpu-specs/processor-n150.c4109) can boost a bit faster (0.2 GHz) and its windows 11S not 11 Home  \nBut on the HP Build Quality might be a little bit better.\n\nEither way i wouldn't buy either, performance will be horrible on both.  \nAt that budget i'd buy a used laptop.",
  "Thanks for all the helpful information, I'm gonna end up waiting till Christmas and asking my parents to help out and try and get something around 600!",
  "Neither of them 4 GB of RAM is useless in 2025 and they have the lowest end processors. You'll probably get triple the performance going from a $300 computer to a $500 one.",
  "https://ebay.us/m/IJXfIu\n\nGo used, something like this. Has a 1 year warranty, and will be much better, I got a more modern model, same difference though. 4gb will not cut the chut, 16gb will hold you over for a while .",
  "I would get used for this budget",
  "Latitude for 200€, Akku for 30€\n\ni7 8th Gen z.B",
  "You don't want to use an N100 or N150 for productivity.  Those are great processors for media transcoding, but if you try to use them for everyday use, you'll be sorely disappointed.",
  "I wouldn't recommend either. 4GB or ram is pretty much only enough for running windows 🙄\n\nI wouldn't go for something lower then the i3 either.\n\nIt is going to be slow from the beginning and probably useless in 1-2 years.\n\nWell black Friday is here soon so you might get a great discount on sometimething useful.\n\nIf not maybe try to find a deal on something used ?\n\nWhatever you are going to do good luck 😁",
  "Nope buy a used lenovo",
  "Neither is a good buy considering the processor very small 128GB SSD AND low 4GB memory.\n\nI would suggest a used/refurbed lenovo buiness class laptop that has com off lease.",
  "300 can get you a Chromebook that will last longer and run way smoother that those 2 laptops. Also with better battery life and android support which means you can download apps from the plays store",
  "https://a.co/d/i0fusoy",
  "I wouldn't recommend any of those for productivity, especially if they are Windows machines. Those specs (intel N100 / N150 4GB Ram) is not going to cut it. Those specs are better suited for Chromebooks. If you want a Windows machine, I would go the used route.",
  "[dellrefurbished.com](http://dellrefurbished.com)",
  "Ask the amazon AI what the best laptop for your budget is and then tell it that it did a shit job and do better then take the best one it gives you which will probably be a hp elite book 845 g8 and see if it can’t do better",
  "Any recs? I can't spend a lot on a computer (only have 300 saved up from like 6 months)",
  "You'll get a good deal for 600 thatll be smooth in most school tasks and last a long time , but if it's emergency you can buy used ThinkPad anyday ",
  "FYI $600 is more than you need to spend. I got my used Thinkpad T16 for less than that, and I work in tech. You dont need a ton of performance, you need reliability!\n\nI'd personally say between $400 and $500 is the best bang for the buck budget at the moment, but thats really just a preference thing given the current offerings at that range.",
  "Please consider a used thinkpad, anything below ~1000 will not be able to compare build quality wise.",
  "Since he doesn't plan on doing any gaming and this is for school and media, a chromebook is a great choice and will run 100x smoother than windows 11. He can get a good Chromebook for 300",
  "Hmm maybe for Christmas then, because it comes up to like ~500 (prob should've mentioned I'm Canadian)",
  "Get a used ThinkPad if they're available and are not expensive in your country ",
  "This is the best deal you'll get for under 200\n\nhttps://ebay.us/m/g4N34t\n\nThis is at least 10x faster",
  "Does it need to be a laptop?",
  "My advice? Get used, don’t get new, new laptops are overpriced, get something second hand, see if you can find anything above 10th gen, if not don’t settle below 8th gen, try and look for an i5/i7 or Ryzen 5/7 with decent ram (12-16GB+) and ssd storage (512gb+)",
  "600 can get him a good thinkpad p73 or precision 7750.",
  "Just look around thats just one example, you could settle with an i5 and half the storage and ram and it would still be a better choice than those new ones",
  "Yep used thinkpad or precision.\n\nJust got an used precision 7530 wint a 6 core xeon 32gigs of ram a quadro gpu and 4k screen for 170usd on ebay and it would run laps arround that thing.",
  "That is an awesome deal",
  "Yeah definately ,but I meant if his budget is 300 , only a ThinkPad is a sound choice and I agree to u/inkeeper_77 (I don't know how to mention on reddit like discord) that 400-500 is enough",
  "Pay attention to what generation processor it is all the stupid processing numbers don’t mean shit the prices also don’t mean shit they’ll charge you $1000 for a Zen two CPU if they can get away with it don’t let them do it to you use ChatGPT and the Amazon ai in between the two of them, you should be able to find the best thing for your budget",
  "Lenovo vs HP for multitasking I’m starting a new job soon and am having trouble picking between these two laptops. My job (attorney) involves heavy multitasking and multiple monitors (3-4). I’m looking at these two laptops below and would appreciate some advice. I’m looking at Best Buy specifically. My firm is paying but I want to be respectful of cost. I’d also be open to any suggestions for monitors in the 100-200 range. \n\nhttps://www.bestbuy.com/product/lenovo-yoga-7i-2-in-1-16-2k-touchscreen-laptop-intel-core-ultra-7-155u-with-16gb-memory-1tb-ssd-storm-grey/JJGYCX6PWR\n\nPros: Lots of Positive Reviews, Lenovo is a trustworthy brand, good specs\n\nCons: I won’t be using the 2 in 1 feature, several reviews mention the screen having a lot of glare for when I use it without a monitor or as an additional screen.\n\nhttps://www.bestbuy.com/product/hp-17-3-full-hd-laptop-intel-core-i7-16gb-memory-1tb-ssd-natural-silver/JJGH2YK4ZP\n\nPros: Anti Glare Screen, good specs, large screen when I use without monitor. \n\nCons: HP as a brand is a bit of hit and miss in my experience. \n\nEdit: I’ve looked at the thinkpads as well but unfortunately all of the Best Buy’s near me don’t have them in stock and I’m on a bit of a time crunch. I’m going through BB because I have their premium membership which includes free geek squad repair/support. \n\nDoes anyone have any advice on Dell? I’ve used the latitude 3520 for the past three years through my old job and it’s worked well. \n\nEdit 2: Any thoughts on this Dell Laptop?\n\nhttps://www.bestbuy.com/product/dell-15-6-2k-touchscreen-laptop-intel-core-i7-1355u-2023-16gb-memory-1tb-storage-carbon-black/J3K4L6J6ST",
  "Never buy any hp essential series (no name)",
  "Get a Lenovo Thinkpad T or P series with 32gb ram  and their docking station.",
  "Ditch the consumer-grade laptop, a man of your stature should get a business-grade laptop. I'm talking about thinkpad.\n\nWhy? While consumer-grade laptop would be usable for 2-3 years, business-grade laptop are good investment for 5 years. And, on-site support.\n\nTry looking for thinkpad T14 series or X1 carbon.\n\nPerhaps P14s with a dock for monitor is a great option for you.",
  "Yoga , absolutely not , it will not last long. Look into a Lenovo Thinkpad T series , it will last your YEARS , upgrade comparability, durability,  portability if you invest in T14. I can’t stress enough how overpowered this laptop is.",
  "I also work in law and will tell you a little secret: people in the upper echelons of this field only use Lenovo",
  "If you aren’t gonna use the 2-in-1 feature, why not just get a Lenovo Thinkpad? Not sure that Best Buy’s deals on them are that great atm but they’re great for work and very durable. Between these two you listed I’d get the lenovo 100% especially at that price, but you can get a thinkpad for like $900 with 32gb ram",
  "Get the X1 carbon  gen 13 aura edition \n\nOr the t14s gen 6 Intel \n\n\nGood battery life, light, good build",
  "Of those two, its the Lenovo. [A fuller choice here. ](https://smbtech.au/features/best-laptop/)",
  "So I went on to take a look at the BB site for offerings and it is...abysmal. \n\nNothing decent at that price point besides 2-in-1s that are *meh* at best. \n\nPersonally I'd suggest getting whatever is inside of your price point and has a good warranty. Both Lenovo and HP in the \"lower\" tiers will have some issues/ failures so brand loyalty won't get you far.\n\nIf you can, consider springing for an ARM laptop (unless some software doesn't allow for it) as they're usually far more superior battery wise. Otherwise; choose for specs/ ports and price/ dimensions (carrying around a 17 inch is not as easy if you'll be out and about)\n\nDon't go below 16GB RAM, pick any modern CPU and...good luck.",
  "Never buy a HP laptop is my experience",
  "I'm also a lawyer, but when I think of 3-4 monitor set ups, I think of financial applications and bloomberg terminals. If your employer is restricting you to a single PC (as opposed to a desktop and a companion tablet/laptop), I recommend you get *any* Lenovo Thinkpad L or T series or literally any HP Elitebook. (HP's Elite line has the same reliability and long term support as the Thinkpads). 16 gb RAM will be enough. Unless you expect to be dealing with video files (I regularly get 100's of gbs of body camera footage to analyze each month), 512gb storage should be enough. \n\nYou will want an external blu-ray burner so you can archive/back-up your files and for sharing discovery with outside counsel. As far as monitors, I suggest you get a single 32\" or larger display. If you somehow need more screen real estate, you can leave the screen open on the PC when it's docked.\n\nAs far as a dock, get a Thunderbolt dock, so you have a single cable going into your laptop that includes power.\n\nSince you're buying this for firm work, have the firm just spec and order it from HP or Lenovo. That way you can also get it configured with a 5 year extended support contract that includes on-site support by an HP or Lenovo technician and *accidental* damage protection.",
  "3-4 monitors... I would get a Dynabook. HDMI + 2 type C ports, neither of which are the charger. You can connect 3 monitors while charging it.\n\nIf not that, the Lenovo for sure. Connect a docking station and/or chainlink DP for the monitors.",
  "check this out, lovely laptop - \n\n[https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C](https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C)\n\nAnother pick - \n\n[https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z](https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z)",
  "For Monitors - \n\nFHD 24 inch - [https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252](https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252)\n\nQHD 27 inch - [https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW](https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW)",
  "For multitasking and connecting to multiple monitors, I would be looking into a higher spec machine. Lenovo is a good brand. Make sure you budget another $200 - $300 for a good quality docking station.\n\nBut for your profession and your needs, you should be looking at $1,000+ machines that are geared towards business use.",
  "You're better off buying I used Lenovo T-Series off Craigslist or Facebook or local computer shop. Should be able to find a decent one in the $200 range. You're not really going to need any support on the thing unless someone throws it down the mountain.  I may even have one of those left at home to sell, but I won't be back from my business trip until next week.\n\nFor using three to four monitors with the laptop, you're going to need a thunderbolt docking station. And I would also suggest getting monitors that have DisplayPort Daisy chaining capability.",
  "Dell latitude, Lenovo thinkpad and HP elite book",
  "Are they imposing a price limit?\n\nYou don't need to go crazy but you shouldn't be getting cheap junk for something you're going to rely on every day for work.\n\nI'll leave aside any commentary on how insane it is that a law firm would be okay with client materials being on random PCs (well, I guess I won't, but that's nuts).",
  "this is the only answer",
  "Which one's better?",
  "I second this, also Thinkpads last way more than 5 years",
  "think pads are in there own category.",
  "Which T14 though my issue is that each laptop line has so many variants??",
  "What do you think the chances are that their offerings improve for Black Friday?",
  "Another Option in FHD - [https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G](https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G)",
  "P=Performance. Workstation class. \n\nT is their traditional, main line.",
  "i say that depends on budget , i have a refurbished $200 one that i’m very happy with. \n\nI was planning on getting another $300 G2 version for Linux conversion.",
  "Sorry I haven't got the slightest clue since I am far from the US, was just offering some tidbits in general",
  "Thank you",
  "If I prefer something that's more lightweight, should I go for the X1 instead? I don't care to need to upgrade any of the specs because I'd rather buy a new one in a few years.",
  "Any thoughts on the Lenovo Ideapad 300 17\"? I've been looking at a new laptop, I normally go for budget desktop replacement type ones, and this stood out to me. I can't find hardly any reviews on this model though, which makes me a little gun shy. \n\nAnyone have any thoughts about it?",
  "[deleted]",
  "Thank you for the input - there are actually several models of it out there, but the one that I am looking at (https://www.amazon.com/Lenovo-Flagship-i5-6200U-802-11ac-Bluetooth/dp/B01MDPLX5M) has 8gb of ram, and is just a little under $500. \n\nIs the 1600x900 on it that bad? I was slightly puzzled about it myself. Thanks for the help.",
  "The resulting pixel density on a 17-inch screen will be a little over 100 ppi, which is certainly usable but will probably look a little blurry. Plus the real-estate you have for applications is uncomfortably low.\n\n[Taking a look at the review here,](https://www.notebookcheck.net/Lenovo-IdeaPad-300-17ISK-Notebook-Review.163437.0.html) it looks like a TN panel, so don't expect good colors. It's not a bad machine per se, but you could do better with the same money.",
  "Need a laptop for returning to school I have a few options but really just need help deciding which one. I don't need anything fancy, just need something for online courses and communicating with professors and peers. Really have no idea which to choose out of the ones pictured. All are within my price range. Please help!",
  "From these second one no contest",
  "Easy, AMD HP - if you're only looking at those 3. You want to avoid Celeron and anything aside from an SSD for your drive. Anything running on a memory card, or hard drive, is usually low quality",
  "If you have to have one of these three the second one is best, stay away from Chromebooks due to application compatibility and RUN away from intel Celerons. I do, however, recommend continuing to shop or spend a little more and get something better.",
  "If you are going to get that. May I recommend this?\nhttps://www.bestbuy.com/site/sku/6549066.p?skuId=6549066\nA little more and you get much faster laptop, fast ssd and more capacity, replaceable ram\nNice ips display. Also touchscreen. Comes with windows 11, It is not 2in1 but I think you get lot more nice features at similar price range",
  "I guess the 17inch Ryzen system. But this is like choosing who’s the best QB on the NY Jets. 17 inch is a back breaker but the other ones are slow.",
  "Avoid celeron and pentiums from intel get a ssd and at least 8gb of ram",
  "It (Chromebook flex) does look good. I did see at Walmart USA has an Acer 315 Chromebook at 199. It looked extremely nice re screen and keyboard.\n\nThey had an Acer Aspire 3 with Intel i5 12 Gen for $400 too.",
  "Definitely don't take Lenovo flex. I had a flex 4 and it has the worst build quality ever. Things started breaking apart under an year",
  "Really depends on what you’re doing. But I would recommend the HP Ryzen, the Ryzen CPU is my favorite and bang for your buck.",
  "Hp 100% - 8gb RAM, AMD ( normal cpu instead of celeron ) and Vega graphics, that is better that Intel HD",
  "Good thing to keep in mind when getting laptops is never consider laptops with pentium or Celeron processors",
  "At this price you can get yourself an excellent used Lenovo thinkpad like the T470, it’s the vest vaue for money you can get at this price range",
  "Number 2  shits on 1 and 3 any day def get it",
  "2nd one absolutely for just school work/light work",
  "Second one without a doubt. It has the best processor and has Windows instead of ChromeOS with what you can do a lot more stuff with than ChromeOS.",
  "If you can, consider getting a refurbished ThinkPad T480/T480s off eBay or Amazon, for example. They are buisness laptops and far more powerful than any of these, plus will have much better keyboards, can be upgraded fairly easily, and will have far better build quality.\n\nThe Chromebooks are very limited and have not great hardware. The HP is not good quality, however has a decent CPU.\n\nPlease avoid all 3 if you can, however if you *must* choose from these 3, then the HP will likely be your best bet.",
  "https://progamerstech.com/product/asus-vivobook-15-laptop-15-6-fhd-1920-x-1080-display-intel-core-i3-1215u-cpu-intel-uhd-graphics-8gb-ram-128gb-ssd-windows-11-home-in-s-mode-quiet-blue-f1504za-as34-2/\n\nAvoid those 3, This is much better",
  "The hp windows, chromebooks are actually terrible and arent worth what theyre sold for",
  "youre not experienced, just ask more friends with help or youre chosen wrong laptops",
  "A Chromebook? No. My 6 year old school laptop will outperform 1 and 3 and it performs terribly. For 2, 8GB of RAM is OK but is becoming obsolete (even for lightweight use) as the years progress. I would recommend splurging a little and getting at least 16GB of RAM if you want it to last more than a couple years. Your price range, even though you're in college, is not quite sufficient in the year 2023.",
  "Emmc is garbage tier",
  "one on the left and right is ewaste, avoid, useless garbage. middle is good budget option",
  "Chromebooks don't deserve to be called laptops",
  "From these, the HP with the Ryzen processor. Avoid chrombooks like the plague for schoolwork. Also, the storage is significantly better and much more worth it",
  "Hp",
  "Hp eyes closed",
  "Please stay away from Chromebooks. Speaking from experience. Grab yourself a nice Windows laptop, such as the second picture",
  "#2. by a long shot",
  "Can you spend a bit more non of these are great number 2 is the least worst one. Look for a machine with attest a core i3 or ryzen 5 ideally a core i5 or ryzen 5, for intel core no older than 12th gen  and amd ryzen no older than 5000 series, 8gbs of ram and if you can 16gbs and 256gb of storage and a 1080p screen, this will find you a decent laptop for the described tasks which should last 5 to 7 years assuming it well looked after.",
  "The HP with Windows 11 and a Ryzen 3",
  "Go with the Ryzen 3 with full windows, nothing against chrome but windows all the way.",
  "Get the HP for sure but I would reinstall windows and use Winaero to clean it up. Mine has a 4500U and 8gb RAM and runs like a dream. I use it for my school audio engineering job as well.",
  "Is this a joke? The sexond one is an obvious win.",
  "The second one because its NOT a chromebook. Plus its a better laptop anyway",
  "Number 2, but try to see if you can get 16gb of ram instead of 8",
  "Man thank you all SO much. Y'all really came through for this clueless gal. I haven't thought about or bought a laptop since 2011, the last time I attempted to go to school lol. I truly appreciate all of your comments. I'm going to either go with the HP in the original post or possibly this one:\n https://www.bestbuy.com/site/hp-envy-2-in-1-15-6-full-hd-touch-screen-laptop-amd-ryzen-5-7530u-8gb-memory-256gb-ssd-nightfall-black/6535748.p?skuId=6535748\n\nGoing to Best Buy after work today!",
  "Disregarding my opinions on the brand, the HP one. So much more power and utility for not a lot more",
  "Clear here. Unless you're fine with an OS that will run a small selection of not that bad but apps, slow unreliable little storage and a cpu that time-traveled from the 2000s, you'll pick the second one. HP\nThe value for money is 0%-200%-0%, the first and third don't justify the money",
  "Gotta pay real close attention to these two acronyms: xxGB eMMC  compared to xxGB SSD.  An eMMC will make you hate the thing. Miserably slow.\n\nBoth of these are not that rugged. Are you careful with your stuff? You say \"professors\" so you're headed to college not high school I assume. Then it's probably OK to get that HP. If you think you need something tougher, you can get off-lease refurbished Thinkpad T or X series from Lenovo that can be slammed around in a backpack a lot more than the two pictured models.",
  "But why do you need a 17 inch laptops to school? Dont you wanna go with 12-14inch?",
  " avoid a chromebook at all costs",
  "The HP has terrible cooling and build quality while the Lenovo has worse specs, both suck",
  "Buy the second one it has a great CPU for the price and will suit your school needs flawlessly, the Ryzen 3 in that laptop is very capable and can get programming, other schools stuff or more demanding stuff like light gaming done at 60 fps",
  "2nd no contest\n\nwhy the fuck do chromebooks have such a big price hike for such terrible performance",
  "The HP blows those Chromebook out of the water. Definitely get the HP while it’s on sale bro",
  "Ryzen 3 over Pentium and especially over a Celeron.",
  "Might I suggest finding a refurbished laptop from a reputable business. Often times you can find quite a steal. I recently got a laptop with an intel i7 16gb of ram and a 512gb ssd for around $150.",
  "Honestly i’d go second hand. These are pretty bad",
  "Never get a chromebook, you’ll regret it later, and in the long run will cost you more. Go with the HP Amd. Its a bit more up front but It’ll last much longer and be much better for general use like streaming, schoolwork, video calls etc.",
  "I’d get an iPad unless you really want a laptop",
  "If you can I'll always recommend the late 2013-2015 MacBook pros. can easily get one for under $300 on ebay with 16gb of ram and an i7",
  "100% the second one. The first one is a Chromebook (they're awful) and the third one would have been okay if the year would still be 2010. The second one isn't particularly incredible either, but for the price it's really good and should perform pretty decent, even in some older or indie games.\n\nOh, and it has an SSD and not eMMC. eMMC is terrible in both speed and lifespan. You can be extremely happy if it lives for longer than 2 years and the r/w are like 100-400 MBs, whilst an SSD has at least 500 r/w.",
  "Maybe controversial but if you just need it for online school stuff get the Chromebook. Cheaper, performant even on dubious hardware because of a light OS, and guaranteed updates for a while",
  "Do not buy a Chromebook",
  "Also the HP has a 3 year refundable(if not used) accident warranty. After you turn on the computer, you can buy it through HP Support Assistant under apps; click on warranty and it will give you options to get the HP Care Pack.",
  "I agree with this. Get at least i3 or ryzen 3 and higher. Anything above 10th gen i3 or after ryzen 3000 is fine. Only some pentium are acceptable, but most are slow.\nAnd at least 8GB ram ( I really like 16GB though), and ssd is a must\n\nAnd IPS display. Oh my I hate TN laptop display 😒",
  "Not really talking about the processor but can't you just install Windows on those Intel Chromebooks?",
  "$220 off, OP your not gonna see a better deal than this",
  "For a new laptop this is very good for its price, hope OP see this",
  "I actually just bought this exact laptop, it’s been great!",
  "I bought a 15iwl with an i5-8265u for $1000 4 years ago and it was shit",
  "Lenovo flexing",
  "How tf they would call it a laptop if it's even slower than most $150 Android phones?",
  "T480 is much more powerful than the T470 and as such will likely be a better choice in the long run. That being said, we daily a T470 and it's a excellent laptop so a T470 is still a great choice.",
  "I wouldn't go with this, it only has a 128gb ssd",
  "Bro what do you think he is doing here",
  "He can just buy another 8GB stick of RAM for about $10-$15 during Black Friday. Upgrades take about 5 min",
  "Well do be careful with that hinge because HP stands for hinge problems.",
  "out of these 3 the second seems the best :)",
  "Pentium Gold might be okayish though, but i3/Ryzen 3 is miles better.",
  "I’m sure there is a way, but Chromebooks normally have less powerful specs, so you’ll be stuck running Windows sub-optimally, and you’ll likely have a bad time",
  "It's a HUGE pain in the ass. You have to open it up and remove a screw to get rid of write protection, then flash a new BIOS. Not suitable for anyone tech-illiterate",
  "You can, but it takes a lot of effort, you have to boot into developer mode (after that point you have to press ctrl + d on startup every time) then disassemble the chromebook, either boot the chromebook without the battery or take out a chip, Unlock the bootloader with a script, then get a USB stick and install windows on the chromebook",
  "Can you?  Maybe.  Should you bother not a chance.  Your looking at maybes at best more often then not they use arm processors which have awful support, and unlike the MacBooks they have no way to run x86-64 code.  Their motherboard are often locked down as well.  (Windows 11 won’t even run right on 4gb of ram either)",
  "It depends.   \nThere's a firmware for many Chromebooks, but that only really guarantees that Linux will run.",
  "The Intel Celeron is the reason you can’t install Windows on it. The CPU is so damn weak it can’t run windows. \n\nI work IT and just had someone complaining about how their computer keeps freezing. Turns out having two open Microsoft edge tabs and a single tab in outlook for emails maxed that CPU out at a constant 100%. Trying to attach anything to an email would freeze the entire computer for like 2 minutes. \n\nIntel celeron is worse than an i3 from 2012. And Windows 11 is so bloated with BS (maybe 10 as well, I haven’t fucked with any since 8) that a CPU from 2012 can’t run it at all. CPU’s from like 2017 struggle.",
  "Quite literally lol. The palm rest and the screen both opened up",
  "[deleted]",
  "If the motherboard supports it then yes you are right",
  "Reasonable 🤔",
  "So looks like it's extremely lockdown? Geez, I thought it's just some laptop with Linux on it, so I assume you can change it easily. (Since you know, ChromeOS is based on Linux).",
  "I've tried my friend's laptop two times (two different friends, two different laptop, but the same Celeron N4020) and Jesus Christ it tooks ages to open File Explorer and the goddamn Network Switcher. The same goes to my (another) friend's laptop with AMD A9. Like geez, how can you guys survive with this kind of crap?\n\nSometimes I hate the fact that I'm still stuck with i5 6th Gen from 7 years ago. But sometimes it also makes me grateful because my laptop is still far far faster and smoother than my friend's newer but crapper laptop.",
  "Not really, an i7-2600 from 2010 runs W11 pretty well with an SSD",
  "the Celeron isn’t the reason. it’s the locked down BIOS + UEFI incompatibility. Windows 10 runs on my dual core 1.6GHz desktop AMD processor and it ran on my old HP Stream with a Celeron N3050 (2.16GHz). newer celerons are *much* better, but still mostly garbage.",
  "Yep I've had a few build quality problems with lenovos over the years, once my grandma picked up my thinkbook from the edge of the screen the entire bezel and hinges came off luckily the screen was ok. The build quality is definitely a bit inferior as compared to hp or dell imo.",
  "Yea, but that's probably an extra 70 dollars on top for a decent 512gb drive",
  "Most motherboards these days support a minimum of 16GB-32GB RAM. I'm confident he'd be fine and that it comes with one stick of 8GB - stock",
  "It's a whole process. The system itself is on two separate write-protected signed partitions that are swapped out on every update. To even get to any semblance of a shell you have to wipe all your data and put it in Developer Mode (which conveniently adds a self-destruct button and an annoying beeper to every boot)",
  "[deleted]",
  "For a excellent 1TB NVMe SSD, you can expect to pay about $60.",
  "Yeah I think you’re right.",
  "Since he's looking for under $350 there's decent chance the MB only has soldered RAM without slots for extras. Especially the Chromebook-style. I would rather get a deal on used Lenovo Thinkpads/Dell Latitude/idk the HP business brand equivalent at these price point.",
  "Geez, what's the reason behind all of this? They're really sure that people's getting locked on an OS which is just a more advanced version of Android lol.",
  "It's also windows in s mode which is bad",
  "🙏",
  "I can almost guarantee you that the AMD HP has at least the ability to expand RAM. Sorry, but I'm not here to argue about something I never said or hypotheticals",
  "I mean, I don't think there's a Chromebook in existence that has had malware worse than a rogue Chrome extension. That's great news for schools.\n(especially since dev mode can be disabled by enterprise)",
  "See [the chromium is doc on security goals](https://chromium.googlesource.com/chromiumos/docs/+/master/security/chromeos_security_whitepaper.md#principles-of-chrome-os-security).   \nIt really comes down to making any user aware of any modifications, and having to reset the device and perform first-time setup and look at a warning screen is a great way to do it.",
  "You can turn it off though.",
  "Fair reason I should say"
]