[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Lenovo yoga pro 9i Aura Edition (Tandem Oled) They just released it, and it looks stunning with its Tandem OLED display, 1,600 nits peak brightness, Ultra 9 285H processor, RTX 5070, and up to 64GB of RAM. It’s like a dream Windows machine.\n\nHowever, why are they still not using anti-reflective coating on their laptops? It doesn’t seem like there will be a matte option for this one either. They claim it's designed for bright environments, but if you're working with a dark-themed interface, the glossy display turns into a mirror.\n\nApple offers a nano-texture option on the MacBook Pro, even though their standard glass already has an anti-reflective coating. Their mini-LED panel is also incredibly bright, yet they acknowledge glare as an issue—just like Lenovo, which provides matte displays on many of its laptops.\n\nSo why isn’t this laptop following the same standard?\n\n",
  "Cuz antireflective coating looks like ass",
  "Just ordered one. Delivery expected in early August though. I am in Canada.",
  "I can’t find it online. Do they have a release date yet?",
  "Any idea when this might be available?",
  "this tandem oled panel seems to be in 2025 legions too right?  too bad they arent as cute as zephyrus and razer (which still use old panel lol?)",
  "Will there be a 14\" version ?",
  "How much power does the gpu have?",
  "The new tandem model is now listed on the Australian Lenovo website. The \"basic model\" has a price tag of AU$3,999 ( Intel® Core™ Ultra 7 255H Processor and 2.8k 120Hz OLED). If you want the 3.2K Tandem OLED then it only comes wih the Intel® Core™ Ultra 9 285H Processor which is an AU$800 additional cost over the Ultra 7 255H.\n\nSo if you really want the tandem OLED display it is AU$5,400 which is an additional AU$1400 just to get the tandem display.\n\n[https://www.lenovo.com/au/en/configurator/cto/index.html?bundleId=83L0CTO1WWAU1](https://www.lenovo.com/au/en/configurator/cto/index.html?bundleId=83L0CTO1WWAU1)",
  "Regarding anti-reflective coating, both the touchscreen models of 2.8K and 3.2K OLED displays ARE anti-reflective. The other two non-touch models are not.\n\nIf you want a glossy screen on a laptop, it is always worth going for a touchscreen model because the anti-fingerprint layer also has built in anti-glossy + anti-scratch resistant feature.\n\nAlso, tandem OLED on Lenovo laptops is absolutely stunning in person.",
  "I could not agree more.  The Dell XPS, starting with 7590 (that I know of) has one of the best OLED anti-reflective treatment.  The recent HP Spectres use the Corning Gorilla DX, which is an anti-reflective variant.  The difference is night and day.  It helps the OLED display work much better and reduce the mirror effect.  \n\nIndeed, the Galaxy Book5 Pro has it too, but the specs are not up to par.  If in fact the Yoga Pro 9i with tandem/touch is like a mirror, that would be a real shame.  I do not know why manufacturers are not including anti-reflective glass.  I'd gladly pay more for it and do not buy computers that don't have it due to my use case.",
  "Hello, I'm torn between the Yoga 7 Pro with an integrated GPU, Ultra 9 185h, and Ryzen 9 Ai 365, and the Yoga 9 Pro with an i7 13705h and discrete GPU, RTX 4050. I won't be gaming much; I'll be using programs like Autodesk, Matlab, and Unity. Which one do you think I should choose?",
  "Did you check galaxy book",
  "On the contrary, they look much better when there is any sign of reflection.  They actually make the computer usable.  I've compared my many OLED laptops side-by-side.  Those with anti-reflective treatment, like the ones with Gorilla DX glass, simply look superior.",
  "🎉",
  "Im thinking about it.  Has everything I want and coupon codes too :)",
  "Yes they are launching in June globally except north america",
  "The earliest will be June if you are not from North America.",
  "I have not read about any other laptop using this panel and reaching this much brightness. Dell has a tandem oled but they have capped the brightness to 400-500 nits. Lenovo might cap at 700 nits or maybe fully unlock upto 1000 nits. Battery life is a concern with high brightness.",
  "Not at all. 14 inches are other variants. You can check them [here](https://news.lenovo.com/pressroom/press-releases/expanding-boundaries-ai-powered-creativity-productivity-and-innovation/)",
  "The specs are totally not out yet.",
  "No matte options wow",
  "hella expensive man",
  "I am very sure touchscreen models have no anti-reflective coating. Matte option is available in non touch model.",
  "I'll know in a few days, but nowhere was I able to find in the specs that the tandem touchscreen is anti-reflective.  I have had several touch OLEDs that do not have anti-reflective.  Their specs show all four display variants use the Dragontrail Glass, which in default format has no anti-reflective.\n\nAre you saying that you have/have seen the tandem touch and compared to a non touch version and the touch obviously has anti-reflective treatment?",
  "the best is I believe is integration of anti-reflective displays in supply chain is still an issue and of course cost is a factor.",
  "Yea Galaxy Books come standard with anti reflective coating and they look amazing.",
  "How much discount per your coupon?",
  "when will north America get ?",
  "And later in the US?",
  "Check the new lenovo legions and in descrivtion it says pure sight true black 1000 so it should be the same tandem oled but nobody speak about it ?",
  "Hi Ok-Algae4024\n\nI was expecting around AU$4,000 which is not unreasonable for a Macbook Pro competitor. However, for my applications the Ultra 9 285H processor is overkill. In fact, the Ultra 7 255H is more than I need. Unfortunately, they have \"bundled\" an $800 extra (Ultra 9 285H) if you want to get the 3.2K Tandem OLED display. I will wait for the reviews WHERE ARE THEY! before I decide if the Tandem OLED is really worth the extra $1,400.",
  "It does. I have the laptop, Yoga 7 16 but with the same OLED touch.",
  "I don't kow about non-touch tandem oled on the Yogas specifically, but I've used several non-touch regular OLED laptops from Lenovo and Asus before which had no coatings. The yoga pro's reduction in reflection is about 40% as effective as a typical Macbook's LCD display. So not quite on the level of a really high-end glossy monitor.",
  "I think it's their patented tech and Lenovo would rather just give an option of matte display than integrating that tech into their supply chain.",
  "Pretty sure june. It's already listed on best buy. As usual, north america will not get the 5070 and 64gb ram variant.",
  "Yes for North America it is scheduled to be launched in the second half of the year.",
  "I don't know where you are getting that info from.",
  "Are there any other windows laptops that are considered MacBook Pro competitors - and out of interest, what makes this model to be one?\n\nI could see details on the Lenovo site about a haptic trackpad etc.",
  "Can you post a review",
  "Hi tinybn\n\nI cannot find a Yoga Pro 7  16 with a tandem OLED display on the Lenovo (US) website. The only model advertised with an Tandem OLED display is the Yoga Pro 9 16 (Part Number 83L0CTO1WWUS1).\n\nCould you please supply a link to the Yoga Pro 7 16 which has the Tandem OLED display.",
  "I just got the Yoga Pro 9i Aura with tandem OLED and touch options.  It is a mirror--just as, if not more reflective than my other most reflective OLED laptop.  Putting it next to a Spectre 16 with Corning Gorilla DX, it is night and day.  The Spectre, though still has some reflection, is very subdued.  The Yoga shows my face and every light source behind me.  Again, this is with tandem and touch.  From my view, there is no anti-reflective treatment whatsoever.  U.S. model.",
  "Per their specs, Lenovo uses the Dragontrail glass, which has an anti-reflective variant.  Corning Gorilla DX would have been another option.",
  "It's not patented, Samsung uses Corning DX. Its basically brands cheaping out by not going for Corning DX. Corning also has DX+. This tech has been available for YEARS.",
  "oh okay cool",
  "[deleted]",
  "Are you sure? The articles I see online say March or Q2 2025?",
  "swear i've seen true black 1000 but now when i check it says true black 600, 500 nits brighnrss\n\nlmao. XD",
  "I really like it. I specifically wanted the Tandem OLED and it's great for watching HDR content after calibration. And unlike the Yoga Pro 9i which has 275H, the Yoga 7 has a 17watt low-power CPU that gives it much longer battery life. I get 8-9 hours browing multiple tabs. \n\nMy only gripe is 4 key rollover across Lenovo yoga series. 120Hz and Intel ARC grapgics are all great for playing high FPS games, except the keyboard doesn't register multiple presses very well.",
  "I am from Europe. In the US, the same display should be available on select models of Ideapad 5 Pro laptop.",
  "[https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb4#tech\\_specs](https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb4#tech_specs)\n\n  \nUK website",
  "Was is bad enough to return it ?",
  "https://www.bestbuy.com/site/lenovo-yoga-pro-9i-16-3-2k-oled-touchscreen-laptop-intel-core-ultra-9-processor-nvidia-geforce-rtx-5060-32gb-ram-1tb-luna-grey/6617152.p?skuId=6617152",
  "[official press release ](https://news.lenovo.com/pressroom/press-releases/expanding-boundaries-ai-powered-creativity-productivity-and-innovation/)",
  "I mean can you make a video about reflectivity and post it on subreddit if it's not too much of a hassle for you.",
  "It was for me. Huge difference from my Spectre and XPS. I really liked the tandem OLED but not enough to offset the mirror.",
  "Nice find!",
  "FYI - The press release says \"Glass / Matte\" for the Pro 9i\n\nHope it's true... Though I've never heard of a matte OLED... have you?",
  "Yeah my thoughts exactly, thanks a lot for inside.  2024 mini led isnt bad at all and I picked it over G16 but its still  pretty much useless outside even at full brightness so tandem or not tandem if it acts like a mirror  its not worth the hassle.",
  "ThinkPads have matte oled and mini led laptops are matte too. This tandom oled is gonna be matte too. Yeaa!",
  "Expect all the options outside of US. Inside US probably just garbage base configurations lol, that's the way it goes with Lenovo.",
  "It's a shame because the panel is beautiful. I do not understand why manufacturers are not using anti reflective glass. Lenovo has anti reflective on some thinkpads so obviously they see the value in it.",
  "ohh really? which ThinkPad exactly?",
  "haha I've noticed that in my worldwide hunt for my perfect spec! \n\nWhich country do you think gets the most options & has the best pricing?\n\nPS - for some reason i seem to see a lot of Pro 9i users from Norway!?",
  "X1 carbon gen 13 aura edition",
  "User-Review: Ninkear A15 Pro The Ninkear A15 Pro has been updated with more current hardware this year. Its predecessor was equipped with an AMD Ryzen 5 6600H. The 2025 model uses an AMD Ryzen 5 7430U. Read my review here to find out how the device performs.\n\nhttps://preview.redd.it/pyf9pncxu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=1fd25bbdde81ba27af2fd5169b47bd3c9aa17f05\n\n**Design and workmanship**\n\nThe Ninkear A15 Pro retains a straightforward and unobtrusive design. The housing is made of aluminum alloy, which contributes to a solid feel. The surface is matte and resistant to fingerprints. The workmanship is appropriate for this price category, with clean edges and fits. The hinge still allows the display to be opened up to 180 degrees, which makes it more flexible to use and gives it stability. Weighing often less than 1.8 kg and with a slim design that is 20 mm thick, it is also easy to transport.\n\nhttps://preview.redd.it/pd5aceszu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=58e8e1ef90e4b8338a011ab2802ff609941dbe25\n\nThe base is made entirely of aluminum and can be easily removed after removing 11 Phillips screws.\n\nhttps://preview.redd.it/ti7foey1v9ef1.jpg?width=1280&format=pjpg&auto=webp&s=4025e49254415ed35592f152584bd31cda7ac101\n\n**Display**\n\nOne feature of the Ninkear A15 Pro is its 16-inch IPS display. It offers QHD resolution (2560 x 1600 pixels), which enables sharp display of text and images. The brightness is specified at 400 nits. The color space coverage in the sRGB range is 99-100%, making the display suitable for multimedia content, light image editing, and office applications. The 120 Hz refresh rate supports smooth display.\n\n**Performance**\n\nInside the 2025 Ninkear A15 Pro is an AMD Ryzen 5 7430U with a TDP of 15W. These CPUs offer balanced performance and energy efficiency. In conjunction with 16 GB DDR4 3200MHz (one module) and a 1 TB NVMe SSD connected via PCIe 3.0. Daily tasks, multitasking, demanding office applications, and basic image or video editing can be performed smoothly. The integrated AMD Radeon also allows you to play less demanding games at moderate settings. Fortnite runs in Full HD at around 60FPS on the lowest settings.\n\nhttps://preview.redd.it/6ivvbzf5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=f9b5fc6852f21829cc49bbf8164cc7fcd4732269\n\nhttps://preview.redd.it/dg3ne1g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=55fabe070c429c1b00cb2d3a64cced24cedbf1a9\n\nhttps://preview.redd.it/lbno40g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=569979cb24136170fa055d0d9d9b90cd404af375\n\n  \nThe built-in PCIe 3.0 SSD is from a manufacturer called TSWC, which I am not familiar with, and I can't find any information about it on Google. The temperatures remained constant at 44°C.\n\nhttps://preview.redd.it/ye3nhzr7v9ef1.png?width=1012&format=png&auto=webp&s=e5999ee43785995c0cbd9fa02de490d00be345bd\n\nhttps://preview.redd.it/xjv4vxr7v9ef1.png?width=724&format=png&auto=webp&s=7c3d062da74b8645bc1cb25153738289b9630cab\n\nThe performance in Crystaldiskmark is also acceptable. However, the SSD was only 19% full. With an almost full SSD, the situation can be quite different. With inexpensive SSDs, transfer rates can plummet.\n\nSince I don't have another PC or laptop with a 6-core (and 12-thread) CPU, there is no comparable model here. The closest thing I have is an AMD Ryzen 5800H in my Lenovo Legion, but it has 2 more cores and is therefore always faster.\n\n\n\n|Benchmarks|Ninkear A15 Pro|\n|:-|:-|\n|3D mark Timespy (complete/CPU)|826/4390|\n|Cinebench 2024 (single/multi)|55/348|\n|Fortnite 1920x1080 Performance Mode all low|58FPS|\n\n**Input devices and connectivity, scope of delivery**\n\nThe keyboard of the Ninkear A15 Pro is backlit and offers a pleasant typing experience with good key travel and a clear pressure point. The keyboard itself has an ANSI-US layout, and no other layout is available for purchase.\n\nhttps://preview.redd.it/f4wb1oynv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=da8d3e7ca926567506df4725b2c054188998060b\n\nThe touchpad is a comfortable size, responds precisely, and supports Windows multitouch gestures without any problems. The fingerprint sensor is located in the upper left corner of the touchpad and works flawlessly with Windows Hello.\n\nUnlike the Ninkear N15 Pro, which I also tested, the two touchpad buttons are quiet and do not make a loud clicking sound when pressed.\n\nConnectivity is comprehensive: the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support, plus three USB-A ports (USB 3.0), an HDMI output for external monitors, a 3.5 mm audio jack, and a micro SD card slot. For wireless connections, there is Wi-Fi 6E and Bluetooth 5.3. On my 5GHz Wi-Fi, the laptop connects at 866 Mbit.\n\nhttps://preview.redd.it/5p6vvneqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=316d28c48d3bb1dd8dda8447db11fc5bdf8f2f23\n\nhttps://preview.redd.it/yqqx8geqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=a8f0a5d9d59398a2e469fb0ece00bcc616028516\n\nIn addition to the Ninkear A15 Pro, the package includes a 65W USB-C power adapter, a very simple, inexpensive wired mouse, a small mouse pad, and stickers for the keyboard to customize it to your preferred language.\n\n**Battery life and cooling**\n\nThe battery life of the Ninkear A15 Pro is adequate thanks to the energy-efficient AMD Ryzen processors. With moderate use (office, browsing, streaming), 6 to 7 hours of use are possible, making it a companion for the workday or longer university sessions. The cooling system is barely audible during normal operation. Even under load, the noise level remains low, and the case only heats up in certain areas, but remains very inconspicuous overall.\n\n**Upgrading**\n\nThe RAM can be upgraded as there is one slot free. The built-in RAM is from a manufacturer unknown to me called Gofatoo. It will be very difficult to find a second identical RAM module. If you plan to upgrade the RAM, buy two 16GB modules from one manufacturer.\n\nhttps://preview.redd.it/3f0wg3ktv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=c8b2596f11b270335be8260aea8e08d583b44df4\n\nThere is also a second NVME SSD slot in which a second SSD can be installed. This is also connected with PCIe 3.0 x4.\n\nThe Wi-Fi module is also located in an M.2 slot and can be replaced if necessary.\n\n**Conclusion**\n\nThe Ninkear A15 Pro (2025 version) offers a good balance between price and performance and is aimed at those who are looking for a notebook for productivity, multimedia, and occasional gaming. For students, home office users, and anyone who needs a reliable all-rounder, the Ninkear A15 Pro (2025) is a good option. The price in the company's own online shop is currently around €570. The device is shipped from Germany. Unfortunately, I cannot say anything about support and/or warranty issues.\n\nThanks to Ninkear for providing me with the device for testing.\n\n\n\nBest regards, hugoLOST",
  ">the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support\n\nAre you sure the USB-C supports DisplayPort? I don’t see it mentioned anywhere on their website or on aliexpress",
  "Yes",
  "I only connected one Display",
  "Both",
  "Both",
  "Is whole body aluminium? Are hinges mounted well?",
  "Is factory installed system full version and legal ?",
  "Got the same laptop. There's a red watermark in the top right of the screen, but I don't understand how to remove it. If I take a screenshot it doesn't show. Any idea? Thank you in advance.",
  "How bright is the screen? 350 nits is true?",
  "Do you is it possible to buy battery for this A15 Pro model?",
  "Yes, I tested it. But not at the same time",
  ">So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?\n\nto this?",
  "Yes, but you tested the two USB-C ports for display support individually or only one of them? And you tested it in a USB-C to USB-C connection, right? Thanks again.",
  "Last question, USB-C to USB-C, USB-C to HDMI or USB-C to DisplayPort? Thanks!",
  "?.. There are 3 options",
  "Only the bottom and top cover",
  "Yes, an no virus or spyware is installed.",
  "Can you post a picture, mine doesn't have that.",
  "Yes. For inside with with the Laptop it's enough",
  "So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?",
  "How would you know?",
  "Thank you for your reply brother. I took a pic with my phone. [https://ibb.co/F4GTrggn](https://ibb.co/F4GTrggn)",
  "I searched with different tools",
  "Maybe it's a screen foil. Or the wallpaper",
  "It was the screen foil. 🤣\nThank you so much my friend",
  "No problem",
  "Am I about to make a mistake? Lenovo Yoga Pro 7i \nhttps://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nWHY AM I LOOKING AT IT?\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. Presumably that'll eek more time out. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\nWHAT AM I WORRIED ABOUT?\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? \n\n\nSecond thing is overheat potential. Without reviews on this specific configuration, seems a risk the ultra 9 285H might get SPICY. I presume I can maybe manage this by reducing power in the settings...",
  "Idk about this model specifically as I'm researching a 2in1 to purchase, why are all the Lenovo 2 in 1's so much more expensive than their pro counterparts?? My local retailers won't even stock them as their price is just absurd.\n\nAlso, because these brands make multiple laptops of the same format with different specs, usually have to look at them as a whole, then the changed specs individually. Look for reviews on the yoga/yoga pro (compared to other brands, some great reviews and minimal complaints), then make sure the cpu is good.",
  "Hmmm. Interesting. What region are you in? I'm in Victoria Australia and here it seems like the 2 in 1s are pretty affordable, they just use the less heavy duty specs (Vs instead of Hs). \n\n\nBut yeh that's kind of what I've had to make do with RE reviews. Kind of gettins the vibe of similar names and judhing it off that. My exact thoughts on it. The complexity of the seemingly similar but not quite same laptop models with different nearly the same name and completely different specs has made the review space completely fucked to navigate hahaha.",
  "Im in QLD, I should have clarified for the same specs, the 2in1's are more expensive. Currently I'm trying to find specs for a version JB hifi sell but Lenovo have removed completely from their website. Of course they do that and JB don't specify.",
  "To be fair JBs laptop prices are uniformly atrocious hahaha. They charge amounts for specs that are several tiers below what that price point should provide. I think their target market is mostly people who know nothing about computers haha",
  "That's true, but jb for at least one of the models is the exact same price as Lenovo website, without the 3-5 week wait.",
  "Yeh they sometimes might be ok generally, but i notice A lot of the lenovo website prices themselves are inflated. \nLike the one I posted is apparently 40% off, as are other ones im considering which are slightly less speccy, full price of 3.2k or so. But the literal same laptop at a retailer like HN or Office Works is like 2.3k full price. \nSo lenovo website on sale is a genuine sale price but not on sale they're wildly expensive.",
  "Am I about to make a mistake? Lenovo Yoga Pro 7i https://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\n\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? ",
  "It seems quite expensive for having integrated GPU. Maybe you can also check out some options with more favourable prices, such as [this HP OmniBook X Flip 2-in-1 for 1000 usd](https://www.bestbuy.com/product/hp-omnibook-x-flip-copilot-pc-16-3k-oled-touch-screen-laptop-intel-core-ultra-9-32gb-memory-2tb-ssd-eclipse-gray/JJGH2Y9TPC). It has CPU Intel Core Ultra 9 288V, integrated NPU with 48 TOPS, integrated GPU Intel Arc 140V, 32GB LPDDR5X RAM 8533MHz, 2TB SSD, 16-inch OLED 2.8K 120Hz touchscreen display (with practical 16:10 aspect ratio, 500 nits brightness), backlit keyboard, and Windows 11 Home.",
  "That's 2300 AUD not USD.\n\n\nI don't think that's available here, Australia. Price for what I can tell is equivalent here is circa 3k aud.",
  "You're right. Sorry, I didn't pay attention.",
  "Lenovo Yoga pro 7i aura vs Slim 7i aura. Hi. I want someone to help me decide between these two models. After reading many reviews i decide to go with intel version instead of Amd. The touchscreen variant bother me that can be extra reflective ( oled + touchscreen =  like mirror). Any advice will be appreciated. ",
  "very reflective",
  "Pro = better performance \n\nSlim = better battery \n\nDepends what you value the most.",
  "I was in between the same as well but ended up going with the ThinkPad X9 for just under $1200. Seems like a much more solid build. Contact support and they an help ensure the best price give discounts.",
  "New Lenovo Chromebook Plus 14 Review: The laptop for most people This is my review of the new Lenovo Chromebook Plus 14, which has been hyped up as the “supreme being” of Chromebooks thanks to the new MediaTek Kompanio Ultra chip. I’m just a regular tech nerd who loves Chromebooks but can still look at things objectively, especially when something costs close to $800. This is an honest review, no marketing fluff of just reading the specs. I do reviews as a hobby because I genuinely love tech and enjoy spreading the gospel.\n\nWhile I was overall impressed, I think this machine is overhyped, mainly because of the chip. It’s not quite ready for the big leagues in some areas. I’m coming from using devices like my Galaxy Tab S9+ with the Snapdragon 8 Gen 2, which **EATS UP** anything I throw at it (AI, photo/video editing, multi tasking, video calls). That’s my dream: give me that level of power from a Galaxy Tab S series in a Chromebook with a great keyboard with zero compromises.\n\nSo here’s my category breakdown after using the Lenovo Chromebook Plus 14 for a week, alongside my trusty daily driver, the [HP Chromebook x360 14c](https://www.aboutchromebooks.com/hp-chromebook-x360-14c-first-impressions-great-build-quality-in-a-smallish-high-performing-package/) (i3/8GB RAM), which is still a beast since 2021.\n\n**-----------------**\n\n# 🔧 Build & Design\n\nThe Lenovo is thin and light, but solid. It gives off premium MacBook vibes in build quality, especially when typing. It's so light, it almost feels like a dummy unit, but clearly isn’t. It definitely feels like the next generation of Chromebook hardware.\n\nOnly downside? The bottom is plastic, so it lacks that full premium unibody feel. But unless you’re carrying it around a lot, it’s a non-issue. People mentioned keyboard flex but I didn’t experience any in daily use. And I’m a weightlifter and former lineman with 10.5-inch bear paws. I only got flex when I intentionally tried to flex the keyboard by pressing hard.\n\nThe hinge is firm, you can’t open it with one hand, but once open, it holds its position perfectly.\n\nCompared to the HP 14c, the Lenovo is a little longer and wider but way thinner and lighter. My HP is a full aluminum tank, it’s been a champ for years. The Lenovo feels like it’ll hold up, but its lighter build will need to prove itself over time.\n\nhttps://preview.redd.it/7cx1remd5ugf1.jpg?width=3946&format=pjpg&auto=webp&s=88fc512c4967fd3d9b6ea3b537f575ffb690dff4\n\nhttps://preview.redd.it/8m1a8ard5ugf1.jpg?width=3924&format=pjpg&auto=webp&s=efab4b1846b64e7727b72556ddd716a9c3daaf11\n\nhttps://preview.redd.it/cdn5xkwd5ugf1.jpg?width=4000&format=pjpg&auto=webp&s=665327d55e809b4a4685834ce4593af80b4fe985\n\n**Build Grade: A**\n\n**-----------------------------------**\n\n# 🔋 Battery Life\n\nLet’s be real: I never got anywhere near the advertised 17 hours. But that’s OK, because I still got a solid 9–10.5 hours under heavy, real-world use:\n\n* 20–30 tabs open\n* Zoom app + Teams (web)\n* YouTube music streaming\n* Constant typing\n* Screen at \\~70%\n\nCompared to my aging HP, which lasts about 4–5 hours now, this is a major win. For comparison, the [HP Dragonfly Pro ](https://www.aboutchromebooks.com/hp-dragonfly-pro-chromebook-review-the-pixelbook-of-2023/)from 2023 with an i5 is the worst battery life I ever had on a high powered Chromebook that gave me a max of 3 hours. That thing didn’t last the weekend before it went back.\n\n**Battery Grade: A+**\n\n**-------------------------------------------**\n\n# ⌨️ Keyboard, Trackpad & Fingerprint Reader\n\nTyping on this was a breeze, even with my bear paws. No real keyboard flex during regular use. The keys feel a little shallower than on the HP 14c, but once I got into a groove, I had no complaints.\n\nTrackpad is large, smooth, and accurate, feels close to a MacBook in responsiveness. No lag, no misclicks.\n\nThe fingerprint reader? 🔥 One of the best I’ve used on a Chromebook or any computer. I tried to fake it out with weird angles and different parts of my finger, but nope, still unlocked instantly.\n\n**Grade: A**\n\n**----------------------------**\n\n# 🔊 Sound & Speakers\n\nThe Dolby-branded speakers had me hopeful, but they’re great for a Chromebook, but average overall. My HP PC from 2013 would blow these out of the water, so it's nothing special there. They do have more depth than 99% of all Chromebooks and are a little louder overall, it's still Chromebook speakers, so they are decent in a small room.\n\nThe HP DragonFly Pro was also hyped up to have amazing speakers, but again, good for a chrombook, but in real-world usage, they are just ok.\n\n**Grade: C overall | B+ for a Chromebook**\n\n**--------------------------------------------------**\n\n# ⚡ Chip & Performance: Kompanio Ultra 910\n\nHere’s where the hype train slows down.\n\nIn benchmarks (Jetstream, Speedometer), this chip was twice as fast as my HP’s i3. In real-world use? Not really. It’s only slightly faster, like a 0.5-1 second lead in page loads, even for heavy sites like ESPN and data heavy Google Sheets.\n\nYes, it wins technically.... but it was often a photo finish.\n\nhttps://preview.redd.it/erj1q9w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=e9612c64acde7e2224c924ad258d9bfc6a111dcc\n\nhttps://preview.redd.it/u0brf8w35ugf1.jpg?width=4000&format=pjpg&auto=webp&s=0cad7a55498ced4378d570f2a42a10285385f394\n\nI **ran into consistent problems** using Teams in the browser. Video calls would freeze, the screen would stutter, and it even blinked to black unless I turned off the camera. Reddit confirms I’m not alone on this. Zoom (via app) worked fine, but Teams was rough. No such issues on my HP.\n\nBut, the Mediatek chip does allow you to download ALL of THE APPS in the Play Store, which opens up the full world of Android on your Chromebook. The i3 in my HP doesnt allow that, and each day more and more apps that I could download are no longer supported, so that gives it the edge to usher in the full Android Laptop experience, as some of the apps would be better on a full-screen computer with a keyboard compared to the phone.\n\nI tried video editing on the Lenovo using my favorite video editing app on Android called [InShot](https://inshot.com/), and it temporarily presented a dream come true, to have InShot on a laptop, not a tablet with an added on keyboard, where I could edit videos comfortably on my lap. But then I tried to edit together 4 different 15-second 4k files, and that's when it went to crap fast. As soon as I added in a transition, it became super laggy and jittery, and adding in more transitions and text almost made the computer quit. So video editing on the Lenovo is not ideal.\n\n**Video editing on this is about as good as a groundhog trying to make a beaver dam; it looks like it should work, and has the same shape and characteristics, but no, it won't do at all.**\n\nAI features like background blur or object removal? Not there yet. Definitely nowhere near Galaxy S phones or tablets.\n\nMy last point about the chip is, why not use past (1-2 year old) true flagship chips that can do it all, like the Qualcomm Snapdragon 8 Gen 2 (from the Galaxy Tab S9 series)? If they are going to charge such a premium price and say it's because of the chip, bring in a true elite chip that can handle everything like AI, multitasking, video editing, and more, all at the same time, and then Chrome OS would be a monster.\n\n**Grade: B**\n\n**--------------------------------**\n\n# 📺 Screen & Camera\n\nhttps://preview.redd.it/8ualptw55ugf1.jpg?width=4000&format=pjpg&auto=webp&s=23693f067cae0fa1665c752c8052afbdcf8eb7f5\n\n\n\nNow this screen, WOW. It’s a 2K OLED panel that’s absolutely beautiful. I watched an [8K Planet Earth video on Youtube](https://www.youtube.com/watch?v=6JWxHy0C_pI&list=RD6JWxHy0C_pI&start_radio=1) and it felt like I could reach into the screen and touch it. The best screen I’ve ever seen on a Chromebook. Also, they list the Lenovo at 400 nits, but it feels much brighter than 400. I kept the screen constantly at 60-70% and that was perfect for me in all of my use cases.\n\nBUT… a few things:\n\n* Some images/web pages looked oversaturated\n* No screen tuning or adjustment in ChromeOS\n\nThe camera is also surprisingly good. Not Galaxy Ultra good, but very usable for video calls even in tricky lighting.\n\n**Grade: A**\n\n**------------------------------------**\n\n# Final Thoughts\n\nThis is a great machine and a peek into the future of Chromebooks, especially with ARM chips. The design is sleek (though I wish they offered a deep gray or navy blue), the screen is stellar, battery is excellent, and it handles most tasks with ease.\n\nFor most users who use nothing but web apps (Google Docs, Office, email, YouTube) this is more than enough. People spending $2,000 for email machines should seriously consider this and Chrome OS as an alternative.\n\nBUT… looking at the complete picture of the Lenovo Chromebook Plus 14, this would be the no-brainer recommendation of the year (for any laptop, especially a Chromebook) at $500, as $750 feels like a reach when you can get a MacBook Air for $850. If Best Buy does their normal act of putting this on deep discount after a couple of months, and this goes down to $450-550 for a new one, **run**, don't walk to get one if you need a new laptop. At that price, this is the no-brainer Chromebook of the decade.\n\n**Overall Grade: B+**\n\nMe and my bear paws are off to test the next device.",
  "This is cool, but for $800, it better deliver without hiccups. Why risk it when you can grab a MacBook Air for a bit more?",
  "I have found my LCP14 to be fast, but I think the glowing performance reviews may be a bit overstated. I get some freezing/non-loading tabs with maybe 7-10 open (some of them being Google Docs or Gmail), which was unexpected. I also noticed it can't handle 16k (4320p) videos with 60fps on YouTube—not that this is a dealbreaker by any means, but I was still surprised. I typically use that as a test for a machine's horsepower.\n\nI assume all this has to do with the ARM processor and the extended battery life, which may come at a cost. The above tasks would never challenge my HP Elite Dragonfly Chromebook, but that machine had historically bad battery life. Overall, I'm happy with the LCP14 so far, but I thought I'd add this context.",
  "This is the review I've been looking for and have been going back and forth with a MacBook Air for the exact reason on price. I don't want to switch my ecosystem so I'll wait for a sale. Thanks for your hard work!",
  "Great review, thanks a lot. Very well written and exactly what I was looking for.\n\nEdit: I have one more question. How well or poorly does the touch display respond? And were you able to test Android games on it? Did they run better or worse than on Intel devices?\n\nTwo questions. Those were two questions. Sorry.",
  "Thanks for the insightful review! One question though, as I couldn't find this information anywhere. How far does the screen open? Maybe show pictures of maximum opening angle or a value in degrees would be fantastic :)",
  "[deleted]",
  "Well for those of us who love Chrome OS, its an alternative to Windows that faster and lighter, but as you mentioned for this price, it needs to be flawless, or we can grab a MacBook \n\nLike I said, for around $500 this is great, at its current price and chip flaws I see why people are taking it back (I have seen this a lot on here)",
  "See, you are a person who has actually used the machine and not just had one tab open and is hyping the machine up.   The Lenovo is fast, but the jitters and lag it has when doing real-world stuff are unacceptable for me at that price.  As I said, comparing it to my HP Chrombook with an i3 from 2021, they are neck and neck in real-world speed tests, but the i3 never stutters with 20 tabs open, playing 4k videos, and video calling at the same time. \n\nYes, the battery life is not great on my older HP, but I never experienced any hiccups like I did on the Lenovo, just doing what we have come to consider basic things, like video calling, when the Lenovo about aborted on me. \n\nI think the Mediatek chip is ok, but it's not as powerful as they make it seem.  As I said in my review, they need to take older top of the line chips like thise from a Galaxy s tab and put it into the Chromebook so that it cna do EVERYTHING with ease, and then it will be perfect.",
  "So which one are you going to get, the MacBook or the Lenovo?",
  "Thanks, I appreciate you!!\nThe touch screen is amazing, no issues the at all and it was good to use at times for certain things but it does leave a lot of smudges on the screen. \n\nGaming I don't do, but there's a video by Lon Sibon on YouTube that he talks about gaming.  Again I'm not sure how it will hold up because the chip is not as strong as they make it seem, you can download all the apps yes, but raw power is questionable in real world use cases as I mentioned.",
  "It goes all the way flat, or 180 degrees and the hinge is very firm  \nThis is not a convertible.  But, Acer is launching a 514 chrombook plus with this chip in it next month that will be a convertible and I think they will have he chip tuned better than I experinced on this Lenovo",
  "I agree with you, and the fact that the chip was struggling with certain task makes it even worse \n\n$450-500 it's a steal, but anything above $550 is a no",
  "I'm leaning Lenovo because of the ecosystem, but the m3 or m4 MacBook Air is on sale for ~$800 and seems like it would have better longevity than what the Lenovo may have (both based on past experience). I have a Lenovo duet 5 now which I love but the snapdragon is feeling a little long in the tooth when I have more than a few tabs open.\n\nI guess my heart says Lenovo but brain said MacBook Air.",
  "Thanks a lot for the feedback! 180 degrees would be perfect for me. I got a Acer Spin 513 (the one with the previous top ARM model) which is a convertible, but it turned out I hardly use it as a tablet. 95% only as a laptop. Having good speakers is a great bonus for the Lenovo for me, as well as a bright screen. Don't need maximum power as for heavy workload I want to rely on remote desktops.",
  "Check your local best buys, in my area (SE Michigan) the Lenovo is on BB as a used excellent for $530 which is the right price point. So see if you can find one in your area for that price",
  "Unfortunately not near me but I'll keep an eye out.\n\nWhat do you think the chances of the kompanio lasting close to apple silicon?",
  "Not sure, thats a ChatGPT quesiton lol \n\nHappy hunting, hopefully you can find one soon.   I hear that they are high-end Chromebooks with Spandragon x Elite processors coming; I'm hoping they are here just before the holiday season.",
  "Ended up with the m4 MacBook air. It went on sale on Amazon for 750(!) and I can't find the Lenovo near me. Also mixed in the surface laptop for fun but the air just seems too good. Thanks again for your help!",
  "Lenovo Yoga 7 Pro vs Asus Zenbook 14 OR Lenovo Yoga 2 in 1 vs Zenbook S14 Hi, so I am looking for a premium thin and light powerful laptop with great battery life in the premium segment. I have shortlisted to 2 categories and 4 laptops which I have mentioned in the title.\nHere are some basic configurations :-\n1) Lenovo Yoga 7 Pro \n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD \n- Aura édition 8853 MT/s\n- Touch\n\n2) Asus Zenbook 14\n- Intel core ultra 9 285H\n- 3K Oled display\n- Intel arc 140T graphics card\n- 32GB RAM / 1TB SSD\n- Normal édition and less than 8853 MT/s\n- Touch and stylus support\n\n-> 3) & 4) Both have Intel core ultra 7 258V processor which I'm worried won't be sufficient for tasks such as light gaming even. \n\nPlease provide your valid inputs with your reviews and also I would consider yoga 7 Pro but it comes in a single color which I found a little bit unsatisfactory than the zenbook's looks.\nInputs are welcome! Thanks\n\nP.S. - I am going to buy the laptop tomorrow so I need quick suggestions please.",
  "I have the Zenbook 14 (mine has the 1920x1200 OLED, otherwise specs as you listed) and would definitely recommend it. In mixed use (some Youtube, web browsing, a couple hours playing 9 Kings) I've been getting 8-9 hours of screen on time out of the battery, and performance has been excellent. Battery might be slightly better or worse on Windows (I am using Debian Linux), but for the performance I think that much battery life is still mindblowing. The hardware is 100% a premium device. If I could do it over, I would buy this laptop again.",
  "Damn, but didnt you consider yoga 7 Pro cuz it has better features otherwise",
  "Been looking everywhere for someone who has this OLED! The 3k doesn’t appear to be available in the UK. Do you have the reported issues with seeing dots on the digital layer for the touch screen? Do you do a lot of reading and typing as supposedly it’s not great for that either?\nFinally, how is wifi 7 card?\nThank you",
  "I did not. The Yoga 7 Pro doesn't appear to be readily available in the US (where I live) in anything close to the spec you listed, so that takes it out of the running for me. I did find a listing for $200 more than I paid for the Zenbook, which doesn't inspire me much. Are the prices for the two similar where you are?",
  "> Do you have the reported issues with seeing dots on the digital layer for the touch screen?\n\nI don't; however, those seem to be reported by people who view a lot of white backgrounds. I just checked out a white background myself to try to look for it and I *think* I saw a little of it on a fully white screen, but frankly the sheer amount of white light was far more offensive than any pattern that may or may not have been there. With anything not majority pure-white I can pretty confidently say it's not an issue.\n\n> Do you do a lot of reading and typing as supposedly it’s not great for that either? \n\nNot sure how a screen would be bad for typing, personally - if this is re: the keyboard, I have found it to be very solid as far as laptop keyboards go. Primary use case for this for me is as a web browsing machine/capable PC on the go, but it is not my main PC. I have not noticed anything that would lead me to say it's not great for reading, though.\n\n> Finally, how is wifi 7 card?\n\nWorks well, though I can't speak to the Windows-specific aspects of it. No complaints once it was up and running (If you're a Linux user, it wasn't detected by the Debian installer, so I had to use a USB-C-to-Ethernet dongle to get the OS installed; worked fine out of the box once the OS install was complete. If you're a Windows user I am sure it will be perfectly fine out of the box.).\n\nOverall, I'm really happy with this laptop. I bought it as a secondary device as mentioned, but I could happily use it as my main PC (outside of graphically-demanding games) if needed. It's got tons of power in an extremely portable form factor with an excellent screen, which is exactly what I wanted from it.",
  "Well well it's even about a 100$ cheaper here the yoga",
  "Really appreciate you taking the time to reply, thank you.\nI think the reading/typing comment was tied to the screen in the sense of it being suitable for that type of work (coding, desktop publishing etc) vs gaming/entertainment, but I’m satisfied hearing from a real world not review world use case. \n\nI’m probably going to go for ultra 7 rather than 9 - my use case won’t really benefit from the extra power when the trade off for the power is slightly less battery time , and more heat and subsequent fan noise. \n\nThat conclusion is also formed from reviews though, so if you’ve an opinion on that I’m all ears! (I will be running Windows)",
  "I may be wrong (going off of the US website as that is where I am based) but it looks like the Ultra 7 variant is the older 155H, whereas if you want the current crop of CPUs the Ultra 9 285H is the only option; from what I was able to find the 155H and 285H get similar battery life, but you get a healthy chunk more performance with the 285H (as you'd hope). If the pricing is similar imo go for the 9. Haven't found heat or noise to really be an issue with this machine anyway (yes the fan can be heard when it's on like any laptop, and yes putting a big fat 16 core CPU into a thin and light chassis like this means the fan will be coming on regularly - that will be the case both with the 155H and the 285H, so I would not consider it a factor in purchase decisions personally). Obviously, if the 155H meets your needs and comes at a decent discount, then it makes sense to go for it.",
  "Lenovo Legion Pro 7i (RTX 5070 Ti) @ $1,999 - Worth it or wait for better Black Friday deals? Hey everyone! Content creator here looking for laptop advice. **Zero gaming** \\- this is purely for work.\n\n**My workload:**\n\n* Python automation & AI development\n* Video rendering (DaVinci/Premiere)\n* Running AI models locally (ComfyUI, Stable Diffusion, local LLMs)\n* Text-to-image, image-to-image, image-to-video generation\n\n**Current deal I found:** [Lenovo Legion Pro 7i at B&H - $1,999 (was $2,849)](https://www.bhphotovideo.com/c/product/1875948-REG/lenovo_83f5001bus_16_legion_pro_7i.html)\n\n* Intel Core Ultra 9 275HX\n* RTX 5070 Ti (16GB VRAM)\n* 32GB RAM\n* 2TB SSD\n* 16\" OLED 240Hz\n\n**Questions:**\n\n1. Is this the best deal right now, or should I wait for Black Friday proper?\n2. Anyone seen better early BF deals on comparable specs (especially RTX 5070 Ti laptops)?\n3. Considering Alienware equivalent - thoughts on Lenovo vs Alienware for content creation/AI workloads?\n\nThe 16GB VRAM on the Ti seems crucial for my AI work. Any insights appreciated!",
  "Debating between Lenovo Ideapad and MacBook Pro M4 chip I’m trying to decide if the Lenovo ($700) or MacBook Pro M4 (basically double the Lenovo) would better suit my needs (and if the Mac might be overkill). I know almost nothing about laptops.\n\nCurrently in medical school and my primary concern is being able to run large dataset computations and R for research, battery life for school/hospital in the future, Remote Desktop apps and being able to keep a lot of tabs open. \n\nI have previously used an hp pavilion for almost 8 years but struggled with the slow processing and battery life.\n\nIdeally, I’d like the laptop to last for the next 10+ years. \nOf note: I own an iPad and iPhone as well\n\nThank you for your help!!",
  "There is no debate. The Mac M4 wins by a wide margin. Highly recommend going with Air, imho the MacBook Pro is way overkill. If you do need to use Epic or some other EMR that just works better on Windows, get a second cheap thin average Windows machine to run those apps and keep things portable for you. An older Surface laptop may be a good bet for this usage.",
  "If looking at 10+ years ownership and already using apple products then macbook M4 definitely.",
  "Shitty tablet + shitty laptop 2 in 1. Wins till the first drop",
  "If the Mac ecosystem is familiar to you and conducive to getting your daily tasks done, then go for the Mac. I would strongly advise against Lenovo's 2-in-1s. I do computer repairs and these fail miserably in the hinge area. The brackets separate from the LCD cover which can ultimately lead to the display panel being damaged if not addressed quickly. Up to last week a customer contacted me to have one repaired. If Windows is more conducive then go with one of the business line machines like a Thinkpad.",
  "Samsung Galaxy Book5 Pro 360 vs HP OmniBook Ultra Flip 14 vs Lenovo Yoga 9i 2-in-1 Gen 10 Aura Edition Hi everyone!  \nI’ve been researching 2-in-1 laptops for months because I want to buy one during Black Friday and honestly, it’s been *hard*. I don’t know much about PCs or specs, so I’m hoping some of you can lend me a hand!  \n(I would love to be able to use it in uni, to keep it for a solid 5-6 years, to be able to use krita for drawing/ light animations and to do a little light gaming like vanilla minecraft and stardew valley)\n\nAfter a lot of digging, I narrowed it down to three main contenders:\n\n* **Samsung Galaxy Book5 Pro 360**\n   * **Pros:** part of the Samsung ecosystem, anti-glare display, comes with the S Pen, great battery life.\n   * **Cons:** only 16 GB of RAM available, 16″ feels a bit too big, and I’ve seen a few mentions of screen cracking? I couldn’t find many detailed reviews: almost no one seems to be talking about it, and the few reviews out there only cover the 32 GB model (which isn’t even available)\n* **HP OmniBook Ultra Flip 14**\n   * **Pros:** 32 GB RAM option, battery life, very sleek design.\n   * **Cons:** keyboard doesn’t seem great, and the audio quality apparently isn’t that good, pen not always included\n* **Lenovo Yoga 9i 2-in-1 Gen 10 Aura Edition**\n   * **Pros:** keyboard, build quality, OLED screen, 32 GB RAM, pen included\n   * **Cons:** battery life might not be as strong as the other two, and the display seems quite reflective with little to no anti-glare coating.\n\nIf anyone has real-world experience with any of these, or recommendations for better alternatives in the same range, I’d love to hear your thoughts!",
  "Lenovo Yoga Pro 7 14ASP9 Hi all\nI'm looking to buy new laptop for myself, i came across this model(32 ram, 1tb ssd, recently 9 365) it looks great to me specs wise considering it can get it for 1k euro with discount. Also i was looking at macs but they're kind of pricey, especially in want to have same storage and ram. I could not really find comprehensive information regarding battery life for this model, either reviewers say it's ok like 7 hrs, or some ppl on reddit say it's abysmal. Is there anyone here who uses it and can share some insights? Also i was thinking of running linux on it, it seems that it's quite compatible and I'm guessing l'l get better battery life?",
  "Lenovo Yoga Pro 9i 16 G10 Aura Edition Review with new 1600-nit tandem OLED ",
  "Title: 7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Says It’s a Game Changer in 2025 🎮 Hey everyone,\n\nI just read this review titled *“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025”* and thought it’d be worth sharing/discussing. (Link included below.)  \nHere’s a quick breakdown + my take — would love to hear what you all think:\n\n# 🔍 Key Highlights from the Review\n\n1. **Top-tier graphics & processing** – It leans on Intel + latest RTX (5000 series) hardware for serious gaming punch.\n2. **Stunning OLED 240 Hz display** – Crisp visuals, high refresh, rich colors.\n3. **Performance & cooling optimized** – Good thermal design (especially on a stand) helps sustain heavy loads.\n4. **Strong build quality & premium feel** – Materials and finish got good praise.\n5. **Quiet / balance modes are effective** – You don’t always have to blast full power.\n6. **Decent audio & ports** – For a gaming laptop, it doesn’t skimp too much.\n7. **Some compromises & trade-offs** – Battery life is underwhelming, smudge-prone surfaces, and the new port layout (sides vs back) isn’t ideal for everyone.\n\n# My Thoughts & Questions\n\n* This looks like a beast if you mostly use it plugged in — for gaming, video, creative work. But if you're mobile and need long unplugged sessions, the battery life sounds weak (which echoed in other reviews too).\n* The OLED + 240 Hz combo is tempting, but in bright environments, reflections may kill the vibe.\n* Side instead of rear ports is a controversial change — ergonomics over aesthetics?\n* I’m curious: for folks who’ve tried it, how is it in real-world use (noise, heat, battery wear)?\n\n**Link to full review (for reference):**  \n“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025” [mesnbot.com](https://mesnbot.com/7-powerful-reasons-the-lenovo-legion-pro-7i-gen-10-review-proves-its-a-game-changer-in-2025/?utm_source=chatgpt.com)",
  "ChatGPT review lol",
  "Lenovo Yoga Pro 7i 14 (Ultra 7-Windows 11 Home-32GB-1TB) I just bought my new Lenovo a week ago, and there are several things I like about it, but the most important ones for me, such as battery life, are starting to bother me. According to the website and reviews I've seen, the battery should last more than 8 hours with normal use for web browsing, Netflix, and so on. But every time I unplug it and it's at around 90% or 80%, it says there are 5 hours remaining. On the other hand, I started hearing metallic noises from the chassis when I pick it up or move it. I don't know if this is normal, but I'm thinking of returning it and switching to a Macbook Air. Considering that I paid €1,099 for the Lenovo, I could get the Macbook M4 for a similar price.\n\n\n\nMy use of it is quite simple for now: web browsing, multimedia, office automation. General student use and perhaps work. That's why I feel that the Macbook is a better option, considering the battery life, which is the most important thing for me.\n\n\n\nAnother thing the Lenovo has is the 3k OLED touchscreen, but I don't really use the touchpad...\n\nWhat do you guys think? Should I return mine and buy a Macbook Air 16ram 216/512 SSD?",
  "Which one did you get, was the problem there initially? Or it you faced it much later on",
  "Hi, wgich reviews did you see?",
  "How is the battery life now after 3 months, have you found any solutions to make it last longer?",
  "Is Lenovo IdeaPad pro 5 a good laptop ? So, I am a cse major and I want to buy a laptop, I researched and came across Lenovo IdeaPad pro 5 gen 10. I chose this because it has a good screen, good battery life and decent build quality as I've heard.\n\nMy use case is just jetbrains ides, vs code and lots of chrome tabs. I usually use my laptop 6-8 hours a day. \n\nSo, is this a good a laptop ? or should I look for something else ? ",
  "https://www.reddit.com/r/UnboxParadigm/s/ZpjTDEulmn\n\nThis is my review of the laptop",
  "How is it working now ? Any issues ?",
  "Its pretty good there is nothing that i would find missing that would make me want to upgrade to a more expensive laptop as:\n\nThe screen is 3K OLED 120hz so its as good as it gets and looks gorgeous irl The brightness is crazy good and HDR videos look awesome (this screen is so good that I cannot get myself to use a monitor cuz it feels far worse lol)\n\nThe performance is very good and beats the Ultra 9 185H in performance while staying very cool so i didnt feel like it was worth spending much more for Ultra 7 or Ultra 9 (cooling becomes a bottleneck and thus this wouldn't yield much higher performance too)\n\n32gb ram is plenty so i can run multiple coding software  while also playing music/videos easily (20 tabs too) This ram is also very fast (fastest in the segment) \n\nGaming performance/GPU: its pretty good as you can play GTA V and games like it at decent fps (40 to 45 on 3K and 90 on 1080p) and newer games like AC Mirage and Marvel Rivals have XESS Frame gen to help.. Although the arc 140T on Ultra 7 or Ultra 9 is superior its not a deal breaker \n\nBuild Quality: Pretty solid its full aluminium with a good amount of ports and 2 fans which keep it cool and when doing regular tasks on battery saver the fans don't even turn on so it feels like an m4 macbook \n\nBattery life: 10+ hours on battery saver (for coding/ media consumption) and 5 to 6 hours on auto while getting 2hrs on high performance tasks (gaming/video editing) This is for 3K resolution and variable refresh rate \n\nSpeakers: pretty mid and doesn't get loud (depends on the video) so unless im in a quiet room i use headphones",
  "I also like my lenovo purchase. Got the 2025 model with the 285H and 32Gb and all is ok except the speakers. I would decently rank them low to very low. I think they sound worse then the speakers of an A range samsung A50-A55 they all sound about the same. Imagine that a Samsung S23 - S25 has better bass. The speakers are good only to listen the words from any youtube review/tutorial, news etc. Any form of music will sound horrific, no matter how you would try to tune the settings and that is truly shameful cause all other things are very good for the money i have paid. \n\nPro: Full metal, oled, large battery for a 14inch, good cooling with dual fans, extra ssd slot (got 3tb on mine), hinge that goes 160\n\nCons: Speakers are HORRIBLE",
  "thankyou for this detailed info. Did you order from the lenovo site ? If yes, if i order from the site, is there anything i should keep in mind to get great deals or just in general ? Also why Intel and not ryzen ?",
  "Yo can you tell me about the power limits for CPU + iGPU on this laptop?",
  "Can you give more info about gaming ?? ( you are talking about ultra 5 225 H right?)",
  "Yes I ordered from their website (India) and i applied Sheer id student discount, Unidays 5% cto discount and EXTRASAVINGS along with with a 5% credit card cashback and 3% affiliate cashback from u/unboxparadigm \nI also removed 3 years adp which was 4k inr and added 1 year adp which was 1 inr and thus i brought the price for 1TB 32gb ram version from 92k to 76k inr\n\nI chose intel as Ryzen AI 5 and 7 are just rebadged versions of last gen with an NPU and although an NPU might be useful to get copilot plus features such as recall I don't want to sacrifice performance for a feature I may use (yes the ultra 5 225H beats the Ryzen ai 7 350) \nBut if you have the budget for Ryzen ai 9 hx 370 definitely go for it as it is more powerful than Ultra 5 and Ultra 7 while using much much less power thus giving you a substantially better battery life while doing high performance tasks",
  "Thanks for the detailed review.",
  "ASUS VivoBook Pro 15 vs Lenovo IdeaPad Pro 5i? (Both OLED) Which is the best overall laptop for heavy digital media usage for college? FYI I’ve been on team Lenovo for quite a while however I want to know whether I should stick with Lenovo or try something new such as the ASUS VivoBook 15 Pro OLED. Specs are shown in the three pictures. Wanting to try ASUS for quite a while however I’m not sure if it’s worth switching from that from Lenovo. Just want to try something new.\n\nSorry for the repost. Have to remove my shipping zip code and city for safety purposes.",
  "i’m from the uk so i have a slightly different spec to the vivobook (4060 and 16GB of ram the rest is the same) the keyboard and the screen are lovely, i’ve never had an issue with performance, i game a fair amount on it and it handles it well. I will say, the moment you do anything like gaming, it turns into a jet engine it can be unbearable but performs very well, and it has meh battery life (which makes sense since the screen and cpu is power hungry) speaking of it does run quite hot unless if you place it on a table. Long story short get the lenovo it might not seem like it but the specs are better, the new gen cpu is much more power efficient and a new gen gpu is always a good thing, you will probably still have an issue with cooling such a thin laptop",
  "Lenovo Chromebook Plus 14 Review I bought this Chromebook about a week ago from  Curry's in the UK as the top spec had a deal on for £599.\n\nMy honest opinion using it for my business is that it nails it with only one downside. \n\nI run my own business Functional Drinks Club which has bricks and mortar stores and an online store. \n\nI'm also a Fractional CMO for a UK based tech company. \n\nI hate the Apple OS and eco-system, so Macbooks are always out for me. \n\nAnd I hate how even the best window laptops can get slowed down with anti-virus software and other various plug-inside just to keep them safe while I'm working from different locations. \n\nSo, the Chromebook was always going to get my interest. \n\nWhat I mainly use it for:\n\nShopify Store Management\nMeta Ad Management\nSocial Media Managament\nG-Suite (Pro Business Account)\nSocial Media Creation (FB, Insta, Tik Tok, LinkedIn, YT) \nQuickbooks Accountant Software \nVideo Call Meetings \nCanva - Design needs\nRiverside.Fm for video podcasts and basic editinf\nHubspot CRM Management \n\nI can safely say that it nailed all of the above with aplomb, and because I like to be mobile it's the perfect laptop (not just chromebook) for my business. \n\nNote: I don't do heavy, complex video editing as part of the above.  \n\nThe only downside is that when it comes to printing shipping labels from shopify it only recognises known brand names when it comes to label printers. \n\nThere is a workaround extension for it, but it's a pain in the butt if I'm honest to get working.\n\nThat's it. \n\nI use the Chromebook as my day to day now and I'm not going back. ",
  "Review of the Tuxedo Infinitybook Pro 14 gen 9/ Skikk Green 6 AMD/ TongFang GX4IDL I bought this laptop a couple of days ago. I bought the Skikk Green 6 AMD. Short specifications:\n\n* 14\" Matte Retina 120Hz 2880x1800\n* Ryzen 7 8845HS\n* USB-C ports with Displayport 2.1 and USB PD\n* 2 x M.2 2280 Port\n* 2 x DDR4 SODIM slots\n\nThis laptop is the TongFang GX4IDL and it is imported by various companies into the EU under different names. These laptops are typically exactly the same. There could be differences between bootloaders, but I expect not. Companies differ on options like RAM, SSD, keyboards and the included charger.\n\nThese are the variants I found:\n\n* Skikk Green 6 AMD\n* [Tuxedo Infinitybook Pro 14 gen 9](https://www.tuxedocomputers.com/en/TUXEDO-InfinityBook-Pro-14-Gen9-AMD)\n* [PC Specialist Lafite AI AMD](https://www.pcspecialist.co.uk/notebooks/lafite-pro-IV-14M/)\n\nI paid 900 Euro excl. VAT and mine came with:\n\n* 1TB Samsung 990 Pro SSD\n* 32GB 4800MHz nameless DDR5\n\nFor approximately 150 Euro more there is an Intel variant available.\n\nI was in the market for a 13 - 14\" laptop with a powerful CPU and I don't need a discrete GPU. I need 32GB RAM and preferably extendable. I use the laptop mainly in the office connected to USB-C docks and I use Ubuntu. So decent support of USB-C in Ubuntu was a requirement.\n\nAt first I tried to find a Lenovo, Dell or HP, but that would run quickly up to 1500 Euro easily. For the given specifications this laptop is a great deal. The enclosure feels sturdy, little flexing and good looks. It isn't super premium, but certainly not lower consumer grade like Acer, Asus or MSI laptops around the same price point. It is not so sturdy as my previous Lenovo bricks. I dare not to lift the laptop by its screen.\n\nThe retina IPS display is beautiful, vertical viewing angles are good. Horizontal slightly worse, but both very good.\n\nI'm not  a keyboard fetishist so the only thing I can say about the keyboard is that is works well. Unfortunately Skikk only sells the ISO variant of Querty without a Euro sign on the 5. Tuxedo gives you the choice between ISO and ANSI for Querty.\n\nThe touchpad is fine, comparable to higher end consumer touchpads, not even close to Apple. Disable touch when typing is not working great in Ubuntu. I haven't looked into this issue yet.\n\nThe webcam quality is good. IR cam is available for Windows Face ID.\n\nI haven't tested battery life, but my expectations are not high. The battery is small and the CPU power hungry. In Windows the battery charging thresholds can be managed. In Ubuntu unfortunately not. This will degrade the  battery quickly.\n\nWhen browsing the web and using office, the fan doesn't spin up most of the time. When it spins up it is nicely regulated. It only spins up to full speed if you start CPU intensive tasks. The noise is acceptable then.\n\nPros:\n\n* You get a semi-premium laptop with a lot of CPU horsepower for a low price\n* 95% support in Ubuntu\n* 5 USB-ports! (of which one on the back)\n* 2 of the 5 USB ports support Displayport and USB PD\n* Almost no crapware installed out of the box\n* 2 RAM slots which fit a lot of RAM\n* Silent until you release the Ryzen 7 beast\n\nCons:\n\n* No max charge level for the battery in Linux\n* There is only one LED to indicate both running status and charging status. When charging you cannot see the running status\n* When the lid is closed the LED is under the lid and not visible, this is annoying for dock users\n* Skikk offers no ANSI Querty\n* The whole laptop feels a bit warm\n\nTo conclude, I'm pretty happy that I found this laptop. I hope that his TongFang can meet the durability of my past Lenovo laptops.\n\nI took some photos of the laptop, a photo with the webcam and photos of all UEFI boot menus. You can find these photos in [this Youtube video](https://www.youtube.com/watch?v=0lS5pbprS2M)\n\n**UPDATE after 5 months of daily usage:**\n\n* I'm still very happy with this laptop. In the last couple of months I also bought a Lenovo LOQ. The built quality of the LOQ is bad compared to this TongFang.\n* Found a weird bug: If I restart in Windows and then go into Ubuntu during startup (GRUB), then the Wifi card is disabled in Ubuntu. If I shut down in Windows and cold boot into Ubuntu, I never have this issue. So I need to remember not to restart to switch from Windows to Ubuntu.\n* The webcam image quality is pretty bad.",
  "Would have given a double thumbs up if you would have made the Skikk Green 6 AMD text linked to the specific product page ;-) ;-)",
  "How are the WiFi speeds? I read some things about Intel WiFi speeds being better then the AMD chip.\nGoing to use with Arch linux myself though",
  "Could you update how the battery life has been (please mention the OS) and how are you satisfied with the purchase after nearly a month? Any surprises? Any disappointments? Would you buy it again? Would you choose the same config?",
  "thank you for all the tests. I really like the fact that the laptop seems to be running mostly silent, but has a very good cpu if you need it. appreciate your input on this !",
  "Thank you for the review. Does the screen wobble at all, compared to your T480?",
  "thank you so much for this review, have been eyeing this brand for a while now but no recent reviews (only 2-3 year old ones)\n\n  \nwould like to ask if you noticed any performance issues previously reported with the older models - the ones previously came with a barrel DC in and optional USB-C charging, when attempting to use with USB-C charging drastically reduced the performance, however on battery or DC-in barrel charger, there were no issues.\n\n  \nand any serious complains regarding the accuracy of the touchpad and the membrane keyboard?\n\n  \nThanking you in advance!",
  "Hey, any updates on your experience after a few months of owning it?",
  "Hi, thanks for the nice review! I'm a bit late to the party, but were you able to test the quality of the microphone/speakers in meetings?",
  "Thanks so much for the review, I couldn't find any other reviews for this laptop. I'm planning on buying one to run Linux. I have a couple of questions:\n\n1. Is there a way to set the amount of VRAM in the BIOS?\n2. Can you disable \"Secure Boot\" in the BIOS?",
  "Hello, stumbled upon your post. I was wondering if your ethernet is working on Ubuntu? I can't seem to connect mine. I'm using Fedora and can't seem to activate the ethernet even on the net manager.",
  "Thanks for the pre-sales and after-sales support! Very quick and to the point e-mail responses.",
  "Missed opportunity to link it yourself in this comment!",
  "I just did a couple of speed tests. I have gigabit internet, so my internet doesn't cap out my Wifi connection. I have the TongFang and Lenovo T480 side-to-side to each other. The Lenovo reaches 270Mbit/s, the Tongfang 150Mbit/s. Tested three times on each laptop, little variation between runs. So there seems to be an issue with Wifi speeds indeed.",
  "I haven't stressed the battery yet. I use it docked to USB-C 99% of the time. Just some occasional meetings or couch usage. I will run a battery test.\n\nI am still very happy with the purchase. Only downside until now is the slower Wifi. USB-C displayport works nicely under Ubuntu, better than with my previous Lenovo T480. \n\nMy config has 1 x 32GB DDR, I would have preferred 2 x 16GB to enable dual channel. So I'm satisfied so far. No downsides for me except for the ones mentioned in my review.",
  "I did a battery test. I opened the Edge browser in Windows, opened a Youtube 4K playlist and started playing videos. Windows power mode = Best power efficiency. Battery saver disabled. Brightness at 100%. Youtube playing 4k videos, not full screen. Battery drained from 100% to 44% in 4 hours and 15 minutes.",
  "Yes it does slightly. Screen rigidity is better with the T480, which is not strange since it is bulkier and heavier.",
  "With a 65W USB power brick you achieve full performance. Keyboard is fine. Touchpad is average, no complaints.",
  "Yeah, I'm still happy. Love the performance. I recently ran into 2 issues. At its highest speed, the fan makes a high pitched noise. I only noticed it when I was using the laptop on my lap and I was probably blocking the ventilation holes at the bottom of the laptop. Another issue is when playing music at the highest volume, something near the speaker starts resonating causing the audio to sound extra distorted.",
  "I always use a headset during video calls, so not tested.",
  "1. I don't think the amount of VRAM can be set.\n2. Secure boot can be disabled.",
  "I can check this for you tomorrow.",
  "Not fancy to do so! 🙃",
  "Maybe one additional question. Can you charge it with a power supply that is not 100W (5V/20A)? Have you tried with e.g. 65W? Some laptops have a problem with that AFAIK.",
  "Not bad at all! Thank you for testing that!",
  "Thanks! Would you still say that it works 95% in Linux, or has that number changed for you?",
  "Thanks. I ended up buying one and found out that the VRAM can't be changed. I tried using Smokeless\\_UMAF, but this didn't work either (this has worked on all of my previous laptops). I guess I'm stuck for 512MB of VRAM - not that this is bad, I just wish I could bump it up a little more.\n\nI'm using two kernel params on mine:\n\n    acpi.ec_no_wakeup=1 \n    amdgpu.dcdebugmask=0x10\n\nThe first is to fix an issue where the laptop wakes as soon as it goes to sleep when the lid is left open, and the second is to make the graphics a little smoother in 120Hz mode.\n\nI've been very happy with this laptop. I'm using `tuned` (instead of `power-profile-daemon`), and can get around 10 hours of light use (just browsing the web and doing stuff in the terminal). I'm traveling with mine right now, and have been very happy with the battery life (for my use cases).\n\nI'm really loving it - just a nice little light and portable 14 inch Linux laptop, yet powerful enough to handle coding/compiling, running AVDs (Android Virtual Devices) etc...",
  "Thanks man",
  "Just tested this. It charges fine with this [65W USB-C PD charger](https://eleshop.eu/compact-2-port-65w-pd-gan-fast-charging-usb-c-adapter.html).",
  "There are the typical Linux issues you will have with most computers. For example high quality audio over Bluetooth. But aside from those issues it works perfect in Ubuntu. I'm especially impressed with the USB-C compatibility. Much better than the Lenovo T480.",
  "Its not working. I didn't do a deep dive. Network card is detected, but when plugged in it doesn't connect.\n\n  \nMaybe you can do something with the solution here: [https://www.reddit.com/r/tuxedocomputers/comments/1h5mqb8/ethernet\\_on\\_infinitybook\\_pro\\_14\\_gen9\\_amd\\_not/](https://www.reddit.com/r/tuxedocomputers/comments/1h5mqb8/ethernet_on_infinitybook_pro_14_gen9_amd_not/)",
  "So you don't experience any [FPS drops](https://www.reddit.com/r/tuxedocomputers/comments/1544o98/performance_drops_to_30_when_charging_via_usbc/) on USB-C?",
  "Thanks again, will most probably order it as well.",
  "Man, I guess we'd have to try other distors then.",
  "I ran PassMark on battery and on 65W charger and the result is similar.",
  "Most Honest Review of the Lenovo Yoga 7i – Only 3 days in*  \n\nKeep in mind I’m only three days into my new purchase of the Lenovo Yoga 7i 14, but so far I’m really impressed. After returning my M2 Macbook Air Last October, I had been in the market for a new laptop for quite some time, and the Yoga was always something I was considering. The no touchscreen on the Macbook Air simply wasn’t cutting it for me, which is why I ended up returning it despite my relative investment in the Apple ecosystem (ipad pro m1, iphone 12 pro, airpods pro)\n\nMy model: i7 1255U, 16GB DDR5 Memory, 512GB SSD\n\n**Performance:** So far, the performance has been great. Not sure if it’s the marketing gimmick, but the evo certified i7 CPU is quick and extremely responsive in ways that my desktop isn’t. For quick tasks such as opening your apps from the taskbar or simply interacting with the Windows UI, it’s a very snappy chip that has yet to disappoint whatsoever. The 16GB of DDR5 memory is also impressive here, and I’m able to keep dozens of tabs open on Microsoft Edge without any hassle. Definitely think the upgrade was worth it in this sense, 8GB just never seems to cut it these days.\n\n**Display**: One of the best features of this laptop, and is Dolby Vision certified. It has a really nice looking and glossy 2K resolution that looks great from writing documents to watching Netflix–you can definitely notice the upgraded resolution in this sense. I’ve heard some complaints about the display being too glossy, but I prefer it over a matte finish because it feels nicer to navigate on when in touch mode (although it *can* become a fingerprint magnet at times). \n\n**Keyboard:** Keeping this section short and simple. The BEST laptop keyboard I’ve ever typed on. When I first tried it, I was shocked at the switches’ tactility and it was honestly a bit harsh but I’m getting more used to it. \n\n**Trackpad:** Not the best. One of the few downsides of this laptop. The material feels nice, but its touch sensitivity could be improved. \n\n**Battery Life:** Also, not the worst but could be better. I’ve been using battery savings mode on Windows 11 which has seemed to mitigate some of the battery life issues I was initially having. I believe Lenovo advertises over 10 hours and I’m just not sure that’s accurate for my workflow.\n\nOVERALL: Great laptop, 2 in 1 functionality is awesome and feels really polished with Windows 11. Stone Blue color is also awesome and would recommend it!! 4.5/5 overall.",
  "Just got a Yoga 9i myself, also came from a MacBook. \n\nHaven't even had it for more than 24 hours yet, but so far, really can echo a lot of the points you made. Amazing screen, build quality, and speakers. The stylus support is an added bonus as I markup PDFs quite frequently for work.\n\nIf I had to pick a complaint, would be around battery and efficiency. It's not bad but not great either. Expected a bit more battery life and less heat/fan noise. Its early on, so hard to put a great gauge on it. \n\nGreat 2 in 1 all around though, pretty satisfied.",
  "Really nice to hear what you had to say. I just ordered the 14\".  I customized to go 16G RAM. My first (new) Lenovo. I fell in love with a refurbished Flex 7i but it was buggy.\n\nMy brother is an Apple use (phone, pc, etc.) and this is the first time he's not talking smack about my choice.\n\nI'm over here with fingers crossed.",
  "How is it holding up now?",
  "Danke für deine Erfahrungen. Ich wünschte ich könnte auch die Erfahrungen über mein Geräte teilen aber dieses kam nie an und seitdem ärgere ich mich über den Kundendienst rum.\n\n**Meine Erfahrungen zum Lenovo-Service:**  \nIch habe vor über 8 Wochen bei Lenovo eine Bestellung aufgegeben, bestehend aus einer Laptop-Tasche und einem Tablet. Das Paket wurde zwar geliefert, jedoch war nur die Laptop-Tasche enthalten – das Tablet, das auf dem Lieferschein ebenfalls ausgewiesen war, fehlte.\n\nSeitdem habe ich mehrfach den Kundensupport kontaktiert, um das Problem zu klären, und wurde jedes Mal mit standardisierten Antworten abgespeist, die offensichtlich nicht auf meinen spezifischen Fall eingehen. Es wurde mir wiederholt geraten, bei Nachbarn nachzufragen, obwohl ich von Anfang an erklärt habe, dass das Paket bei mir angekommen ist, aber unvollständig war.\n\nNach wochenlangem Hin und Her bekam ich schließlich die Anweisung, einen Polizeibericht zu erstellen, damit eine Rückerstattung oder Ersatzlieferung erfolgen kann. Diese Forderung ist vollkommen unangemessen, da es sich hier nicht um einen Diebstahl oder Verlust handelt, sondern um ein Versäumnis seitens Lenovo.\n\nLaut geltendem Recht trägt der Verkäufer bei Verbrauchsgüterkäufen das Risiko für die Lieferung – es liegt also in der Verantwortung von Lenovo, die vollständige Lieferung der Ware sicherzustellen.\n\n**Fehlender Kundenservice:**\n\nDer Kundensupport scheint automatisierte Antworten zu geben, ohne auf den individuellen Fall einzugehen. Trotz klarer Schilderung des Problems wurde ich immer wieder mit unsinnigen Vorschlägen abgespeist.\n\n**Unangemessene Forderungen:**\n\nDie Forderung, dass ich als Kunde einen Polizeibericht erstellen soll, ist nicht nur rechtlich fragwürdig, sondern auch eine Zumutung. Es ist nicht meine Aufgabe, die Fehler von Lenovo zu korrigieren.\n\n**Verzögerungen:**\n\nSeit fast acht Wochen warte ich auf eine Lösung. Statt den Fehler umgehend zu beheben, werde ich mit bürokratischen Anforderungen hingehalten.\n\n**Mangelhafte Kommunikation:**\n\nEs gibt keinerlei proaktive Updates oder klare Lösungswege. Stattdessen muss ich als Kunde ständig nachhaken, nur um erneut enttäuscht zu werden.\n\n**Vertrauensverlust:**\n\nNach dieser Erfahrung bin ich nicht nur enttäuscht, sondern habe das Vertrauen in Lenovo als Unternehmen verloren. Ein solches Verhalten ist weder kundenorientiert noch akzeptabel für ein Unternehmen dieser Größe.\n\n**Fazit:**\n\nIch habe das Gerät vor 8 Wochen bezahlt und warte seitdem auf die Lieferung des Tablets oder eine Rückerstattung meines Geldes. Der Kundenservice gibt sein Bestes, mich immer wieder abzuwimmeln.\n\nDieser Umgang mit Kunden ist schlicht inakzeptabel.\n\nIch kann Lenovo nach dieser Erfahrung niemandem empfehlen und werde selbst in Zukunft keine Produkte mehr bei diesem Unternehmen kaufen.",
  "Any update for me? I have a question",
  "I got the 9i and love it. The sound is amazing and the graphics are good. I like how slim it is. I don't regret getting it.",
  "I think I got the same thing with 1tb SSD all for $499+tax for Black Friday. I’m hoping this thing can handle music production.",
  "I have the same laptop. I got the Ultra 7-155U 1TB 16' model. Really lovin' what Lenovo's done here.",
  "I just got my Lenovo Yoga 2 in 1 16 inch yesterday and I notice the touch screen does not always respond. Does it have anything to do with the settings? Did anyone else have this issue? Please share",
  "MacBook Air",
  "I am using the yoga 7i intel 12th gen i5 and the only downside for me is the battery life. This thing is brand new and i have it on battery saving mode at all times with the power settings set to conservative. In 2 hours the battery goes to nothing with me only doing light tasks like web browsing or YouTube. Outside of that I type and do office tasks. Had this laptop for 5 months. I'm worrying about battery bloat since I charge it so often. Its a shame that nothing can come close to the Macbook battery life.",
  "How is the bloatware? Does it have MS Edge, Bing, and a bunch of other stuff that can't be deleted?",
  "Can these computers be upgraded like more gpu, ram?",
  "Anybody with yoga 7i 8th gen (2023) facing issues with hinge ? How is it holding up ?",
  "How long does the battery usually last for you? Because I need one for school and thought of looking at this laptop.",
  "Any issues with freezing? Mine is brand new and no errors but completely freezes up. I hit the power and it restart fine. All tests etc come back good... very frustrating idk if I should return before the 2 weeks is up.",
  "Just bought one last night. I haven't taken it out of the box yet because it was kind of a last-minute purchase due to my old laptop (Toshiba Satellite A660 circa 2010) finally kicking the curb, and I wanted to make sure the specs and reviews line up with my needs. So far, so good!",
  "Thanks for sharing about the PDF markup. That's exactly why I've been considering this laptop.",
  "I’d love to hear your experience after two years. I’m starting a PhD and looking for a reliable laptop to last 4–5 years.",
  "How much battery life we talking here ? Running nothing crazy , one software program working without a charged ?",
  "How do you think it compares to the Flex 7i? Making the decision literally right now. My three options are: MacBook Air M1-226 gb, Lenovo Flex 7i- 1 TB and Lenovo Yoga 7 -512 gb. Yoga is $50 more then the other two, but if it’s a better laptop that’s no big deal. I’m hesitant on the Mac cause I’ve never used MacOS. But I’m trying to figure the difference on Yoga vs Flex",
  "I have an 82yn and when the laptop is working it has been great. HOWEVER, mine has so many problems with it. I consitently run into driver issues with the touchpad and speakers. I have to constantly reinistall drivers mutliple times a day to ge the speakers working probably and for my touchpad to work at all. It fucking sucks. Also, Lenevo support fucking sucks. I sent the laptop to them all they did is factory reset my machine and then sent it back with exterior damage to the chasis. I have a very big dent on the front left of the laptop. I spent hours on support for them to finally say they were going to fix the damage for free and I had before and after pics, then they fucking blue balled me right at the end and said they were not doing it for free and going to charge me like 530 bucks to fix the chasis and hinge, which were both damaged in tranist or during the initial repair. This laptop could have been great but I will never be buying a lenovo product again.",
  "Heyy, how's the hinge and hardware holding on?",
  "how is it going? looking into buying one",
  "Still feel this way 2 months later? Looking to get one",
  "Technically you can't delete MS Edge on any Windows machine without any command prompt workarounds - so yes, to answer your question. Regarding \"bloatware,\" the only thing that comes stock with the yoga is the Lenovo vantage which you can easily remove.",
  "yes, they all are there, but the debloat apps exists and work to some extent.. if your workflow does not require windows, stick to mac. I have my Yoga 7i with every cell of my body. Absolute garbage in terms of battery life.",
  "RAM, Hard Drive space? Yes.\n\nGPU? No. Most laptops are designed for their very specific components. While an M.2 and RAM chip are the same size, most laptop GPUs vary and one won't fit in the same physical space as another.",
  "And I'm curious about the battery, is it better?",
  "I got a 16” 2023 (2k screen 400nits, i7 1360p, 16 gb ram, 1tb ssd) because I found a great deal on it and I’ve been using it for a week. I just came back from the library after a 8 hour session (10 AM - 5:45 PM) and still had 25% battery by the end. I was running the screen around 75% of the screen brightness and had 2 desktops with 2 separate edge windows, 6-7 edge tabs open, MS word and OneNote. I run both the intelligent cooling mode on Vantage and balanced performance mode on windows but I do limit the maximum CPU in windows power plan to 50%. For my use case of note taking, browsing, writing papers it does not slow down or lags. Sorry for long review lol but I was trying to find an objective review before I bought it and I couldn’t find any, hope this helps tho. \n\nI love my 16” 2023, the pencil is a plus for me to take notes and screen is a beauty to use. I’m upgrading from a base 2020 M1 MBP, I sold it already and I also sold my 2020 iPad Pro since I can just carry around my Yoga 7i instead of both laptop and iPad. Glad to be out of the apple ecosystem!",
  "Return it, mine does not freeze at all.",
  "I have a Toshiba satellite P50-C bought around the same time as yours and I''m considering this one as a replacement (I know my Toshiba won't last good too much longer). What's your impression on the Lenovo?",
  "Funny I came here looking for things to watch out for on my new yoga I finally treated myself to after more than a decade which was a Toshiba Satellite as well haha. So far I'm really loving mine this past few days, but then again I'm coming from an ancient machine hahaha  I just got open box for 200 so I'm leary if it has issues I just have not personally found yet.  For the price, I am going to ride it our regardless as it is in warranty, and most likely extend the warranty on it just to be sure because I really like it a lot.  I accidentally left it in the bag turned on in my car in blistering heat while I was at work and it survived that I guess lol",
  "I really loved the Flex - it was just used & buggy. After looking at a ton of reviews and videos & articles, I'm hearing that the  Yoga 9i is the cream of the crop. My fingers are crossed.\n\nMy *uneducated* wager would be on the Yoga 9i. I will try to come back and let you know when I get it (estimated to be on the 25th). But go over and look at both. When looking at specs, you can go all the way to the bottom and there will be a link for \"full specs\" for whichever build number you are considering. I saw an exhaustive PDF on the Yoga I got.[ for the Yoga I got.](https://psref.lenovo.com/syspool/Sys/PDF/Yoga/Yoga_9_14IRP8/Yoga_9_14IRP8_Spec.pdf)\n\nIf it helps, see if you qualify for LifeMart (through insurance or employer or veteran, etc). I saved almost $300 because my United Healthcare Insurance offers a LifeMart membership, Never even heard of it before now!",
  "Really well! And I tend to go from tenting to notebook to full tablet mode quite often.",
  "Loving mine",
  "To my knowledge, the ram on the 7i cannot be upgraded",
  "Woahhh coming from a gaming laptop 8 hours is insane. I can barely get 2 hours just watching YouTube on my $1,400 laptop.",
  "is still good? how are the hinges holding up? do you have the link of the laptop?",
  "Hi. Is this the 2 in 1 convertible you’re talking about? If yes how is the hinge on that? Also any additional points you’d add to this review ?",
  "Hasn't been anymore not sure if it was from an update I did to bios or what",
  "I really like it!",
  "I still have never had an issue (knock on wood). Hope you enjoy yours!",
  "I ended up going with the Lenovo Yoga 7i, the rep for Lenovo told me good things about both told me they were pretty similar but I got a really good deal on the Yoga 7i. Thanks for the help tho!",
  "Yes it's the 2 in 1 convertible. Hinge has been fine and absolutely no issues, it is sturdy and doesn't wobble a lot. \n\nNothing new to report, just that battery has been consistent to about 7-8 hours each day and that is more than enough for me to go to class, take notes and then review at the library until 6 PM. It's a little heavier than my old 13\" M1 MBP and the battery does not last nearly as long that (I would need to charge it every other day - newer MacBook laptops are crazy for battery life), but the bigger screen, the USB-A ports, nicer keyboard and pen support is what makes it 100% worth it for me. And also for a fraction of the price for the Apple equivalent.",
  "Thanks! That’s so good to hear!!",
  "I'm looking at reviews of the 7i now. How do you like yours?",
  "Just echoing the person below in wanting to say thank you for responding! Really appreciate it",
  "That’s great to hear. Just found out my classes don’t even allow laptops… and i can use laptops in the school even if mine ends up dying. Not ideal but yeah.",
  "Thank you for the review and feedback of the laptop, ill be a commuter and my uni is 1hr and 30mins so i was a bit worried about the battery life and the weight of the laptop. Specially if it makes any loud sounds like fan noise ect.",
  "any update a year later lol. looming for a new laptop for uni",
  "Thank You for taking the time to answer my questions",
  "I’m loving it man, looking to get a pen soon to start really taking advantage of the touch screen but it’s been great",
  "Awesome, I just bought it! Ordered a stylus for it also. Thanks!",
  "Lenovo Legion Pro 7i Review (Gen 10) ",
  "MSI Vector 16 vs ASUS GOG Strix G16 vs Asus ROG Zephryus G16 vs Lenovo Legio Pro 7 Hi everyone, \n\nI currently have an old R1 Alienware M51, which at the time was a mighty i9 32 GB RAM and a 2800 RTX, but it's rather long in tooth now and I am looking for a replacement.\n\nThe key elements are that it needs to be an I9 Processor, 32GB RAM and an Nvidia 5800 card in it. I have discounted Alienware from my current selection, because I had massive problems with Windows 11 and it's put me off the brand to be honest.\n\nUpon reviewing online, the four machines in the title all have similar specifications. At the moment, the Zephyr is in the lead, although I saw in a comparison vid that Lenovo edged it. For me I can help but get IBM/Lenovo out my mind as crap work laptops, but I am hearing better things about Lenovo nowadays.\n\nSo here is the ask. \n\n1) Are there any other models you would add to those 4 as a comparison?\n\n2) I haven't used AMD for quite a while, always found their drivers to be poor in the past. Is there an AMD equivalent you would suggest?\n\n3) Is there anyone who actually owns those models in the title and would be able to give an owners option?\n\nMany thanks in advance.  \n",
  "The zephyrus is the best imo, the only downside is that it is not upgradable",
  "Help decide - Aus ProArt P16 or Lenovo Yoga Pro 9i  Hello everyone, \n\nI am in the market for latop for a while now, and was looking to buy latest and greitest. But new stuff keeps comming up, so cant decide. Most likely i have been reading too much about all the laptops and new stuf thats comming out... anyway to keep it short.\n\nI like and settled on two options, cant get both and buy-try-return is not an option. \n\nStuff that looks like gaming laptops are out of question! I dont use external screen.\n\n**Asus ProArt P16  - AMD HX370, 2TB, RTX4070, 64 GB RAM, 4k oled, touch**\n\n**Lenovo Yoga Pro 9i 16\" - Core Ultra 9 185H, RTX4070, 1TB, 64 GB RAM, 3200x2000 miniled 165hz, touch**\n\n\n\nAsus P16 goes for 3k €, also available with 32GB RAM, for around 300€ less.\n\nLenovo currenly is available for 2700€.\n\nThey both have GPU at around 100W, reviews are good on both o them, at least the ones i watched and read. Battery life is not a problem, i can be plugged in everywhere i use it when needed.\n\nI am mostly using Premire Pro. H265 mostly, some H264, little bit of iphone 4k video to edit. Also some photoshop, baisic Aftereffects. Also office work, borwsing, also I like having tabs open on chrome all the time.\n\n  \nIf someone could chime in on my choices, or maybe real use experiance on those would be very heplfull to decide. \n\nThanks, everyone.\n\n",
  "just put together a **quick** **comparison** table(more detailed) for  Asus ProArt P16 vs Lenovo Yoga Pro 9i\n\nI thought it would be helpful for anyone considering them: [https://docs.google.com/spreadsheets/d/1KWPjS824F1L98r6FHwbRIkoyffUJNs242Ek0sj1ViFg/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1KWPjS824F1L98r6FHwbRIkoyffUJNs242Ek0sj1ViFg/edit?usp=sharing)",
  "I've had a Lenovo Yoga in past I wasn't too impressed, the ProArt can have 8Tb ssd",
  "if not in a hurry i think you can try for lunar lake with a nvidia gpu otherwise go with **Asus ProArt P16**",
  "Yoga seems like the better value. You get the same performance essentially, a brighter faster refreshing display (but give up 10% or so adobe RGB coverage), and you trade a little battery performance for a price difference that could buy you your own Asus proart 4k monitor if you wanted and still have some cash to spare.",
  "Well, i got myself a Asus ProArt P16.  Its about one month i my hands. Pretty happy with it, build quality is very good, screen is awesome, came with 64GB ram and 2TB drive.  Touchpad is nowhere near haptic touch pads in macbooks, but its very good compared to others i have tried. In short it is as good as it gets for not haptic touch pad.   When video editing battery from 80-10% lasts about 1,5-2,5h depending on workload. When doing everyday stuff it does not seem to drop at all.   Its a shame with modern laptops that they dont have S3 sleep option. Its so called “always connected”.  When sleeping device in 15-17h consumes about 15% of battery… i have a phone in my pocket that is always connected, i dont need laptop for that! Anyway… Charger is quite big, but it is charging from a 90w thru USBC pretty good if needed. But while editing battery drains slowly with 90w connected. Screen, as everyone said in reviews, is wobbly, so is on other laptops. I havent experienced any discomfort while on it is on table. Haven't had a chance to use it an my lap, or train yet. Over all i would say i made a good purchase, at least at the moment i think so. 😁",
  "Am also stuck between the 2.\n\nHave you chosen one? If so, which one and why?",
  "good on you man, appreciate this and the work you put in",
  "Thanks, will keep in mind.\n\nI was thinking about that also, but as i understand higher spec lunar lake laptops ar at least 2 months away. Currently for preorder are only with integrated graphics.",
  "The lenovo has worse battery?",
  "Have you tried the PlatformAoAcOverride registry hack to get back S3 sleep ? [https://www.reddit.com/r/ASUSROG/comments/1cpgtrd/comment/l3zu4sh/](https://www.reddit.com/r/ASUSROG/comments/1cpgtrd/comment/l3zu4sh/)",
  "Well, Lenovo was unavailabale and had older CPU at the time. \nI got P16, very happy. Works nice for video editing, screen is amazing, battery life while editing is around 2h+ if charged to 100%, a bit warm above keyboard when under heavy load, touch pad is as close as it gets to what macbook has.\nOver all very good pirchase. Got it in september, still no regrets. ",
  "Same here, did you already choose one?",
  "Yeah from what I've seen it will get worse battery performance, but the p16 isnt exactly like a \"just leave your charger at home\" type laptop either. Both can be stretched to get decent light web browsing and video type performance but if you're wanting to do anything intensive like photo or video editing, you're not going to last a work day. I'm curious if you find an upgraded 99wh battery for the Lenovo since the battery is replaceable.",
  "No, havent tried it yet, will definatelly try. Thanks",
  "Thanks OP",
  "Hey, yeah, I went with the Lenovo Yoga Pro 9.  \nI intended to use it for some casual video editing and music productions because the specs seemed good enough for it, turns out life is so busy and I am just unmotivated to make time for it. T'is now lightly put to work for simple web browsing and mostly YouTube viewing.\n\nHowever, I don't ever see myself buying another laptop or pc in the future, I play console if I ever game. And for what it is, it really is a decent laptop in terms of on paper specs and I can see it being put to work for what it is built for and being good at it. But, I'm no laptop expert and I'm sure there are better laptops out there for just as much or whatever.  \n  \nHaving owned it for just a little over 2 months, I have nothing to complain about. Fan is quiet, I get at least half a day of battery with the light use I do now, its almost always hooked up with the charger. The screen is a bit glassy and could be a bit brighter during the day. It is good for how I use it now and if I ever do use it with my original intentions I am pretty sure it wouldn't have a problem doing it.\n\nThat is my take on this machine.",
  "Its just so annoying that no windows machine can beat a macbook pro... but i just hate MacOS. \n\nand the lenovo was the closest i found in build quality",
  "Correction to my own comments: the registry hack won't work, if S3 sleep is unavailable from the firmware, which is the case for recent AMD CPUs. See [https://bbs.archlinux.org/viewtopic.php?id=279369](https://bbs.archlinux.org/viewtopic.php?id=279369) [https://community.amd.com/t5/pc-processors/why-doesn-t-amd-support-s3-sleep-mode-on-6800h-laptops/td-p/551188](https://community.amd.com/t5/pc-processors/why-doesn-t-amd-support-s3-sleep-mode-on-6800h-laptops/td-p/551188)",
  "Nice! I’m leaning towards that one as well. Thank you for your take on it!",
  "Yeah after exhaustive research, I've found there's no perfect device. MacBooks seem nice but they have their flaws too and you pay way too much for them. You pick your flaws. Personally I'm leaning towards a laptop and tablet combo. If you need just something ultra portable with loads of battery for light tasks, why not just snag a tablet? Plus you could rig it as a second display for your laptop. I'm wanting to do this anyways because I think I'd like having a writing tablet for note taking and white boarding programming projects while in meetings. Then if I want to catch up on personal emails during lunch or review notes of new stuff I'm learning, I can leave the laptop at my desk. If I know I'm going to a coffee shop to go do some more serious work, I can always take a GaN charger which should be plenty Photoshop and davinci. \n\nI'm considering something like a Lenovo tab plus or something. Doesn't need to be super beefy - just handle obsidian and content consumption really.",
  "well your getting a dedicated gpu brother if you not gonna game get a mac lol",
  "Choose SSD Crucial T500 or Samsung 990 Pro for Lenovo Legion R7000 2024? Hello all,   \nI'm going to buy a new 1TB SSD for my new laptop. I want to use it for Window system. I am wondering between SSD Crucial T500 or Samsung 990 Pro. Their price is quite similar and their performance is also impressed but I want a stable and durable SSD. I hear there are some problem related to health reduction on Samsung 990 Pro. But about T500, I don't hear too many reviews  \nWhich SSD should I choose?",
  "As long as they're both TLC it shouldn't really matter imo",
  "Health issue with the 990 pro was a bug in early firmware.  Recent firmware does not have that issue.",
  "Lenovo bad. HP better? IdeaPad Pro 5 (8845HS) and Yoga Pro 7 (155H) vs Omnibook Ultra 14 (AI 365) Hi everyone!  \nSorry for the click-bait topic. I want to ask about buying HP over Lenovo. In order to make this post more valuable, I'll write down a short review of the Lenovo laptops because I found many people are looking for similar things in a laptop as me. Also including the OLED vs IPS opinion. I'll add 8845HS vs 155H review later.\n\nOriginally, I wrote a long post, but I didn't save it and it got lost. I'll try to make it short this time.\n\n**What am I looking for?**  \nI want a small work laptop that I could also use for my personal things. It should have good CPU, 32GB of RAM and 100% sRGB because I intend to use it for editing photos while traveling. I also wanted iGPU because it's good enough for the tasks I intend to use it for.\n\n**Why I don't want OLED**  \nOLED screen is dominant in the class of laptops I am looking at. And generally it's a selling point of many laptops. I understand why, but it's no good for my use-case.  \nI use a lot of static content Programming/Lightroom/Web and when I am working, I want to use my laptop as a second screen, which means opened browser or a VS Code for extended periods of time. Of course, this is exactly the use-case that's not great for OLEDs. I also went to a local shop and I saw that the OLED screens have a burn in. I understand that the laptops might be there for a long time, but still.. I don't want to limit my productivity to mitigate something that's going to happen sooner or later. Also the eye strain is real. So it's an IPS for me.\n\n**IdeaPad Pro 5 14AHP9**  \nThis was a big step up from ThinkPad E590 I had before. The performance is great. It's even better than 5600X I have in my PC. But I was being worried about the OLED burn in too much in the long run. Otherwise it was a perfect choice for me. \n\nPros:  \n\\- Very good specs  \n\\- Full metal case  \n\\- Good keyboard  \n\\- Good connectivity with 2 USB-C (USB-4), 2 USB-A and a SD card reader  \n\\- 85Wh battery  \n\\- **Quiet**\n\nCons:  \n\\- Very limited customizations  \n  ThrottleStop doesn't support 8845HS, you can't do much in the BIOS, you can't adjust fan curve  \n\\- OLED burn in  \n\\- 240Hz PWM\n\n**Lenovo Yoga Pro 7 14IMH9**  \nI was hesitant to choose Intel because I believe AMD is better, but it has a nice IPS display and it fit my requirements perfectly.  \nI don't know if it's because of the Intel processor, but it's **loud.** Every time it get's above 60C, the fans just start spinning for some time. The CPU reaches 38C in the mean time. WHY?. And it happens even while browsing. The fans are also very high-pitched and annoying. The fan curve from Lenovo is terrible and I couldn't change it. It behaves like that in all power modes. Lenovo restricts any customization for some reason. It's very annoying and that's basically the only reason why I am looking for some other options.\n\nPros:  \n\\- IPS with 100% sRGB  \n\\- Very good specs  \n\\- Full metal case  \n\\- Good keyboard  \n\\- Thunderbolt 4  \n\\- 14.5\" display with minimal overall size change  \n\\- Good light use efficiency thanks to E-cores\n\nCons:  \n\\- Terrible fan curve (loud)  \n\\- Power button located on the side means accidental shut downs  \n\\- Only one USB-A  \n\\- Very limited customizations  \n  ThrottleStop doesn't support 8845HS, you can't do much in the BIOS, you can't adjust fan curve\n\n  \n**IdeaPad Pro 5 14AHP9 vs Lenovo Yoga Pro 7 14IMH9**  \nBoth look very much the same and I really like the design. Yoga is a bit larger thanks to the 14.5\" display which is better for productivity and you can't really tell when carrying it.  \nThe build quality is better on the Yoga. It has a more premium feeling, but it's really not noticeable. The only noticeable things are the bezel around the screen is glass vs plastic on the IdeaPad. Another thing is keyboard, which is meant to feel more premium on the Yoga. It has a great travel but it's harder to press than on IdeaPad that's why I prefer the IdeaPad keyboard.\n\n**Ryzen 9 8845HS vs Intel 155H**  \nAMD is definitely more power efficient during moderate tasks. I think it's also part of the reason why IdeaPad is more quiet. \n\n**HP OmniBook Ultra 14 (AI 365)**  \nThis is an option I am looking into and I want your opinion on it. It's about 150$ more expensive, but it has a newer ZEN 5.  \nI'll share my cons and pros about this laptop. What I would really appreciate is your experience with the noise. Also if you can do more customizations like a fan curve using FanControl.\n\nPros:  \n\\- ZEN 5 (quiet?)  \n\\- IPS with 100% sRGB  \n\\- More customizability?\n\nCons:  \n\\- Worse design  \n\\- Large bezel (the laptop is the size of Yoga which has 14.5\" vs 14\")  \n\\- USB-C in the corner  \n\\- More expensive  \n\nWhat I ultimately want to achieve (and what is achievable with the IdeaPad) is that I want my laptop dead silent during some light work.\n\nI hope somebody will be able to share their experience and help me decide. I also hope I could help somebody else decide!\n\nThanks!",
  "Did you end up picking up the omnibook ultra 14? I’m debating getting it but I’m hesitating because of the build quality and keyboard .. any feedback? :)",
  "Any review/thoughts on the new lenovo IdeaPad pro 5i with intel ultra225h paired with 32gbs of ram. Will purchase it soon so want some review on the laptop. Not finding enough reviews online. ",
  "Here is my review [https://www.reddit.com/r/UnboxParadigm/comments/1kzrz9f/how\\_i\\_bought\\_the\\_best\\_work\\_laptop\\_under\\_75k/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/UnboxParadigm/comments/1kzrz9f/how_i_bought_the_best_work_laptop_under_75k/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
  "HP omnibook ultra 14 for an insanely good deal or a lenovo yoga pro 7 I've just found an amazing deal on the HP OmniBook ultra 14 with a Ryzen AI 9 375 processor but i like the lenovo yoga pro 7 more as a whole. The yoga pro 7 has a worse chip (AI 9 365) but costs around $500 usd more. The performance difference doesn't seem too bad when looking at some reviews online but $500usd is a lot. I do like everything else on the lenovo more. Should i go for the crazy good price of the omnibook or splurge on the yoga for a potentially better ux?",
  "What to chose ? Lenovo Yoga Slim 7i Vs Lenovo Yoga pro 7 I don't really know what to chose between this laptops, I saw the new \"lunar lake\" processor comes with the new intel technologies and power efficiency but i didn't find any review about this pro 7 build. What is more powerfull between this builds in terms of multy tasking, gaming and what the difference's will be:\n\nYoga pro 7:  intel core ultra i9 185h\n\nIntel Arc Graphics (from the i9)\n\n32Gb RAM\n\nYoga Slim 7i: Intel core ultra 7 258v\n\nIntel Arc Graphics 140v\n\n32Gb RAM\n\n",
  "ASUS Zenbook S14 vs. Lenovo Yoga Slim 7i Aura 15 vs. LG gram Pro 16/17 - which would you choose? I have been looking at these three laptops and am beginning to feel as though there isn't much difference beyond the screen size and whether it's OLED or IPS. Is there anything I'm missing? Would you choose one over the other for reasons beyond screen size preference, and if so, why? Would you not recommend anything about these processors or specs for any reason? How about OLED - is it worth it at these screen sizes and is it even noticeable? TIA!\n\n[ASUS Zenbook S14 - $1,499.99](https://shop.asus.com/us/90nb14f4-m00620-asus-zenbook-s-14-ux5406.html)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.65 lb - 12.22\" x 8.45\" x 0.47\"\n* 2880 x 1800 resolution (OLED)\n* 100% DCI-P3 coverage, Pantone-validated\n* 1,000,000:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 72Whr battery, 21 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[Lenovo Yoga Slim 7i Aura 15 - $1,422.99](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/83hmcto1wwus1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 3.2 lb - 13.53\" x 9.27\" x 0.55\"\n* 2880 x 1800 resolution (IPS)\n* 100% DCI-P3 coverage\n* 1,500:1 contrast ratio\n* 500 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 1 USB-A port, 1 audio jack\n* 70Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W one-piece charger\n\n[LG gram Pro 16 - $1,550.00](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)  |  [LG gram Pro 17 - $1,596.98](https://www.amazon.com/LG-16-inch-Lightweight-Laptop-Intel/dp/B0CTD2QP53/ref=asc_df_B0CTD2QP53?th=1)\n\n* Intel Core Ultra 7 258V\n* 1 TB PCIe 4.0 SSD\n* 32 GB LPDDR5X RAM\n* Integrated Intel Arc Graphics\n* 2.96 lb - 14.08\" x 9.9\" x 0.5\"  |  3.16 lb - 14.91\" x 10.19\" x 0.7\"\n* 2880 x 1800 resolution (OLED in 16\", IPS in 17\")\n* 100% DCI-P3 coverage\n* 1,000,000:1 contrast ratio\n* 400 nits brightness\n* 120Hz refresh rate\n* 1 HDMI port, 2 USB-C Thunderbolt 4 ports, 2 USB-A ports, 1 audio jack\n* 77Whr battery, 24 hrs video playback\n* Charges via Thunderbolt 4, 65W two-piece charger",
  "## Amazon Price History:\n\n**LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - AI-enabled Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display**\n* Rating: ★★★★☆ 4.0 (6 ratings)\n\n* Current price: **$1699.99** 👍\n* Lowest price: $1299.99\n* Highest price: $1999.99\n* Average price: $1749.61\n\n| Month  | Low  | High | Chart             |\n|--------|------------|------------|------------------|\n| 02-2025 | $1628.95    | $1881.52    | ████████████▒▒  |\n| 01-2025 | $1621.11    | $1920.67    | ████████████▒▒  |\n| 12-2024 | $1299.99    | $1919.95    | █████████▒▒▒▒▒  |\n| 11-2024 | $1299.99    | $1999.99    | █████████▒▒▒▒▒▒ |\n| 10-2024 | $1658.17    | $1999.99    | ████████████▒▒▒ |\n| 09-2024 | $1699.99    | $1986.64    | ████████████▒▒  |\n| 08-2024 | $1562.65    | $1999.99    | ███████████▒▒▒▒ |\n| 07-2024 | $1562.27    | $1999.99    | ███████████▒▒▒▒ |\n| 06-2024 | $1568.64    | $1938.55    | ███████████▒▒▒  |\n| 05-2024 | $1651.81    | $1999.99    | ████████████▒▒▒ |\n| 04-2024 | $1799.99    | $1999.99    | █████████████▒▒ |\n| 03-2024 | $1939.85    | $1999.99    | ██████████████▒ |\n\nSource: [GOSH Price Tracker](https://gosh.app/?utm_source=redditbot&utm_medium=laptops&utm_campaign=2025-02-19)\n\n\n^(Bleep bleep boop. I am a bot here to serve by providing helpful price history data on products. I am not affiliated with Amazon. Upvote if this was helpful. PM to report issues or to opt-out.)",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: LG gram Pro 16-inch Thin and Lightweight Laptop, Intel Evo Edition - Intel Core Ultra 7, 32GB RAM, 1TB SSD with OLED Display \n\n>**Company**: LG\n\n>**Amazon Product Rating**: 4.0 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 4.0\n\n>**Analysis Performed at**: 02-19-2025 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lg-gram-pro-16-inch-thin-and-lightweight-laptop-intel-evo-edition-intel-core-ultra-7-32gb-ram-1tb-ssd-with-oled-display) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "First impressions of the 2023 Lenovo Slim (Yoga) Pro 9i I just bought on clearance I finally pulled the trigger on a new laptop. I was waiting for the new 16 inch Yoga Pro 9i to go on sale at Best Buy when I found last year's 16 inch Slim Pro 9i on clearance for $1,099 at a Costco about an hour from my house. Even though it lacks some of the refinements of the newer model, I couldn't pass up that price. It is the mini-LED touch screen version with intel i9 processor, GeForce RTX 4050 GPU, 32GB RAM, and 1TB SSD. I will mostly be using it for productivity, music production, some video editing, and watching stuff on YouTube.\n\nI set it up last night and did all the system updates. Here are my first impressions\n\n**Looks/build/feel/ports:**\n\n* Build quality feels insanely good to me - the Storm Gray aluminum body is super sleek. \n* The keyboard is incredible (one of the things I liked about the new model when I tried it at Best Buy) \n* The glass trackpad also feels amazing and has a fairly satisfying click (I prefer this to haptic personally).\n* A little heavy, but also seems slimmer and more compact than I was expecting.\n\n**Screen:**\n\nI wasn't sure how I'd feel about the screen, as I've never owned a glossy one before, but wow. It is spacious and bright and very impressive. Unfortunately, the HDR mode in Windows seems to do something wacky with the colors, but in SDR, it still seems to have plenty of contrast to me. I put it side by side with my partners MacBook Pro and it was definitely brighter, although the overall colors on the Mac are still better IMO. I haven't really noticed any of the blooming people complain about. Ghosting has also not been an issue.\n\n**Speakers:**\n\nAs good as everyone says. Comparable to Mac.\n\n**Performance:**\n\nThis computer is fast and fluid, even at 60hz refresh. It is very quiet and cool when not in performance mode. I haven't really put it to the test yet, but I'm thinking it should be able to handle whatever I throw at it.\n\n**Battery:**\n\nThis is the main thing reviewers complain about with this model (and to a lesser extent the newer model). I was expecting the worst, but so far I'm pretty impressed. I've been using it off and on today for the last 6 hours for some work and web browsing, and I'm now sitting at about 25%. This is with battery saver on, so I'd expect worse in intelligent cooling mode, and much worse in performance mode.\n\n**Conclusion:**\n\nSo far, I'm pretty much loving this thing. Most of the issues I've had have been related to OneDrive syncing things I didn't ask it to and other Windows-related complaints. The other issue is ports - it has a decent selection, but I'm hoping I can find a USBC charger that will work with it (this has been another complaint in previous reviews).\n\nOf course, the newer model just went on sale at Best Buy for $1,499. That has the \"Ultra\" i9 processor and a slightly bigger battery, as well as fixing some of the port issues. But at that price it comes with the IPS, albeit a very nice one, and it's still $400 more than what I paid.  They have the mini-LED variant with RTX 4060 on sale for $1649 as well.\n\nPart of my plan was that if I wanted, I could just return this one to Costco and go grab the newer model, but I really like getting a good bang for my buck and I think I've achieved that with the older model. However, I'd say if you are considering the new Yoga Pro 9i, both options are a great value at the current sale price.\n\nSidenote: the other great value option I was considering was the IdeaPad Pro 5i at Costco for $1,499 with similar specs, but with an OLED. However, I wasn't impressed with the low-resolution of the screen in person and the build just didn't seem as good to me. ",
  "Paid 1599 for it a year ago same specs mini led ",
  "If you haven't yet you need to download the hdr calibration tool from the windows store and manually calibrate the screen. I thought I was watching things in hdr but realized it wasn't calibrated at all and was basically the same as sdr. If you don't see any blooming, you're probably not really using the hdr capabilities. It's night and day once you do.",
  "I bought this laptop too around half a year ago, also mostly because of the pretty decent discount. I was deciding between it and a Legion Slim 7 for around $200 less although I regret picking it despite still liking it overall.\n\n**Pros**\n\n* keyboard feels great to type on and is a step above other Lenovo laptop keyboards\n* very bright 3200x2000 165Hz mini-LED screen\n* loud, booming speakers\n* relatively quiet fan noise in a variety of use cases\n* capable of light gaming in a pinch - mobile 4050 is roughly equivalent to a desktop RX6600/RTX3060\n* solid build quality outside the base cover\n* fairly thin at around 0.7\"\n* high quality webcam and microphone\n\n\n**Subjective Pros/Cons**\n\n* extremely large Macbook-sized touchpad\n* bland aesthetics fit for an office\n* lack of RGB keyboard backlighting\n* high resolution of 3200x2000 potentially wasted in a 16\" form factor and makes games more difficult to run\n* uses Torx screws to access the internals\n* beveled and rounded corners on the panel\n\n**Cons** \n\n* woeful battery life of around 2-3 hours with casual use\n* only one USB-C port\n* no Advanced Optimus\n* creaky base cover\n* mediocre SD read/write speeds\n* relatively heavy for a thin non-gaming laptop\n* noticeably higher black levels in SDR mode\n* soldered unupgradable RAM\n* no ethernet port\n* outdated HDMI 2.0 (some report 1.4, but I can output 4K60 on mine) standard\n* tiny up/down arrow keys\n* mini-LED local dimming only activates in HDR mode",
  "Do you still have it? How are you liking it?",
  "Yeah that sounds about right. The legion slim 7 is supposed to be a great machine.",
  "Is this list regarding the Lenovo Slim Pro 9 14IRP8?",
  "Yep I still have it. The screen is the best part every time I open it. The performance is still great and I have no issues. I hate to say but the battery life is terrible. Barely 3 hours with medium usage.",
  "I used it for a while and also really liked it. Longer battery life, more gaming-capable, lighter, more ports and better located, per-key RGB backlighting, etc. \n\nBut the screen (while still very good) didn't pop as much with the colors, the keyboard was mushier, the speakers/webcam/microphone weren't as high quality, and the build quality was a slight step down as I could feel some creaks holding it one-handed. With the Slim Pro 9 I really only feel the creaks if I apply pressure on the bottom cover. And I grew to really like the size of the Slim Pro 9's touchpad.",
  "No, it's for the 16\" variant.",
  "Sounds like I made the right call then (for me), assuming I can find a more portable charger. I'm really liking the feel of it so far.",
  "Man, I have seen such minimal coverage for the 14\" version!",
  "Oh yeah, the charger on the Legion was also noticeably larger, which makes sense as it was trying to drive a 4060 instead of a 4050.",
  "Have you found an additional charger yet? I'm struggling to figure out what wattage I need!.",
  "Yeah, I've actually heard good things about it, but I can't say how many of these pros/cons apply.",
  "I haven't bought one yet, but I'm still planning on getting the portable 100w ugreen charger before I do any traveling. Supposedly anything 65w or above will work.",
  "I have it myself and it basically fits all of your pros and lacks most of the cons. Maybe I'm missing something, but I'm surprised it isn't more popular. \n\nIt almost seems like a unicorn device that Lenovo's had to cover up to stop it from cannibalizing sales\n\nI'm trying to buy a backup charger and can't find any reference of what power specs it needs",
  "That's my goal too!\n\nI've tried other power sources (Samsung s24u 45W@9v) hoping for even the ability to trickle charge, but they were simply too weak to even be recognized by the computer.\n\nI'm curious if there is also an upper limit to the wattage. Or even what voltage it charges at. Or where to find such information!",
  "Help Choosing Between A Lenovo Yoga Pro 9i and Dell XPS 16 ",
  "Hello all! \n\n  \nWould love to get some input between these two laptops. I've been hearing great things about the new Lenovo Yoga 9i, but know Dell's XPS lineup has a good reputation. Both would be purchased at similar prices (2nd hand), I just used the bestbuy links as they offered the most information and match the models exactly. \n\n  \nI have gone though many laptops before and impartial to either in this case. Would love to hear what you have to say! \n\n  \nThank you!",
  "Dell all the way imo,way better build and speakers",
  "Awesome,  thanks for the input!",
  "I just ordered a Lenovo Yoga Pro 9i with 185h. Will i regret this with the upcoming launch of lunar lake? When will comparable lunar lake laptops release? ",
  "Looks like Lunar Lake will be launched properly toward the end of September, so you're a month or so away from all questions being answered! TLDR; unless you have super specific requirements, you're probably going to be very satisfied with the 185H.\n\nPerformance-wise, there's probably very little to be regretful of. The 185H is still a very powerful laptop chip for the current market, and new generations will always show improvements as they iterate, so the FOMO is a natural feeling. The 185H is top-of-the-range for early '24 and will probably still be comfortably usable in half a decade from now.\n\n  \nBattery-wise, seems like Lunar Lake is about to take a big-ish step forward, but the biggest step has already happened in getting away from Intel's old chip architecture. If your Yoga isn't running a discrete GPU, you'll probably still be able to get a day's worth of light/medium use out of the laptop. That's probably enough for most people, but something to consider if recharging frequently is annoying for you. Lunar Lake will probably be Intel's first laptop chip that will see 99% of users through a full day of any kind of use, if you believe the claims. \n\n  \nGraphics-wise, I can't speak for creative applications, but looks like there's another big-ish step forward on the gaming/FPS front. General rule will probably still apply though: light gaming is still going to be very doable with integrated graphics, and triple-A games are still going to be sluggish but playable (albeit more-so). If you don't game, no problem! Your laptop is otherwise a monster :)",
  "[deleted]",
  "Thanks!  \nAfter reading a bit more about Lunar Lake i have to say i'm quite impressed, mostly by the fact that they managed to get to 3nm which brings the chips into Apple-M territory.  \nAlso the fact that the 288V seems to be faster than the 185h while using substantially less power is quite impressive, i don't care too much about battery but more so about fan noise and it seems like that could be reduced drastically.  \nBut after all, the Yoga Pro 9i is the exact laptop i wanted to buy (meaning there's no soon-to-be-released alternative with Lunar Lake like Dell XPS) and there's a good chance they'll only release a new version with Arrow lake, which means  no launch until \\~April 2025.  \nEven if they launch a version with Lunar lake / 288V, i doubt it will be out before end of the year (Lenovo's releases are always quite late) which is just too long to wait for me. At the end of the day, it's just a matter of \"Will the laptop feel fast (enough) for the my tasks?\" and i'm sure that's given with the 185h.",
  "Please help me",
  "Look up Yoga Slim 7i Aura Edition. Lenovo just announced this laptop today at IFA 2024 as well as the Lenovo Yoga Pro 7. The pro 7 has the New Ryzen AI 9 365 Processor. \n\n[Both of these should be releasing by end of September according to Lenovo](https://news.lenovo.com/pressroom/press-releases/lenovo-unveils-new-yoga-and-ideapad-devices-at-innovation-world-2024-empowering-consumers-with-ai-technology/)",
  "Well.. \nSeems like the Slim 7i Aura is a completely new device. What do you think the chances are they‘ll actually relase a refreshed Yoga Pro 9i soon? I‘m still quite sceptic as none of the announced laptops offers a dGPU.",
  "Someone told me the 24th we'll see the next laptops announced with lunar lake. I'm in the same boat but I'm pretty certain I'll get the yoga pro 9i on sale for black Friday since I'm guessing it will be $1500 or so for the top sku and the new lunar lake models even if they're good will be at their highest price or maybe slightly discounted for those sales and then I'll be kicking myself in 8 months when that same laptop is $400 cheaper.",
  "I already have the Yoga Pro 9i and I'm kind of medium satisfied with it. The build quality is okay (the casing panels are too thin), the keyboard is okay (for some reason, the keyboard of my Legion 7 from 2021 was much better), the display is great, and the fan behavior doesn't make sense. When gaming in Balanced Mode and with the battery whatever mode disabled in the BIOS, the laptop stays extremely quiet (>35db), yet the fans are almost always on, even during simple browsing in Quiet Mode, which doesn't really add up. Lunar Lake doesn’t allow the possibility to connect a dGPU anyway, so I’d have to wait for Arrow Lake. To be honest, if Arrow Lake is similarly efficient as Lunar Lake but more powerful (and thus there are laptops that are truly silent during normal use), I will definitely sell the laptop and get one with Arrow Lake.",
  "Didn't realize lunar lake can't use dgpu. I'm not sure how much I'd be bothered by fan noise sense I'm using headphones typically. How do you like the display?",
  "I‘m writing a review at the moment i‘ll let you know!",
  "For sure keep me posted. I'll give it a read",
  "I just got a hold of one (2024 4050) and it's really quiet when doing light tasks like browsing, watching videos even just having 10+ tabs. The only thing that sucks is unfortunately the battery life but you can move around this by just switching to integrated graphics, eco mode, 60hz, dimming down the display but then you can get around 5ish hours of constant use, switching tabs, moving around opening and closing stuff.\n\n\nI haven't tried anything super heavy for gaming but I did let it run sparking zero and it was able to handle it really well, the fans got louder of course and you would have to use the Nvidia GPU ofc but it ran smoothly in medium settings, 80 resolution in settings and it's just beautiful. But I mainly using this for school rn.",
  "Lenovo Yoga Pro 9i 16\" 2023 Personal Review Hi guys, I have used this laptop over one month, therefore want to share some thoughts here (and gain some karma:)). I'm definitely not trying to sell it to you, so I'll talk about its pros and cons.\n\n&#x200B;\n\nPrice: I paid AU$2723 - AU$437.28(cashback) = AU$2285.72 (= US$1553.72)\n\n&#x200B;\n\nSpec:\n\nProcessor : 13th Generation Intel® Core™ i9-13905H Processor (E-cores up to 4.10 GHz P-cores up to 5.40 GHz)\n\nGraphic Card : NVIDIA® GeForce RTX™ 4050 Laptop GPU 6GB GDDR6\n\nMemory : 32 GB LPDDR5X-6400MHz (Soldered)\n\nStorage : 1 TB SSD M.2 2280 PCIe Gen4 TLC\n\nDisplay : 16.0\" 3.2K (3200 x 2000), IPS, Glare, Non-Touch, 100%DCI-P3, 400 nits, 165Hz, Glass\n\n&#x200B;\n\nWhen I opened the box, I was very impressed, it looks as an artwork. I have used Macbook for few years, I think this build quality is even better than MBP, at least similar.\n\nThat night, I used it to play some youtube videos and music, the sound is good, the screen is superb.\n\nhttps://preview.redd.it/iusuog3elheb1.jpg?width=4032&format=pjpg&auto=webp&s=d60e58281ed2c9144f0dadfeec50f7d67081c383\n\nAll right, that's all about the feel and look.\n\n&#x200B;\n\nRegarding to its performance:\n\n1. i9-13905H. According to my research, this is a custom CPU upon 13900 with more power and less space.\n2. 32GB/1TB, notihng special. DDR5 is good, but soldered approach is not extensible. By the way, it can add one more 2280 SSD storage.\n3. RTX4050, well, due to lots of research, I found 4050's performance is similar to 3060. Which is definitely the situation of 3050. If you buy 4060, it will have \\~20% improvement, but at the time of purchaing, it will cost me AUD 300 more, therefore I didn't choose it. When I get it, I played Forza Horizon 5, in 2k solution, I can run it with the second highest setting (forgot the name) and it was very smooth. But I'm not a fan of playing game, so just played 3 days, then never touch it again.\n\n&#x200B;\n\nConclusion\n\nPros:\n\n1. Screen display is amazing.\n2. Very powerful machine, I'm a programmer, I can feel the difference when using docker or starting a heavy application.\n3. It has around 130w power supply in total for CPU and GPU, which unleash the power of both.\n\n&#x200B;\n\nCons (actually that's the valuable part, you can't get it from elsewhere):\n\n1. This is a full sized keyboard, with numpad. I don't like it, I have another 14\" thinkpad, every key is larger than the 16\" full sized one. I prefer the larger keycap, and I doubt numpad is useful for most people.\n2. Heavy? Yes, but not too heavy, you can get the exact weight from Internet, this is a 16\" laptop, the weight is lighter is most similar sized laptops. If you are a student, want to take it to lab or classroom, maybe you should avoid this one, and choose a 14\" laptop.\n3. It comes with a 170w power supply, um... I don't like it. If you buy Yoga pro 9i 14\", it comes with a 140w power supply, and its interface is type-c. which gives your laptop 2 type-c and 2 type-a, that would be perfect. But now I only have 2 type-a and 1 type-c, alought it's thunderbolt 4.\n4. RTX4050: the 6gb VRAM will be the bottleneck in the near future. If you like playing game, buy 4060. It will definitely extent your laptop's lifespan.\n5. Warranty, somehow I got only 1 year warranty, so I purchased 2 more years, it also costs me additional $$$. Most other laptops, even lenovo, comes with 3 years warranty by default.\n\n&#x200B;\n\nRecommendation:\n\nIf you like the powerful spec, I suggest you choose the Yoga Pro 9i 14\" instead of this one.\n\n&#x200B;\n\nFeel free to ask any questions you want to know about this laptop. Also, appreciate so much if you can give me a upvote for my karma growth.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
  "Got the same spec as your for $1700. I really like the screen",
  "1 thing to consider is probably the battery life since I've had it for a bit. I lost about 20% in 1 hour of use. FYI it was at 165hz refresh and balanced mode. I was just doing some web browsing. So that's about 5 hours of use which is pretty good for my needs. It's pretty rare to not find an outlet work somewhere or in college which I think this laptop is aimed towards so probably not a huge issue. It's also understandable because it has a mini led 3.2k screen and AN i9 which is POWER HUNGRY for sure, the 4050 also doesn't help. But I feel it's worth it",
  "I have it and it have high pitch fan noises and came with a broken trackpad..",
  "What about battery life?",
  "Hi could you tell me what brand/model the wifi card is?",
  "The real issue with this laptop that nobody mentions - not even Lenovo - is the actual name of the product : Yoga.\n\nAll Yoga laptops are **convertibles,** aka you can flip the screen 360°.\n\nThis one can't, same for the 14'' version, which loose everything that makes it a Yoga a Yoga. You can flip the screen up to 180° which is kind of useless if you ever wanted to use it as a tablet.\n\nIt simply makes it a laptop with a touch-screen instead of a 2-in-1 laptop, and there are better ones out there.\n\n&#x200B;\n\nCurrently i don't even know if any convertible laptops using a Nvidia RTX GPU (and not an integrated graphics one) are available but the Rog Flow X16. Sadly it doesn't feature a numpad or a finterprint scanner.\n\nI guess the perfect gaming 2-in-1 laptop doesn't exist yet !",
  "Thank you for the review, I got the IPS on the way, seems like all the reviews are for the Mini LED version so happy to hear the IPS display is also nice.",
  "How's the battery life like on a casual usage \nbasis?",
  "Can You please tell me from where you bought it that cheaper?",
  "Here is lot of people who not will buy any notebook without numpad. Mostly programmers.",
  "Yep, the screen is amazing, the best 16” screen as of 2023.",
  "how so cheap ? considering getting this same setup",
  "Hey from where you bought it that cheaper in 1700 ?",
  "Now the laptop has been used less than 2 months, so the battery is in new condition.\n\nI took it to deliver a 2 hours session, with balanced mode. After the session, battery dropped to 55%. During the session, at least 1/2 time I was sharing screen, other time I was talking hence screen went to off automatically. \n\nIf you care about battery life, don't buy this laptop. 14\" laptop without discrete GPU would be much better.",
  "Wi-Fi 6E 2x2 AX & Bluetooth® 5.1 or above",
  "THANK YOU. I knew I wasn't misremembering that Yoga was their convertible lineup.",
  "If you have found a 2-in-1 laptop that can do games and has decent battery life, please let me know. I was excited by the HP Spectre x360 but they updated it to force OLED on the dedicated GPU models...",
  "How are you finding it?",
  "Seems like Costco has a holiday deal right now in north America. Same specs for 1499 USD. Get it before it's gone",
  "It was actually supposed to be 2000 but I got a discount from Costco.",
  "Costco. It was on sale for 1599 but with taxes was 1700",
  "I'm looking for something 14-16\" with very good performance, ideally 64 GB ram, dedicated GPU and good battery life, but it's hard to get the best of both worlds (performance and battery life)",
  "I wonder if before you started the presentation you change the settings to use less power, is this not an option ? I would only use full power settings if connected to an outlet",
  "thanks for the reply. i meant the exact model under device manager -> network adaptor. if that's not too much trouble. thanks",
  "Pretty great, build quality is nice. Don't like Lenovo service though, apparently not allowed to open up the device at all since it voids the warranty. When that's up I'll throw in some extra storage in the vacant m.2 slot. I also wish the mini LED display was available in my country, the IPS looks great, but I reckon the other one would look nicer. Also don't like the numpad, keep mistyping due to the offset. Overall pretty favourable but few nitpicks.\n\nThe massive glass trackpad is the best thing about this device.",
  "Yoga Pro 9i 14” fits your requirements",
  "There are 3 modes: saver, balance, performance. (not exactly the name, but doesn't matter)\n\nUsually I use balance mode, If I really need to use the battery for long time, I will switch it to saver mode, otherwise I prefer balance mode e.g. 2 hours session.",
  "No worries, under device manager -> network adaptor is:\n\nIntel(R) Wi-Fi 6E AX211 160MHz\n\n&#x200B;\n\nVoting up is helpful to me, thanks",
  "Cool. To be honest it seems like the Mini LED sucks up so much power/battery and is v reflective so the IPS sounds really good to me. How is the battery life for you?",
  "great thanks",
  "Sorry, can't comment on that as I use it plugged in 99% of the time. Also will note the IPS screen is very reflective as well.",
  "Torn Between Lenovo Yoga Pro 9i and Dell XPS 16 I'm currently torn between the Lenovo Yoga Pro 9i 16” (Intel Core Ultra 9 185H Processor, 32 gb RAM, 1 TB SSD, RTX™ 4060) and the Dell XPS 16 (Intel Core Ultra 7 155H Processor, 16 gb RAM, 512 gb SSD, Intel Arc Graphics).  The Lenovo is about $200 less and looks like the clear winner and I was really excited about it.  However, I am looking around online and it looks like a lot of people are reporting that they have all these problems with it (fried motherboard, power button not working, trouble with the ports, etc.) either straight out of the box or within the first few months and the customer support is TERRIBLE.  Do any of you have any experience with either one of these computers or with the support teams at Dell or Lenovo?  I am in the US if that makes any difference with regards to the quality of customer support.  I would plan on getting the highest level plan of support/warrantee.\n\nI will be using the computer for voice over and other normal person stuff (not gaming).  I am driving myself crazy trying to figure out which one to get!  Thank you so much for any input you have!\n\n ",
  "I am also looking at this same comparison and have included the Samsung Galaxy Book4 Ultra. I plan to use the laptop primarily for video editing.\n\nBased on pricing and specs which vary by machine, I'm sort of feeling like the machines are rated good, better, best in the following order - Lenovo, Samsung, Dell.\n\nI've read the same reviews about the power button/blue screen/lack of support on the Yoga. I've also read some negative reviews on the XPS concerning a variety of issues as well.\n\nThe Samsung has the most positive reviews, however I'm sort of waiting to see if the Galaxy Book5 Ultra will be released in February before making a final decision.\n\nI'd also appreciate any feedback anyone has regarding this comparison.",
  "Samsung has that 240hz pwm dimming thing else it's perfect.",
  "Lenovo Yoga Pro 7i is good? I recently ordered a laptop called the Lenovo Yoga Pro 7i. It has an Intel Evo i7 processor, an RTX 4050 GPU, a 120Hz LCD display with 3K/2.5K resolution. If anyone has the same laptop, I’d love to hear about your experience with it, especially battery life.",
  "I’m considering getting this exact spec but haven’t seen any reviews. How are you finding it if it has arrived?",
  "Lenovo Yoga Pro 9i Hey guys! \nJust bought a Lenovo Yoga Pro 9i\nSpecs are:\n\nIntel Ultra 9\nRTX 4060\n32GB Ram\n1TB SSD\n16\" 3.2 mini led display\nSo far it's been an amazing laptop, screen looks gorgeous (has 60-165hz refresh rate) and the speakers are out of this world. Choose it cause I wanted an all around laptop that offers good performance while being pretty portable and has a pretty minimal design. Yet, battery is not that great.\nBeen looking for videos on how to optimize it but haven't found anything other than reviews of the laptop. I'm still in the warranty time, I really like it, but looking for ways to optimize it's battery or taking it back and looking for something that has same performance but manages battery life better. So far it gives me 5 hours on a full charge. Turned off some things, lowered the resolution and even have it on battery. Which gave me a bigger expectancy on battery duration while unplugged. Just wanted to see other thoughts or maybe if you have any recommendations on the set up.\nUse:\n-Light gaming, don't care about graphics (have a console for that) but maybe single player games on the xbox gamepass.\n-Solidworks and other CAD systems are also in the picture.\n-I also like movies",
  "Lenovo Yoga Pro 7i is good? I Recently Bought A New Laptop With A 3K/2.5K Resolution, Intel Evo i7 13th Gen Processor, RTX 4050, And A 120Hz LCD Display. I Haven’t Been Able To Find Any Reviews For It, So If Anyone Has The Same Model, I’d Really Want To Hear About Your Experience With It.Especially Performance And Battery Life.",
  "Lenovo Ideapad Pro 5 Hello! I just want to ask on your thoughts on the [Lenovo Ideapad Pro 5 (14\", Gen 9)](https://www.lenovo.com/ph/en/p/laptops/ideapad/ideapad-5/lenovo-ideapad-pro-5-gen-9-14-inch-amd/len101i0096?srsltid=AfmBOoqk1d5xMU6o2gDVZwld_YepQJ0RLn6jtrDPKMwYJmvfxTS49swr). \n\nSpecs:\n\nAMD Ryzen 7 8845HS (with Integrated Graphics only)\n\n16 GB LPDDR5X-6400MHz (Soldered)\n\n512 GB SSD M.2 2242 PCIe Gen4 TLC\n\nBattery : 4 Cell Li-Polymer 84Wh\n\n\nSo far, I watched reviews online about this laptop, and I am pretty satisfied with this laptop.\n\nMay I also ask if it is possible to buy this laptop without an OS?\n\nThank you!!",
  "Does the Lenovo Yoga 9i Pro 16\" (2024) support 4TB SSDs? I want to get [this](https://www.amazon.com/Crucial-Plus-PCIe-NAND-5000MB/dp/B0B25M8FXX?th=1) NVMe drive for my Yoga's open additional SSD slot. But I'm reading about how there can be power issues, overheating issues, and even leakage issues when using the wrong drives for a laptop.\n\n  \nI'm trying to get educated, but there's not much to go off of about this laptop. Does anyone have any advice about what kind of SSD is most stable for a brand new, well-spec'd laptop like the Lenovo Yoga 9i?\n\n  \nThank you.",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Crucial P3 Plus 4TB PCIe 4.0 3D NAND NVMe M.2 SSD, up to 5000MB/s - CT4000P3PSSD8 \n\n>**Company**: Crucial\n\n>**Amazon Product Rating**: 4.7 \n\n>**Fakespot Reviews Grade**: C\n\n>**Adjusted Fakespot Rating**: 3.4\n\n>**Analysis Performed at**: 06-29-2024 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/crucial-p3-plus-4tb-pcie-4-0-3d-nand-nvme-m-2-ssd-up-to-5000mb-s-ct4000p3pssd8) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "I am trying to do exactly this right now. I cloned my 1tb drive on to a 4tb crucial drive and swapped (disconnected the battery to). Got the keyboard to light up, but no booting. Replaced it back to the 1tb, same error. I some how got it back on. Maybe holding he power button for like 60 seconds.... I don't know. I'm going to keep trying. No info on this laptop yet.",
  "Any update about upgrading to SSD nvme 4tb with your Lenovo yoga 9i 2024? Does it work and how did you go it, because I'm trying to upgrade mine to 4tb",
  "I opted for the 2TB to be safe. Let me know if you go through with it though",
  "Yes I got it, kingspec xg 7000 4tb, and it's working fine, I have 4tb in one slot and 2tb in second slot as storage. All is working fine",
  "i'll be damned. maybe i'll get a 4tb someday, haha. Thanks man!",
  "Lenovo Ideapad 5 Pro 16\" Review (Comparing to Dell/HP/Samsung) My old HP Envy broke so I purchased 3 consecutive laptops and returned them all. The new HP Envy screen made my eyes hurt, the dell Inspiron 16 had really odd sounding speakers and shut down randomly even after re-installing windows, and the Samsung Galaxy Pro Book was sleek and well built but the screen was very pixelated. All where Ryzen 7 besides the Galaxy which was i7\n\nThe fourth laptop I tried was the  Lenovo Ideapad 5 Pro 16\" QHD Laptop with AMD Core Ryzen 5 5600H / 8GB RAM. I got it on sale for $500 and thought it would be very basic.\n\n1. The build is awesome and has the best keyboard out of all 4 laptops I've tried. Sleek and seems light but sturdy.\n2. Sounds is great and features like face-scan sign in are appreciated.\n3. Start up time is fast fast fast\n4. Also, I accidentally put a lot of my weight on the screen (laptop was shut) when trying to kill a bug on the wall and the screen survived no blemishes.\n\nCon:\n\n1. Matte screen is not super appealing but the more I use it the more I don't mind a matte screen at this price range.\n2. I would not want to pay $900 for this but if you can get it under $600 thats a real deal.\n\nThis is my first Lenovo and I am impressed so far, for $500 total paid this is an A+.",
  "I own the newer model of this with a Ryzen 6800HS RTX3050 and 16/512GB that I got for $1100 and I like it a lot. There is also a Ryzen 6600HS RTX3050 16/512GB for $840. An Intel 11300H MX450 8/512GB model for $530.\n\nThey all have the same display and build quality and its a pretty solid line up to pick out how much horsepower you need in this budget friendly yet premium design.",
  "Having owned the galaxy book pro, it doesn't use Ryzen. It's an Intel based laptop with Intel's evo certification.",
  "They all have the QLED matte screen?",
  "Hey, \nHow good is temperature x fan noise, battery life? \n\nI am thinking of buying the ThinkPad 5 Pro R7 6800HS or Yoga Slim 7 ProX R7 6800H or Zenbook Pro 17 R7 6800H, but I am not sure which one is the best choice :D",
  "Hi, sorry to bother you again, but I bought that laptop as well and I am facing an issue sometimes... when i close the lid and open it after a while, sometimes I can't wake it up. Have you encountered something like that?   \nSeems like a software issue to me, but I don't really want to reinstall it after I signed up into everything and so on :D",
  "That's right, Ill update the post.",
  "QLED? They all have 2.5K QHD 100% sRGB 350nit 16:10 16” matte displays. Some of them are 120Hz too like mine.",
  "Thermals are good since the wattages are low. It’s like 35W CPU and 55W GPU or something like that. Fan noise and surface temps are also good. Cooler and quieter than my brothers G14 but then again his laptop pumps way more wattage to the components.",
  "How about [Ideapad 5 Pro](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-500/ideapad-5-pro-gen-7-(14-inch-amd)/len101i0057) for $850 vs M1 Mac Air with (16+256) for $1,137 and a $150 gift card?\n\nI'm going to use it for my research tasks for example using three browsers and keeping at least 15 tabs in each of them open simultaneously and running one word processor that's it\n\nI can deal with external storage without any issues. What would be the actual battery backup of the 6600HS version? My primary requirement is longevity, that it should at least survive my multiple browser tabs for 5 to 6 years. I have been using one IdeaPad 330S 14\" by Lenovo with 8 GB of RAM and 512 SSD, with one TB hard drive and extremely poor battery life that is for 3.5 hours and I've been using it for a 3 year and 8 months. Do you think if I do not take Apple Care Plus then I should not be touching Mac and I would be better off with one Windows device?\n\nI don't use any Apple products. Fixing Apple with out of pocket is surely scary! But, I just can't find a Windows alternative with similar battery life. While Apple is asking significantly more money for less RAM and storage, but yes I understand that there are things beyond RAM & SSD for which they are doing it. I have been used to cheap Windows machines so much that I am pretty reluctant to pay 850 for a Windows machine. I am building this argument in my head that if I am going to pay above 850, then it shouldn't be a Windows machine. But, then comes the back and forth discussion on what are you getting for your money actually! It is frustrating! I still can't decide.",
  "Yes disable the smart face detection features. In Lenovo Vantage there’s a thing that will automatically sleep when you walk away and auto wake when you come back. It does this by looking from the IR camera. I found turning this off fixes the lid sleep wake issue.",
  "Got it, that’s what I meant sorry. How do you like the matte finish versus the newer shiny alternatives it looks a little retro but I guess it’s easier on the eyes.",
  "Great, thanks! And the battery life? In specs is usually around 9h, but I didn't find any review in English so...",
  "Battery life will be better on the mac and the 16GB RAM will go farther in MacOS than in Windows. The Pro 14 probably gets around 10 hours real world use depending on what you're doing but the M1 Air gets like 15 hours real world use.\n\nMacOS is more efficient with RAM and swap so a 16GB M1 Air will feel more like 24GB in Windows. That is the major downside to the Ideapad Pro line is the soldered RAM. I got 16GB soldered and I am fully aware of the RAM limitation in Windows, and I am fully prepared to run Linux in a few years if I need my RAM to be used more efficiently.\n\nHonestly the only reason I got the Ideapad Pro 16 over a Mac was 1. I like to game while I'm traveling and 2. I wanted a bigger screen. The only big laptop Apple offers is insanely expensive. I get like 80% of the experience for half the cost. But the Ideapad Pro 14 vs the MBA 13, you don't really lose much with the MBA in terms of screen real estate, but you gain so much in battery life and RAM utilization without paying twice as much.\n\nDo you live near a micro center? If so, check if they have any more of these refurb Ideapad Pro 14 in stock. This is a killer deal for $500 for almost the exact same laptop just with a 5600U from last year instead. https://www.microcenter.com/product/648423/lenovo-ideapad-5-pro-14-laptop-computer-refurbished-grey",
  "Great, thanks.\r  \n\r  \nI found these features very interesting, but it makes sense it causes problems. Turned them off, will see tomorrow. \r  \n\r  \nBut so far, great laptop for that price, only 32GB RAM could come handy sometimes. :D",
  "I don’t like glossy. At only 350 bits it’s bright enough but not bright enough to fight a glossy reflection.",
  "Office work in power saver mode I get around 8-10 hours\n\nGaming on iGPU in balance mode around 2-3\n\nGaming on dGPU on performance like 1 maybe 1.5",
  "Here is a review of the AMD model from last year. [https://youtu.be/yDdmVlnA\\_HY](https://youtu.be/yDdmVlnA_HY)\n\nAnd the Intel model. [https://youtu.be/Hu5FHcMMgLc](https://youtu.be/Hu5FHcMMgLc)\n\nThey're both basically the same laptop, just with different internal specs.",
  "This is extremely helpful. Even if I pay around $1140 (for M1 Air 16+256GB) i.e. $250 more (not counting the $150 gift card) than IdeaPad 5 Pro (16+1TB) it would be a good investment, right (even if I am not into the Apple ecosystem)? Again, my priorities are longevity, and good real world use. I am a grad student from literary background, so research and writing is what I do. No gaming or using intense softwares at all!\n\nI am scared to use any refurbished product unless it is a personal source or something like that. Would it still be wise to think about the refurbished one from micro center? I mean the price is really good! Just have to be lucky to not run into troubles.",
  "Lmk if it worked.",
  "Wow, that's great, thanks.",
  "I would say the M1 Air is worth the investment especially for just reading and writing. I’m a scientist and spent most of my PhD reading and writing papers too. If not for gaming, I too would enjoy an M1 Mac. My wife has one. Real world experience is just flawless.\n\nIf you are on a budget though and that micro center option is available I would go and check it out. It’s a Lenovo refurb so it’s from the factory, micro center is just the store front. MC has some of the greatest customer service in the world so if you’re at all interested just go in and ask them about it. Since it’s a factory refurb it likely has a warranty on it.",
  "Get an LG Gram.",
  "seems like it is, so thank you!",
  "After a while I have to say that it still doesn't work as It should.   \nI put it in sleep mode manualy from Windows start, close the lid and the next day I can't wake it up again - but It might be because it still drains battery and in Windows I see \"Screen on 11h\" as the battery drains almost 10%/hour even though it should be in sleep.   \nTried clean install but the issue still continues.\n\nIdk, I will prolly try to contact Lenovo if I won't fix it today, cause it might be hw issue... great.",
  "It took some tweaking to make sure nothing was running on the dGPU when I’m just doing office work. But after about a week of diligently checking the 3050 usage I got it down.",
  "Wonderful! I have dropped a text into your chatbox.",
  "Ah! Too late! Went with the [Lenovo Ideapad 5 pro 14\"](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-500/ideapad-5-pro-gen-7-(14-inch-amd)/len101i0057) for $750 with tax.",
  "Did it ever get resolved?",
  "Hey man, have you been happy with your purchase?\n\nI’m asking because I’m looking for a new laptop for the exactly same usage as you (postdoc researcher), and am considering the same options as you did (Ideapad 5 pro vs M1 Air). Currently leaning towards the Ideapad because it’s on sale for a good price at a local retailer and I don’t have too big of a budget right now. It would be about 400€ cheaper than the Air.",
  "Depends, the issue is audio driver from some reason and they obviously didn't fix it - [https://www.reddit.com/r/Lenovo/comments/xggq44/ideapad\\_5\\_pro\\_wont\\_wake\\_up\\_from\\_sleep/](https://www.reddit.com/r/Lenovo/comments/xggq44/ideapad_5_pro_wont_wake_up_from_sleep/)\n\nSince I downgraded to older realtek driver (I have to do this kinda often, since windows likes to upgrade it back), this issue has been \"resolved\".",
  "I am getting 8-9.5 hours battery from moderate to low use. The screen is fabulous but have to keep the brightness at 70-80 in mid to high lit condition since it's not anti-glare. All the complaints about fan noise is absent for me. I have been using it for almost a month but the fan has never kicked in with high pace, whenever it did, it was very silent. I work at rooms with 4-5 people and mostly at library, no noise at all! The keyboard is a Lenovo chicklet, so sort of standard if you have used Lenovo ideapad series before. No lag till now for my work flow (CPU 30-60%, MEM 50-70%). I don't game, so can't comment on the graphics. Build quality is on the premium side. Tested the speaker by comparing with last year's XPS 15, apart from the bass, it's good for the money. The 1TB SSD has totally doable speed, but no extra slot. Wifi 6 is upto the mark here.\n\nTake M1 if you want more battery, a bit more PPI, a better speaker, be connected to the Apple ecosystem, and do not mind the bezels and are fine with Apple repair costs.\n\nI didn't want to pay $1000+ for the 512GB+16GB M1 version in the hope that it would last me for 5 years without any issues. I decided to pay $750 with the hope that it would last me 4 years and then I can buy another!",
  "Thanks for this. \n\nI was on the point of pulling the trigger on this one last night and suddenly started seeing these warnings people were posting.",
  "Interesting followup on this.\n\n1. As I was waiting for your response, I now see that the laptop I *almost* bought has a 20% discount *today*...but\n- Also why waiting, I discovered a fix for my existing laptop problem and I don't even *need* a new laptop anymore...it's charging again.",
  "Thank you for taking the time to write such a detailed reply! Still going to have to think about it for a bit, but you gave some really useful information.",
  "My Lenovo IdeaPad 5 Pro 16ARH7 is lags every 10 seconds if not connected to power. Hey guys. A few months ago I bought Lenovo IdeaPad 5 Pro 16ARH7 16\" IPS 120Hz (Ryzen 7-6800HS/16GB/1TB SSD/GeForce RTX 3050 Ti. When I use it without charging it , it lags for half a second every 10-12 seconds. When it is connected to power, it is working perfectly. I've already reviewed my settings but nothing seems off. Any ideas? Thanks in advance.",
  "Check your laptop's battery health in the BIOS, as the issue is likely due to a faulty battery",
  "Lenovo Yoga Pro 7 with i5 13500H I’m looking for a laptop with touchscreen mainly for work, browsing and streaming. For my work I usually have some 20+ tabs open at once and several excel files. Would this Lenovo be a good choice? I don’t want the laptop to overheat fast or become slow with that many tabs open. I’ve found several positive reviews about it’s performance but none with the i5 13500H. Also one of the reasons I’m considering it is the price, around 750$ US.",
  "Did you get it? Hows the performance and any heating/battery issues?",
  "No, I got the Asus Zenbook.",
  "How is the battery life of asus zenbook after medium uses?",
  "Which Asus Zenbook did you get? What's your impression after initial usage?",
  "Lenovo Yoga Pro 9i - Is it good for gaming? Goooddmorning,\n\nLadies en gents, I need your help! I'm thinking of buying a Lenovo Yoga Pro 9i,  \nSpecs: intel 13th i7, 16GB DDR5, 1Tb SSD, Mini-led 3.2k and NVIDIA RTX 4060.  \nIm planning on using it for entertainment and gaming. \n\n  \nI've seen reviews on the creator side, but im wondering if some of you have expierence with gaming on this machine, think of Assissins creed, total war, MineCraft (shaders) and GTA.\n\n  \nHope to get your opinion on this!\n\n",
  "I'm looking at this as well! Looking for more gamers that have used this.",
  "HP spectre x360 14\" 2024 or Lenovo Slim Pro 9i 14.5\" I am going to college for cyber security this fall, and I need help choosing a laptop. I need 32 GB ram and 1 TB SSD. I am not interested in gaming, money is not an issue. I narrowed it down to these 2, but don't know which to choose. I welcome to any advice or help. Thank you!",
  "neither... for that price I would get a dell latitude or even a precision those would last much longer...\n\nspectre 360s are very problematic and there's always tons on my local fb marketplace that are in peices.",
  "While I do agree with you, I admit that looks so matter to me a little bit. I know they shouldn't, but those dell laptops are a bit too dated for my taste. Also, il looking for something thin that I can carry around easily.",
  "yeah, but you still shouldn’t get either of them. if you want to go the hp route, get an envy(if u rly want 2-1) probook, or dragonfly. otherwise get a thinkpad. at your budget you should be able to afford some powerful business laptops",
  "Then get an XPS",
  "[removed]",
  "spectre isn’t a bad laptop, but for a business laptop and the associated price tag it’s not a great offering compared to the others. repairability for one sucks on the hp spectre",
  "Is My New Lenovo Yoga Pro 7 Worth It? Seeking Advice on Battery Life and Performance Hi everyone, I'm just looking for advice on a laptop that I've recently purchased. I bought the Lenovo Yoga Pro 7 on sale for €780 (\\~$850). The laptop is certainly an upgrade from my previous laptop, a Dell Latitude 5410, but I'm worried it's not as good as advertised.\n\nReviews and advertising promised an all-day battery life, with some asserting it was easily over 10 hours. However, in my limited time with the laptop, I have only been able to get 5/6 hours and that's just with some web browsing (job applications, filling forms, etc.), some MS Word, & watching videos and TV. I was wondering if this is the best I would realistically be able to get at this price point, especially since this laptop was on sale for \\~50%. Ideally, I would also use this laptop for some video editing and media stuff so I wouldn't want it to die too quickly.\n\nI've been looking for a 16GB RAM/512GB SSD as the min spec for a laptop, with battery life as a huge factor, as I would like to bring this laptop to college without worrying about needing to charge it. I was initially looking at the ASUS Zenbook and some Macbooks, as they seem to be the best portable performance options with reliable battery life. However, Macs are a bit out of budget, and I haven't really been able to find a Zenbook.\n\nThis laptop does have a 100w adapter and some pretty fast charging, which is good, but I'm wondering if I should go through the return process and look for an alternative, or am I being neurotic and did I get a good bang for my buck considering this is a Windows machine?\n\nI will leave the specs for the laptop below\n\nProcessor: AMD Ryzen™ 7 8845HS Processor (3.80 GHz up to 5.10 GHz)\n\nOperating System: Windows 11 Home 64\n\nGraphic Card: Integrated AMD Radeon™ 780M\n\nMemory: 16 GB LPDDR5X-6400MHz (Soldered)\n\nStorage: 512 GB SSD M.2 2280 PCIe Gen4 TLC\n\nDisplay: 14.5\" 3K (3072 x 1920), IPS, Anti-Glare, Non-Touch, 100%DCI-P3, 400 nits, 120Hz\n\nCamera: 1080p FHD RGB/IR Hybrid with Dual Microphone, E-Shutter\n\nBattery: 4 Cell Li-Polymer 73 Wh",
  "Lenovo Ideapad 5 pro 16 gen 8 battery life Hi all, I am considering this laptop with i7 13700 and rtx 4050 over 7th gen of this same laptop, which comes with amd 7 6800h and rtx 3050. The price difference is 100€ in my country, so would like to know if it is worth it in your opinion.\nTo me it seems like a good deal, but my biggest worry is battery life, because as far as I know amd is more power efficient. Both laptops have 75wh battery. Does anybody happen to know the battery life of this laptop? I couldn’t find any reviews on it yet. Thanks in advance",
  "I would wait for the ryzen 7840hs version for the 16inch since it's so much more efficient and the integrated radeon 780m has enough power for most tast. compared the rtx 4050 which will drain battery",
  "following",
  "Hi, this reply has given so much light, lol.  \nI'm actually lookint at the 7840hs version, 16\". And I'm dwelling between getting the 16gb RAM + RTX 3050 6gb (newer version added 2gg... also I know it's the low tier gpu, but anyway) OR getting the 32GB RAM with NO GPU.  \nI will use it mostly for work with lots of cloud-based web analytics and web advetizing apps, and multiple dasboards and tabs at the same time. And casual gaming, Dota 2, Lol, Far Cry 5 (from time to time) and maybe some video editing, but midlly.   \nBattery duration is important but a 1hr difference is not really abig deal.  \n\n\nWhat would you suggest? Thanks!",
  "what did you decide man in the end? what model and what characteristic. Also would be glad to hear about battery life",
  "Got the Amd 7 32gb 16\" with no additional GPU (as mentioned above). \n\nWorks like a beast, and its very comfy in terms of screen size and weight is surprisingly not so heavy. \nThe downside is the battery life, I selected a larger battery and even so, after 3hrs of gaming (full) I have to plug in. And light work is around 5hrs. I think its the screen size that really depletes it. But apart from that is amazing overall.",
  "Is your screen IPS? I assume ultra 7 155 wirh igpu intel Arc should be similar to AMD 780m. Do you think with these iGPUs we can live for at least 4 years ?\n\nI saw new vivobook with the new HX 370 chip but it costs like 1700 Euro, too expensive. Lenovo will have AMD HX365 too for ideapad but I assume cost will be expensive too.\n\n\nLet's imagine,  if you would have 16gb ram and RTX, how much difference it would be with the battery life during light work like ms office and browsing? If it is only 1 hour then maybe it worth to have RTX",
  "For me the point was that in the long run the 32gb will prove more useful than a GPU with 6gb of ram, which will really not add much versus de AMD 780m, besides I don't game too much on PC as per my original comment for lite gaming as Dota 2 and else will do as well with 780 as with rtx. \n\nWhat I can tell you is that the 16\" screen is nicer for me as I work excell and a lot of analytic tools so the space comes in handy, as well as some webmaster work its helpful.\n\nYes, its IPS display.",
  "My order will arrive this week and it is also IPS screen. Yesterday I compared with OLED (yeah it is so $€xy screen haha but I think this IPS should be good too, not like cheap one from other brands. About 32gb and igpu you might have a food point. \n\nAlso I was hoping to get something with AMD AI strix point but seems like they are actually going to be very expensive. However based on news 890m igpu will be like rtx 3050 almost.",
  "Good choice! And yes, the IPS panel is noy as crispy (sexy) but for me its more than enough, its a 2.5K resolution panel, and thin edges, definitely beautiful and not cheapy at all!\n\nEnjoy your rig!",
  "How long have you been using your new device? And for how many years you think it worth investment? I hope windows 12 will not limit us and push us having NPU 45+",
  "8 months, so far, amazing! I dont plan on changing PC for the next 4-5 years. \n\nWhat's NPU 45+?",
  "Lenovo yoga 9i Pro or not? Hello to all, \n\nI'm a student and usually not the most knowledgeable with picking laptops and such. I've heard lots of good reviews on lenovo so I am mainly thinking about buying one of the yoga 9i, or yoga 9i pro. The confusion comes from being unsure if the pro version is worth the extra money, with the 32gb memory and 1Tb storage. Also the yoga 9i (not pro) has included within the price a case, a dongle for usb-c/ HDMI, and the pen for the touch screen (which costs an additional 60€ almost).\n\nI would like to get a 2in1 device to make note taking easier as well (buying a good laptop and good tablet becomes way too expensive). My use is generally just watching videos, or listening and working on microsoft (word or excel most often), I will also be using applications like matlab and occasionally solidworks. Usually I work with 2 screens (laptop +1) by connecting with HDMI.\n\nAny advice is appreciated\n\nThank you\n\n[Yoga 9i pro specs](https://preview.redd.it/76z4eerlpb0c1.png?width=1304&format=png&auto=webp&s=58d7d8bb884c7f1f4fb01fe165666a168593184d)\n\n[Yoga 9i \\(not pro\\) specs](https://preview.redd.it/cu5kwqvtpb0c1.png?width=858&format=png&auto=webp&s=ac3beb1d01bb0cf136b9c71d31287bba2bac6bbd)",
  "You are getting ripped off. I got the 16in pro 9i with an i9 13905h processor and the same specs but a slightly better resolution for 1700 US dollars with taxes. You are paying almost 2000 for a smaller laptop with a 4050 which has a lower power limit than the 16in",
  "Soldered RAM which means you can't upgrade it - so if you plan on keeping it, just pay for the 32gb RAM upgrade.",
  "I’m in the EU so I think that’s why there is this price difference. This is from the Lenovo website. i9 processor can only be added on the the pro but will raise the price again by about 200.",
  "How different will the 32gb be compared to the 16 in terms of my usage. Since I do plan on keeping it. I’ve had a MacBook for around 8 years and would hope that this would last almost the same",
  "Did you buy it in the end ?",
  "I would go for the Yogo 9i because the processor is pretty similar but your use case isn't super demanding so the ram and gpu isn't a problem. Unless you plan on playing games or want to be future proof by getting 32gb ram get the pro.",
  "Since you're now comparing this to coming from an Apple product, let me explain -   \n\n\nFor laptop PC's, expect 1y-4y because of hardware degradation and WinOS issues later on.   \nMaybe 5y if you really take care of it and reformat the OS when it needs it after years 1.5y-3y.\n\nNot everyone keeps a MacBook for over 4y-5y, either. \n\n16gb on Windows 11 OS is bare minimum for enthusiasts, which means that if you're into design and multitasking, why bother with anything less than 32gb? \n\n8gb RAM on Win10 OS was already barely cutting it for just regular usage. \n\n32gb is for breathing room of other applications that need to remain running in the background, as of Q4-2023. \n\nIf you're spending that much, just get the 32gb RAM and be done with it. \n\nRE: occasionally solidworks  \nThis statement alone already closes the gap of 16gb vs 32gb. \n\nHonestly, you're sacrificing a lot to get a 2-1 computer with a hot burning P-processor on a thin frame, and the lack of upgrade to 64gb RAM. \n\nGet the computer right where it's not sacrificing power, thermals and RAM upgrade capability, ...and just get a regular laptop that's not a 2-1 flatbread laptop.   \nIE - ThinkPad X1 Extreme gen5 is a thin laptop with advanced cooling capability on hot CPU/GPU, and it just blatantly sucks, it's not setup for long term thermals barrier push. \n\nIf you want to take notes that badly onto a tablet, then get a discounted iPad or Galaxy tablet with a pen to see if you're even going to use it or not. People have gotten through engineering courses on notebook paper and heavy laptops, you're not the first to need a tablet computer, but I won't rule it out of the equation if that's your preference for learning in the class and being on the go.\n\nYoga Pro 9i will work with 16gb, but the RAM is not upgradeable, and you'll likely be regretting it later by not jumping to the 32gb, for an few extra bucks.",
  "I did not buy anything in the end as I had other expenses come up. A friend of mine got the yoga 7 pro I think and he’s very happy with it for his work. Mainly viewing/ editing files (pdf and Microsoft office) and some web browsing",
  "Thanks",
  "Thank you for the detailed answer",
  "Can I DM you?",
  "Yeah sure",
  "Lenovo Pro 9i Yoga or Copilot+PC laptop Hi, I want to purchase 15/16-inch mobile laptop for heavy Imaging data analysis so excellent screen is a must), lots of Excel, Fiji/imageJ (image analysis) and Graphpad files which would be easy to navigate between as well. I don’t care about gaming.\nI was on the verge of buying a Lenovo Yoga Pro 9i 16” (with NVIDIA RTX 4060) - attached pic of model. \nBut now I’m really tempted to get a copilot+PC laptop and thought it might help me with some analysis. I did research the options and best one in terms of graphics and performance seems to be a surface laptop (15” with 32 RAM) - attached pic of model. \nThe GPU in all of the Copilot+PC seems to be an “entry level” how “poor” is this and do you think it should be a deal-breaker? \nAs for the Yoga Pro 9i I heard bad reviews related to battery life though it seems that the newer model (2024) is doing ok. \n\nThe cost is not an issue currently as both are comparably same price. \nI care about (written according to importance):\n\nbuild quality and longevity \nhigh sustained performance with minimal throttling\n(Will the copilot/AI benefit here?)\nscreen quality and color accuracy\n battery life\nkeyboard quality\n\nI don’t care about:\nwebcam quality\naudio\n\nThanks !",
  "Lenovo Yoga Pro 9i 14,5\" in 2024 Hi.\nI was almost ready to throw money after the Lenovo Yoga Pro 9i 14,5\" laptop when it suddently sold out on all shops in denmark.\nI am looking for the i9, 32gb 1000gb SSD spec with 14,5\" touch 3K monitor. \nA's far as I can see now they only sell the 16\" version or the 14,5 with lower specs. \n\nAnyone knows if the 14,5\" version will return sometime in 2024? \n\nAlternatives could be asus ZenBook pro but I have good history with Lenovo. \n\nBR Søren\n",
  "Hey if you could the 16 in is a lot better than the 14.5. If you get a Nvidia GPU the power limit for the 16 is a lot higher which gives a lot more performance. Also the speakers are leagues better",
  "Thanks for both replies.\nUnfortunately the 16\" is too big to carry around.\nIts docked to a USB-C hub 95% of the time so mobility is a main factor for travelling and when I work device-only.\nMy current device is Huawei Matebook Pro X which is 13,9\". Huawei has made a new 2024 version with 32gb ram and a slightly larger display but it isn't available i denmark unfortunately.\nThanks afain through.\nI'll have a look at the Asus instead.",
  "I second this. Lenovo is not planning to refresh 14” model this year, but the 16” 2024 refresh is amazing.\nIf you want to know more, great review here: https://youtu.be/cq9t7zs9EJQ?si=bl2tWgMSVuv3DTLt",
  "Which one to keep - 1) Lenovo Z16 Gen 1 UHD OLED 32GB Ryzen 7 Pro OR 2) Dell XPS 15 (9530) i7-13700H Non-OLED  \n\nI am currently **debating between two laptops** (have to decide which one to return):\n\na) a new **Dell i7-13700H XPS 15 9530 (2023) Arc A370M 512GB SSD (16GB RAM**, but if I keep it, I would upgrade it to 40GB or 56GB using a 32GB or new 48GB SODIMM). It arrived arrived today\n\nversus\n\nb) a **Lenovo Ryzen 7 Pro 6850H Z16 Gen 1 with 32GB RAM UHD OLED and 2TB (2022) with a discrete Radeon GPU** which I have had for 1 week.\n\nI will only be keeping one (also have a powerful 1 year old desktop with a 3070Ti - I do not game though).\n\nEach laptop has it pros and cons.\n\nIronically I was originally drawn to the Z16 by its sleek aluminum chassis. I then checked it out and reviews said battery life is great. Perfect I thought.\n\nHowever, while the Z16 I got was fantastic deal, it came with the OLED display - I know what you're thinking: great, that is the best display and it comes with 32GB RAM and a 2TB Gen 4 SSD).\n\nHowever due to their respective configurations (Dell non-OLED and only an A370M and larger Dell battery size vs. Z16 being an UHD resolution OLED panel and discrete GPU), for YT video playback (set to 720p) and 50% brightness, the Dell will last a lot longer!!! 10 hours and change vs 6 hours for MY OLED Z16.\n\nThoughts:\n\n**I am particularly concerned about the Dell's carbon fiber top wearing over time. An thoughts on this? If I do lean towards the Dell, I might have to look into a skin to see if that reduces the casrbon fiber top wear in the long run.**\n\n[**https://www.reddit.com/r/DellXPS/comments/oxk3jo/report\\_how\\_well\\_the\\_carbon\\_fibre\\_keyboard\\_deck/**](https://www.reddit.com/r/DellXPS/comments/oxk3jo/report_how_well_the_carbon_fibre_keyboard_deck/)\n\n[**https://www.reddit.com/r/Dell/comments/ei1jb9/how\\_does\\_the\\_xps\\_15\\_hold\\_up\\_after\\_years/**](https://www.reddit.com/r/Dell/comments/ei1jb9/how_does_the_xps_15_hold_up_after_years/)\n\n&#x200B;\n\n**Z16 Gen 1**: \n\n* I like the Z16's OLED UHD screen and the gorilla glass.\n* The Z16 keyboard feel seems nicer and is also supposedly spill resistant (but not sure it is as good as the old ones in that regard - [https://www.youtube.com/watch?v=0U5n2WaMMHo&ab\\_channel=Lenovo](https://www.youtube.com/watch?v=0U5n2WaMMHo&ab_channel=Lenovo)\n* The Z16's top deck is infinitely easier to clean and likely will not deteriorate like Dell's carbon fiber might.\n* Wifi 6E is a plus on the Z16, although not a huge deal given speed tests of both and my usage.\n\n&#x200B;\n\n**Dell XPS 15 (9530):**\n\n* The Dell (my config) has (likely 'much') better battery life than my Z16 (UHD OLED).\n* The XPS is also a bit smaller\n* Dells is upgradable - 2nd SSD slot and 2 SODIMM slots), whereas the Z16 is not upgradable at all, except the primary SSD of course) and has a matte screen for outdoor use.\n\nBoth laptops have aluminum builds and look nice and sleek and well built! Which was a big factor this time around.\n\n**So that is my dilemma and the Z16 return period is running out...**\n\n**Ultimately I know it is my decision to make, but there really is no clear winner IMO based on MY criteria. :)**\n\n&#x200B;",
  "Update. I ran battery tests on both. The XPS 15  thanks to its lack of UHD OLED crushed the Z16 OLED laptop's battery life (50% brightness, Battery Saver on): \n\nXPS 15 9530 (2023) i7-13700H Arc A370M: 10+ hours. \n\nZ16 Gen 1 Ryzen 7 Pro 6850H + Radeon 4500M + OLED  just barely over 6 hours - same video and settings as the Dell.\n\nBattery life test results - compare the battery percentages remaining:\r  \nStarted test at 6:47 PM XPS 100% Z16 100%.\r  \n8:26 PM XPS 86% 8 hours 4 mins. Z16 72% 4 hours 32 mins.\r  \n9:33 PM XPS 76% 8 hours 11 mins. Z16 54% 3 hours 27 mins.\r  \n10:32 PM XPS 68% 7 hours 25 mins. Z16 39% 2 hours 32 mins.\r  \nEnd test at 11:33 PM: XPS 59% 7 hours 23 mins. Z16 only 23% 1 hour 24 minutes."
]