[
  "User-Review: Ninkear A15 Pro The Ninkear A15 Pro has been updated with more current hardware this year. Its predecessor was equipped with an AMD Ryzen 5 6600H. The 2025 model uses an AMD Ryzen 5 7430U. Read my review here to find out how the device performs.\n\nhttps://preview.redd.it/pyf9pncxu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=1fd25bbdde81ba27af2fd5169b47bd3c9aa17f05\n\n**Design and workmanship**\n\nThe Ninkear A15 Pro retains a straightforward and unobtrusive design. The housing is made of aluminum alloy, which contributes to a solid feel. The surface is matte and resistant to fingerprints. The workmanship is appropriate for this price category, with clean edges and fits. The hinge still allows the display to be opened up to 180 degrees, which makes it more flexible to use and gives it stability. Weighing often less than 1.8 kg and with a slim design that is 20 mm thick, it is also easy to transport.\n\nhttps://preview.redd.it/pd5aceszu9ef1.jpg?width=1280&format=pjpg&auto=webp&s=58e8e1ef90e4b8338a011ab2802ff609941dbe25\n\nThe base is made entirely of aluminum and can be easily removed after removing 11 Phillips screws.\n\nhttps://preview.redd.it/ti7foey1v9ef1.jpg?width=1280&format=pjpg&auto=webp&s=4025e49254415ed35592f152584bd31cda7ac101\n\n**Display**\n\nOne feature of the Ninkear A15 Pro is its 16-inch IPS display. It offers QHD resolution (2560 x 1600 pixels), which enables sharp display of text and images. The brightness is specified at 400 nits. The color space coverage in the sRGB range is 99-100%, making the display suitable for multimedia content, light image editing, and office applications. The 120 Hz refresh rate supports smooth display.\n\n**Performance**\n\nInside the 2025 Ninkear A15 Pro is an AMD Ryzen 5 7430U with a TDP of 15W. These CPUs offer balanced performance and energy efficiency. In conjunction with 16 GB DDR4 3200MHz (one module) and a 1 TB NVMe SSD connected via PCIe 3.0. Daily tasks, multitasking, demanding office applications, and basic image or video editing can be performed smoothly. The integrated AMD Radeon also allows you to play less demanding games at moderate settings. Fortnite runs in Full HD at around 60FPS on the lowest settings.\n\nhttps://preview.redd.it/6ivvbzf5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=f9b5fc6852f21829cc49bbf8164cc7fcd4732269\n\nhttps://preview.redd.it/dg3ne1g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=55fabe070c429c1b00cb2d3a64cced24cedbf1a9\n\nhttps://preview.redd.it/lbno40g5v9ef1.jpg?width=605&format=pjpg&auto=webp&s=569979cb24136170fa055d0d9d9b90cd404af375\n\n  \nThe built-in PCIe 3.0 SSD is from a manufacturer called TSWC, which I am not familiar with, and I can't find any information about it on Google. The temperatures remained constant at 44°C.\n\nhttps://preview.redd.it/ye3nhzr7v9ef1.png?width=1012&format=png&auto=webp&s=e5999ee43785995c0cbd9fa02de490d00be345bd\n\nhttps://preview.redd.it/xjv4vxr7v9ef1.png?width=724&format=png&auto=webp&s=7c3d062da74b8645bc1cb25153738289b9630cab\n\nThe performance in Crystaldiskmark is also acceptable. However, the SSD was only 19% full. With an almost full SSD, the situation can be quite different. With inexpensive SSDs, transfer rates can plummet.\n\nSince I don't have another PC or laptop with a 6-core (and 12-thread) CPU, there is no comparable model here. The closest thing I have is an AMD Ryzen 5800H in my Lenovo Legion, but it has 2 more cores and is therefore always faster.\n\n\n\n|Benchmarks|Ninkear A15 Pro|\n|:-|:-|\n|3D mark Timespy (complete/CPU)|826/4390|\n|Cinebench 2024 (single/multi)|55/348|\n|Fortnite 1920x1080 Performance Mode all low|58FPS|\n\n**Input devices and connectivity, scope of delivery**\n\nThe keyboard of the Ninkear A15 Pro is backlit and offers a pleasant typing experience with good key travel and a clear pressure point. The keyboard itself has an ANSI-US layout, and no other layout is available for purchase.\n\nhttps://preview.redd.it/f4wb1oynv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=da8d3e7ca926567506df4725b2c054188998060b\n\nThe touchpad is a comfortable size, responds precisely, and supports Windows multitouch gestures without any problems. The fingerprint sensor is located in the upper left corner of the touchpad and works flawlessly with Windows Hello.\n\nUnlike the Ninkear N15 Pro, which I also tested, the two touchpad buttons are quiet and do not make a loud clicking sound when pressed.\n\nConnectivity is comprehensive: the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support, plus three USB-A ports (USB 3.0), an HDMI output for external monitors, a 3.5 mm audio jack, and a micro SD card slot. For wireless connections, there is Wi-Fi 6E and Bluetooth 5.3. On my 5GHz Wi-Fi, the laptop connects at 866 Mbit.\n\nhttps://preview.redd.it/5p6vvneqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=316d28c48d3bb1dd8dda8447db11fc5bdf8f2f23\n\nhttps://preview.redd.it/yqqx8geqv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=a8f0a5d9d59398a2e469fb0ece00bcc616028516\n\nIn addition to the Ninkear A15 Pro, the package includes a 65W USB-C power adapter, a very simple, inexpensive wired mouse, a small mouse pad, and stickers for the keyboard to customize it to your preferred language.\n\n**Battery life and cooling**\n\nThe battery life of the Ninkear A15 Pro is adequate thanks to the energy-efficient AMD Ryzen processors. With moderate use (office, browsing, streaming), 6 to 7 hours of use are possible, making it a companion for the workday or longer university sessions. The cooling system is barely audible during normal operation. Even under load, the noise level remains low, and the case only heats up in certain areas, but remains very inconspicuous overall.\n\n**Upgrading**\n\nThe RAM can be upgraded as there is one slot free. The built-in RAM is from a manufacturer unknown to me called Gofatoo. It will be very difficult to find a second identical RAM module. If you plan to upgrade the RAM, buy two 16GB modules from one manufacturer.\n\nhttps://preview.redd.it/3f0wg3ktv9ef1.jpg?width=1280&format=pjpg&auto=webp&s=c8b2596f11b270335be8260aea8e08d583b44df4\n\nThere is also a second NVME SSD slot in which a second SSD can be installed. This is also connected with PCIe 3.0 x4.\n\nThe Wi-Fi module is also located in an M.2 slot and can be replaced if necessary.\n\n**Conclusion**\n\nThe Ninkear A15 Pro (2025 version) offers a good balance between price and performance and is aimed at those who are looking for a notebook for productivity, multimedia, and occasional gaming. For students, home office users, and anyone who needs a reliable all-rounder, the Ninkear A15 Pro (2025) is a good option. The price in the company's own online shop is currently around €570. The device is shipped from Germany. Unfortunately, I cannot say anything about support and/or warranty issues.\n\nThanks to Ninkear for providing me with the device for testing.\n\n\n\nBest regards, hugoLOST",
  ">the device has two USB-C ports (USB 3.2 Gen 1) with Power Delivery and DisplayPort support\n\nAre you sure the USB-C supports DisplayPort? I don’t see it mentioned anywhere on their website or on aliexpress",
  "Yes",
  "I only connected one Display",
  "Both",
  "Both",
  "Is whole body aluminium? Are hinges mounted well?",
  "Is factory installed system full version and legal ?",
  "Got the same laptop. There's a red watermark in the top right of the screen, but I don't understand how to remove it. If I take a screenshot it doesn't show. Any idea? Thank you in advance.",
  "How bright is the screen? 350 nits is true?",
  "Do you is it possible to buy battery for this A15 Pro model?",
  "Yes, I tested it. But not at the same time",
  ">So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?\n\nto this?",
  "Yes, but you tested the two USB-C ports for display support individually or only one of them? And you tested it in a USB-C to USB-C connection, right? Thanks again.",
  "Last question, USB-C to USB-C, USB-C to HDMI or USB-C to DisplayPort? Thanks!",
  "?.. There are 3 options",
  "Only the bottom and top cover",
  "Yes, an no virus or spyware is installed.",
  "Can you post a picture, mine doesn't have that.",
  "Yes. For inside with with the Laptop it's enough",
  "So, you mean they both worked on an external monitor individually but you haven't tested them in dual-link yet?",
  "How would you know?",
  "Thank you for your reply brother. I took a pic with my phone. [https://ibb.co/F4GTrggn](https://ibb.co/F4GTrggn)",
  "I searched with different tools",
  "Maybe it's a screen foil. Or the wallpaper",
  "It was the screen foil. 🤣\nThank you so much my friend",
  "No problem",
  "Will the ASUS ROG Strix G16 (2025) Handle My Workload ArcGIS Pro + AutoCAD & Tons of Multitasking? I am looking for a laptop to use as a workstation in case I need to provide my own equipment in the future. I am a Design Engineer working with Aerial & Underground fiber optics in the Telecom field. I mainly use ArcGIS Pro & AutoCAD for drafting & designing routes. While I have one of those programs open, I also must have MS Teams, MS Outlook, MS Excel, Adobe Acrobat, Google Earth Pro, 2 to 3 File Explorer folders, plus a web browser running Katapult + Katapult Photo + Katapult Map + Client Engineering Support Platform + Sharepoint + Smartsheet (around 6-7 tabs depending on Google Earth Pro/Google Maps) all running at the same time. I can get away with Google Maps most of the time. Long story short heavy multi tasking processing is a must.\n\nI do not know much about the difference between AMD & Intel processors but from what I have heard AMD excels at multi tasking & Intel is better at running single tasks. Please correct me if any technical information is wrong. Things have evolved a lot since I last purchased a laptop a decade ago for college.\n\nMy current position supplied me a laptop I am very happy with. Here are the specs:\n\nDell Precision 5690\n\nIntel Core Ultra 7 155H (3.80 GHz)\n\n32 GB RAM Speed 7467 MT/s\n\n1 TB SSD\n\n128 MB Intel Arc Graphics\n\n16 inch touchscreen\n\nI have had bad experiences with the Dell I used throughout high school. After having it serviced 7 or 8 times because of the cheap plastic hinge, I replaced it with an all metal Asus in 2017 when I started college. Here are those specs:\n\nASUS Q504UA\n\nIntel Core i5 7200U (2.5 GHz)\n\n12 GB RAM Speed 2133 MHz\n\n1 TB SSD\n\n128 MB Intel HD Graphics 620\n\n15.6 inch touchscreen 2 in 1\n\nEven though I had bad experiences with Dell in the past, this Precision 5690 is really nice. I like the all metal design for the shell & hinges. My only problems with it is that I have yet to see them go on sale and I hate that it only has USB C ports. The XPS goes on sale from time to time but I do not know if that will give me what I need.\n\nAfter doing research the unanimous answer from coworkers, gamer friends, the internet, & even AI was that the bare minimum I need is 32 GB RAM, 1 TB SSD, an AMD Ryzen 7 or 9 / Intel Core Ultra 7 or 9 / Intel Core i7 or i9 processor, & a dedicated graphics card. Preferably I want something that has an extra RAM slot & an extra M.2 slot so that I can upgrade RAM & storage in the future.\n\nI pulled an all nighter last night going through all of the Best Buy Black Friday deals trying to find THE ONE. I narrowed it down to Lenovo, & Asus. I ended up with three options: Lenovo Yoga 9i Pro, Lenovo Legion Pro 5, & the ASUS ROG Strix G16. All three had 16 inch screens but the Yoga got kicked out because it does not have expandable RAM or storage. That left the Legion Pro & Strix G16. I watched a ton of review & comparison videos, checked rtings, & I think I finally did it. I chose the ASUS ROG Strix G16 based on my personal preferences, AMD over Intel processor, & the nail in the coffin was my childhood friend’s recommendation plus his father’s recommendation. They preferred Asus over Lenovo. His fathet owned a Legion Pro, the best Alienware 16 inch, & recently switched to the Strix G16 & loves it. The only difference between my choice & his is that mine has the RTX 5070 while his has the RTX 570Ti, which in my opinion is not worth the extra 800 dollars which is the current difference with the black friday sale favoring mine.\n\nHere are the specs for the winner:\n\nASUS ROG Strix G16\n\nAMD Ryzen 9 9000 9955HX3D (2.5 GHz with boost up to 5.4 GHz)\n\n32 GB DDR5 RAM (5600 MHz)\n\nExtra SO DIMM slot (tool free)\n\n1 TB SSD PCIe 4.0\n\nExtra M.2 slot (PCIe Gen 5 ready)\n\nNVIDIA GeForce RTX 5070 with 8 GB GDDR7\n\n16 inch 2.5K 240 Hz 3 ms Nebula Display\n\nNow here are my questions for you all:\n\n1) Will this do what I need it to do?\n\n2) Do these laptops last or will it brick in a few years?\n\nI plan on babying this laptop if that helps.\n\n3) Is 20% off the best sale I am going to find for a current generation ROG Strix G16?\n\n4) Do I need an external cooling pad or fan? If not needed, would you still recommend one, & if so which one works best with this laptop?\n\nThis is going to be my personal computer that can double as a workstation if I need it. The fact that it is a gaming laptop is a plus for when I finally make the switch from console. I like the fact there are 2 x USB-A 3.2 in addition to the the 2 x UBS-C ports. I do not know if I will ever be a full PC person since I like being able to move around, laptops are my power meets portability. My job tried to give me a computer but I declined as I visit family and a tower is not a realistic option for me to travel with.\n\nI am sure this is probably way too much information & I might be making too big of a deal out of this. This thing will probably do everything I need & more. I just like doing my homework before sinking a grand or more into something. Buying a new car took years & the only reason I finally did it was because squirrels totaled my old one.\n\nThanks for your help guys and gals I really appreciate it!",
  "Honestly, think about if you actually NEED a laptop. With this budget you can build a WAY faster desktop.\n\nPersonally, I'd build an equivalent desktop which would save some cash, sell my current laptop and use that money to buy like a 4050 laptop.\n\nYou'd have a capable workstation at home, and a machine to get you by during the day.\n\nThat's of course if you don't NEED portability at all times. \n\nIf you do, this should be fine. I know a engineer who uses a RTX 2060 laptop for work to this day. And my dad's company (which is for construction), had some similarly powerful workstations a few years ago.\n\n\n\nTldr; This is fine, but if possible get a desktop + a reasonable laptop, for your use-case.",
  "I would say get intel, it had a lot more cores then amd, but in all fairness the laptop should be enough for all of your tasks, 32gb might not be enough so consider upgrading, but i think you should get the laptop",
  "I appreciate your feedback. I actually did think about it. Right now I'm doing well in my position, just was getting worried about the future. I have that ASUS that still works, & a back up Lenovo that was a hand me down to replace the eye sore that was my old Dell. The 2 in 1 ASUS got me through college using AutoCAD, Inventor, ArcGIS, & Solidworks. I don't think I need a new laptop (or desktop), I may have just been giddy at the prospect of getting a deal. I am a sucker for deals & have been known to be impulsive not to miss out on them. The deal is good for 1 more day so I'm going to sleep on it again tonight, but more than likely I may not move forward on it right now. As long as things are going well with work I don't need a personal work station. If I do need it in the future I will have done all this research & it will be an easier ordeal not having to start from scratch. \n\nThank you for your candor!\n\nEdit: I slept on it. I did some more research based on the other person's comment I looked for more comparison videos between the Intel Core Ultra 9 Series 2 U9 275HX & AMD Ryzen 9 9000 Series 9955HX3D on the ROG Strix G16 (2025). Based on that research I've decided to move forward on my purchase but have switched from the AMD to the Intel processor since the Intel model is newer, has an improved chasis,  & has a lot of newly improved features that support more future proofing and quality of life than the older AMD model. \n\nI am not a desktop kind of guy, portability is more important to me than strictly power & perfomance. I understand PC will outperform & be lower cost when compared to laptops. Also having both isn't a realistic option for me, it would be one or the other. My personal preference or bias is laptop > desktop.",
  "I did more research after posting & it looks like you were right. JarrodsTech compared the Intel & AMD versions. The Intel Core Ultra 9 Series 2 U9 275HX model came out ahead of the AMD Ryzen 9 9000 Series 9955HX3D in most cases. It also has easier access to the internals with a pull tab instead of 12 plus screws just to remove the bottom panel. The Intel model supports the next generation PCIe 5 for future proofing on both SSD ports whereas the AMD only supports PCIe 5 on 1 of 2. The Intel version includes 3 USB A ports where as the AMD only has 2 USB A ports. They have the same number of USB C ports but the port speeds are faster on the Intel than on the AMD model. The Intel also has WiFi 7 compared to WiFi 6 on the AMD.\n\nThe Intel model looks better with the 360° RGB, & it runs cooler thanks to the updated vapor chamber design. It also uses liquid metal & cools both the CPU & GPU, while the AMD version only cooled the GPU. The Intel also support facial recognition whereas the AMD does not. The Intel was more energy efficient and has a 29% longer battery life when compared to the AMD.\n\nI really appreciate your comment because it pushed me to dig deeper and helped me make a better informed decision. I was close to skipping a laptop upgrade this year, but based on Jarrod’s testing & how this newer Intel model performs and looks, I have changed my mind & am going to stop by BestBuy after work today to go ahead and place my order!\n\nIn case you wanted to see the comparison video I was talking about here is the link to it. [ASUS Strix G16 (2025) Review - Intel or AMD? Don’t Choose Wrong!](https://youtu.be/Qd-SXvTEjbk?si=wKORVbO8jDhPyMsf)",
  "I just realized in the checkout that the Intel has the RTX 5060 GPU (the 5070 is available but at a +$400 price hike) vs AMD which has the RTX 5070 GPU. The sale price between these 2 is exactly the same at 1,699. I'm thinking about sticking with the Intel because of the new and improved chasis, both M.2 SSD ports being PCIe Gen 5 compatible, improved cooling, ports, wifi, battery life, energy efficiency, and RGB.",
  "Is this a good deal?or should I just wait until Black Friday?(end of next month) ",
  "Don't know how the prices are in canada but in Germany i could get that Kind of Laptop for 1000€\n\nAlso you probably want Something with 32GB RAM",
  "For CAD its ok, maybe if you can find some discounts",
  "Wow that’s cheaper…It’s my first time buying a laptop so I don’t know if I can choose 32 GB on their website(maybe I can’t ,but if I go Lenovo’s office website I can build my laptop)",
  "yeah its CAD,maybe I can go to Best Buy this morning",
  "High performance, long lasting laptop requirement. Budget €2500 Hello all.\n\nI'm looking for a Windows laptop which will do me a number of years. As longevity is important, I believe performance is an important criteria. My current setup is an 8th gen Intel i5 Asus laptop (8/256) and a M4 Mac Mini (24/512) on the desk. I want to replace both of these items with a single Windows laptop and I'll sell the Mac. I find Windows is more natural to me so I'm going that route.\n\nThe laptop will be 80% on the desk, open and the screen being used in addition to my on desk monitors. Although it'll be on the desk, I don't want something that weighs a ton and is practically not portable. Also quieter fans always helps.\n\nMy work is quite varied from Affinity photo, VS Coding/Cursor, Docker, VM's, MS Office, 20-30 browser tabs open etc. Apart from the additional RAM needed for VM's/Docker etc, I probably don't need a very high performing processor but since my last laptop gave me 6 years and the one before that was a 2012 MacBook Air, I expect longevity. While I love the form factor of 16\", I can't stand the numpad on these laptops but I guess it's something I'll have to live with. Budget in or around €2500 but I'd very happily not spend that much.\n\nCurrent machines I'm looking at:\n\n\\- Lenovo Legion 5i (2024) - i9-14900HX, 16GB RAM (SODIMM so I can add more). 1TB SSD, 16\" 240Hz screen, RTX 4070. €2000  \n\\- Lenovo IdeaPad Pro 5 (2025) - Ultra 9 285H, 32GB RAM, 512 SSD, 16\" 120Hz 2.8k screen. €1400  \n\\- Lenovo Yoga Pro 7i Aura Edition (2025) - Ultra 9 285H, 32GB RAM, 512 SSD, 14\" 120Hz 3k screen. €1700  \n\\- Asus ProArt P16 (2024) - AI 370 HX, 32GB RAM, 1TB SSD, 16\" 4K 60Hz screen, RTX 4070. €2700  \n\\- Asus Zenbook S16 (2024) - AI 370 HX, 32GB RAM, 1TB SSD, 16\" 3K 120Hz screen. €1700  \n\\- Lenovo ThinkPad P14s Gen 5 (2024) - Ultra 9 185 vPro, 16GB RAM (SODIMM so I can add more), No OS, 1TB SSD,  3K 120Hz screen. €2200.  \n\\- Asus Zenbook Duo (2025) - Ultra 9 285H, 32GB RAM, 2TB SSD, 2 x 14\" 120Hz 3k screens. €2500\n\nI'm finding it very difficult to see past the value proposition of the Lenovo IdeaPad Pro 5 (2025) right now considering it's half the price of the ProArt P16 for practically the same (my) real world performance/usage. Any reviews for the IdeaPad I can find are quite positive. Second is the Yoga and I'm half thinking to just buy it and be done. I also realise that it's very early for many laptops to be available with the 200 series Ultra chips but I'm probably not interested in waiting for this or waiting for that. I'll probably buy in the next 2 weeks. I know the Yoga 9i is available in June but I suspect that would be outside my price range.\n\n* **Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:** €2500 (euro)\n* **Are you open to refurbs/used?** Yes\n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?** I'd say 80% desk based. Looking for something to last 5 years\n* **How important is weight and thinness to you?** Not overly important\n* **Do you have a preferred screen size? If indifferent, put N/A.** 14-16\" with preference for 16\"\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** Mostly web development so not heavy\n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?** N/A\n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** No requirement for a touch screen. Would like a very good screen to look at.\n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.** Longevity is important. Do not want a Mac (already have a Mac Mini that I'm moving away from). I don't need a dedicated GPU. With the 200 series of Intel chips out, I'm not overly interested in 100 series. Not overly excited by 14th gen Intel either due to issues. That said, I have included some options.",
  "Have you ruled out Asus Zephyrus G16 (2024 or 2025)? It is a cheaper Asus ProArt with the same of internals.  These Asus model carry the best speakers of all Windows laptops which is nice to have if you have kids or others to share a screen.",
  "Update: Added the ThinkPad P14s Gen 5 to the list",
  "Thinkpads amazing for build quality and longevity. The Ideapad 5 you're considering has significant issues with the hinge and will not last years if you use it like a laptop at all. I bought two Ideapad 5's and both failed at exactly 6 months, right after warranty expired. This is a widespread issue with the Ideapads though it's impossible to know with the brand new 2025's. \n\nFor your price range I'd probably say get the Thinkpad P1 gen 7 with OLED 4k. The Intel Ultra processors it comes with are generally efficient and quiet, and if you pick a lower TDP option GPU and something like the Ultra 7 155H it'll be very quiet when plugged in. Also, it has no numpad and a centered keyboard. As for price, there's brand new ones on Ebay with specs above that for about $1800-1900, from Lenovo with no sale it's over $3.5k lol",
  "Question: why are you listing high refresh rate laptops? Is that something you want?\n\nBecause I doubt you’ll max out that refresh rate in games unless you play older games or competitive online games.\n\nEdit: nvm just saw you don’t care about games.",
  "Have you considered a HP ZBook?",
  "T14 Thinkpads",
  "Update: Added the Asus Zenbook Duo (2025) to the list",
  "I did but seems a little difficult to find them not overly priced in Ireland.",
  "I'm doing some research on the P14s this morning.\n\nDirect from Lenovo I can get the Ultra 9 185H, no operating system, 16GB RAM, 256GB SSD, 3K IPS display for €2370.\n\nA local retailer has the Ultra 9 185H, Win 11 Pro, 32GB RAM, 1TB performance SSD, 2560x1600 @ 90Hz display for €1790.\n\nI don't think the better display is worth €600.",
  "Also, unlike the ProArt you don't need to pay for a 4070 you said you wouldn't be using much. The 16:10 screen is also good for web development with it's bit of extra height. P1's are also pretty much the top of the Thinkpad scale, being workstation laptops and thus very solid. P1 gen 7 is also 17mm thick and 2kg so pretty portable.",
  "You're right, I never game but do appreciate a nice smooth screen. High refresh rate is not a must have but more a nice to have.",
  "I will take a look, thanks",
  "Thanks. A lot of praise online for Thinkpads",
  "1700€ or 900€ laptop?? OBJECTIVES:\nI need a laptop for working in the summer and at the library, so I don’t have to carry my desktop and monitor. Remote work isn’t an option due to poor WiFi in cafes and libraries.\n\nPrograms I use: Houdini, Unreal Engine, After Effects, Premiere Pro, Blender\n\nLaptops Considered:\n\t•\tMSI Katana ❌ Poor reviews, cheap plastic build\n\t•\tHP Omen ❌ Selling old stock with black screen issues (might be fixed in 2025)\n\n\t•\tLenovo Legion Slim 5 (RTX 4060, 32GB) Good materials, solid cooling, positive reviews. The Slim version may not be ideal, but a classmate using it for Houdini says it performs well. \n\n\t•\tLenovo Legion Pro 5 Gen 8 (RTX 4070, Ryzen 9, 32GB) €1699. Good performance, but Lenovo laptops reportedly overheat and die after ~5 years.\n\t•\tGigabyte Aorus 16X 9SG ❓ Great cooling system, but I don’t know much else.\n\n\nMY THOUGHTS: \nI need a powerful laptop but not top-tier—spending over 1000€ doesn’t make sense since it won’t match my desktop anyway. \n\nInitially, I considered the Lenovo Legion Pro 5 (RTX 4070, Ryzen 9, 32GB, 1TB) for Houdini and Unreal, but realistically, I only need it for Unreal (mid-high workloads) and video editing. Houdini caching/rendering isn’t worth doing on a laptop—it’s better handled by my desktop, and 13h+ caching would destroy battery life.\n\nSo, for just Unreal and video editing, is a €1700€ laptop really worth it, or would a cheaper one with an older RTX and maybe 64GB RAM (+€200) be a smarter choice? I got the money but I feel like spending 900€ more for this purpose would be more worth it to spend in improving my other pc specs. ",
  "Lenovo Legion 9i sales price I was able to get the price reduced on a Lenovo Legion 9i for $3345 by stacking multiple discounts.  I upgraded three things as part of this price; Windows 11 Pro (from Home), 64GB DDR5 (from 32GB), and 4090 (from 4080).  Should I get it at this price?  I’m also thinking about downgrading the operating system back to Home and just sticking with 32GB DDR5.  Those changes would save me about $200.  Let me know your thoughts!",
  "I would recommend just getting the 7 pro. To be honest they don’t have too many differences and also the keyboard and track pad will be a lot more comfortable on 7 as apposed to the 9",
  "How did you end up getting to 25% off? What discounts did you stack? I am looking to pick up this laptop as well and would love to be able to get more than the 5% I am currently seeing on the site.",
  "Is 2k good price for the Legion Pro 7i 4080 ? Or I can find it cheaper during sales ?",
  "I looked at the 7 series, but decided I want that miniLED 1100 nit HDR display.  Unfortunately, it’s only available on the 9 series.",
  "I stacked 3 separate coupons; two from the website (sale + special discount) and my military discount ;-)",
  " Seems like a good price I paid the same for 32gb of 6400 ram and a single 2tb hard drive. I used Rakuten and got another 6% cash back too.",
  "My discount ended up being 25%, which is pretty insane.  I looked at doing the 32GB DDR5 6400 in place of the 64GB DDR5 5600....it's a tough decision.  The real problem is that the Legion 9i system memory can't be upgraded by the end user because Lenovo decided to solder the 32GB to the motherboard.  To make matters worse, the memory is on the backside of the motherboard, which requires the removal of the motherboard from the chassis just to access the memory.  So, for the sake of longevity and possible need for more memory later, I think going with the 64GB is the best option for me.  And, in my opinion, there just isn't enough performance gain to justify the minor bump to 6400.  I can upgrade the WiFi and storage at anytime as those are easily accessible.",
  " Yeah if you use it for work 64 gb could come in handy. I’m just using it for gaming so 32gb should be plenty. How long do you have to wait for yours?",
  "The memory is not soldered. It's on the other side of the motherboard",
  "I haven’t ordered yet - still on the edge on whether or not I really need it.  I definitely want it, but $3300 is not chump change for me…lol",
  "The hardware reviews said it was soldered.",
  "My mac just died I need help to choose a new laptop. It's a laptop for personal use. I will use it mainly for web browsing and gaming (no triple-a games, mostly old ones). Note that my mac was not able to run half life 1... I know nothing in this regard, but I want something reliable and tough. I'm looking for one of those 2 models. Which one would you suggest me and feel free to recommend other model as well (specs close to : intel i5 or AMD, 16gb ram, 512gb memory and a dgpu). Budget around 1-1.5k.\n\nhttps://www.lenovo.com/ca/en/p/laptops/legion-laptops/legion-pro-series/legion-pro-5-gen-8-(16-inch-amd)/82wm0000us#reviews\n\nhttps://www.lenovo.com/ca/en/p/laptops/thinkpad/thinkpadp/thinkpad-p15v-gen-3-(15-inch-amd)/21em0034us\n\nThx a lot !",
  "Which is better for me: Legion 5 Gen 6 or Ideapad 5 Pro Gen 6? I prefer light laptops, great battery life on iGPU mode or Optimus mode, a good screen, and great build quality(especially the hinges). I only play light to run games so the RTX 3050 is plenty for me. I going to use it for my computer engineering course and I heard having a powerful CPU is better so I picked the 5800H of both laptops.\n\nApparently, this config is sold out everywhere but I can still wait until next month(I think) or else I will get the R5 5600H config of the Legion 5 Gen 6.. [https://pccentralstore.com/collections/laptops/products/copy-of-legion-5-15ach6-82jw003nph-15nbu-gaming-laptop-amd-ryzen-5-5600h-nvidia-rtx-3050ti-15-6-fhd-165hz-16gb-3200mhz-ram-512gb-ssd-m-2-win-10-home-pc-central?variant=40951203365031](https://pccentralstore.com/collections/laptops/products/copy-of-legion-5-15ach6-82jw003nph-15nbu-gaming-laptop-amd-ryzen-5-5600h-nvidia-rtx-3050ti-15-6-fhd-165hz-16gb-3200mhz-ram-512gb-ssd-m-2-win-10-home-pc-central?variant=40951203365031)\n\nThe Ideapad 5 Pro: [https://gameone.ph/lenovo-ideapad-5-pro-16ach6-82l500kkph-16-2-amd-ryzen-7-5800h-nvidia-geforce-rtx-3050-16gb-ddr-1tb-ssd-storm-grey.html](https://gameone.ph/lenovo-ideapad-5-pro-16ach6-82l500kkph-16-2-amd-ryzen-7-5800h-nvidia-geforce-rtx-3050-16gb-ddr-1tb-ssd-storm-grey.html) But I could get the 5600h config tho but it is only around 6-8 USD less than the 5800H config",
  "[removed]",
  "Legion 5 Is great but to your point vs what you play and what you want to do with it. I support ideapad it does have a better battery life. I have a legion 5 myself so not being biased. 😊 hope you are happy with whichever you go for!",
  "I have the Ideapad and that 16” display is so nice for productivity. I came from a 15.6” 1080p ThinkPad and the 2.5K 16” just feels way bigger in terms of how I organize my windows. \n\nI would say get the Ideapad if you are satisfied with the lower power limits and performance. If you need more performance, skip the standard Legion 5 and look at the Legion Pro with the 16” display.",
  "Both are great devices though the Legion 5 will be a better long term CPU performer whilst the IdeaPad 5 Pro will sure throttle or use a little lower frequency after some time. I can bet though you will get better build quality, lighter build and better bttery life on the IdeaPad 5 Pro. Also The Screen might be better fo media consumption etc.",
  "well, im not gonna play AAA games and if Im going to, im fine with medium 60 or a bit lower than that",
  "I see. The Legion Pro turns me off because of the design so I didn't chose even though it is way superior on all aspects compared to the two that I have chosen.",
  "[removed]",
  "i already watched a ton of reviews and i still can't decide as ideapad 5 pro reviews are mostly biased IMO and they are only a few of them unlike the Legion 5 because it is popular",
  "Which laptop would be a better purchase for programming, heavy gaming and video-editing? Also, open for other recommendations with these qualities:\n\n32 GB RAM\n\n1TB\n\n3070 gcard\n\nAt least 15'' screen\n\n&#x200B;\n\nOption 1: Lenovo Legion 7 [https://www.amazon.com/Lenovo-Legion-Gen-500nits-i7-10750H/dp/B09R9YSKZ4/ref=sr\\_1\\_4?crid=1P8X56VMBVOOX&keywords=legion%2B7&qid=1647217894&refinements=p\\_n\\_feature\\_thirty-three\\_browse-bin%3A23720422011%2Cp\\_n\\_feature\\_thirty-one\\_browse-bin%3A23716057011&rnid=23716050011&s=pc&sprefix=legion%2B%2Caps%2C149&sr=1-4&th=1#customerReviews](https://www.amazon.com/Lenovo-Legion-Gen-500nits-i7-10750H/dp/B09R9YSKZ4/ref=sr_1_4?crid=1P8X56VMBVOOX&keywords=legion%2B7&qid=1647217894&refinements=p_n_feature_thirty-three_browse-bin%3A23720422011%2Cp_n_feature_thirty-one_browse-bin%3A23716057011&rnid=23716050011&s=pc&sprefix=legion%2B%2Caps%2C149&sr=1-4&th=1#customerReviews)\n\n&#x200B;\n\nOption 2: ASUS ROG Strix G17 [https://www.amazon.com/ASUS-ROG-Strix-G17-Computer/dp/B09LTF72ST/ref=sr\\_1\\_1\\_sspa?crid=3ENI59GIN3ASM&keywords=asus%2Bzephyrus%2Bs17&qid=1647216997&sprefix=asus%2Bzephyrus%2Bs17%2Caps%2C310&sr=8-1-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExSEdZQjFRNTVCWTRHJmVuY3J5cHRlZElkPUEwNTk0NDgxM1NDQjBXTFdCTjk5VSZlbmNyeXB0ZWRBZElkPUEwNjEwNDQ2MjVUTFBYWFBGUzdLNSZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&th=1](https://www.amazon.com/ASUS-ROG-Strix-G17-Computer/dp/B09LTF72ST/ref=sr_1_1_sspa?crid=3ENI59GIN3ASM&keywords=asus%2Bzephyrus%2Bs17&qid=1647216997&sprefix=asus%2Bzephyrus%2Bs17%2Caps%2C310&sr=8-1-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExSEdZQjFRNTVCWTRHJmVuY3J5cHRlZElkPUEwNTk0NDgxM1NDQjBXTFdCTjk5VSZlbmNyeXB0ZWRBZElkPUEwNjEwNDQ2MjVUTFBYWFBGUzdLNSZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&th=1)\n\n&#x200B;\n\nOption 3: ASUS ROG Strix G15 [https://www.amazon.com/ASUS-ROG-Zephyrus-2560x1440-Accessories/dp/B09FJ1GZBV/ref=sr\\_1\\_3?keywords=Asus%2Bm16&qid=1647217176&refinements=p\\_n\\_feature\\_four\\_browse-bin%3A21354490011&rnid=676578011&s=pc&sr=1-3&th=1](https://www.amazon.com/ASUS-ROG-Zephyrus-2560x1440-Accessories/dp/B09FJ1GZBV/ref=sr_1_3?keywords=Asus%2Bm16&qid=1647217176&refinements=p_n_feature_four_browse-bin%3A21354490011&rnid=676578011&s=pc&sr=1-3&th=1)\n\n&#x200B;\n\nOption 4: Lenovo Legion 5 Pro [https://www.amazon.com/gp/product/B09922XWCV/ref=ask\\_ql\\_qh\\_dp\\_hza?th=1](https://www.amazon.com/gp/product/B09922XWCV/ref=ask_ql_qh_dp_hza?th=1)",
  "I have been Super happy with my ROG 15.  It is now 10 years old, still works great, quad core.   I have upgraded it from 8 to 24 gb, added an SSD drive, boots to Windows in 6 seconds even though it’s 10 years old.   I’ve had Lenovos and they are good too, but Thinkpads for work, not a Legion.   Both are great brands and I believe you will not make a bad choice with either.   Look at options for expand ability later."
]