[
  "Need help buying a laptop (India) I've checked many specs and wanted to go with Ryzen(ntg more specific ) not gonna be gaming but need the laptop to last a few years at least. Decided on this laptop. Give suggestions please ,abt this laptop and any other good one's.",
  "Never seen a Laptop with 24Gb Ram. Lmfao. \nNevertheless is a good comp.\nBut it dont have a graficcard",
  "Considering your at a budget where you can only get a new consumer grade laptop, Lenovo Ideapad is a budget laptop same as Acer Aspire 3, you get what you pay for so if you pay for budget price, you get budget quality, but I can't really pinpoint how long that laptop will last because it's either you're unlucky that it will last for only two years or lucky enough for it to last for 4 to 5 years",
  "budget? in rupees",
  "Check on lenovo.com maybe after offer and discount you get it cheaper there dm me for help",
  "Which laptop did you buy? I have the same budget and use as you. I landed on the same laptop, but the one that comes with the Snapdragon X chip. As I am looking for a long battery backup and a Lenovo or Asus Brand. I am getting the Lenovo IdeaPad Slim 3 Snapdragon variant at 40K. All the office applications I use are already compatible with the Snapdragon processor, so that is not an issue. Should I go with this option and is there any other laptop that I should consider?",
  "Ikr the ram and Thank you. I won't specifically need a graphic card so it's okay",
  "Oh okay. Hope I'm lucky , also Do u have any other laptop suggestions ? without considering the budget",
  "Around 60 to 65,000",
  "Will check it out, thank you",
  "I Bought this one , I checked out many options and found this the best considering the price and specs, idk much abt snapdragon so can't compare, but this is good for now and other than this the lenovo yoga , asus vivobook is good but higher price.",
  "Here you go,here is a detailed review of this laptop,tech power up reviewed the 16gb ram variant in this review.\n\nhttps://www.techpowerup.com/review/lenovo-ideapad-slim-3-15ahp10/",
  "Probably the lenovo thinkpad or a framework laptop",
  "Yes get from site you'll get sheer ID disc other coupons and 3yr ADP and premium at very low cost",
  "I think apart from Snapdragon processor both laptop are same. Yes, i also believe it is the best value for money as compre to other laptop in that price range. How's the build and overall laptop? Any issues?",
  "Oh wow, thanks",
  "Will check it out, thank you",
  "Also I am getting the snapdragon laptop for 35k. Do you think apart from processor it is a good laptop and would you recommend. ",
  "Nope, it's been more than a week and no issues till now , build is fine and battery is good",
  "Yeaa",
  "Lenovo Y740 17\" Review (8750H, 2080 Max-Q) Good afternoon Reddit!\n\nI recently just got in my Lenovo Y740 17” (8750H, 2080 Max-Q, 16GB Dual Channel) and just got done running some benchmarks and so forth in an effort to shed some light on this enigmatic model, as the  15” variant gets \\~95% of the coverage in terms of reviews and user anecdotes.\n\n**Chassis and Physical features**Pictures of all the I/O and interior/exterior found [here](https://imgur.com/a/s0wqMQz).\n\nIt weighs about \\~6 lbs., and is actually pretty thin, just under 1 inch thick (or \\~23mm). The keyboard deck has a bit of flex when pressing down with force, but given its size, it’s still pretty sturdy. Trackpad uses Precision drivers, but is WAY too small given the area Lenovo had to work with. The dedicated mouse buttons are okay; they just get the job done. The exterior has a “butt” that protrudes outward and houses the majority of the I/O and 4 exhaust vents. This does not fit in my 15.6” laptop bag (it is not deep enough, but does fit width-wise).\n\nThe bezels are a bit larger than the 15” brother, but they did move the webcam back to the top, so no more nose-cam! Very happy about that. The screen is a 144Hz IPS G-Sync panel, and gets reasonably bright compared to the competition, \\~300 nits. My unit has very minimal backlight bleed, but that does vary heavily from unit to unit.\n\nKeyboard layout is great, but “feel” is, well, okay. Nothing special, nothing awful. Feels like one of Lenovo’s IdeaPads or something. I wish it felt more like their ThinkPad lineup, but not sure how that would look on a gaming laptop. I did however hit close to my typing speed record on my second try with it (104 WPM)\n\nOverall, I’d give the unit a 7/10 for build quality and design, docking points for wasted space on the keyboard deck, thick-ish bezels and some flex around the unit. I do love the minimalist design otherwise.\n\n**Performance/Thermals and Noise**\n\nNow, this is where this beast really shines. All benchmarks are run with max-fans and -140mV core/cache undervolt.\n\n[UserBenchmark link](https://www.userbenchmark.com/UserRun/18724106)\n\n[Heaven Unigine Benchmark Score](https://imgur.com/Bqs6qqT)\n\n[FireStrike Scores](https://imgur.com/a/ik5Y4DX)\n\nI won’t go into detailed game benchmarks, as I don’t have a full Steam library to do so, but I can tell you all this: the temperatures on this thing are **insane.**\n\nI ran three loops of Heaven’s benchmark with uncapped FPS and **didn’t see above 63C on the CPU and above 60C on the GPU, even with a +100MHz OC.** I have yet to mess with the voltage curve to really maximize the potential of this 2080 max-Q.\n\nCineBench R15 on repeated runs stays in the 1200 range, and the CPU can pull \\~60W when the GPU is not also under load. Highest core temperature was 65C after 3 runs, the rest were 61-63C.\n\nWhile using the laptop with normal tasks, it’s almost completely silent; I can only really hear the whirr of the HDD. Max fans is also much quieter than I anticipated. Notebookcheck’s review shows it maxing around 45-47dB, which is twice as quiet when compared to most 15-inch gaming notebooks with similar or worse specs, which are in the 54-56dB range. (TIL that every 10dB is equivalent to doubling the sound intensity or perceived increase in volume)\n\nSimply put, 10/10. Could not ask for better thermals given its performance output in <1” footprint.\n\n**Misc. (I will add to this to answer questions about things I may have forgotten)**\n\nBattery life with G-Sync enabled is about 2-3 hours. Without, 4-6 hours depending on how aggressive you are.\n\nRunning on BIOS revision 1.07, preserving the ability to max the fans with FN+Q.\n\nFeel free to ask questions and I will try to answer them!",
  "Thanks for taking the time to post this review. It sucks there has been so much focus on the 15\" and not as much on the more powerful 17\" version. \n\nAny chance you could install the free version of 3dmark Firestrike? I would love the see the scores you hit with the undervolt. \n\nI am torn between this and the MSI GS75. I know the GS75 is a sexy beast with a smaller footprint, but I like the style on the Y740 as well. Have you had a chance to check out a GS75? I'd love to know how the build qualities compare.",
  "How are you able to you Max fans as the latest BIOS removed Max fans feature?",
  "Hey everyone! I added my FireStrike score to the post :)",
  "What’s your average clocks on the 2080 and what wattage is the card + what drivers does it run?",
  "where you able to squeeze more performance out of the GPU? Did you OC it with afterburner?",
  "Both have okayish build quality. stiffness is a little weak compared to other brands, but still no real reason to complain.\n\ni would strongly reccomend the Y over the GS tho, its cooling system is simply SO MUCH ahead of any other manufacturers cooling solutions that its downright ridiculous to not chose the Y, no matter what other gaming notebook in this category you compare it with.\n\nI would love to see an overclockable HK processor in this thing, just to see how much you can get out of this baby.",
  "I have the gs75 with the same cpu and gpu. The temps get really high that causes it to thermal throttle 90-95 degrees under load with max fan curve. I did a repast and undervolt now I’m sitting at 75. Y740 has better cooling but the gs75 looks a bit better on design.",
  "I just bought the y740 with a i7-9750H and rtx 2060. I was considering an MSI, but the end decision was more with the thermal and overall quality seemed to be a lot better. MSI is good, don't get me wrong, but the cons seemed less ideal for MSI than Lenovo Legions. Plus I didn't want to be that kid to haul out a loud ass spaceship in class. \nCheck out this review: \n https://www.youtube.com/watch?v=bTUytmEYx6s&feature=share",
  "I purposely disabled automatic updates when I received mine, and it was on BIOS build 1.07, so I still have that ability.\n\nI'm going to update the post to include my BIOS revision.",
  "Without tweaking the voltage curve in Afterburner, I’m in the 1500s usually. It is an 80W variant, but running on max fans allows it to pull 90ish Watts. \n\nI have to get back on the Drivers when I get back home!",
  "Where did you go to turn off auto-updates?\n\nYour post made me decide to go ahead with my purchase. I'll be ordering one this weekend. I downloaded a copy of the 1.08 bios in case I need to revert it from 1.09. I cant seem to find 1.07 anywhere online though.",
  "Nice, its better to avoid that latest BIOS unless Lenovo fixes it",
  "Lenovo Vantage software!",
  "Ordering for Lenovo is a little janky, fyi. They're backlogged on orders rn so you'll have to wait a couple weeks and they're payments won't seem logical, but it should all work out on its own.",
  "Yeah, I did some reading prior to getting the laptop and the first thing I planned to do was prevent a BIOS update if it was older than 1.09, or do a flashback lol"
]