[
  "Which one should I get?(budget is of about 130000 inr or $1550) ",
  "I personally have used legion for many years and can vouch for it. Amazing piece, amazing build quality never had a single problem till date",
  "I'm not so sure about Indian mark-ups or taxes. But are you sure you don't want to get a laptop lineup downgrade to get a 4060 instead? That'll be more worth it. Probably a Helios 16,cheaper than both of those most of the time and on the same league. Helios Neo or a LOQ or maybe a TUF if you want a lower lineup. If you really want one of the Big Bois, I'll pick the ROG to save some bucks. A better cpu from the legion ain't worth it if you still have a 4050.",
  "I got the G16 with the exact specs. Using it for 10 months. No problem so far. Works super smooth. I mainly use it for Data science and Machine Learning. You can take the ROG G16. \nAsus' product support is also good.",
  "Thanks but just wanted to ask if it gives better performance in heavy duty tasks like graphic designing , gaming etc. thank the rog strix",
  "So, according to my research, Acer ain't a very reliable brand, LOQ has a bad motherboard (not for amd but I want to use Linux with windows so I can't take the amd one), And I do not have an external keyboard and do not want my laptop to look like a bulky sh\\*t. The build quality and reliability for both the strix and legion is unmatched. Also , all your options take in a lot of dust and if you don't know, India has a lot and a lot of dust all the time but thanks for your opinion :)",
  "Thanks for the review:)",
  "Yeah it got 170w GPU that's better than rog one which was 120w I guess. And yeah you can game good on it. Maybe 4060 would be far better or maybe look for 3060. I have heard that 3060 is better than 4050 not too sure you should do your research in that matter.",
  "Like a 4060 sure does not give bad performance only approx 10 fps downgrade so it will work fine for me",
  "Yeah , There is a big festival here which is about to begin so even though both of these are about 125000, they will drop to about 105000 and the 4060 will drop to about 110000. I also have my older laptop for exchange which will go for about 10000 and card bonus for about 5000. I will also get around 5000 bonus by bargaining. Total = 110000- 10000+5000+5000=110000-20000\n\nI can get both for about 90000 or 1070 $",
  "You'll get 20% more performance with a 4060, a guaranteed 15-30 fps on AAA games on ultra. The extra 2gb vram is also pretty nice. Acer does NOT have bad quality on their higher-end lineups, predators. Their nitros are mid. Both those legions and ROG sips more dusts than others because they have wider intakes. If not more dust, they sip the same amount. They just have more and thicker heatsinks that allows for better cooling than lower end laptops, most of the time, same fan.",
  "I can get a 3060 for way cheaper but there are no option for intel only amd",
  "Oh, I will cheack out the helios 16 as my dad told me that acer has many problems thanks :))",
  "Amd is also a good option. Their battery efficiency is far better than Intel's. Also they heat lesser than intel. It's your choice tho which ever you prefer. As I said I don't particularly know if 3060 is better than 4050 I just heard it. Better option would be doing your research or getting 4060.",
  "Im not going for amd as it can't run linux and windows at the same time",
  "Strix g16 vs Strix g17vs Aorus 17 vs Legion 5 vs Predator Helios neo 16! Help me Strix vs Legion vs Predator vs Aorus it’s so confuse\n\nHey folks, I need some solid opinions because I’ve read tons of reviews and Reddit posts, but I’m still stuck on my decision.\n\nI’m looking for a laptop for coding, gaming (RDR2, GTA, etc.), running two monitors (34” + 27”), and handling multitasking without breaking a sweat.\n\nI had an HP Envy 16 with an i7-13700H and RTX 4060, but it was a massive letdown—that thing ran so hot I could fry an egg on it, and I wasn’t even pushing it hard.\n\nBiggest concerns:\n\t1.\tTDP limitations – Some laptops cap power so hard that an i9 + 4070 can perform worse than an i7 + 4060.\n\t2.\tUndervolting – Some machines just won’t let you tweak it, which sucks for managing temps.\n\t3.\tHeat outside gaming – I don’t want a laptop that turns into a furnace just from opening an IDE.\n\t4.\tUpgradable RAM – If it comes with 16GB, I’ll upgrade to 32GB anyway, so that’s not a dealbreaker.\n\t5.\tBudget – Within the models available in Brazil, 4080 laptops are out of the question prices are ridiculous.\n\nModels I’m considering:\n\n\n\n\t•\tGigabyte Aorus 17 BSG-13US654SH (Ultra 7 155H + RTX 4070)\n\nHeard Aorus has great TDP tuning, meaning even an Ultra 7 could outperform a power-limited i9. Anyone confirm? I couldn’t find any real info on this model on YouTube.\n\n\n\t•\tROG Strix G16 G614JIR-N3054W (i9-14900HX + RTX 4070)\n\nPeople say it has solid cooling and good power control, but Intel chips always run hot.\n\n\n\t•\tROG Strix G17 G713PV-WS94 (Ryzen 9 7845HX + RTX 4060)\n\nRyzen generally handles TDP better, so even with a 4060, I’ve heard this can match or outperform the G16 above, just with cooler temps.\n\n\n\t•\tAcer Predator Helios Neo PHN16-72-91P6 (i9-14900HX + RTX 4070)\n\nSupposedly good cooling, but Acer’s software limits tweaking a lot. If you get unlucky with a hot unit, you’re screwed because undervolting isn’t an option.\n\n\n\t•\tLenovo Legion 5 (i9-14900HX + RTX 4060)\n\nThe Legion 7 gets a lot of praise, but I’m unsure if the Legion 5 has the same cooling and build quality.\n\n\n\t•\tLenovo Legion 5i (i9-14900HX + RTX 4060)\n\nWhat’s the actual difference between the 5 and 5i? Specs look identical to me.\n\n\n\n\n\nIf anyone has experience with these, drop some knowledge! I need a laptop that handles multitasking well, runs cool, and gives me the flexibility to tweak TDP and undervolt if needed.",
  "Razer blade 17 vs lenovo yoga/legion vs hp spectre/omen Hi, looking for a new laptop and would love some help. Got a spectre from 2018 and battery been replaced twice... Looking for something new that has the best 4k/UHD resolution ideally, and can be great for AAA games, and also a powerhouse for work/processing bunch of software/tabs/etc... Saw this seemingly great deal but I'm not that sharp about if this is actually a good deal or not... I like the idea of touchscreen and 2 in 1 but not bound to it... Most important is visual quality and processing capability... TIA! ",
  "Not this one a 3070ti is not enough you can find a laptop with a 4080 is you shop around at this cost",
  "I'm not too sure on the US side of things but the laptop you showed in the screenshot seems like a pretty good price. Personally, I stick to Asus for my gaming laptops but if I were to choose another brand, it would 100% be razer",
  "Fuck omen, honestly it's such a pain in the ass. Stick to razer",
  "Ordered the legion on sale at Walmart right now thanks everyone",
  "Thanks, what's the difference?",
  "What's the pain of it?",
  "Which one",
  "50%+ performance is the difference",
  "Much more powerful GPU and can handle up to 4k gaming performance. Its really just overall better and anyway you can imagine. With the current sales going on you can have the 4080 for this cost and maybe cheaper not to mention is it the current generation of GPU until the next new thing come to bare",
  "The usual HP problems- hardware failure, fragile, probably bad thermal performance",
  "Poor cooling, Build quality is lacking, Super loud.  I was never fully comfortable using my omen for the 4 years I had it. It always had something wrong with it",
  "[removed]",
  "Gotcha, yeah wound up getting the legion pro 4070!",
  "Seems like the best deal under 2k right now",
  "I got a legion pro too when my omen kicked the bucket. Its such an awesome laptop!. But word of advice, get a laptop stand so you can lift it a bit since the exhaust can release hot air on your hand from the side. Using a stand completely fixes the issue 👌",
  "Pretty good one",
  "Nice! Yeah already got one, got a 55 ark screen coming too, maybe switch to keyboard and prob put laptop to the side... I'm new to having a good setup lol",
  "The legion pro screen is already super nice. But going that route would be cool as hell too.\n\nEnjoy it !",
  "I can't decide which laptop to buy. Hello guys, \n\nMy old laptop died, and I'm currently planning on buying a new one, considering the fact that I need it for both gaming (not extreme 4k resolution games obviously) and for a normal engineer's workloads, we require good CPUs but not necessarily insane GPUs in the Data Science field. I usually spend hours reading reviews, watching videos etc... But this time, I simply can't decide since the opinions are super mixed :\n\n\n1) Lenovo Legion Pro 5 16ARX8 / Ryzen 7 7745HX / RTX 4050 6G / 32 Go / 1 To SSD\n\n\nI've seen people talking about spyware and horrible customer service + the low vRam\n\n2) MSI CYBORG 15 A13VE / I5-13420H / RTX 4060 8G / 32 Go / 512 Go SSD\n\n3) MSI Katana 17 B13VGK / i7-13620H / RTX 4070 8G / 32 Go DDR5 / 1 To SSD\n\nI used to love MSI laptops but to be honest I've read about overheating issues etc...\n\nI kinda have to get a laptop since I won't be able to use a desktop because I won't have a stable location let's say.\n\nThanks in advance!",
  "Help me find a BestBuy! ",
  "Collective Thread: best laptop speakers and best laptop keyboards (attempt 2) It is hard to find any good list or larger comparison between laptop keyboards and speakers. Let's try to at least create a list which one can base their research of. At least for me these are important things to look for in a laptop but unfortunately not as well reviewed like displays.  \nPersonal opionions are very welcome.\n\nSuggestions for comment structure:  \n\\-Laptop Model  \n\\-Short description  \n\\-Pro / Con\n\nFor some time I tried to gather some models as well which I will insert in the list below. If you disagree with any of the models listed, don't refrain from telling and what you disagree with or would add/change.\n\nI will try to frequently edit the most popular results in here:\n\nSpeakers:  \nApple MacBook Pro 14/16 (air and older ones good as well)  \nAsus ROG Zephyrus G14/G16 2023 & 2024  \nDell XPS 15/16/17  \nRazer Blade 18  \nAsus ROG Strix Scar 18\n\nKeyboards:  \nMicrosoft Surface Laptop (possibly my favourite)  \nApple MacBook Pro/Air (avoid butterfly - most models <2020)  \nLenovo Thinkpad (basically any, though often older = better)  \nLenovo Legion Pro 5/7 (said to be very good)  \nAcer Nitro 5 (>2019)  \nDell XPS 15/16/17\n\nIf there is enough precise feedback, we could add something like a ranking / poll at some point.",
  "Looking for recommendations for a good gaming/student laptop Posted first to r/SuggestALaptop to no avail so posting here.\n\nHey, first time posting here. I'm a UK comp sci student and I've been looking at gaming laptops to buy this Black Friday. I'm mostly looking for a high-performance laptop that can future-proof me for years and won't limit me in gaming either. I will also use it for a reasonable amount of coding and other general uses so gaming isn't the primary usage. Battery life is important to me but I don't know it it'll be an issue or not since most of my uni buildings have charging ports pretty much everywhere.\n\nBudget: £700-£900\n\nI've looked at models with some big discounts on Amazon for Black Friday so here are the ones I'm considering:\n\nhttps://www.amazon.co.uk/MSI-Katana-17-Gaming-Laptop/dp/B0BSXQ9RPS\n\nThis one appeals to me quite a lot, the CPU is faster than the other models below and it has a RTX 4050. What worries me is the appalling battery life of 3 hours normally and less than an hour for gaming.\n\n\nhttps://www.amazon.co.uk/MSI-Crosshair-15-Gaming-Laptop/dp/B0CJFGKJDS\n\nThis one is basically the same model as the previous one but with a RTX 4060 and a slight downgrade on the CPU for the same price. I can't find much on the internet about this so I can't decide whether this is worth getting. Looks appealing though because the 4060 is a big upgrade from the 4050 but is the CPU downgrade worth it?\n\n\nhttps://www.laptopsdirect.co.uk/lenovo-legion-s7-amd-ryzen-7-16gb-512gb-rx-6600s-165hz-16-inch-windows-11-g-82ug0004uk/version.asp?wgu=272145_196673_17005782844803_c24f1d2dc2&wgexpiry=1732114284&utm_source=RedBrain%20Ltd&utm_medium=webgains&refsource=webgains\n\nThis model has a weaker CPU and GPU than the other ones but I'm still considering it for the better battery life and I've heard good things about the Legion models.\n\n\nhttps://www.amazon.co.uk/ASUS-FA617NS-7-7735HS-RX7600S-Graphics/dp/B0BN661S2F\n\nWhat impresses me the most about this model is the really good battery life which makes me want to get it, I've seen positive reviews as well. Not sure about the specs though because it's a downgrade from the MSI models.\n\n\nI've done some laptop comparisons in nanoreview.net , (idk if it's a reliable site or not) but it's been telling me the Legion and the ASUS get better FPS on games than the MSI ones despite the better specs on the MSI laptops. Would appreciate if someone could explain why.\n\nThanks in advance everyone, I'm open to suggestions for more laptops or advice!",
  "RTX 4060 should be minimum if you want to handle 3D games.4060 is a massive upgrade from the 4050, the benchmarks and performance are wide enough to notice a major difference in raw performance, so long the cooling is adequate and there is enough RAM loaded and available in the laptop, ie- 16gb-32gb.\n\nand battery life will be improved if computer comes with iGPU where the discrete GPU can be toggled off.\n\nbest battery life will come from just iGPU only but will have terrible performance in advanced 3D games that require the discrete GPU.\n\nRecommend the Legion or LOQ, as it has better support from Lenovo and usually fair pricing, typically.\n\nif you're serious about the career and less about gaming, then just get a gaming desktop later or after you graduate, and get a thin and light laptop that can actually deliver you the battery life you're looking for.",
  "Gaming Laptop with max size, Belgium, No Budget Limits Using a form from another reddit, hoping for suggestions!\n\nTotal budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:\n\nNo real budget limits \n\nAre you open to refurbs/used?\n\nNo\n\nHow would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?\n\nIn order of preference, it needs to be slightly smaller than my current Alienware 17 which is Height (max) ● 20.90 mm (0.82 in.) Or 21.41 mm (0.84 in.) *** Width 399.23 mm (15.72 in.) *** Depth 299.49 mm (11.79 in.) *** Weight (max) 3.20 kg (7.05 lb).\n\nGiven that, it should as large as possible, with very good performance, display, and build quality. Battery life ideally available to watch a movie. Good cooling required. Not super mobile with it, mostly moving spot to spot and working there.\n\nHow important is weight and thinness to you?\n\nSee above. \n\nDo you have a preferred screen size? If indifferent, put N/A.\n\n16 or 17 inch. Most 17 inch might be too large in total dimensions (see above) but perhaps there are \"smaller\" 17 inch laptops?\n\nAre you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.\n\nGaming. The latest. I often play on a high resolution monitor attached to the laptop.\n\nAny specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?\n\nHas to be easy to tether to multiple monitors.\n\nLeave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.\n\nBudget is no issue. The laptop has to fit in a bag where my old alienware 17 is slightly (1 to 2 cm) too big for.\nI often use the laptop stationary, and rarely while mobile (sometimes when flying or on public transit or in bed). I game while tethered to multiple monitors and good quality is a must. Good cooling , performance and so on is a must.\n\n16 inch laptops seem likely to be the ideal form factor but perhaps a 17inch with smaller dimensions than above are good as well. I am also unsure if the resolutions of the 16 inch form factor doesn't cause issues?\n\nSo far, I've heard good things about the following, but looking for your feedback.\n\nLegion 9i Gen 8 16IRX8 with a new cooling function \n\nRazer Blade 16, seems well reviewed \n\nRazer Blade 17, might be too big\n    \nAlienware x16 en m16, but don't see many reviews about them\n    \nLenovo Legion Pro 7i, also looks good but unsure about the differences with 9i\n    \nAsus ROG Strix Scar 16  or G16, also mentioned often as good\n    \nMSI Titan GT77 HX 13V, might be too big?\n    \nMSI Raider GE78 HX, might be too big?\n    \nAcer Predator Triton 17X, might be too big and unsure if available in Belgium",
  "Hey Laptop Enthusiast Here. Do You Still Need Assistance?",
  "Used Lenovo legion 5 worth it? Hey guys! So I have a seller that's willing to sell their Lenovo Legion 5 for $860, and it has been used for 1.5 years. They still have the receipt and the reason for selling is because they have a PC and don't need the laptop anymore. So should I buy it? Is it worth it? My primary concern is if it will be able to handle video editing tasks like running Priemere Pro without overheating. The brand new ones are selling for $1300 in my country. Any and all advice would be useful.... \n\nLenovo Legion 5 (2021) Gaming Laptop – AMD Ryzen 7-5800H / 15.6inch FHD / 512GB SSD / 16GB RAM / 4GB NVIDIA GeForce RTX 3050 Ti Graphics / Windows 11 Home / English & Arabic Keyboard / Phantom Blue / Middle East Version – [82JW00LRAX]",
  "you would want more than a 3050ti  for that money maybe  at least a 3060 for that money",
  "Used Lenovo legion 5 worth it? Hey guys! So I have a seller that's willing to sell their Lenovo Legion 5 for $860, and it has been used for 1.5 years. They still have the receipt and the reason for selling is because they have a PC and don't need the laptop anymore. So should I buy it? Is it worth it? My primary concern is if it will be able to handle video editing tasks like running Priemere Pro without overheating. The brand new ones are selling for $1300 in my country. Any and all advice would be useful.... \n\nLenovo Legion 5 (2021) Gaming Laptop – AMD Ryzen 7-5800H / 15.6inch FHD / 512GB SSD / 16GB RAM / 4GB NVIDIA GeForce RTX 3050 Ti Graphics / Windows 11 Home / English & Arabic Keyboard / Phantom Blue / Middle East Version – [82JW00LRAX]",
  "Which should I buy?! I saw these were the best options for under $1500! \nI just graduated basic training for the Air Force now I am in tech school for 11 months. I want to use the laptop for school and for gaming. I also want it to last me for at least 4+ years while I take college classes. If you have any different recommendations let me know! Thanks! \n\nAsus TUF Gaming A17 RTX 4070: $1,799 $1,399 @ Newegg\nSave $400 on the TUF Gaming A17 with Nvidia GeForce RTX 40 Series GPU. It packs a 17.3-inch (1920 x 1080) 144Hz display, AMD Ryzen 9 7940HS 8-core CPU, 16GB of RAM, and 1TB SSD. For graphics handling, it's outfitted with Nvidia's GeForce RTX 4070 GPU with 8GB of graphics memory. \n\nMSI Katana 15 RTX 4070: $1,499 $1,159 @ Newegg Save $340 on the MSI Katana 15 RTX 4070 gaming laptop. This high-performance machine is built for gaming and content creation. It packs a 15.6-inch (1920 x 1080) 144Hz display, Intel Core i7-12650H 10-core CPU, 16GB RAM and 1TB SSD. For heavy graphics lifting, it employs Nvidia's powerful GeForce RTX 4070 GPU with 8GB of dedicated memory.\n\nAsus ROG Zephyrus G15 RTX 3080 GPU: $2,199 $1,429 @ Best Buy\nBest Buy is currently slashing $770 off the Asus ROG Zephyrus G15 RTX 3080 gaming laptop. In our Asus ROG Zephyrus G15 review, we praise its sleek design, stunning display, strong CPU performance. Its battery lasted more than 8 hours during testing which is impressive for a gaming laptop. Besides Nvidia's powerful RTX 3080 GPU, the laptop in this deal packs a 15.6-inch 2K Quad HD (2560 x 1440) display, AMD Ryzen 9 5900HS 8-core CPU, 16GB of RAM, and 1TB SSD. \n\nLenovo Legion Slim 7 RX 6800S: $1,949 $1,300 @ Best Buy\nSave $650 on the Lenovo Legion Slim 7 in this pre-Prime Day-rivaling deal from Best Buy. Thin and lightweight, this gaming laptop packs a 16-inch (2560 x 1600) display, AMD Ryzen 9 6900HX 8-core CPU, 16GB of RAM and 1TB SSD. AMD's powerful Radeon RX 6800S does the heavy lifting for graphics.",
  "Lenovo Slim 7 Pro 14IHU5 Hey , I was looking for a good laptop for webdev / general use and I found out about this laptop with\n\nEDIT : its the version with the  Intel Iris Xe Graphics and not the mx version\n\ni7-11370H | 16 GB | 1TB SSD | TouchPad 14\" 2.8k 2880x1800 100% srgb display .\n\nI saw some reviews and I want to ask some questions before pulling the trigger :\n\n1. I saw that there is no Ethernet connection , I've only heard about thunderbolt a few days ago so , it should be a problem getting an hub with ethernet connection right ?\n2. The video reviews / their site shows a very good battery life , is it real ? because from what I know intel cpu's tend to consume more power. ( they said around 8-12 hours of general use ).\n3. any big drawbacks in this laptop?\n\nI currently have legion 5 17\" with i7 rtx2060 , while it has a very good build quality I'm looking to get a smaller , lighter laptop with better battery life since im not playing much games anymore . thanks 🙂",
  "I have this exact laptop as my daily. Yea a thunderbolt dock is easy and will work. Battery life is 5-8 hours depending on my use and especially brightness of display. It’s been amazing tho I’ve had it since December. Lmk if you have any other questions. No drawbacks in particular other than it’s expensive but coming from a MacBook I wanted to pay for the build quality and got this one at Costco for a good deal.",
  "Exactly how much battery life do you need?\n\nWhen it comes to laptops, manufacturer advertised battery life should be ignored. You are looking at \"2021 Lenovo Ideapad Slim 7 Pro 14 Intel\" which has a [5 hour](https://www.ultrabookreview.com/51062-lenovo-yoga-slim-7-pro-review/) runtime at best if you turn down the brightness. This is NOT the laptop to get for battery life.",
  "Cool , actually I found a nice deal on it , but even online its not that expensive.\nHow about the screen reflection, is it disturbing?",
  "damn thats kinda bad battery life runtime , I dont need insane battery like the newer macbooks but at least 8 hours of general use ( visual code , browsing , office , etc ) .",
  "I came from a gloss screen MacBook so I wouldn’t know any different. I have no problems but it’s a deal breaker for some",
  "Where are you buying from and what is the budget?",
  "So this laptop is more than enough for me , thanks :)",
  "my budget is around 1k usd .   \nHonestly , I've decided to just go with macbook air even tho its abit expensive with extra ram.",
  "Great choice!",
  "Laptop buying advice - choice of 3  So I'm looking to upgrade my laptop next month and I'm considering 3 machines: **The LG Gram**, the **Lenovo Legion 7 Slim** and the **Dell XPS 17**. My budget is between $1500 - 1800 and it's basically for internet surfing, light gaming and streaming movies/shows. I don't upgrade often, maybe once every 10 years ...so my main concern is just getting the best all around rig for the money that will be as future proofed as possible. I would prefer 17'' but will take 15'' if it's a much better laptop or deal. I think the Dell XPS is a little out of my price range but there seems to be one on the Dell site under 'Deals' (just not sure if it's 'for real' a decent XPS). Suggestions ...and why you think it's better than the other two? Also I have seen on reviews that UHD will kill the battery life more of the laptop and unless you KNOW you need it (into hardcore gaming) ... you don't really need it? It's a big step up in price I might not need to consider.  Also, is the Intel I7-11800H still a pretty good CPU these days?",
  "BRO. Just get a \"cheap\" $600 laptop. Use that other money for savings, your mortgage, taxes, a PC, crypto, real estate, stock market. Why spend all that money? With the rest ($900-$1200), you could get a PC or use it for the above or other things.",
  "Desktop dead. Help Buying Laptop Please My desktop is not functional so I decided to finally get a laptop for convenience sake.\n\nI am looking for a gaming laptop where I can also do other work tasks. Preferably one with a camera, but not required.\n\nI was deciding on what laptop to get but the top reviews on amazon scared me. A lot of people seem to have issues with screen colors being wrong (which I assume you can color correct) and some other issues im not too aware of in whether it is a common problem OR user issue.\n\nHaving never owned a laptop before, I decided I ask reddit where I am sure you guys are much more knowledgeable than I am.\n\nHere are my choices:\n\n\nDell Gaming G3 15 3500\n\n15.6 Inch\n\nIntel core i7-10750H 10th Gen\n\n16GB DDR4 RAM\n\n512GB SSD\n\nNvidia Geforce GTX 1650Ti 4GB GDDR6\n\n$1009.77[$1009.77 on Amazon](https://www.amazon.com/dp/B089HV9HJ4/ref=cm_sw_r_cp_apa_glt_i_50AZK6HKXGH6AGTR6WK1?_encoding=UTF8&psc=1)\n\n\n\nLenovo Legion 5\n\n15.6 Inch FHD IPS\n\nAMD Ryzen 7 4800H\n\n16GB DDR4 RAM\n\n512GB SSD\n\nNvidia Geforce GTX 1660Ti\n\n[$1199.99 on Amazon](https://www.amazon.com/dp/B08BB9RWXD/ref=cm_sw_r_cp_apa_glt_i_DGZP4KDXBTVTFSBAFDHA?_encoding=UTF8&psc=1)\n\n\n\nASUS TUF Gaming F17\n \n17.3 Inch 144Hz FHD IPS-Type Display\n\nIntel Core i5-10300H\n\n8GB DDR4\n\n512GB SSD\n\nNvidia Geforce GTX 1650Ti\n\n[$849.99 on Amazon](https://www.amazon.com/dp/B08ZLC661T/ref=cm_sw_r_cp_apa_glt_i_70XM8PT1V7JW2MPF6HE4?_encoding=UTF8&psc=1)\n\n\n\nMSI GF75\n\n17.3 Inch 120Hz\n\nIntel Core i7-9750H\n\n8GB DDR4\n\n512 SSD\n\nNvidia Geforce GTX 1660Ti\n\n[$1197.99 on Amazon](https://www.amazon.com/dp/B07Z5KP1Y1/ref=cm_sw_r_cp_apa_glt_i_FE8G6J13HC49A00FPWZ9?_encoding=UTF8&psc=1)\n\n\n\nASUS TUF FX505DT\n\n15.6 Inch 120Hz\n\nAMD Ryzen 5 R5-3550H\n\n8GB DDR4\n\n256 SSD\n\nNvidia Geforce GTX 1650\n\n[$874.88 on Amazon](https://www.amazon.com/dp/B07VBK4SYS/ref=cm_sw_r_cp_apa_glt_i_9M9TWYZ3JAXXWQN6AN5Y?_encoding=UTF8&psc=1)\n\n\nI have an external HDD to use already and plan on upgrading any laptop with elss than 8GB RAM\nThansk everyone.",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Dell Gaming G3 15 3500 - 15 Inch FHD, Intel Core i7-10750H 10th Gen, 16GB DDR4 RAM, 512GB SSD, Nvidia Geforce GTX 1650 Ti 4GB GDDR6, Windows 10 Home Eclipse Black \n\n>**Company**: Visit the Dell Store\n\n>**Amazon Product Rating**: 4.6 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 3.5\n\n>**Analysis Performed at**: 05-20-2021 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/dell-gaming-g3-15-3500-15-inch-fhd-intel-core-i7-10750h-10th-gen-16gb-ddr4-ram-512gb-ssd-nvidia-geforce-gtx-1650-ti-4gb-gddr6-windows-10-home-eclipse-black) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "[deleted]",
  "Good Bot :)",
  "May I ask why?",
  "[deleted]",
  "I looked around as soon as you said no to ASUS and I see what you mean.\nThank you\nWhat would you suggest?\nI see a lof of Legion 5 fans on this subreddit...",
  "[deleted]",
  "Yeah... Im leaning that way too...\n\nMore $$ than what I wanted but [this](https://www.amazon.com/dp/B08L1XP7Q3/ref=cm_sw_r_cp_apa_glt_i_HTZEVN9637CYFB7FMJ8K?_encoding=UTF8&psc=1) is what I might purchase",
  "[deleted]",
  "About half the SSD size",
  "Help Finding a laptop Hello, I have $1300 in Best Buy credit and wanted some help finding a good laptop. I previously had a MS Surface Pro 7 and was thinking of getting something more powerful, as I will be beginning my Junior year as a CS student. I don't know much about specs and haven't really considered actually getting a gaming laptop until now, but I figured that if it can run games on it, then it should be able to handle future projects. Furthermore, I may try playing games that I currently play on console on it like rainbow six siege and rocket league. I also wanted to ask if gaming laptops are worth buying, or if I should stick with something like the Dell Inspiron. I was thinking of going with the HP OMEN:[HP  - OMEN Gaming 15.6\" Gaming Laptop - Intel Core i7 - 16GB Memory -  NVIDIA GeForce RTX 2060 - 512GB SSD + 32GB Optane - Shadow Black](https://www.bestbuy.com/site/hp-omen-gaming-15-6-gaming-laptop-intel-core-i7-16gb-memory-nvidia-geforce-rtx-2060-512gb-ssd-32gb-optane-shadow-black/6409146.p?skuId=6409146) \n\nbut I heard from other sites that it isn't really worth it. I was also considering the Lenovo Legion:  [Lenovo - Legion 5 15\" Gaming Laptop - Intel Core i7 - 8GB Memory - NVIDIA GeForce GTX 1660 Ti - 512GB SSD - Phantom Black](https://www.bestbuy.com/site/lenovo-legion-5-15-gaming-laptop-intel-core-i7-8gb-memory-nvidia-geforce-gtx-1660-ti-512gb-ssd-phantom-black/6398969.p?skuId=6398969)\n\nMy third option is the Acer Nitro: [Acer - Nitro 5 17.3\" Laptop - Intel Core i5 - 8GB Memory - NVIDIA GeForce GTX 1650 Ti - 512GB SSD - Obsidian Black](https://www.bestbuy.com/site/acer-nitro-5-17-3-laptop-intel-core-i5-8gb-memory-nvidia-geforce-gtx-1650-ti-512gb-ssd-obsidian-black/6413248.p?skuId=6413248)\n\nI clearly do not know enough about the specs nor do I fully trust the reviews from Best Buy itself. Could I get some feedback on my choices along with other recommendations that are under $1300. Furthermore, would you all recommend getting the Geek Squad protection plan on it? I had it on my surface and the damage--cracked screen--was covered by the manufacturer's warranty; however, since there were no parts available to repair it, they went ahead and gave me the in store credit at BBY instead. I highly doubt that something worse than a cracked screen will happen to me, but I felt like it wasn't worth getting the GeekSquad protection, as it wasn't even required to cover my device. \n\n&#x200B;\n\nThank You for the help!",
  "Asus rog Zephyrus g14 is a good choice",
  "what will be ur use? will u be doing any cpu intensive stuff on it?",
  "no",
  "one of the worse laptops ever, 25ms response time super bad thermals",
  "For now, the most intensive thing will probably be running programs such as MATLAB and possibly play games like Rainbow six if i get into PC gaming",
  "On my screen it’s about 10 ms and my cpu and gpu never went past 80 c",
  "how tho, see every review, they say its 25ms even jarrods tech review",
  "When I’m playing Valorant the highest I’ve seen it spike to is 15, I probably had good luck just got one of the better ones"
]