[
  "Which one should I get?(budget is of about 130000 inr or $1550) ",
  "I personally have used legion for many years and can vouch for it. Amazing piece, amazing build quality never had a single problem till date",
  "I'm not so sure about Indian mark-ups or taxes. But are you sure you don't want to get a laptop lineup downgrade to get a 4060 instead? That'll be more worth it. Probably a Helios 16,cheaper than both of those most of the time and on the same league. Helios Neo or a LOQ or maybe a TUF if you want a lower lineup. If you really want one of the Big Bois, I'll pick the ROG to save some bucks. A better cpu from the legion ain't worth it if you still have a 4050.",
  "I got the G16 with the exact specs. Using it for 10 months. No problem so far. Works super smooth. I mainly use it for Data science and Machine Learning. You can take the ROG G16. \nAsus' product support is also good.",
  "Thanks but just wanted to ask if it gives better performance in heavy duty tasks like graphic designing , gaming etc. thank the rog strix",
  "So, according to my research, Acer ain't a very reliable brand, LOQ has a bad motherboard (not for amd but I want to use Linux with windows so I can't take the amd one), And I do not have an external keyboard and do not want my laptop to look like a bulky sh\\*t. The build quality and reliability for both the strix and legion is unmatched. Also , all your options take in a lot of dust and if you don't know, India has a lot and a lot of dust all the time but thanks for your opinion :)",
  "Thanks for the review:)",
  "Yeah it got 170w GPU that's better than rog one which was 120w I guess. And yeah you can game good on it. Maybe 4060 would be far better or maybe look for 3060. I have heard that 3060 is better than 4050 not too sure you should do your research in that matter.",
  "Like a 4060 sure does not give bad performance only approx 10 fps downgrade so it will work fine for me",
  "Yeah , There is a big festival here which is about to begin so even though both of these are about 125000, they will drop to about 105000 and the 4060 will drop to about 110000. I also have my older laptop for exchange which will go for about 10000 and card bonus for about 5000. I will also get around 5000 bonus by bargaining. Total = 110000- 10000+5000+5000=110000-20000\n\nI can get both for about 90000 or 1070 $",
  "You'll get 20% more performance with a 4060, a guaranteed 15-30 fps on AAA games on ultra. The extra 2gb vram is also pretty nice. Acer does NOT have bad quality on their higher-end lineups, predators. Their nitros are mid. Both those legions and ROG sips more dusts than others because they have wider intakes. If not more dust, they sip the same amount. They just have more and thicker heatsinks that allows for better cooling than lower end laptops, most of the time, same fan.",
  "I can get a 3060 for way cheaper but there are no option for intel only amd",
  "Oh, I will cheack out the helios 16 as my dad told me that acer has many problems thanks :))",
  "Amd is also a good option. Their battery efficiency is far better than Intel's. Also they heat lesser than intel. It's your choice tho which ever you prefer. As I said I don't particularly know if 3060 is better than 4050 I just heard it. Better option would be doing your research or getting 4060.",
  "Im not going for amd as it can't run linux and windows at the same time",
  "Help me find a BestBuy! ",
  "Looking for recommendations for a good gaming/student laptop Posted first to r/SuggestALaptop to no avail so posting here.\n\nHey, first time posting here. I'm a UK comp sci student and I've been looking at gaming laptops to buy this Black Friday. I'm mostly looking for a high-performance laptop that can future-proof me for years and won't limit me in gaming either. I will also use it for a reasonable amount of coding and other general uses so gaming isn't the primary usage. Battery life is important to me but I don't know it it'll be an issue or not since most of my uni buildings have charging ports pretty much everywhere.\n\nBudget: £700-£900\n\nI've looked at models with some big discounts on Amazon for Black Friday so here are the ones I'm considering:\n\nhttps://www.amazon.co.uk/MSI-Katana-17-Gaming-Laptop/dp/B0BSXQ9RPS\n\nThis one appeals to me quite a lot, the CPU is faster than the other models below and it has a RTX 4050. What worries me is the appalling battery life of 3 hours normally and less than an hour for gaming.\n\n\nhttps://www.amazon.co.uk/MSI-Crosshair-15-Gaming-Laptop/dp/B0CJFGKJDS\n\nThis one is basically the same model as the previous one but with a RTX 4060 and a slight downgrade on the CPU for the same price. I can't find much on the internet about this so I can't decide whether this is worth getting. Looks appealing though because the 4060 is a big upgrade from the 4050 but is the CPU downgrade worth it?\n\n\nhttps://www.laptopsdirect.co.uk/lenovo-legion-s7-amd-ryzen-7-16gb-512gb-rx-6600s-165hz-16-inch-windows-11-g-82ug0004uk/version.asp?wgu=272145_196673_17005782844803_c24f1d2dc2&wgexpiry=1732114284&utm_source=RedBrain%20Ltd&utm_medium=webgains&refsource=webgains\n\nThis model has a weaker CPU and GPU than the other ones but I'm still considering it for the better battery life and I've heard good things about the Legion models.\n\n\nhttps://www.amazon.co.uk/ASUS-FA617NS-7-7735HS-RX7600S-Graphics/dp/B0BN661S2F\n\nWhat impresses me the most about this model is the really good battery life which makes me want to get it, I've seen positive reviews as well. Not sure about the specs though because it's a downgrade from the MSI models.\n\n\nI've done some laptop comparisons in nanoreview.net , (idk if it's a reliable site or not) but it's been telling me the Legion and the ASUS get better FPS on games than the MSI ones despite the better specs on the MSI laptops. Would appreciate if someone could explain why.\n\nThanks in advance everyone, I'm open to suggestions for more laptops or advice!",
  "RTX 4060 should be minimum if you want to handle 3D games.4060 is a massive upgrade from the 4050, the benchmarks and performance are wide enough to notice a major difference in raw performance, so long the cooling is adequate and there is enough RAM loaded and available in the laptop, ie- 16gb-32gb.\n\nand battery life will be improved if computer comes with iGPU where the discrete GPU can be toggled off.\n\nbest battery life will come from just iGPU only but will have terrible performance in advanced 3D games that require the discrete GPU.\n\nRecommend the Legion or LOQ, as it has better support from Lenovo and usually fair pricing, typically.\n\nif you're serious about the career and less about gaming, then just get a gaming desktop later or after you graduate, and get a thin and light laptop that can actually deliver you the battery life you're looking for.",
  "Gaming Laptop with max size, Belgium, No Budget Limits Using a form from another reddit, hoping for suggestions!\n\nTotal budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:\n\nNo real budget limits \n\nAre you open to refurbs/used?\n\nNo\n\nHow would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?\n\nIn order of preference, it needs to be slightly smaller than my current Alienware 17 which is Height (max) ● 20.90 mm (0.82 in.) Or 21.41 mm (0.84 in.) *** Width 399.23 mm (15.72 in.) *** Depth 299.49 mm (11.79 in.) *** Weight (max) 3.20 kg (7.05 lb).\n\nGiven that, it should as large as possible, with very good performance, display, and build quality. Battery life ideally available to watch a movie. Good cooling required. Not super mobile with it, mostly moving spot to spot and working there.\n\nHow important is weight and thinness to you?\n\nSee above. \n\nDo you have a preferred screen size? If indifferent, put N/A.\n\n16 or 17 inch. Most 17 inch might be too large in total dimensions (see above) but perhaps there are \"smaller\" 17 inch laptops?\n\nAre you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.\n\nGaming. The latest. I often play on a high resolution monitor attached to the laptop.\n\nAny specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?\n\nHas to be easy to tether to multiple monitors.\n\nLeave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.\n\nBudget is no issue. The laptop has to fit in a bag where my old alienware 17 is slightly (1 to 2 cm) too big for.\nI often use the laptop stationary, and rarely while mobile (sometimes when flying or on public transit or in bed). I game while tethered to multiple monitors and good quality is a must. Good cooling , performance and so on is a must.\n\n16 inch laptops seem likely to be the ideal form factor but perhaps a 17inch with smaller dimensions than above are good as well. I am also unsure if the resolutions of the 16 inch form factor doesn't cause issues?\n\nSo far, I've heard good things about the following, but looking for your feedback.\n\nLegion 9i Gen 8 16IRX8 with a new cooling function \n\nRazer Blade 16, seems well reviewed \n\nRazer Blade 17, might be too big\n    \nAlienware x16 en m16, but don't see many reviews about them\n    \nLenovo Legion Pro 7i, also looks good but unsure about the differences with 9i\n    \nAsus ROG Strix Scar 16  or G16, also mentioned often as good\n    \nMSI Titan GT77 HX 13V, might be too big?\n    \nMSI Raider GE78 HX, might be too big?\n    \nAcer Predator Triton 17X, might be too big and unsure if available in Belgium",
  "Hey Laptop Enthusiast Here. Do You Still Need Assistance?",
  "Which should I buy?! I saw these were the best options for under $1500! \nI just graduated basic training for the Air Force now I am in tech school for 11 months. I want to use the laptop for school and for gaming. I also want it to last me for at least 4+ years while I take college classes. If you have any different recommendations let me know! Thanks! \n\nAsus TUF Gaming A17 RTX 4070: $1,799 $1,399 @ Newegg\nSave $400 on the TUF Gaming A17 with Nvidia GeForce RTX 40 Series GPU. It packs a 17.3-inch (1920 x 1080) 144Hz display, AMD Ryzen 9 7940HS 8-core CPU, 16GB of RAM, and 1TB SSD. For graphics handling, it's outfitted with Nvidia's GeForce RTX 4070 GPU with 8GB of graphics memory. \n\nMSI Katana 15 RTX 4070: $1,499 $1,159 @ Newegg Save $340 on the MSI Katana 15 RTX 4070 gaming laptop. This high-performance machine is built for gaming and content creation. It packs a 15.6-inch (1920 x 1080) 144Hz display, Intel Core i7-12650H 10-core CPU, 16GB RAM and 1TB SSD. For heavy graphics lifting, it employs Nvidia's powerful GeForce RTX 4070 GPU with 8GB of dedicated memory.\n\nAsus ROG Zephyrus G15 RTX 3080 GPU: $2,199 $1,429 @ Best Buy\nBest Buy is currently slashing $770 off the Asus ROG Zephyrus G15 RTX 3080 gaming laptop. In our Asus ROG Zephyrus G15 review, we praise its sleek design, stunning display, strong CPU performance. Its battery lasted more than 8 hours during testing which is impressive for a gaming laptop. Besides Nvidia's powerful RTX 3080 GPU, the laptop in this deal packs a 15.6-inch 2K Quad HD (2560 x 1440) display, AMD Ryzen 9 5900HS 8-core CPU, 16GB of RAM, and 1TB SSD. \n\nLenovo Legion Slim 7 RX 6800S: $1,949 $1,300 @ Best Buy\nSave $650 on the Lenovo Legion Slim 7 in this pre-Prime Day-rivaling deal from Best Buy. Thin and lightweight, this gaming laptop packs a 16-inch (2560 x 1600) display, AMD Ryzen 9 6900HX 8-core CPU, 16GB of RAM and 1TB SSD. AMD's powerful Radeon RX 6800S does the heavy lifting for graphics.",
  "Desktop dead. Help Buying Laptop Please My desktop is not functional so I decided to finally get a laptop for convenience sake.\n\nI am looking for a gaming laptop where I can also do other work tasks. Preferably one with a camera, but not required.\n\nI was deciding on what laptop to get but the top reviews on amazon scared me. A lot of people seem to have issues with screen colors being wrong (which I assume you can color correct) and some other issues im not too aware of in whether it is a common problem OR user issue.\n\nHaving never owned a laptop before, I decided I ask reddit where I am sure you guys are much more knowledgeable than I am.\n\nHere are my choices:\n\n\nDell Gaming G3 15 3500\n\n15.6 Inch\n\nIntel core i7-10750H 10th Gen\n\n16GB DDR4 RAM\n\n512GB SSD\n\nNvidia Geforce GTX 1650Ti 4GB GDDR6\n\n$1009.77[$1009.77 on Amazon](https://www.amazon.com/dp/B089HV9HJ4/ref=cm_sw_r_cp_apa_glt_i_50AZK6HKXGH6AGTR6WK1?_encoding=UTF8&psc=1)\n\n\n\nLenovo Legion 5\n\n15.6 Inch FHD IPS\n\nAMD Ryzen 7 4800H\n\n16GB DDR4 RAM\n\n512GB SSD\n\nNvidia Geforce GTX 1660Ti\n\n[$1199.99 on Amazon](https://www.amazon.com/dp/B08BB9RWXD/ref=cm_sw_r_cp_apa_glt_i_DGZP4KDXBTVTFSBAFDHA?_encoding=UTF8&psc=1)\n\n\n\nASUS TUF Gaming F17\n \n17.3 Inch 144Hz FHD IPS-Type Display\n\nIntel Core i5-10300H\n\n8GB DDR4\n\n512GB SSD\n\nNvidia Geforce GTX 1650Ti\n\n[$849.99 on Amazon](https://www.amazon.com/dp/B08ZLC661T/ref=cm_sw_r_cp_apa_glt_i_70XM8PT1V7JW2MPF6HE4?_encoding=UTF8&psc=1)\n\n\n\nMSI GF75\n\n17.3 Inch 120Hz\n\nIntel Core i7-9750H\n\n8GB DDR4\n\n512 SSD\n\nNvidia Geforce GTX 1660Ti\n\n[$1197.99 on Amazon](https://www.amazon.com/dp/B07Z5KP1Y1/ref=cm_sw_r_cp_apa_glt_i_FE8G6J13HC49A00FPWZ9?_encoding=UTF8&psc=1)\n\n\n\nASUS TUF FX505DT\n\n15.6 Inch 120Hz\n\nAMD Ryzen 5 R5-3550H\n\n8GB DDR4\n\n256 SSD\n\nNvidia Geforce GTX 1650\n\n[$874.88 on Amazon](https://www.amazon.com/dp/B07VBK4SYS/ref=cm_sw_r_cp_apa_glt_i_9M9TWYZ3JAXXWQN6AN5Y?_encoding=UTF8&psc=1)\n\n\nI have an external HDD to use already and plan on upgrading any laptop with elss than 8GB RAM\nThansk everyone.",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Dell Gaming G3 15 3500 - 15 Inch FHD, Intel Core i7-10750H 10th Gen, 16GB DDR4 RAM, 512GB SSD, Nvidia Geforce GTX 1650 Ti 4GB GDDR6, Windows 10 Home Eclipse Black \n\n>**Company**: Visit the Dell Store\n\n>**Amazon Product Rating**: 4.6 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 3.5\n\n>**Analysis Performed at**: 05-20-2021 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/dell-gaming-g3-15-3500-15-inch-fhd-intel-core-i7-10750h-10th-gen-16gb-ddr4-ram-512gb-ssd-nvidia-geforce-gtx-1650-ti-4gb-gddr6-windows-10-home-eclipse-black) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "[deleted]",
  "Good Bot :)",
  "May I ask why?",
  "[deleted]",
  "I looked around as soon as you said no to ASUS and I see what you mean.\nThank you\nWhat would you suggest?\nI see a lof of Legion 5 fans on this subreddit...",
  "[deleted]",
  "Yeah... Im leaning that way too...\n\nMore $$ than what I wanted but [this](https://www.amazon.com/dp/B08L1XP7Q3/ref=cm_sw_r_cp_apa_glt_i_HTZEVN9637CYFB7FMJ8K?_encoding=UTF8&psc=1) is what I might purchase",
  "[deleted]",
  "About half the SSD size"
]