[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Help me choose: Lenovo X1 Carbon Gen 13 or HP Elitebook X G1a Hi folks, can you please share your thoughts on this choice? Particularly on real life usage, robustness, keyboard, display, and overall experience? \n\nI read tens of reviews, and technically understand them, but no chance of touch these laptops before I buy one, and I miss the real life feelings to make my choice.\n\nI need a work laptop, and choosing between the two:  \n1) Lenovo X1 Carbon Gen 13, Intel 258V chip, 1TB ssd, 32GB, 2.8K non-touch OLED,  \n2) HP Elitebook X G1a, AMD HX PRO 375 chip, 1TB ssd, 32GB, 2.8K non-touch OLED.\n\nMy use case and needs:  \n\\- scientific computations (preliminary and analisys on laptop, normal on big servers)  \n\\- C++ programming  \n\\- photography and some design (Photoshop, raw converters, Illustrator, databasing)  \n\\- almost no gaming (I have a dedicated gaming desktop)  \n\\- most work is on desk with additional displays etc  \n\\- at the same time, I need decent portability, as I go to work 2hrs on train several times a week + business trips are work-on-go by nature\n\nMy final thoughts:  \n\\- Currently, I have Lenovo X1 carbon gen 5, which I LOVE, the keyboard, the portability, the best on class display, it's robustness is really great. And I really appreciate it works good after 8 years, I don't like to refresh often. But yeah it gets outdated, I feel the lack of cpu power etc.  \n\\- I like the power specs of AMD 375 in HP. I have big servers for really long calculations, but still a lot of computation, programming, photoediting, all these require cpu power.   \n\\- I like light weight of Lenovo, and I like my current Lenovo, but Intel 258V is so frustratingly slower than AMD 375. It may play no role now, particularly considering I have servers for computations. Still in 4 or 5 years it may make a lot of difference...\n\nThanks for reading all this, and particularly if you can add some value to this choice!",
  "Well, for comparison sake, I just 2 weeks ago bought the Elitebook X G1A with the 375, 64GB ram, touchscreen OLED and 2 TB SSD.  So that definitely shows which I'd choose.",
  "I purchased the Elitebook X GIa and am coming off a Latitude 9440 2 in 1. I was beginning to get tired of the lattice keyboard of the latter. The G1a has a fantastic keyboard, and the laptop itself is unbelievably fast.\n\nMost importantly, if the specs are good enough for you, please see the one on sale at Costco ($1599). This is a relatively new addition to Costco's line (including the G1i).\n\n[https://www.costco.com/s?keyword=elitebook](https://www.costco.com/s?keyword=elitebook)",
  "What you like and what you don't?",
  "Thanks, I'll check it. Not sure they do international delivery, though.\nYeah, the keyboard is critically important for me, I'm typing a lot, and I'm not used to the modern-ish keyboards at all. It limits my choice greatly. Is there anything you _dislike_ about this laptop, btw?",
  "I love the performance.  Totally embarrasses the Lunar Lake.  I like the battery life.  Yes, Lunar Lake is capable of much better battery life, but this is \"good enough\" for my needs (9+ hours), so any more than that is completely unnecessary.  I like the fact that I got SOOOOOOOOOOOOOOOOOOO much more performance for the same price.  I like the fact that I have 64GB ram (Lunar Lake maxes at 32).\n\nI don't like the OLED, they're horrible on battery.  But this is, as pointed out, still \"good enough\" due to that (reasonably) large battery.  Nice to finally see business models getting reasonable sized batteries.\n\nThe price I paid for my Elitebook (375/64/2TB/2.8K OLED) is the same as if I were to configure the X1C13 with 256V/16/512/WUXGA.  That's a LOT of extra for the same price.  And I happen to think the Elitebook looks better, to boot.  Obviously that's highly subjective.\n\nMy Elitebook (after I made a skin for it):\n\n[https://ibb.co/dJ2pMfVD](https://ibb.co/dJ2pMfVD)\n\n[https://ibb.co/RTj90zvC](https://ibb.co/RTj90zvC)\n\n[https://ibb.co/xS08Dw3r](https://ibb.co/xS08Dw3r)",
  "Sorry, I did not realize you needed to have it shipped overseas. That might be difficult, if not impossible, with Costco.\n\nIt is a little thick and heavy (almost 3.5 lbs), and the bottom chassis is more rounded than I like.  Battery life is ok. Maybe 6-7 hours of browsing on balanced power mode?\n\nBut overall, I like it. Very quiet and has a great port selection. Also, the lid is rigid and doesn't wobble when open, unlike the X G1i or the Omnibook Ultra that I had a chance to play with.",
  "Would you with hindsight bought had the 1080p IPS panel instead for the improved battery life? Or do the increased sharpness from the resolution bump of the OLED panel make up for it? Do you also have any new long term measurements about battery life, or is it still around 9 hours? What usage do you have when testing this?",
  "Thanks, understood. How badly glare is the display there, btw?",
  "Thanks, really appreciate the first hand experience!",
  "If they made the HX375 available with the IPS, I DEFINITELY would have bought it.  But HP only sells the HX375 with the OLED, and I wanted the HX375 more than I wanted good battery life on this particular machine.\n\nI have enabled the \"maximize battery health\" in hte bios, so I no longer get anywhere near 9 hours (max charge is now 80%).\n\nWhen testing, I'll have my browser with 4-5 tabs, email client, and local streaming music player running at a comfortable (on this brightness, that's 40%) but lowish brightness, and on high powered CPU's like this, I will enable most of the power saving features to maximize battery life (on U series CPU's I just set it to balanced).",
  "this",
  "So far, pretty awful.  The joys of glossy displays.  Probably won't be so bad where I normally use it, but building it I've been using it directly under a multi-light outlet, so it's quite bad at that location.",
  "Sounds tough. Ah, where are my beloved matte displays, I use a laptop in a train a lot, with a lot of sun going from the windows.",
  "Yeah, this was the ONE part of ordering this I wasn't a fan of, but almost ALL the higher builds automatically include the 2.8K touchscreen OLED, so it's nearly impossible to not get it outside of a base-model G1A.  The WUXGA non-touch displays are matte.",
  "Macbook pro 13\" vs Surface Pro 7 vs Lenovo X1 Yoga 14\" Hi, which of of this laptop is the best overall, regardless of price? I don't have a specific need, will use one of this laptop mainly for  office work ( email, websurfing, microsoft office documents....) and I am both used to iOS and Windows. All with be with Intel i7 processor 16GB of RAM (32 for the X1)",
  "These are very different devices. The MacBook is a traditional laptop, surface pro has a detachable keyboard, and the yoga is a 2in1. It's like asking what's the best overall fruit: apples, oranges, or pears. Do you have anything specific that you are looking for?",
  "I went with the Mac pro 13”, best choice ive ever made",
  "What about a MacBook Air M1? This is futureproof and a great bang for the buck. 🙂",
  "MacBook is \"Clamshell\".\n\nSurface Pro is \"Detachable\".\n\nX1 Yoga is \"Convertible\".\n\nThese are the 3 main *form-factors* of laptops. I suggest you choose the one you like, then pick between laptops of the same form-factor.\n\nI would recommend Apple M1 chip, that means any MacBook released after 2020.",
  "Apple M1 Pro.",
  "Hi u/Tomcorsnet, that's the thing, i do a very traditional use of a laptop, i'm not doing anything fancy such as gaming, web design etc...i mainly do emails, websurfing, watch movies, MS office documents....",
  "Pears ;)",
  "For the record I think its silly people think we can't compare fruit!",
  "Really? What is good about it? I'm a bit clueless to be honest",
  "Unfortunately I only have access to those 3 :-(",
  "You mean macbook pro?",
  "You mean macbook pro?",
  "This one is not on the list..",
  "What about carrying the laptop around? It might be helpful to check the weight too. If not then I would just go with the cheapest option because none of them are bad. I would shy away from the surface just because the keyboard is not as great and it sounds like you do a lot of typing",
  "You can compare fruit, but comparing (for example) an apple and an orange is different than comparing a Fiji and a Red Delicious. \n\nTo compare an apple and an orange you are doing much easier work, apple is sweeter, has thinner skin, has crisp flesh, etc. Orange is sourer, has thicker skin, has spongier flesh. \n\nComparing a Fiji to a red Delicious is much more complex. The Fiji is a little sweeter, it's color is a bit different.\n\nComparing two disparate things makes choosing between them easier most of the time (the only exceptions are when different necessary features are lacking in both options)",
  "I read just now that you don’t need it for anything that may acquire something “special”.  I would say go with the cheapest option.",
  "Yup. Macbook Pro M1.",
  "Good tip, I'll check the weight , but yes typing is quite important to me, I should have mentioned it before",
  "I’d say that the typecover definitely is a worthy contender to a laptop keyboard. Mind you, I’d take a proper keyboard any day but for what it is it’s pretty nice.(price however, and the fact you have to purchase extra however, is not so nice)",
  "Ok but as I'm not paying for it, I dont really mind the price.  As I'm typing a lot though, the surface might not be ideal\n?",
  "If typing is important then I would check online reviews on what they say about the keyboard. Mobile tech review is pretty reliable.",
  "Yea I always wonder why it's an accessory and not included",
  "I cant seem to find a Macbook pro 13” with an i7 processor. But if it has a magic keyboard implemented, it is great. I really like mine.",
  "If the Mac doesn't have a M1, definitely go for the X1. Current displays are nice, twice the RAM, and it has a pen, which is fairly neat. Keyboard is probably the best of the three.",
  "I checked the spec I can only see that, would you know if it is the one with M1 chip?\nDesign: Traditional clamshell in space grey\nWeight: 1.37kg\nDisplay: 13”\nBattery life: upto 10 hours\nRAM: 16GB\nLocal storage: 512GB\nPorts: 2 x Thunderbolt 3 (USB Type-C)\nProcessor: Intel i7",
  "M1 is an ARM processor. If the laptop you’re speaking of has an intel processor, it cant be same with the one queasyhipster mentioned",
  "Lenovo ThinkPad X1 Carbon Gen 11 - But which configuration Hi all! I will start to work as a bioinformatician and therefore I'm in the need of a new notebook. I think the Lenovo ThinkPad X1 Carbon Gen 11 is the perfect match for me, due to many positive reviews, its longevity, the keyboard, and its light weight. Of course, it's also a high-end business laptop. \n\nHowever, I'm a little bit overwhelmed by the amount of different configurations I can choose from. It should be powerful enough for my work, but I don't want to overkill on some parts.  For now I'm thinking about getting it with 32GB RAM (due to large datasets + ML + future proofing) and a 256 GB SSD (Will upgrade it in the future and save some money now). However, I have no clue which CPU I should get. I can choose between i7-1355U, i5-1335U, i5-1345U, i7-1365U and the i7-1370P. \n\nFrom what I've heard is the U version a low power version, that will be better for battery life and heat. But I don't know if it will too weak. Can anybody help me out? :) I would be grateful for any kind of advice!  \n\nBest ",
  "[removed]",
  "I have an all purpose machine with a Ryzen 7 5700u. It still is really fast for excel type calculations.If you were a big building architect who does 3d modeling the fastest chip is necessary. I assume the data formulas you run don't need the fastest chip on the planet. I would probably go with an i5 new u version.",
  "Thanks for your insight. I will check them out!",
  "what did you get in the end?\n\nI am also struggling with the i5 vs i7 (15W TDP vs 28W TDP) question",
  "Advice for ssd to Lenovo X1 Carbon gen 7 Looking for advice before picking a M2 2280  2tb hdd.\n\nLenovo modelnr: TP00109A\n\nCpu: Intel Core i5-8365U \n\nDoes it makes sense to buy a faster one over a slower one?\n\nIs it limited in read/write speed by any bus, cpu etc?\n\nCurrently considering Crusial P3 2TB\n\n[https://www.tomshardware.com/reviews/crucial-p3-ssd-review](https://www.tomshardware.com/reviews/crucial-p3-ssd-review)",
  ">Does it makes sense to buy a faster one over a slower one?\n\nOf course it does. Most importantly, is the price/performance ratio.\n\nYour PC only has a PCIe Gen 3 interface, it wouldn't make sense to put a Gen 4 SSD.\n\nI've used several Crucial SSD (namely, a few P2) and they still work very well. Crucial is a very good brand overall for everything SSD/RAM related.",
  "Thank you for valuable input=)",
  "Lenovo X1 Carbon Gen 10 vs Yoga 9i (14\" intel) Normally I answer these questions for friends and acquaintances but I am a bit stuck right now.\n\nI'm not asking which one is better. Rather, better for my use case.\n\nI need a new laptop. After reviewing many options and I'm down to the **Lenovo X1 Carbon Gen 10** vs the **Yoga 9i** and I'm on the fence. The Yoga 7i is the first runner up thanks to the  i7-1255U processor and the Dell XPS 13 was a close second runner up.\n\nBoth with similar specs are around the same price. (16 GB, Display WUXGA touch)\n\nThe main differences are that the yoga has the i7-1260P processor, 1 TB SSD and it seems that a larger battery. The X1 Carbon the i5-1240P, 256 GB SSD, and a lock slot. Any of those processors, even the  i7-1255U is suitable for what I do. SSDs are cheap so I can get a larger one if needed. Battery life is important and security is important.\n\nI use it with Linux so Linux compatibility is important. The X1 Carbon comes with Linux but it seems that the Yoga 9i has good compatibility.\n\nI am traveling a lot and like to bring the laptop along. Last 6 months we backpacked through many countries cities carrying my girlfriend's Dell Inspiron 2 in 1. I love the form factor. It has good specs but the exterior bent in one corner. Also at 1.63 Kg it felt a bit heavy as we carry max 10 Kg in total so cutting down 0.5 Kg (1 pound) seems meaningful.\n\nSo, knowing that here are my questions:\n\n* Is the Yoga sturdy enough to backpack?\n* Is the X1 Carbon as sturdy as it seems?\n* Is the battery life in the X1 Carbon with a \"P\" processor really as bad as the reviews say? Between 4 to 8 hours of real work.\n* Is the battery on the Yoga as good as the reviews say? Between 8 and 10 hours.\n\nThanks",
  "High response times on modern screens, and Lenovo X1 Carbon, ZBook Firefly G8 TLDR: If any of you guys own a ZBook Firefly 14 G8, do you see ghosting on the screen? Is it okay? Is it bad?\n\nRecently I became aware of the pitiful situation of modern laptop screens. In particular, I had my hands on Lenovo X1 Carbon Gen 9. While overall the laptop is not bad, the screen (1920x1200) is an atrocity with insane amount of ghosting. So I started looking for an alternative and realized that on paper almost every single similar laptop comes with a very \"slow\" screen. For example, I was thinking to get instead a ZBook Firefly 14 G8, which is similar in specs and price. Well, according to Notebookcheck they have very similarly performing screens:\n\n[https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-9-Review-Longer-battery-runtime-with-the-Full-HD-panel.540209.0.html#toc-2](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-9-Review-Longer-battery-runtime-with-the-Full-HD-panel.540209.0.html#toc-2)\n\nvs\n\n[https://www.notebookcheck.net/HP-ZBook-Firefly-14-G8-laptop-in-review-Small-workstation-with-faster-ports.530893.0.html#toc-3](https://www.notebookcheck.net/HP-ZBook-Firefly-14-G8-laptop-in-review-Small-workstation-with-faster-ports.530893.0.html#toc-3)\n\nSo if any of you guys own a ZBook Firefly 14 G8, do you see ghosting on the screen? Is it okay? Is it bad?\n\nSecond, are the on-paper response times in general indicative of the visible ghosting? Is it the black-white response time or grey-grey response time that is more important? Somehow, I refuse to believe that every single laptop is the same in this respect and every user just sucks it up and lives with this amount of ghosting especially in workstations that are marketed for CAD, graphics, and what not.",
  "Asus Expertbook B9450 vs. Lenovo Thinkpad X1 Carbon vs. Dell XPS 13 Hi All, \n\nTLDR: Asus Expertbook B9450, the Lenovo Thinkpad X1 Carbon, and the Dell XPS 13 - Which is best for general business use and some light video editing for Youtube business content. Also is Lenovo going to be the next Huawei?\n\n&#x200B;\n\nPost:\n\nI am starting a small business and need some advice on which laptop to buy. I have narrowed it down to the Asus Expertbook B9450, the Lenovo Thinkpad X1 Carbon, and the Dell XPS 13. If you have any other suggestions, I am all ears. I'd like to spend under $1,800.00.\n\nI plan on using the Laptop for a mix of business and video editing. My business will be entirely remote,  and so I want to be able to record monthly Youtube videos as part of my effort to maintain an online presence. Otherwise, I plan on using cloud-based practice management software, video-conferencing software, Office 365 with Outlook, and the usuals for business: internet, document programs, etc. I plan of reviewing and storing large documents. Security is important, as I will be dealing with client's sensitive medical information. I also want to have a docking station at home to connect my laptop to two-to-three 27\", 4K monitors.  I would also like a laptop that doesn't overheat easily. \n\nI will travel locally, but nothing major. I want to be able to take the laptop to a coffee shop or somewhere else besides my home to get a change of scenery when I get bored.\n\nLastly, I am nervous that Lenovo will be flagged by the U.S. for security threats - it's a Chinese company and Huawei has had some issues in the U.S. with security as of late. Is this irrational?\n\nI'm probably trying to find a perfect laptop that doesn't exist. That's okay, I'd just like to get as close as possible. \n\nHelp!",
  "Those options are really good. I think it just boils down on the specs and your preference. \n\nAll of them supports strong cpu. Only thing you wanna consider is the ram and the storage.\n\nFor the issue in Lenovo, I don't think it will be like Huawei since Lenovo has been trusted for years and even promotes security in their products.",
  "I own the B9450 and the XPS13.  I do not own the X1 Carbon.  My experience is that the B9450 is great for productivity and extremely lightweight.  The screen is 1080p and matte finish.  The graphics are UHD620.  In my opinion, I think the XPS 13 9300 I own has better graphics, better power and speed, and a more attractive screen.  However, it is heavier and about 1/2 the battery life of the Asus.  If battery life and weight are important, it's a no brainer to go with Asus.  If the extra power is more important, go with the Dell XPS 13 9300.  Or, you can split the baby and go with the Asus UX393 which is basically a hybrid of both designs.  It splits the difference in battery life, but has the as good a screen and power if the Dell.  Good luck.",
  "How much battery life are you getting out of the B9450? I have Dell XPS and the battery life is GARBAGE... I have to be plugged in all the time",
  "I was getting easily 10-12 hours of real world use.",
  "Lenovo x1 carbon one year review This is a review of my Lenovo Carbon x1 (7th gen) after one year of use.\n\nThe x1 carbon has a good reputation among business users and you can find many positive reviews, so I thought I would share my different experience for anyone looking to buy it.\n\nI bought this laptop one year ago. In this time I have had a whole bunch of hardware and software issues. This really impacts the overall package and user experience, especially if you consider its 2000 € price point.\n\nBelow is a summary of all my issues:\n\nRight after I got it, it started turning off for no reason with a full battery. Windows event log showed a critical battery warning and a shutdown afterwards. I sent it in for service and they updated some software after which the problem went away. I am also kind of disappointed at the battery life, as it is shorter than expected. Anyway, after one year, my computer is saying it can't detect the battery (even though it is powered on and running on battery power) so it seems the issue persists. At least it doesn't turn off anymore... \n\nI also cracked my touchpad after I noticed one edge was sticking out slightly. I didn't apply any real force for it to crack. Kind of annoying. Luckly I got it replaced under warranty.\n\nThe touchpad has a software issue where sometimes it gets very unresponsive to touches. I have to reboot for it to go away. Also the pad is small and doesn't have all that great gesture support.\n\nBad fan control. The fan will spin up all the way up for a second and then drop back down to low speed constantly with load change. I haven't seen such bad fan control in 15 years.\n\nI have a few dead pixels on my screen. Also kind of annoying.\n\nThe backlit keyboard occasionally doesn't work. It will just turn dark and I have to reboot for it go work again.\n\nI expected a better charger instead of the generic one. Since the battery sucks, I have been carrying it around a lot.\n\nWhile it has a good keyboard, is nice looking and lightweight, nothing else is particularly good about it. While most probably won't have as many issue as me, it still isn't worth the asking price in my opinion.",
  "Lenovo ThinkPad X1 Yoga Gen 2 question about the ethernet dongle So I was looking into used laptops for photography, and I don't know too much about them. I saw this one pop up on my fb marketplace and thought it was a decent candidate so I was reading reviews online. \n\nOne of the reviews said a downside was needing an ethernet dongle, and despite googling that, I still don't really know what that is. \n\nDoes the laptop need to be connected to an etherent cable in order to get online? Or does this ethernet dongle need to be plugged in to get online wirelessly, if that makes sense? \n\nAnother question - I saw when the laptop first came out it was going for the $1,800 range in 2017. I found this one on fb going for $300 lightly used. Is this too good to be true? Or do Lenovo laptops just not hold their value for long since they come out with new ones so frequently? \n\nIf anyone can help me with this I'd really appreciate it. Thanks a lot",
  "Lenovo ThinkPad X1 Extreme / P1 Long-term Review (r/ThinkPad x-post) ",
  "##r/ThinkPad\n---------------------------------------------\n^(For mobile and non-RES users) ^| \n[^(More info)](https://np.reddit.com/r/botwatch/comments/6xrrvh/clickablelinkbot_info/) ^| \n^(-1 to Remove) ^| \n[^(Ignore Sub)](https://np.reddit.com/r/ClickableLinkBot/comments/9wy10w/ignore_list/)",
  "I really liked this review since it was after long term usage, where all the small annoyances will start to appear. This was interesting in particular to me:\n\n\"There is an annoying bug with Windows and machines with a dedicated GPU that is directly connected to video output, such as the case with the P1. Basically, when using an external monitor either through HDMI or USB-C, the dedicated GPU will always be used to power new apps/processes. When you unplug the monitor, the processes continue running on the dedicated GPU. \"\n\nSo this means that heat and noise will continue to be generated by the dedicated gpu even when it's not needed at all.\n\nI run Linux on my laptops but maybe it's the same issue there. ",
  "I'm not familiar with linux, but you can probably check the GPU activity with a linux program I assume? ",
  "Dell xps 15 7590 (2019) or Lenovo x1 extreme gen 2 (2019)? Hello everyone, I want to buy a laptop mostly for coding. My choice fell on these two laptops. I need your advice on that, I can’t find lots of reviews about them, still confused. I would say I have 60% for Dell and 40% for Lenovo. Dell seems to be very good but Lenovo because of it’s keyboard(one of the best) and I read that it has problems with connecting a monitor. What do you think? Thank you",
  "X1Egen2 ofc. Better keyboard for lots of code rows. Many coders respect ThinkPads as a brand since it was initially for nerds. In the end, it is just a tool though. You can successfully code on Mac or surface as well if your hands are straight.",
  "I ditched my XPS 7590 for the X1 extreme gen 2. One of the best decisions I've ever made in my entire life.",
  "Lenovo ThinkPad X1 Carbon has a competitor now. Take a look at Acer's New TravelMate X5 - ",
  "Acer laptops have never been close to the reviews  of the X1 Carbon, what are you going on about? ",
  "This isn't even competing in the same segment, why would you compare them? ",
  "Mainly weight and hardware. Build quality of ThinkPads is, of course, a lot better than Acer notebooks, but this is TravelMate - Acer's business line. It is built from magnesium-aluminum alloy so it won't be flimsy like Acer's other budget notebooks.\n\n&#x200B;\n\nWhile it will take time for me and other websites to publish the full review of TravelMate X5, here's the review of its predecessor on Notebookcheck. - [https://www.notebookcheck.net/Acer-TravelMate-X3410-i7-MX130-FHD-Laptop-Review.390961.0.html](https://www.notebookcheck.net/Acer-TravelMate-X3410-i7-MX130-FHD-Laptop-Review.390961.0.html)\n\nIt is rated 4/5 and as far as I know notebookcheck tests laptops more vigorously than any other publications.",
  "What are reviews on Lenovo X1 Yoga or any alternative laptop for programming. I haven't used Mac before and cannot invest time to learn at this moment. Thanks in advance. ",
  "Do you also need it for Active Pen note taking? X1 Yoga is a solid device in my opinion and it's also great for programming too thanks to it's very great keyboard. There's also another alternative such as ThinkPad Yoga X380, for slightly less price while still retaining the Active Pen capabilities. What's your budget though?",
  "The Yoga 730 is also a solid option, and it's considerably cheaper than the X1 Yoga (if you buy the yoga 730 at Best Buy)",
  "All of  the Thinkpad T and P series laptops are ideal for programming. I use  P52 with Xeon and my colleagues use T480 which are much lighter. Spill proof keyboard and awesome battery life -- need I say more!",
  "dell XPS 13 Developer edition vs Lenovo Thinkpad X1 Hey guys, I'm a computer science student going into my third year of college. I want to buy a new laptop, I like the xps 13 developer edition because it comes pre-installed with Ubuntu Linux. However, I've been fascinated with the ThinkPad because of all of the good reviews and loyal users. If I were to go with the ThinkPad I would want the 10th generation processor which I've been having trouble finding. I want to use Linux on a daily basis do get a better understanding on the operating system. On the Dell I would install the tools I need for cybersecurity, on the ThinkPad I would either dule boot with windows and kali linux or just run kali. What do you guys think?   \nTL;DR I like linux and was wondering if i should go preinstall with dell xps 13 or install it myself with ThinkPad x1(also looking for a 10th gen processor for thinkpad)",
  "XPS 15 2 in 1 or Lenovo X1 Yoga w/ eGPU I am looking at getting a new laptop from my aging and heavy macbook pro. I really want something with a 2 in 1 to be able to watch movies and youtube in bed in my dorm. I am currently a college student and need something that can do so computation work and programming. I also want to be able to do some light gaming and that is where I am torn. I like the x1 because it has the hdr screen but it has no gpu so I would need an egpu. If I went this route I already have a 780ti I could uses for this purpose I would just need an enclosure. The XPS on the other hand has a gpu although rx vega m so not as powerful as the 1050ti or 1060 that other laptops have and no hdr screen and from reviews it's 2 in 1 functionality doesn't seem as good as the x1s. It also doesn't have a pen which the x1 includes which is a nice feature but not something that is a deal breaker.\n\nLastly would I be better of waiting for the 2019 models to be released. Both of them seem to come out in June which I can wait for as my current laptop still works but if they aren't going to be that much better I would prefer to get one now. \n",
  "I'm selling an xps 15 2in1 if you're interested! I have it posted on r/hardwareswap",
  "Looking for a premium ultrabook : will the Lenovo X1 Carbon fit my needs? Hello everyone, \n\nI am looking for a new laptop and I may have settled for the X1 Carbon 5th Gen. I first saw an Art Technica Review about the X1 Yoga that looked cool (A few years ago I had bought a Yoga but despite its interesting qualities was much too slow). However, upon looking further, it seems battery life is disappointing. Hence, the X1 Carbon, which I had already looked at about 1 year ago (the 3rd or 4th gen?). \n\n\nI am looking for a lightweight laptop with a good screen, long battery life and one which is not slow (in day-to-day operations and boot/startup).\nWill the X1 Carbon fit this description? According to what I have read yes. \n\nHowever, I have seen people complain about battery life. I usually use things like Chrome, Excel, Word, Evernote, a bit of Matlab and some gaming (CCGs such as Eternal, Faeria, Gwent…) as well as services like Onedrive, Dropbox in the background.\nDo you think  I can achieve something like 8h battery life ? \n\nOther questions : \n\n- Does the WQHD screen reduces battery life vs the FHD?\n- Has anyone tried to charge it with an external battery ? I have an Anker one that I use for my MB pro but I wonder whether it will work with the X1, just in case…\n-  anything else I should be aware of ? \n- Other suggestions (for the X1 carbon I am looking at the high-end resolution with 1TO SSD, 16 G Ram and the WQHD screen) ? \n\nThanks !  \n",
  "Regarding laptops: \n\n* long battery life\n* powerful\n* lightweight & slim\n\nPick any two. You can get a bit more life out of a T470 or T470s. While they're still technically ultrabooks, they won't be as light and slim as an X1C.\n\nThe higher the screen resolution, the faster it'll drain battery. Ask Anker about their products compatibility.    ",
  "It's actually powerful, small, and cheap.  Considering the Razer blade and the aero series are all powerful, thin, and with good battery life. ",
  "Lenovo ThinkPad X1 Yoga Review Roundup: Is The OLED Display Enough To Make You Want It? ",
  "The X1 is no doubt a great laptop, but the price is a bit steep for the specs.",
  "I really do love my X1 Yoga OLED, yes it is expensive, but it is a nice machine, very portable, but capable. It is a first gen product, so this stuff is to be expected as well. ",
  "Yep. I also think that the price is its biggest issue.",
  "Is this worth $300 I want to do stocks, watch sports and movies, do work. 🚀 Speed, Style, Security: This is the laptop that feels like a feather but works like a beast! Selling my Lenovo ThinkPad X1 Carbon Gen 7 (Type 20QD), fully upgraded to 1TB NVMe SSD and 16GB DDR4 RAM – perfect for business, coding, creative projects, or streaming. Features a sleek 14” FHD display, legendary ThinkPad keyboard, rapid charge, and rugged carbon-fiber build. All-day battery and Windows 11 Pro installed.\n\n🔹 Condition: Excellent – no major scratches, battery holds great charge\n🔹 Includes: Genuine Lenovo charger\n🔹 Super lightweight & ready to go!\n\n✔️ 1TB SSD = massive storage for all your files\n✔️ 16GB RAM = ultra-smooth multitasking\n✔️ WiFi, webcam, fingerprint reader, USB-C\n\n🌟 Why settle for bulky or slow? Upgrade to ThinkPad reliability!\n\nPrice\n$290(Cash/Pickup Preferred)\n\nDM if interested – first come first served! 🎒 ",
  "TS is not worth 290 lmao\n\nIf you copy pasted the specs list, that shit is written by chatgpt for sure and is probably NOT what is actually in there.\n\nIf the specs are correct it can do these thing yes, but it aint worth 290. 150 maybe sure.",
  "You're probably better off with a T14 for 300ish",
  "You might find a better deal at an electronics recycler in your area. I got a latitude 7410 with similar specs for $150 plus I got to test it out in person.",
  "\"GPT, make something enticing for a potential buyer on a thinkpad\"\n\nalso suspiciously there are no specs that'd actually show the worth of the thinkpad",
  "AI",
  "It'll do what you want it to, 1TB NVMe is good, 16GBs of ram is alright but if you see high usage you can probably just open it up and add some more yourself.\n\nI will tell you that this laptop will probably last you a decade if not more *as long as windows doesnt do anything stupid*.",
  "Thank you any recommendations? Looking to get a good refurbished laptop",
  "I agree with the chatgpt part and that the specs aren't groundbreaking, but in what world can you get an X1 Carbon Gen 7 for $150?",
  "Thoughts on this [https://ebay.us/m/aoImSb](https://ebay.us/m/aoImSb)",
  "it says Type 20QD, which means it's an 8th gen Core processor (which is kinda old tbh)",
  "I’d argue that for watching movies, the display is not very good.  An used/refurbished M1 MacBook may do the job with longer battery life and a nicer display.  They’re also going for relatively cheap now.",
  "If you have a university nearby govdeals is a great place for cheap used laptops.",
  "[https://www.ebay.com/itm/336208865269?\\_trkparms=amclksrc%3DITM%26aid%3D777008%26algo%3DPERSONAL.TOPIC%26ao%3D1%26asc%3D20250506202230%26meid%3Db3446153d2014a908b7c8fa00286ee5f%26pid%3D102751%26rk%3D1%26rkt%3D1%26mehot%3Dnone%26itm%3D336208865269%26pmt%3D1%26noa%3D1%26pg%3D4375194%26algv%3DRecentlyViewedItemsV2SignedOut%26brand%3DToshiba%26tu%3D01K9R0B5ZWKFF5DTX24MC2G48Z](https://www.ebay.com/itm/336208865269?_trkparms=amclksrc%3DITM%26aid%3D777008%26algo%3DPERSONAL.TOPIC%26ao%3D1%26asc%3D20250506202230%26meid%3Db3446153d2014a908b7c8fa00286ee5f%26pid%3D102751%26rk%3D1%26rkt%3D1%26mehot%3Dnone%26itm%3D336208865269%26pmt%3D1%26noa%3D1%26pg%3D4375194%26algv%3DRecentlyViewedItemsV2SignedOut%26brand%3DToshiba%26tu%3D01K9R0B5ZWKFF5DTX24MC2G48Z)\n\nI always recommend Dynabooks like that or Thinkpads. I personally prefer the Dynabooks for their superior IO.\n\nI recommend you look through ebay for other models, you might find something even better.",
  "Right here: [https://www.ebay.com/itm/167919046386](https://www.ebay.com/itm/167919046386)\n\nYou can get a 11th gen Dynabook for the same price btw, just with less ram. I usually recommend those instead. If you're interested, [https://www.ebay.com/itm/326764740058](https://www.ebay.com/itm/326764740058) or the 10th gen one I linked to in my other comment, which has 16gb for only 20$ more.",
  "I wouldn't recommend an E model. Look for a T14, maybe a gen 2 or 3. They're around 3 or 400. The T series are business class laptops that are meant to be more durable than consumer laptops. The best part is they are usually from an office environment that are lightly used for the most part.",
  "no",
  "or they could just plug whatever they have into a tv/monitor instead of mac prices",
  "Thoughts on this [https://ebay.us/m/aoImSb](https://ebay.us/m/aoImSb)",
  "Do you have any recommendations closer to 200?",
  "[what you think](https://ebay.us/m/Jtv1KX)",
  "There is clear indication, based on the photos (the Intel sticker specifically), that the laptop has an 8th gen core i7",
  "$350 USD",
  "It's about the same just has more ram and less storage.\n\nI don't know if its 1x32 or 2x16 though, if it's 1x32 you will get worse performance.",
  "Not bad, but youre gonna need to buy a charger. I would recommend getting the 65 watt brick not the 45 watt. If you want better mobile battery life, consider the i5 model. \n\nBe aware that this is an S model, nothing wrong with it, in fact the S model is the premium version. Typically with better cooling too. However, you cannot expand your ram memory usually. If you can live with that, then its definitely a good candidate.",
  "im not saying no you're wrong i'm saying no i wouldn't buy this",
  "no problem, that's just how it sounded. If it was the 11th gen model I might consider it for that price but 8th gen for that price is horrific",
  "Lenovo Yoga 9i (Core Ultra 7 258V) - Will weak multicore performance be an issue for my use case? Hey everyone,\n\nI'm considering picking up a Lenovo Yoga 9i with 32GB RAM and the Core Ultra 7 258V processor. The thing is, this CPU only has 8 cores/8 threads, and from what I'm seeing on benchmarking sites like NanoReview, the single-core performance is solid but the multicore scores are pretty underwhelming.\n\nMy main use cases are:\n\n* Office work (Microsoft Office suite)\n* AI applications and Coding\n* Cloud Computing\n* Cloud gaming via GeForce NOW\n\nI'm not doing heavy video editing or anything like that. Given what I'll be using it for, should I be concerned about the multicore performance? Or will the strong single-core be enough to handle my workflow smoothly?\n\nWould appreciate any insights from people who have experience with this chip or similar use cases. Thanks!",
  "I despise the throttling on my Think pad x1 with 258v and 32gb RAM.",
  "Office Work - Fine  \n\"Cloud\" Gaming - No Effect  \n\"AI App\"??! - Coding - No Effect RUNNING apps/Services in the background? - Throttled.  \nCloud Computing - Anything you run in the cloud won't be affected, anything you run locally in the background will be throttled.",
  "Best budget laptop for college I am currently in the process of transferring from community college to a university in my area and in need of a laptop. I don’t wanna drop $1000 on a new one so I’ve been reading other forums and reviews on best used/ refurbished and the Lenovo think pads are the most common answer. I have little to no knowledge of what specs I need to look out for but here are key details that can help view my needs.\n\n1. I am majoring in business (marketing) with a minor in Econ \n\n2. 400-500 usd is my budget\n\n3. So far the laptop I’ve been most interested in is the Lenovo ThinkPad X1 Carbon Gen 8 i7-10610U @1.80GHz 16GB/256GB Win 11 Pro\n\nThoughts?\n",
  "M1 macbook",
  "Are you okay with Refurbished laptops? If yes, I will look for that ThinkPad X1. If not, here are a few laptops that around \\~$500 USD.\n\nPrices are updated as of July 8th, 2025. Ranked and Sorted by CPU Core performance using PassMark average. Some of the laptops are configurable as per your needs.\n\n**15.6\" | Ultra 5 225U | 16GB DDR4 | 512GB SSD | PassMark: 19301**\n\n* HP 17 Laptop AI PC: [HP Link](https://www.hp.com/us-en/shop/ConfigureView?langId=-1&storeId=10151&catalogId=10051&catEntryId=3074457345621913320&urlLangId=&quantity=1&color=jet%20black) ($369) (Limited Time Black Friday Sale)\n\n**15.6\" | 7535HS | 16GB DDR4 | 512GB SSD | PassMark: 17953**\n\n* HP Laptop 15z-fc100: [HP Link](https://www.hp.com/us-en/shop/ConfigureView?langId=-1&storeId=10151&catalogId=10051&catEntryId=3074457345621474323&urlLangId=&quantity=1&color=jet%20black) ($540) (Limited Time Black Friday Sale)\n\n**15.6\" | i5-13420H | iGPU  | 16GB RAM (64GB Max) | 512GB SSD | PassMark: 17593**\n\n* Lenovo V15 Gen 4: [https://a.co/d/cu2TCwK](https://a.co/d/cu2TCwK) ($493.98) \n\n**15.6\" | 5700U | iGPU  | 16GB DDR4 | 512GB SSD | PassMark: 15636**\n\n* Acer Aspire 3: [https://a.co/d/aUqnzPm](https://a.co/d/aUqnzPm) ($495)\n\n**15.6\" | Core 3-100U | 8GB DDR4 | 512GB SSD | PassMark: 14040**\n\n* IdeaPad Slim 3i (83KD000KUS): [Lenovo Site](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-300/lenovo-ideapad-slim-3i-gen-10-15-inch-intel/83kd000kus#tech_specs) ($469.99)\n* Dell 15 Laptop DC15250: [Dell Link](https://www.dell.com/en-us/shop/dell-laptops/dell-15-laptop/spd/dell-dc15250-laptop) ($249)\n* 17.3\" HP Laptop 17t-cn400: [HP Link](https://www.hp.com/us-en/shop/pdp/hp-laptop-17t-cn400-173-978y0av-1) ($329.99) (8GB + 256GB)",
  "Personally, I can't recommend the ThinkPad T14 gen 3 enough. Recently snagged one refurbished on ebay with a Ryzen 7 pro 6850, 16gb ram (not upgradeable) and 512gb storage for under $500",
  "While I’ve thought about getting a Mac most apps colleges use Mac books can’t support",
  "I think I found an **Used - Good** on Amazon, seller has good ratings too. But the specs are different from what you mentioned on the post.\n\n>**Lenovo ThinkPad X1 Carbon Gen 8 Laptop | 14\" 1920x1080 FHD | Core i7-10510U - 512GB SSD Hard Drive - 16GB RAM | 4 cores @ 4.9 GHz Win 10 Pro Black**\n\n>[**https://a.co/d/gUVhktV**](https://a.co/d/gUVhktV) **($546.47)**\n\nI dont see not much of a processor performance difference between these two:\n\n**10510U vs 10610U:** [https://nanoreview.net/en/cpu-compare/intel-core-i7-10610u-vs-intel-core-i7-10510u](https://nanoreview.net/en/cpu-compare/intel-core-i7-10610u-vs-intel-core-i7-10510u)",
  "Gotchu I had the x1 nano and it broke … considering it was like $1,400 I had regrets buying it. I got a mac and honestly it works 10x better and faster and 95% of apps are on Mac I feel",
  "Laptop Buying Advice - ThinkPad X1 Carbon vs Dell Pro 13 Premium vs HP Omnibook Ultra? Hi everyone,\n\nMy current laptop (a late 2019 Dell XPS 13) is nearing the end of its life, and I'm looking for a replacement.\n\nAfter extensive searching and comparison, I've narrowed my choice down to the three laptops mentioned in the title, but it's still challenging to make a final comparison.\n\nI've configured the three laptops with substantially similar specs, the warranties are identical, and the prices are within a few hundred dollars of each other. I've had a positive experience with my Dell XPS, which only really began to give me problems in the past year. I've never used HP or Lenovo before, but all three (in particular the Carbon and Dell) have excellent reviews.\n\nDo any of you have experience and/or advice about these three laptops? If it makes any difference, I'm buying the laptop in the US.",
  "Please recommend laptops! Hello!\n\nI'm getting very overwhelmed with the number of laptops and laptop reviews out there and I would love some advice on what to get for my needs. Thank you so much in advance!!!\n\nCountry: US\n\nBudget: up to max of $2000\n\nTime frame: not in a rush, willing to wait for a sale, if you know best time of year for sales please share\n\nComputer usage: \n\nWORK: designing, online teaching work (canvas, canva, zoom, Google meets, spreadsheets, Web design, graphic designs, doc writing, etc)\n\nFOR FUN: Games like Minecraft and stardew valley, movies\n\nOTHER NEEDS: needs to be able to run a lot of tabs at the same time (like three windows with about 6 tabs each or so), needs usbc port and HDMI port, light enough to carry around and work in a variety of settings, does not need super great battery life about 4 hours would be perfect\n\nThank you so much!!!\n\n",
  "HP Zbook Studio/Fury, Dell Precision 5690, Lenovo ThinkPad P1/X1 Extreme",
  "Thank you!!!",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "Laptop buy help Hi im about to buy a new laptop this weekend, haven't been able to check on physical stores if they have them or not so i just did initial research using their website. I'm currently under IT program, I play valorant from time to time, I also use After effects and Adobe Illustrator for some projects (no heavy 3d work). So far I've researched reviews on these laptops  \n\n\n|Model|CPU|GPU|RAM|\n|:-|:-|:-|:-|\n|Thinkpad T14 Gen 6 14 Inch| AMD Ryzen™ AI Pro 5 340  |AMD Radeon™ 840M|16 GB DDR5|\n|Yoga Pro 7 (14'', Gen 9)|AMD Ryzen™ 7 8845HS|AMD Radeon™ 780M |16 GB|\n|ThinkPad X1 Carbon G12 [](https://www.lenovo.com/ph/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-12-14-inch-intel/21kc0070ph#reviews)|Intel® Core™ Ultra 7 155H Processor|Intel® Arc™ Graphics|16 GB|\n|DELL XPS 14 |Intel  Core™ Ultra 7 155H or 165H |RTX™ 4050, 6 GB |16GB LPDDR5x |\n|Dell 14 Premium Laptop |Intel^(®) Core™ Ultra 7 255H or 265H|Intel^(®) Arc^(™) 140T Graphics or RTX 4050|16 GB|\n|ASUS Vivobook Pro 14|R9-5900HX|RTX 3050|16GB DDR4|\n\n  \nI'm eyeing on thinkpads however they're quiet expensive, so my second choice would be the yoga however I've been seeing comments on how bad the hinges are, and I'm quite worried about it since I really want this on the long run as much as possible I don't want any issues or replacements much. I've had this Dell Inspiron 5570 for about 6-7 years, I've had replacements with it such as the HDD to SSD then ram upgrade, it's been great with me on the long run however the battery is broken. With my experience with Dell, I'm considering to get the Dell XPS or Premium or whatever is good with them right now but they're not really a hot topic now so i can't get much info on the current dell laptops. \n\nAnyways please do recommend on which are really worth getting",
  "*Dell Premium* is supposed to be a successor lineup to the *Dell XPS* family as Dell does not produce new XPS models anymore. That's why the Dell Premium you see there has the Series 2 ultra chip, whereas the XPS has the Series 1 since that was the latest chip they came with. Between those two I would just choose the *Premium* as the Series 2 chips from Intel are a significant improvement over the Series 1 in every circumstance.\n\nIf you really value performance within Adobe After Effects, I would suggest choosing a laptop with a GPU such as the 4050. Integrated graphics are fine for *lightweight* effects work, assuming you go with at least the 780M or Intel Arc, but it's highly recommended to get even a low-power card, such as the 4050, to assist with graphics acceleration.\n\n**The Vivobook is the worst option you listed. I wouldn't buy it.** Great processor for its time, but it is outclassed by processors of this generation. The RTX 3050 was never even a decent GPU, but it doesn't consume a lot of power which is why it's favorable for graphics acceleration within laptops. Still, a 4050 mobile GPU is better.\n\nI would choose between the Thinkpad T14 and the Dell Premium 14 with an RTX 4050. The Thinkpad is built to last, but the Dell Premium gets you better hardware for the price. **The memory in the Thinkpad is upgradable**, while the Dell is soldered LPDDR5X. Take your pick.",
  "MBA/everyday use laptop Hello, I have been doing extensive research but keep struggling to determine which laptop is best for me. I am currently going to graduate school to get my MBA in finance so I was looking for a business computer which led me to the thinkpad x1 carbon especially because I plan to use it since my job is hybrid after I complete graduate school. However I was also looking for something that could handle my school work and also just be an everyday use laptop for casual things which I have seen reviews saying the thinkpad wasn’t best for that. As I have been back and forth with all sorts of Lenovo laptops I just wanted to reach out and see if I could get any user feedback that might help me determine a good fit for me. Along with the thinkpad I’ve been recommended stuff such as the Lenovo yoga, HP elitebook, Dell XPS 13 and a few others. Any help would be greatly appreciated I just feel there is so many options and I would like to hear some recommendations from people who know more than I do. Thank you for your help!",
  "If you're invested in using Windows, I would look for a laptop that used Qualcomm's Snapdragon silicon. It's the surest way to get both performance and battery life in Windows world. Otherwise, you could jump ship and go \"MBA.\" That is to say MacBook Air. But if you do don't buy the cheapest base model. It can use a spec bump. And although it's not cheap to do it, it's often worth it.",
  "Laptop for University AUS Hello! I’m wondering if people would be able to please advise me on a good laptop for university- commerce & economics. \n\nI currently have a lenovo thinkpad X1 yoga which i love but it’s very old and is operating on only windows 10…\nSO it’s time for a new one. My top choices are:\n1) Microsoft Surface laptop (not the 2 in 1)  however i’m seeing lots of mixed reviews on it so ??\n2) Dell XPS\n3) Lenovo thinkpad ts14 gen 6/5\n\nAny other recommendations would be much appreciated please!",
  "What Windows computer is most similar to Mac in terms of power and build quality? ",
  "X1 Carbon. Unfortunately the latest generation is twice the price and has a much shittier processor than any Mac because Intel hasn’t figured out how to design an efficient chip yet. If you want anything remotely close to MacBook battery life look at something with a Snapdragon processor, like the T14S.",
  "As people have mentioned, the snapdragon cpus are fairly new. Several mags like PC magazine did like the Acer Swift 14 AI with snapdragon processor. Originally, snapdragon was poor on video editing, but several people on this sub said Davinci Resolve has released some upgrades that makes it now efficient with snapdragon. I cannot vouch for that myself, but it seemed to be from legit posters that were not hyping websites or products.",
  "ProBook elitebook",
  "Samung has a nice build",
  "Surface Laptop 7, Lenovo X1 Carbon, HP ZBook or Omnibook Ultra",
  "Definitely a surface. Great build quality. Powerful. Color Accuracy. Magnetic chargers. Good touch pad.",
  "The New MS Surface Laptops seem to be excellent and have received good reviews.",
  "Asus Expertbook P5 now, or wait for another lightweight Lunar Lake laptop to be released early next year? It’s time for a new laptop and the Asus Expertbook P5 has most of what I’m looking for: lightweight, good battery life, MIL-STD 810H for vibrations (I will be taking it on long bike trips), spill-proof keyboard, and a 14\" matte screen. There isn’t really much information about the Expertbook out there yet, though Andrew Marc David and Laptop Mag gave it very good reviews. Should I go ahead and get it now, or is there any good reason to wait to have a look at one of the other ultralight Lunar Lake laptops (Acer Travelmate, Dell Latitude, and Microsoft Surface Laptop 7 – The Lenovo X1 Carbon Gen 13 is off the table because of its high price) that are supposed to be coming out early next year?",
  "I've also been eyeing this one. I think in terms of price this one is already great value for money. I've just read some mixed views on build quality which is making me doubtful.",
  "Coming to you from an expertbook P5 right now - For context I found this thread by googling \"Expertbook P5 trackpad\" because while I think I like this computer a lot, there's just something about the trackpad that seems off to me. Almost like it's just a hair less responsive than what I'd want/expect, but its so slight I didn't know if I'm just being too nitpicky today or if this is something others are experiencing haha. I could also just be used to 13 inch laptops with smaller trackpads so maybe any larger trackpad like this is less exact/responsive?\n\nAlso I haven't done any formal tests, but can say generally I've loved the battery life and the screen. No performance issues either but I'm using it for biz/excel purposes. Pleasantly surprised it displays very well on my two 4K + one LG dualup monitor setup when docked with just one thunderbolt cable, where other laptops have intermittent screen flickering or require multiple cables to run all three monitors. Keyboard is solid but feels different vs what I'm used too, maybe that's because of deeper key travel? \n\nIt's hard to explain - But after using this a good bit I find myself asking why I don't absolutely love it, and I keep coming back to trackpad as the main reason. Also puzzled that there's not too many reviews of this online vs competing options\n\nI might end up picking the Asus ProArt Px13 over this, even though I'll miss the screen brightness/matte of this Expertbook, I've loved using the Px13 but figured the brighter/matte expertbook screen for outside & on the go would be better. Also might just splurge for that Gen 13 Carbon X1 and live with buyers remorse for hopefully the best of all worlds?   \n\nHope this helps / interested to hear if this resonates with anyone. Cheers",
  "It's one of the best laptops i've ever tested, FWIW. [Here's my P5 review](https://smbtech.au/features/asus-expertbook-p5-laptop-review/), if it helps?",
  "any opinions between the expertbook p5 and the yoga slim 7i aura edition ?",
  "The thing is Andrew Marc’s reviews are bias, and he doesn’t handle feedback well. When questioned about his decisions, he gets flustered and dismissive. Above all of else, he is rumored to be a pedophile. I wouldn’t recommend him as a credible tech reviewer.",
  "That is in the back of my mind too. Perhaps we read the same Reddit post. [www.reddit.com/r/laptops/comments/1fzlug2/asus\\_expertbook\\_p5\\_p5405\\_review/](http://www.reddit.com/r/laptops/comments/1fzlug2/asus_expertbook_p5_p5405_review/)  A commenter from a few days ago had no issue with the loose touchpad, and I will be able to try it out before buying.",
  "Hey, thanks for sharing your experience. Are you still using the expertbook or did you decide to return it?",
  "Wow I'm having the exact same experience with the trackpad. It just doesn't pick up like every 5th tap to click but it's enough to drive me insane after a couple hours of use each day. I love everything else about it and don't want to return it but when you're spending $1200+ I think I may need something that lasts longer and doesn't drive me insane.",
  "Screen wise , expertbook has much better screen. I have tried both for few days, and with no doubt the screen is awesome IPS. The slim 7i has one of the most non comfortable oled screen that I ve ever used ",
  "Yeah, if you can try before buying, then you're going right with this price. Dell and Surface will initially come in at quite a hefty price before the whole category gets cheaper. I don't think this will happen before February / March 2025.\n\nI must admit, though, that I don't have as much trust in Asus as other brands. And I can't comment on whether this MIL-STD 810H makes a difference in the end or is just a great marketing lever. Have you been able to look at the Acer Swift AI in comparison?",
  "Returning it now actually haha - It's not a bad laptop and price point is now just like $1K at Best Buy, which for its features seems pretty good. However I decided I really want a 13 inch laptop, I went with \"MSI Prestige 13 AI+ Evo (2024) 13.3” 2.8K OLED Business Laptop: Intel Core Ultra 7-258V, Arc Graphics, 32GB LPDDR5x, 2TB NVMe SSD\" for what its worth",
  "Here in Thailand both the Expertbook and the Swift are going to be released very soon. I've found two websites taking preorders for the Swift and both only list an OLED version, so apparently the IPS version will be coming later. Also, the Swift has a 1920x1200 screen versus the Expertbook’s 2560 x 1600, and I have a touchscreen now and I never use it, so the Expertbook not having that doesn’t matter to me. I'm just hoping to avoid buyer's remorse in a few months time when the Latitude, Surface, Acer Travelmate, or something else is absolutely amazing. I'm sure that's unlikely.",
  "Thanks for your review! If you’ve got time, I’d also love to hear your review on your MSI prestige 13 AI + Evo.",
  "Hey bro, can give some insights on your msi one too??",
  "Hahaha, I love your honesty. If the Expertbook meets all your needs at a very reasonable price, what would you miss out on? I constantly have buyer's remorse, or it's not that, but the feeling something new and better is out there for me. It's what consumer culture has done to us. And we've gotten so used to calling 1-year-old laptops outdated. I have a Macbook M2, but I feel bored with Apple and want to play around with Linux / Windows again.",
  "Yo! Long story short, I love it and I'm keeping this as my \"final answer\" as my next go-to laptop. This is after trying most of all the \"best ultrabooks\" you can think of over the last few months   \n  \nFull disclosure, I also learned I'm partial to 13 inch vs 14 size, so this laptop being 13 inch, such light weight (it's noticeably lighter vs alternatives), high processing power and great battery life fit my wants very well. If I had to split hairs, I wish this came in a style/color looking a little more business oriented / sleek, but you can't have it all and that's all cosmetic  \n  \nIf you want \"Long story Long\", I just saw another purchasers' in- depth review of this on amazon and agree with everything they say, link below... I didn't test its performance as stringently as they did, but can tell you I did intentionally load up way too many multiple excel / office programs, browser tabs, etc and it still performed great... and it displays to my 3 monitor setup without any flickering that I occasionally got from alternative laptops I tried.  \n\n\nHope this helps with your decision! Here's the in-depth amazon review: [MSI Prestige 13 AI+ Evo - light weight with a few tradeoffs](https://www.amazon.com/gp/customer-reviews/R13GJDD9QS4O6L/ref=cm_cr_srp_d_rvw_ttl?ie=UTF8&ASIN=B0DF54PR4D)",
  "Help deciding between these Lenovo ThinkPad and Dell Inspiron laptops - any insight appreciated I need to make a decision on a new laptop and could use help deciding. I'm down to the ones listed in the below table (though if you think I should consider a different one let me know). I don't use this for anything particularly intensive or specific (e.g., no gaming, programming, CAD, etc), this is just an all-around laptop. I would say my main criteria is reliability/build quality - I tend to keep laptops a long time (e.g. 8-10 years) so I want this to last a long time. That said, I would appreciate a nice screen (I do use it for some photo/video editing) and would like decent battery life (though it spends most of its time plugged in).\n\nhttps://preview.redd.it/709cqhhecbke1.jpg?width=1110&format=pjpg&auto=webp&s=ee5190ab219f2ce43705c9a4dff1d2b935e69fc9\n\nHere is my current thinking on these - I would appreciate anyone's input/thoughts, personal experience, etc.\n\n* **Lenovo vs. Dell** \\- I like Lenovo a lot, I have one for my work computer and I love the keyboard. I'm leaning that way, but per the below I am trying to figure out why I wouldn't get the Dell...\n* **Yoga 9i** \\- I love this and this was going to be my choice (particularly love the design and screen), but I'm concerned about (i) only 16 GB of RAM (I could bump it up but that's $500-600 more) and (ii) lots of reviews say the real-world battery life is very poor.\n* **X1 Carbon Gen 11** \\- I know this is a prior gen but the new one is too expensive. Main concern with this one is the lower resolution screen (obviously has an older processor, but again shouldn't make a huge difference in what I use it for).\n* **ThinkPad T14** \\- This is obviously more expensive and has the same drawback of lower quality screen, but it's on the list because (i) it seems to be basically a tank that would last a long time (and could be easily repaired if need be) and (ii) it comes with a 3-year warranty.\n* **Dell Inspiron** \\- The background here is I went to Micro Center to try out the Lenovos and saw the stats on this one and I'm basically trying to figure out what the catch is with this. It generally has the same or better specs than all the others for quite a bit cheaper. What is the catch or drawback with this one? My one concern (other than the fact that I must be missing something) is that it has a lower brightness of 300 nits (which I feel could be an annoyance when using it in a bright room for example).\n\nI hope to buy this in the next day or so, so thanks for all the help!",
  "[deleted]",
  "Different brands do laptops different at different tiers within the same brand. Like bottom tier HP is worse than bottom tier Dell, but both are equivalent at business class tier. \n\nThe inspiron is the lowest dell tier while yoga and thinkpads are higher tiers for Lenovo, so I would disqualify the dell here. \n\nThinkpad >x1 carbon > yoga in build quality",
  "Either the ThinkPad T14 Gen 5 or the X1, preference towards the T14 G5.\n\nThe Dell might have a better CPU on paper, but its build quality is far, far worse than the Lenovos.",
  "Think you are just bitter about malfunctioning laptops that could happen to anyone.",
  "Thanks, and why do you vote those two over the Yoga?",
  "Yoga is consumer grade. Depending on the model, this could be fine or it could have hinge problems, power delivery issues, etc.",
  "Please help!!! I may or may not go insane without your help ;) First, let me just say, until this I was totally and completely computer/electronic dumb. Well, I still am but now I know things, kinda. I have done so much research, and price and review comparison that I am now crosseyed and my brain is mush. I REALLY need all you IT/computer geniuses help. I've been at this for way to long.\n\nSo, My Dell inspiron 15 3000 10th gen i5 just suddenly stopped working 30 min before my 2nd round interview with a telehealth company (the charging port is messed up, I think? No issues of this variety previously and deleted most everything on it so my son could use it since I wasn't). I have always had problems with it being unbearably slow and not loading stuff. More than a few times I have almost tested it to see how far it could fly when thrown from a 2nd story window. So I am needing a new one. I need something fast that I can run EMR programs when traveling and working from hotels or motocross tracks on occasion (The companies usually provide my equipment for home) and I need something I can edit photos and video, do spreadsheets and bookkeeping and I am that person that constantly has 100 tabs open at all times, ok that's an exaggeration, currently I only have 10 google pages and 4 programs open, but I have only been on my desktop for a few hours, I will definitely have more open shortly, no need to worry, haha.\n\nAnyway, from what I've read for remote healthcare work I need MINIMUM 16GB 512GB SSD and an i5 to run the programs efficiently, but an i7 or Ultra i7 is prefered, and need a webcam and good speakers/microphone. I have to have the number pad but am more than ok using a normal keyboard if needed and I will use an actual mouse so the touchpad sensitivity or whatever isn't a consideration. The sites i looked at for best laptops for medical workers never mentioned the AMD Ryzen, but I am not sure how old they were. Their #1 pick was either a macbook or surface pro, but I work in healthcare so I can't afford those and I am not an apple user/fan, but I could consider one if its best.\n\nAfter hours and hours and even more hours I thought I had it narrowed down to a Lenovo ideapad or an Asus Vivobook S with Ultra i7. When I went to buy the Asus the price went back up to over $750 (was on sale for $638) and so I did even more comparison shopping/research and I just can't get over the people saying the Asus's are junk. So I am leaning back towards a lenovo. I would rather have a thinkpad or x1 Carbon but I think I would have to get refurbished. I have a thinkcentre desktop that was refurbished and it has been awesome aside from a glitch here and there (it was $200 so expected to have an issue or 2), but I have had horrible luck with refurbished laptops, so it makes me nervous. Then my son who is preparing for college for coding and programing tells me that every Lenovo he's used has been junk (school provided laptops) and that HP has really gone down hill and aren't like they used to be, but Asus are good gaming laptops and that the AMD are pretty good depending on the generation and specs. He is also a know it all 18yr old but he's a smart lil s#!t, so I listen sometimes, only on occasion. Now though I don't know what is good, what will work for my needs and what I should flat out ignore.\n\nNow here's the kicker....drum roll..... I absolutely cannot spend over $800. Preferably between $500-$700. I have the jist of what to look for but I start going brain dead when comparing SDRAM vs DRAM, graphics and 802.11ax vs Infrared. Ummmm.... yep, one of those is what I need, I think.....\n\nPlease PLEASE help me. I have another interview via Teams on Friday and no laptop and no webcam. I am ok with replacing in a few years but would like it to at least last 5 years, and without a lot of decline in performance. I have tried so hard to find the best laptop to replace my Dell and my desktop with my budget on my own but I can't find a lot on the AMD ryzen aside from it seems to have less cores/threads and I don't know which brand is good anymore. Oh and I also have caviar taste on a top ramen budget, so there is also that. I am a 40 year old mom whos never needed a computer for more than school.\n\nSorry for the word vomit, just wanted to make sure I included as much info as possible. Thank you for your help. It is really truly appreciated.",
  "https://www.rtings.com/laptop/reviews/best/by-price/under-700\n\nif this will help you",
  "Thank you!!!! I will take a look at that one! I mainly used PCmag before (I think)",
  "Thank you again for helping to put me out of my misery! That website helped ALOT and lead me to spiceworks(?) which helped me make my decision. Finally!",
  "no problem, it's just 1 search away lol",
  "For most people ya. For me? 18278398 searches, asking business teachers, college computer nerds and a father in law who is building AI for a major port on the west coast and self taught himself coding which he now teaches at a community college, away before I finally came here. When your poor with expensive tastes and ADHD and OCD, its just not that simple. I have to make sure I am getting the absolute best I can for the money, and that its not cheaper or have better deal somewhere else. It just took us 6mths to buy a used work car under 10K. I have issues, lol. I knew all the minimum specs I needed and knew somethings where more important than others. What was making me lose my mind was Brand and AMD Ryzen or Ultra i-- or just i---. One website says Dell with a Ryzen 7 the next say their POS get a Asus Ultra 7. So ya its just not that easy for weirdos like me. The Ryzen thing was really throwing me off. The rtings site help because it listed all the major laptops for that range and how it rated in each category. I understand charts, lists, and numbers. Data. Reading through reviews and opinion I spiral and will make buying a pair of shoes seem like the biggest investment of my life.",
  "Contemplating getting new Lenovo 7i 2 in 1 - how does this sound for me? I'm leaving work soon, so have to give back a trusty old Lenovo X1 Carbon I've been using. The last laptop I bought was a \"build it yourself / no-name\" and I was very disappointed by the build quality, cooling etc, so I've vowed to buy a known, quality brand this time.\n\nMy use cases are pretty mixed:\n\n* OpenSCAD, Fusion 360 (fairly simple models, so I don't think I need a separate GPU).\n* Adobe Lightroom, occasional Photoshop\n* MS Office (I do love a spreadsheet...)\n* Home Assistant tinkering (including small bit of Python coding)\n* General web browsing, tinkering with Home Server, Network config\n* Streaming occasional game from Geforce Now or local (Sunshine/Moonlight)\n\n \n\nMust haves:   \n\n* \\>16GB RAM\n*   \\>1200p resolution\n*   around 16\"\n*   good build quality (preferably metal chassis)\n*   at least 500GB storage\n*   decent brightness\n*   good single core performance for 3D design stuff\n*   good key travel \n\n\n\n Nice to haves:  \n\n* touch screen (this is borderline \"must have\" - love using stylus for highlighting etc)   \n* numeric pad   \n* OLED display   \n* upgradeable (preferably additional slot) storage  \n\n\n\nI've been impressed with the Lenovos we use at work (though these are mostly ThinkPads) so been perusing the Lenovo site (massive, confusing selection), and this hits all must haves and most nice to haves -  \n\n [https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb3](https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb3)  \n\nI could live without the 2 in 1 feature I guess. Not sure how much I'd use that but intrigued to have a play. Maybe I should look to save some money by going for the same specs in a traditional laptop shell?\n\nAny thoughts? The price is at the very top end of what I was hoping to pay, but can stretch to it if I'm convinced of its longevity.\n\nNot many reviews out yet as it's quite new, but from reviews of older gens it looks like it has the build quality I've come to love from the work machines.",
  "I've ordered mine over a month ago and it should be arriving in a week (just got shipped from China). My requirements were pretty similar to yours, minus the 3D things. Also, battery and energy efficiency were a must-have for me. \n\nAlternatives were Asus and Acer. But I've got convinced by the good build of lenovo laptops (didn't try it myself yet). The downside for me is the not so common size of the SSD, but 1TB should be more than enough for my needs (cloud + NAS)",
  "What is the meta for thin-and-light notebooks for students?(NO MACBOOKS) I’ve read some lists and reviews but some of then are outdated so not too sure, is dell XPS good? but then I’ve heard of its function row and apparently bad display(for the price), what about lenovo/hp/other brands, any advice?",
  "You'll probably get a chuckle out of my comment but, believe it or not... Huwawei matebooks or Xiaomi notebooks are pretty decent for their price points. (starting at like 500-600USD for base models)\n\nI'm not talking purely about spec lists (if you want raw power there are lots of bulky gaming plastic laptops out there for lower the price vs the performance they bring) but rather in their apple-like build quality and feature set (like OLED screens, all alloy bodies, 90W fast charging, etc) for those prices. They're pretty shitty to maintain though, and I can't speak for their customer support.",
  "Lenovo Thinkpad X1 Carbon",
  "[removed]",
  "I have a Dell XPS 14” w OLED display, 32GB RAM, 1TB SSD and it is a fucking beast. Nice to carry. Battery life is above average. The screen destroys any other Laptops I’ve seen in person. The functions keys are alright I guess, I’ve never really had much need for function keys but it is nice that since I don’t use them I can have other controls pulled up instead. The keyboard puts MacBooks to shame, the keys have a little dip in them where your fingers fit perfect and after using it awhile I hate using any other keyboard. My only complaint is the track pad, it works great but it is massive, but also invisible so you don’t actually see the borders.",
  "X1 Carbon would be my recommendation - seen too many practically new XPS machines come in w/ random issues after seemingly normal use. I love the Latitude line for durability and upgradability, but they are not as thin and light, though I don't find my Latitude 5410 to be too bulky in any way.",
  "While I agree with the function keys on the XPS are a little odd. The keys on the keyboard are amazing to type on. Yes you think they look odd but when [using them they are fab](https://www.youtube.com/watch?v=ELsYC-N7hgc&t=123s)",
  "But it is very pricey. But in person, and after some use you’ll see why it’s priced above normal.",
  "[removed]",
  "[removed]",
  "If you want to talk about prices then the x1 carbon with the same specs as mine is 400 more. Less resolution on the X1, and it’s lighter because it used carbon fiber which trust me does not feel as premium as the aluminum on the XPS. We have both where I work and most prefer the XPS. Both very good, I will the the X1 is a lot easier to open but not a huge amount in weight difference. But some have a haptic touchpad and some has the classic 3 button. You have to pay extra for haptic",
  "that was the old model they have fixed that apparently. But I have big hands and don't have that problem",
  "[removed]",
  "Coming from? If you are holding them hand in each you can tell but I’ve used both this year. X1 is lighter but after carrying it room to room (work in medical field) all day and the XPS at the end of the day they are both light and easy to carry. But I much prefer the XPS for the display, keyboard and it definitely turns heads. It also operated much smoother",
  "Lenovo IdeaPad Slim 5i VS Lenovo Yoga Slim 7 I got 2 laptops from Lenovo on sale to compare them before deciding which to get.\n\nIdeaPad Slim 5i: 646$ after tax\n\n* AMD Ryzen 7 8845HS w/ Radeon 780M Graphics 3.8 GHz\n\nYoga Slim 7: 1046$ after tax\n\n* Intel Core Ultra 7 256V 2.20GHz w/ Intel Arc 140V GPU (8GB)\n\n  \nFrom all the reviews of the Yoga Slim 7, I've seen that the iGPU for the Ultra 7 256V (Intel Arc 140V) should be a great one and a much better improvement on previous iGPUs. They also run games on it and it works pretty well (but they usually use the 258V which has the same GPU).\n\nFrom testing however, I found that the AMD one is performing much better. I'm using Fortnite as a comparison/reference: AMD was able to run smoothly with Medium preset settings while the Intel one quite literally blue screened me and crashed the laptop twice. Eventually I got it to work, but at less than 30fps while the AMD one held \\~60fps or more. After benchmarking the two with Heaven Benchmark 4.0 these are the results:\n\nIdeaPad Slim 5i (Radeon 780M)\n\nhttps://preview.redd.it/k5jv6spcpb5e1.png?width=756&format=png&auto=webp&s=6fd5e9e069a998a2255d61c93f4aae0ac5b34cb5\n\nYoga Slim 7 (Arc 140V)\n\nhttps://preview.redd.it/au7bmplmpb5e1.png?width=690&format=png&auto=webp&s=f29549343eb22e47790a344adabaf8b0245deeec\n\nHere's my question: How could a 500$ cheaper laptop perform better? Is this something with the settings or drivers (I updated all drivers)? I made sure both screens had the same refresh rate and resolution for a fair comparison too. Both laptops' battery lives are equivalent and the only difference between the two is that the Yoga has a really good display. I'm kinda lost here. I'm considering returning the Yoga but I'm worried I might just not be using it right.",
  "obviously one cpu is better. Price doesn’t always = best.",
  "I'm worried that it's actually better but there's some setting or driver I need. The youtube reviews online say it can easily run Fortnite at medium preset with 60+ fps",
  "The ryzen cpu is faster",
  "MSI vs Lenovo - Which one should I buy? I am torn between these 2 laptops and could use some help deciding which one would be best.\n\nThey are almost identical in the key areas. The Lenovo offers more ports, but I've heard their customer service is not very good. On the other hand, MSI has a reputation for poor construction quality but I have also been using an MSI laptop for years without issue. That said, I am looking to level up.\n\nAny input would be greatly appreciated.\n\n[Lenovo 7i Gen 9](https://www.lenovo.com/us/en/p/laptops/legion-laptops/legion-7-series/legion-7i-gen-9-16-inch-intel/83fd0018us)\n\n* **PRICE: $1,799.99**\n* CPU :14th Generation Intel® Core™ i9-14900HX\n* Graphics Coprocessor: ‎NVIDIA® GeForce RTX™ 4070 Laptop GPU 8GB GDDR6\n* Memory : 32 GB DDR5-5600MHz (2 x 16 GB)\n* Storage: 1 TB SSD M.2 2280 PCIe Gen4 TLC\n* Display : 16\" WQXGA (2560 x 1600)\n* Ports/Slots: x1 4-in-1 SD card reader / x2 USB-C 3.2 Gen 2 (DisplayPort™ 1.4, 140W power delivery, 10Gbps) / x2 USB-A 3.2 Gen 1 (always on) / x1 Electronic e-shutter switch / x1 Thunderbolt™ 4 (DisplayPort™1.4, 140W power delivery, 40Gbps) / x1 HDMI 2.1 / x1 Headphone|Mic combo\n\n[MSI Creator 16r](https://www.amazon.com/gp/product/B0CXYM7TT6/ref=ox_sc_act_title_7?smid=ATVPDKIKX0DER&th=1)\n\n* **PRICE: $1,999.99**\n* CPU : 14th Generation Intel® Core™ i9-14900HX\n* Graphics Coprocessor: ‎NVIDIA® GeForce RTX™ 4070 Laptop GPU 8GB GDDR6\n* Memory : 32 GB DDR5-5600MHz (2 x 16 GB)\n* Storage: 2TB NVMe SSD, Serial ATA\n* Display : 16\" (2560 x 1600) LED, Anti-Glare, 240Hz\n* Ports/Slots: x1 HDMI 2.1 / x1 DC-in / x1 Ethernet / x1 Audio\\\\Mic Combo / x1 USB-A 3.2 Gen 1 / x2 USB-C 3.2 Gen 2 / x1 M.2 Slot",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: MSI Creator M16 HX 16” 240Hz QHD  Creator Laptop: Intel Core i9-14900HX, NVIDIA Geforce RTX 4070, 32GB DDR5, 2TB NVMe SSD, Cooler Boost 5, Win 11: Black C14VGG-291US \n\n>**Company**: msi\n\n>**Amazon Product Rating**: 4.4 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 3.3\n\n>**Analysis Performed at**: 11-14-2024 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/msi-creator-m16-hx-16-240hz-qhd-creator-laptop-intel-core-i9-14900hx-nvidia-geforce-rtx-4070-32gb-ddr5-2tb-nvme-ssd-cooler-boost-5-win-11-black-c14vgg-291us) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "Isn't most reviews on Amazon fake?",
  "Prueba a escribir una reseña negativa a varios productos de marca reconocida y en unos meses verás que la mayoría te las han borrado. Los anunciantes pueden eliminarlas si no les gusta lo que pones.",
  "Why are there no matte OLED screens? Screen reflections are really annoying and force me to increase brightness, which causes eye strain. I’d love to experience the deep blacks of OLED without the reflections. I’m currently using a matte Mini LED, which is good, but having a matte OLED option would be fantastic! Why are there none?",
  "Adding a matte surface reduces contrast, as it makes blacks less blacks. I wonder if when you do that, the difference between OLED and other screen tech isn't nearly as pronounced and not worth the upcharge since it can (at least partially) negate the most well-known OLED advantage?",
  "There are some, you just have to look properly, for example \nhttps://www.ultrabookreview.com/68424-lenovo-thinkpad-x1-carbon-gen12-review/",
  "I think it’d still be very nice, as it’s pretty much the same thing that happens when you get a matte Mini LED. You’ll get deep blacks at the latest when you’re in a dark environment. It will likely still have excellent contrast even in brighter settings.",
  "This seems the most likely situation. Apparently OLED screens are still quite expensive to produce relative to LED, so matte would completely waste the very purpose of OLED in the first place. And whether it’s TV or computers, you’re usually talking about margins that are already razor thin. Just ain’t worth it.",
  "Look at LG panels",
  "Well then apply a matte film and see for yourself.",
  "Ultrabooks with best battery life I'm looking to swap out my 2019 MacBook Pro for something with a respectable amount of battery life.  \nPurchasing the M3 MB Air appears to be the best option, but I'd like to know what the Windows equivalents are like. \n\nThe HP Dragonfly seems to have an acceptable battery life, but I haven't seen many good reviews. Lenovo X1 is another competitor, but the base models' pricing seems a little excessive.\n\n  \nI'm interested in knowing what people think about the best or most decent ultrabook battery life.  \n",
  "Wait a few months for the s14 lunar lake. Or if you use general apps, surface laptop 7 is the macbook in windows for battery life and has the best battery life in the snapdragon pcs",
  "Just an update: I had a look at the Surface Laptop 7 and they are absolutely amazing! I think that is the one for me. Now considering between the Snapdragon Plus or Elite - I think I’ll go with the Plus 16GB.",
  "thanks! I will wait as I am not in rush but I did not even consider the surface laptop - I guess its late night video review time :)",
  "[deleted]",
  "If they say 50% better than the last M3 Macbook Air than I am sold!! haha  \nThank you, will wait for the new Macbooks.",
  "Are any laptop companies worth my money? I already have an amazing desktop computer and a MacBook Pro but need a thin and light laptop for travel. The Apple Air has insufficient ports, as I commonly need USB-A, USB-C, and HDMI.\n\nReviews recommend the LG Gram Style 14. But LG have zero technical support and horror stories about bad computers, random throttling, under-specified batteries etc.\n\nReviews recommend HP Dragonfly. But HP have zero technical support and horror stories from consumers on forums about... well, everything.\n\nASUS long ago turned trash.\n\nDELL are over-priced and make units with whatever components were cheapest that day.\n\nAre any companies worth buying from? I seriously think laptops were better a decade ago. At least then I could trust IBM/Lenovo.",
  "I mean no one has the footprint Apple has if you are looking for a vendor that has retail stores you can just walk into with issues, third party vendors that specialize in Apple tech, etc.   \n\nDell and HP both have solid business arms with somewhat better tech support (and Lenovo too I guess if you are sticking to ThinkPads) but in the end that's phone support and its only so helpful vs just having a person you can take the unit to.    \n\nIf you like Apple, why don't you just buy a dongle and call it a day? I have a small hub for my MBA that has all those connectors you're asking about.   To be honest I forget it's in my workbag most of the time because it's so rare that I need it.",
  "Just buy a hub/dongle and keep your MacBook.",
  "Get a laptop from a decade ago. Easy solution considering your concerns",
  "As someone that don’t game on laptop anymore, I feel I am most satisfied with Mac’s nowadays. M1/M2 Air, M1 Pro MacBook Pro gives good value to cost I believe.",
  "It really depends on your criteria on what you need. Personally I think Asus is willing to push performance at the cost of quality.  My shopping criteria for laptops are going to be 13\" to 16\" laptops equipped with touchscreens, convertible 2-in-1, dedicated GPU equipped systems with upgradeable RAM and M.2 Storage using M.2 2280 formats. \n\n&#x200B;\n\nDells - got fucking lucky with their DOD contract.\n\nHPs - shitty laptop control hardware and not really meeting my needs.\n\nMSI - bought a bunch but their hinges suck.",
  "Maybe consider the ThinkPad X1 Carbon?",
  "OneMix 4",
  "Lenovo",
  "everyone's like buy a dongle lol",
  "Why wont your macbook pro work? I personally carry my 2.5KG Legion 5 Pro around all the time, im sure a 2KG or less macbook pro should be no issue.",
  "Lenovo thinkpads are still great, X1 carbon is quite good. Framework is especially promising considering the repairability of their laptops. Dell XPS 13 is also good, and if you’re worried about price you could by refurbished or buy a model from the Dell Inspirion series.\n\nAlso, if you want a thinkpad similar to ones during the IBM era, I think the T480 is what you’re looking for.",
  "you seem know well about computer but still need supports? many contradictions in your demand",
  "After due consideration I bought a refurbished Lenovo ThinkPad X390 for one-quarter the price of the current Lenovo ThinkPad X13 G4. Only 90g heavier than the X1 Carbon models that have many reported problems, due to the stressed design.\n\nThis one is not really any faster than my decades-old Lenovo, since not much has changed in computerland. But it has all the current ports, a better screen, twice the battery life, and is whisper quiet.\n\nWill do as my travel computer.",
  "I don't like Apple. Owning a MacBook is a pragmatic decision so that I can work with that OS when absolutely necessary.   \n\n\nBesides which their models don't suit me. The Air does not have enough ports. The MacBook is too heavy for  the type of travel I need to do.",
  "Already have. But see reply above.",
  "Yes, it's easier to eliminate companies from my list than to add to my list!",
  "Yes, am considering. Battery life worse than other brands. And it has a much worse keyboard than my old Thinkpads (I have a couple). But might be the best compromise.",
  "It **IS** an issue for me or why would I be writing this? When I travel to perform I have quite a bit of gear so minimising every gram is important. I have a mobility disability, in case that adds perspective.   \n\n\nBesides, I hate the Mac OS and some apps I use do not support it.",
  "There are no contradictions. I have deep knowledge but it's not infinite. Asking for help is what a forum is for.   \n\n\nBut why are you here?",
  "*I came looking for booty.*",
  "Mom needs a laptop that’s both lightweight and has the coolest thermals possible (so that it can be held in-hand at work) My Mom is looking for a laptop for work that’s light enough to consistenly keep open on the left palm and has low enough heat at the bottom during excel-level tasks to actually hold it that often. The company said that it’d be a company expense as long as the model is approved. She says that since everything else in the office is a Lenovo she’d stick with that, so it also doesn’t need to be Thinkpad but is very preferred. She offloaded looking for the laptop to me. The laptop should be 14”+, Win 11 Pro, i5+.\n\nAt first I was looking at the X1 Carbon which is 2.5 pounds but kept running into its only problem of all things being thermals. It’s a great laptop, but I don’t think she’ll tolerate it or try and use tricks to make it better. Right now I’m looking at either a T14 Gen 4/5 (Gen 5 is brand new with no reviews) or T14S Gen 5/6 (same for Gen 6) which is 2.8 or 2.9 pounds. Which would you recommend between these two for thermals? What about other Thinkpads? Other Lenovos? Thermals are really the main concern. But I think a weight of above 3.2 also won’t be tolerated for this use case. If you guys manage to help me choose one, thank you very much!",
  "It’s been a while since I have been in the hunt/looking for laptops, but you could check the Lenovo Yoga 9i Gen 8. \n\nIt has a 14” screen, good specs, OLED screen, and, under  moderate load, it doesn’t surpass 32°C (90°F) on the bottom.\n\nHere’s a discussion about the laptop if you want to see what some people that own the laptop have to say:\n\n\n[https://www.reddit.com/r/Lenovo/comments/16nognx/not_sure_if_i_should_buy_a_yoga_9i_any_feedback/](https://www.reddit.com/r/Lenovo/comments/16nognx/not_sure_if_i_should_buy_a_yoga_9i_any_feedback/)\n\nEDIT: Faltas de ortografía, not sure how it was called in english",
  "Wait for new laptop with intel Lunar Lake CPU for Copilot+? And entry level LL laptop price estimate? Hi All,\n\nSo I start an MBA in September and need a new laptop. I’m really interested in a 2 in 1 - either a Lenovo Yoga or a Surface Pro. New to latest developments but my understanding of the current situation regarding AI medium-term future proofing is below. \n\nIn summary - copilot+ / max AI functionally in a computer  needs a new CPU with NPU (Neural processing unit) and 40+ TOPS (Trillions of ops per second).\n\nThe only CPU that provides 40+ TOPS now this is the ARM Snapdragon X 1 elite. No Intel CPUs have this level yet.\n\nARM processor does seem to have compatibility issues with many non-standard apps. Emulation does seem to still cause problems. I may have some apps required for the MBA that aren’t compatible/slow for example (and no mainstream VPNs have ARM chip compatibility…)\n\nIt seems it’s too early to tell if the new ARM chip is any good. It’s only been out a week and limited reviews. Is the pace of app functionality with ARM progressing at a good rate? Also seems unclear how useful copilot+ is at this stage?\n\nWith intel releasing Lunar Lake CPUs probably in September and claiming these will offer 1.4x more TOPS than the current ARM chip plus 20% less power (plus no compatibility issues). It seems sensible to wait for those, but I’m wondering if anyone knows what prices will be like? Entry level ARM X1 elite laptops are around USD1000, do you think will be similar with Lunar Lake CPU laptops? Thanks!\n\n*UPDATE* So in the end I bought a Lenovo Yoga 7 2in1 (Intel Core 7 155h). I am absolutley loving it. 8+ hours battery life on good brightness and hybrid tablet use works so well, more than enough for my needs. From research, I felt all these lunar lake, strix point + snapdragon \"AI\" laptops are 1) a gimmick from an \"AI revolution\" perspective and 2) only \"incremental\" improvements in terms of battery life and power efficiency.  ",
  "Did u end up waiting for the Lunar Lake?",
  "I’m waiting and seeing still. I’m def not getting ARM. The ARM compatibility/modulation issues are too significant for me I think. The latest AMD Ryzen AI-geared chip laptops also look to have almost as good power efficiency, better performance and no compatibility issues so may go for that (the ASUS Zenbook for example). Waiting until early September seems to make sense.",
  "Thinking about what laptop to get as an Engineering Student. Im deciding between electrical/computer/mechanical engineering so i will need a decent amount of power. I also want good battery life and build quality for less than 2000 Canadian and preferably less but I'm willing to go up to 2000 if it Is really worth it.\n\n  \nThis is the main laptop I'm thinking of right now and I'm wondering if you have any better picks. I would also be good with 2 in 1s but idk if they're worth it.\n\nhttps://preview.redd.it/hmz24g58a36d1.png?width=1757&format=png&auto=webp&s=2b3224158a6bcae14b02845ae9d376cf3745efc4\n\n",
  "Better buy refurbished thinkpad x1 extreme, it would be a bit cheaper but it will have dedicated graphics",
  "new laptop suggestions currently have a xps plus 13 (9320) but the trackpad and battery life suck. looking at a lenovo thinkpad x1 (gen 11) but am open to suggestions. would like something with a better battery, equivelent or better RAM, dont need anymore memory, dont want touch screen but thats not a deal breaker, and would like to keep weight in the same ballpark as my XPS plus but a slightly bigger screen would be nice. also something i could customize or upgrade like the framework laptops interests me, i dont love how everything is soldered to the board on my XPS.\n\ncurrent laptop: [https://www.amazon.com/Dell-9320-Touchscreen-Notebook-Board/dp/B0BBGTT1R3](https://www.amazon.com/Dell-9320-Touchscreen-Notebook-Board/dp/B0BBGTT1R3)\n\nthe x1 im looking at: [https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-11-(14-inch-intel)/21hm002fus](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-11-(14-inch-intel)/21hm002fus) \n\nframework laptops:  [https://frame.work/products/laptop16-diy-amd-7040](https://frame.work/products/laptop16-diy-amd-7040) ",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Dell XPS 13 Plus 9320 13.4\" Touchscreen Notebook - Full HD Plus - 1920 x 1200 - Intel Core i7 12th Gen i7-1260P Dodeca-core (12 Core) - Intel Evo Platform - 16 GB Total RAM - 16 GB On-Board Memory - \n\n>**Company**: Visit the Dell Store\n\n>**Amazon Product Rating**: 2.9 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 2.9\n\n>**Analysis Performed at**: 02-02-2024 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/dell-xps-13-plus-9320-13-4-touchscreen-notebook-full-hd-plus-1920-x-1200-intel-core-i7-12th-gen-i7-1260p-dodeca-core-12-core-intel-evo-platform-16-gb-total-ram-16-gb-on-board-memory) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "OH, you poor soul.  STuck with a P series CPU.  No wonder you hate the thing.\n\nThat X1C would be a massive upgrade for you, and you wouldn't have to worry about frying your skin when you touch your laptop because you had a camping stove for a CPU.\n\nI think the Framework 13 would be more in your wheelhouse given you seem to like smaller laptops.  But while they're nice laptops, they're not shipping right away when you order them (most of them, anyway), and they're definitely pricey.",
  "I dont know what yoy are exactly looking for but if you can wait I would recommend you do. A lot of laptops will be released in Q2 and almost all of them will have way better battery life. 14 inch screens are the way to go for me at least for a laptop. The new ASUS zephyrus line is amazing even though you didn't mention anything about a GPU but they are just amazing laptops overall.\nI would recommend looking Linus Tech Tips and Dave2D's videos about the new laptops and chipsets. There are a looot of laptops coming out.",
  "Hi, I’m Vetted AI Bot! I researched the **Dell XPS 13 Plus 9320 13 4 Touchscreen Notebook Full HD Plus 1920 x 1200 Intel Core i7 12th Gen i7 1260P Dodeca core 12 Core Intel Evo Platform Total RAM 16 GB On Board Memory**  and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Gorgeous display with deep contrast and accurate colors (backed by 2 comments)\n* Decent keyboard layout with wide keys (backed by 1 comment)\n* Precise and hidden trackpad (backed by 1 comment)\n\n**Users disliked:**\n* Poor camera performance and booting issues (backed by 1 comment)\n* Limited ports and power issues (backed by 1 comment)\n* Inaccurate cpu speed specification (backed by 1 comment)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/joqd89c/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](http://vetted.ai/reddit)",
  "Laptop Purchasing Guide & Q+A - Holiday 2019 Edition! Hey there, r/laptops!\n\nTo preface, I am a laptop refurbisher that has poured several hundred hours into working on (repasting, liquid metalling, undervolting CPU/GPU, upgrading panels/storage/Wi-Fi cards, etc.) several dozens of different laptop models over the last \\~18 months, which include some of the following:\n\n* GIGABYTE Aero 15X\n* Razer Blade 14 & 15\n* Many Dell Latitude and Inspiron variants\n* XPS 13 & 15 Variants\n* HP Elitebooks\n* Various Thinkpad variants\n* Various Alienware variants\n* Surface Book 2 13.5\" and 15\"\n* MacBook Pro 13\"/15\" (2013-2015 variants)\n* Acer Helios 300\n* Acer Nitro 5\n\nThe list goes on, but I think this list covers the majority of laptops that are being purchased regularly in the past few months, secondhand or otherwise.\n\nI wanted to spread some of the knowledge I've accrued over the last year and try to help people that may be hunting for a new laptop this Black Friday/Holiday or looking for one as a gift for a loved one/friend/family member.\n\nI'm going to keep the guide itself short and sweet, and provide my recommendations for each \"genre\" of laptop I can think of, with some light rationale behind my choices.\n\n**Best \"Jack-Of-All-Trades\" Laptop (Including gaming):**\n\nGoing to have to go with the Aero 15 variant from GIGABYTE on this one. It has the same footprint as the XPS 15, which is already quite compact, while sporting some powerful GPUs and color-calibrated 144Hz or 4K panels. It also rocks a 94WHr battery, making it an amazing productivity machine whilst on the go thanks to Optimus. Many of their units have went on sale on Amazon in the last few weeks, including the 1660Ti unit and the RTX 2070 mQ unit, both being awesome choices for gaming and video production/acceleration. **Runner-up choice for me is the Razer Blade 15, but ultimately loses due to a higher price point and smaller battery.**\n\n**Best \"Dedicated Gaming\" Laptop:**\n\nThis one is a no-brainer for me. If portable gaming (at a desk) is the sole purpose of buying a machine, I am going to have to go with the ASUS Zephyrus S, specifically the unit with the keyboard shifted downward to make room for cooling. This machine can be configured all the way up to an RTX 2080, and has pretty much unparalleled cooling capabilities, making it my favorite choice, as many of the other thin/lights struggle with cooling the CPU when its pulling 45W and above. Look at some reviews from BOAT or OwnOrDisown and you'll see exactly how cool this thing runs! **Runner-up choice for me is the 17\" variant of the Lenovo Y740, which had even better thermals than the Zephyrus at a lower decibel rating, at the expense of a \"meh\" build quality and chonky bezels.**\n\n**Best Ultraportable (13-14\") Laptop:**\n\nXPS 13, specifically the 9360 configured with 8th-generation i5s/i7s. The 9370/9380 no longer have a USB-A port, which is super important to have to avoid having to bring a dongle everywhere you go, but still has a USB-C port to charge with. It's still incredibly small, has a great keyboard layout, and amazing screens, like the rest of the XPS lineup. It also still has upgradeable SSDs, unlike the 7390. Not to mention the amazing battery life of the 1080p variant!\n\n**Best Ultrapremium Laptop (No/light gaming):**\n\nFor the money, you can't beat a good deal on a refurbished XPS 15 9570/7590! They are very easy to service, have insane battery life for the FHD AND 4K variants, and offer excellent CPU performance for its size with some undervolting. I know there are some QC issues acknowledged in the Dell subreddit, but that is why I always recommend buying a refurbished unit, which go through more rigorous QA testing than new units do, and also come with a 1y warranty that is upgradeable. **Runner-up choice would be a similarly spec'd Thinkpad X1 Extreme, but is typically more expensive than the XPS and the 1080p screen is only 300 nits, compared to 400 and 500 for the XPS 15. It also has a smaller battery, but does weigh less.**\n\n**Best Hybrid/2-in-1/Artist Laptop:**\n\nAlthough pricey, the Surface Book 2 (with the dGPU base) is absolutely extraordinary for what it can do. It has insane battery life despite its ridiculously bright screen and high DPI, great color accuracy and responsiveness for drawing/content creation, and enough horsepower to get most people through about anything. Of course, you can't really open/service this thing, so plan on buying an extended warranty if possible to protect your investment. Also, it seriously has such an amazing keyboard, it is such a pleasant experience to type on! My only nitpick is that the GPU runs quite hot when under load since the fan curve is super conservative unless you change the power plan to \"Best Performance\". **Runner up would be the XPS 15 9575 with the i7-8705G and Vega M graphics for me, but falls short in battery life and its versatility when compared to the tablet mode of the SB2.**\n\nThat's about all I can type without cramping up for now \\^ \\_ \\^\n\nThus, feel free to comment any questions you may have about any model laptop you've been looking at/comparing against, where to find a good deal on a specific unit, what specs someone may need depending on workflows, anything you may need help with this Holiday season :)",
  "Hey bud, so, looking for a mid tier laptop around the £1000/£1200 mark, I'm happy to play at 1080p, 60fps and not fussed about ray tracing. As much as I've used a PC for long time and can do plenty with them, I'm no PC tech. \nMy desktop rig had an i5 4690k, AMD RX480 8gb, 24gb ram, SSD's and HDD's etc etc, not a super computer either but wanting something with more oomph and some future proofing. \nHad my eye on either a ryzen 7/i5 even an i7, and a 1660ti maybe rtx2060 just for the future proofing thought. Anyway, got these lined up:\n\nASUS ROG Zephyrus G GA502DU 15.6” AMD Ryzen 7 GTX 1660 Ti Gaming Laptop - 512 GB SSD\n\nMSI GL75 9SD-036UK 17.3” Intel® Core™ i7 GTX 1660 Ti Gaming Laptop - 512 GB SSD\n\nHP OMEN 15.6” Intel® Core™ i7 GTX 1660 Ti Gaming Laptop - 512 GB SSD\n\nACER Predator Helios 300 15.6” Intel® Core™ i5 GTX 1660 Ti Gaming Laptop - 1 TB HDD & 256 GB SSD\n\nACER Predator Helios 300 PH317-53 17.3\" Intel® Core™ i7 GTX 1660 Ti Gaming Laptop - 1 TB HDD & 256 GB SSD\n\nLENOVO Legion Y540-15IRH 15.6\" Intel® Core™ i5 GTX 1660 Ti Gaming Laptop - 1 TB HDD & 128 GB SSD\n\n\n\nAt this point I'd literally be rolling a dice on which one to pick, they're all in the same price bracket. \nI also was looking at an ASUS TUF model ryzen 7/rtx2060 16gb ram priced at currently £899 which would be fantastic but with mixed reviews, not so sure. \n\nSomething else I'd like to query is on upgrading laptops should I get one with a small SSD, is it easily swapped for a larger capacity one?\n\nWill mostly be used for gaming, some Photoshop work as well as running music recording programs which my last PC handled fine, so gaming is the priority.",
  "I've just bought s refurbished/2nd hand laptop. I'm quite concerned about privacy and hidden viruses. I'm planning on replacing the hd anyways as it's a HDD not ssd. Is there anything else I can do to make the laptop 100% clean",
  "Any opinion on best 15 inch desktop replacement? I've had a sager with a desktop cpu and 980m for 4 years. i only need to move it once a year but i need it to be 15.6 for that. So i was looking for 15.6inch that are slightly thicker for better thermals and performance. have my eye on GE65 raider since it seems to be the only one that dares to go thicker and is in the $2k range. was comparing it to the 15 inch lenovo 740 and scar 3. any other models you think i should be looking at?",
  "I've been debating between the GS65 15.6\" and the Lenovo Y740 15.6\"! I heard that gs65 may have heating problems and build quality isn't as good, but I live in a relatively cool room at my dorm. The Y740 on the other hand has good cooling but i heard the battery life isn't as good. \n\n**Lenovo Legion Y740 15\" - Iron Grey (from Lenovo website):**\n\n\\-9th Gen Intel® Core™ i7-9750H (2.60GHz, up to 4.50GHz with Turbo Boost, 6 Cores, 12MB Cache)\n\n\\-15.6\" FHD (1920 x 1080) NVIDIA® G-SYNC, 144 Hz, Dolby Vision HDR™ 400, 500 nits\n\n\\-16GB 2666MHz DDR4 (2 x 8GB)\n\n\\-**Hard Drive:** 1TB HDD 7200 RPM\n\n\\-**Second Hard Drive:** 256GB SSD PCIe\n\n\\-**Graphics:** NVIDIA® GeForce® RTX™ 2070 with Max-Q 8 GB\n\n**MSI GS65 Stealth 15\"- Matte Black With Gold Diamond Cut (from BestBuy):**\n\n[https://www.bestbuy.com/site/msi-15-6-gaming-laptop-intel-core-i7-32gb-memory-nvidia-geforce-rtx-2060-512gb-solid-state-drive-matte-black-with-gold-diamond-cut/6343975.p?skuId=6343975](https://www.bestbuy.com/site/msi-15-6-gaming-laptop-intel-core-i7-32gb-memory-nvidia-geforce-rtx-2060-512gb-solid-state-drive-matte-black-with-gold-diamond-cut/6343975.p?skuId=6343975)\n\n\\-9th Gen Intel® Core™ i7-9750H\n\n\\-15.6\", 240Hz\n\n\\-32GB DDR4 Ram\n\n\\-512GB Solid State Drive\n\n\\-**Graphics:** NVIDIA® GeForce® RTX™ 2060\n\nI can get both of them at around the same price ($1399) but I think with student discount on BestBuy I can get it for cheaper?\n\nBestbuy(BF without student discount is 1399)\n\nLenovo website(coupon code+student discount is around $1396.50)\n\nThoughts?",
  "Any thoughts on more general use laptops on a sub-$1000 budget? I'm looking to spend about $850 max. \n\nI'm considering laptops like the HP Envy 13 & the Zenbook UX333FA-DH51 (open to any/all suggestions). \n\nBoth have pretty compelling deals over at Microcenter. \n\n1.  (Refurbished): [HP ENVY 13-ah1025cl](https://www.microcenter.com/product/609745/hp-envy-13-ah1025cl-133-laptop-computer-refurbished---silver) \n2.  (New): [Zenbook UX333FA-DH51](https://www.microcenter.com/product/512768/ZenBook_13_UX333FA-DH51_133_Laptop_Computer_-_Blue;_Intel_Core_i5-8265U_Processor_16GHz;_8GB_LPDDR3_Onboard_RAM;_256GB_Solid_State_Drive;_Intel_UHD_Gr)\n\nI'm looking for a premium productivity laptop for school that can do some light-gaming on the side.  I'm not looking to go beyond Vega8/10 or MX150/250.  Frankly, most of the older games that I'd be interested in playing will likely run with or without a dedicated graphics card.  I'm not looking to spend extensive amounts of time during the semester gaming.  I want something fairly light, with solid build-quality all-around, strong battery life and moderate performance.  Gaming aside I have pretty typical student usage habits; streaming video/audio etc.  \n\nDo you have any suggestions for things to watch out for with refurbished laptops? I've been out of the laptop game for a long time and while the specs are crazy (for a non-gaming laptop) at this price-range I'm also a little leery because it seems too good to be true? I've had my fair share of laptop performance issues with overheating parts, bad cooling, hinges, HDD/MOBOs and I'm really not looking to repeat that sort of thing while I'm in school and focused on taking classes.",
  "Hi! Thanks so much for answering questions. I'm a student just looking for a 15.6 inch laptop for everyday use (browsing, homework, streaming). In Canada at Costco there is a hp envy x360 Ryzen 7, 8 GB RAM, 512gb ssd, comes with the stylus. It is $849.99 Canadian dollars. Is this a good buy? \n\nLink: https://www.costco.ca/hp-envy-x360-15-ds0013ca-2-in-1-laptop%2c-amd-ryzen-7-3700u.product.100521180.html",
  "Hi! Thanks for the info, I’ve been wondering how well the Razer Blade 15 works for you. I have heard that Razer products break or malfunction and I want to know how well it holds up, as in durability and how long you think it will last. Any other information will be helpful, thanks!",
  "What do you think about the Thinkpad series? Specifically the X1 Carbon or X390.",
  "[removed]",
  "Hello Sir, I've [posted](https://old.reddit.com/r/SuggestALaptop/comments/e0ue4f/help_me_get_a_laptop_thatll_last_for_the_next_46/) on r/suggestalaptop already but I'd love it if you could give me some advice. I'm looking to splurge on a laptop that'll last me for the next ~5 years or so. This is my first time buying a laptop; my family used and old Compaq Presario which was new in 2006 when we bought it and we're still using it today! We use a PC for most things but I really do need one for college now. \nI'm looking for a beefy machine that can play games at ~120fps, 1Tb SSD, with a good graphics card (based on what I saw on shopineer, an RTX 2080 seems the way to go). I'm also taking up video editing as a hobby and am planning on doing a post-grad in machine learning as well, so ideally I'd want a powerful GPU (which seems to be taken care of by the RTX 2080) and a powerful CPU as well (Intel i9?). 32 GB RAM (or 64 built-in) is a must as well. I'm also looking at dual-booting with a version of Windows called LTSC, which I hear is reliable and non-bloaty and Ubuntu 16.04. What laptops would you recommend?",
  "Hi, \nThe Yoga c940 seems to have pretty good reviews as a laptop. Was that part of your consideration set or was there anything in particular that made you drop it from the list?",
  "Hi,i need some advice completely new to buying laptops for gaming specifically.im on a budget so console idiot over here.since the black friday sale is coming up i need help with choosing a gaming laptop under 600.im not really picky i just want to play the new games with decent stable fps.",
  "Hi. I am thinking of buying a laptop. \nI have just realised that I am not a gamer anymore. So I think I need more 17 inches than 15. I do a lot of stuff using Excel, hard Internet browsing (50 bookmarks +), beginner at photoshop and that is all I think.\n“Mobility” (17 inches - crazy!) is a matter for me because I am going to use it outside as often as I could. So should I go for i7 9750 or something less efficient. ?\nReliability is one of the most important thing. I hope using my purchase for at least 5 years.",
  "Thanks for this post! Very helpful. I'm interested in the ultra-portable/premium group with touch screen support, at least 16GB RAM and 512GB SSD, decent battery life, with some ports (or minimum thunderbolt for decent docking or eGPU) and deciding between the XPS13 (or 2-in-1), HP Spectre x360, or RBS. All seem to have new updates for late 2019, and I'm currently leaning toward the HP Spectre. Have you had experience with HP Spectre machines and quality or issues? Thoughts on any of HP's \"business\" models that fit in the same niche?",
  "If gaming at a high refresh rate is a priority, I would still go with an Intel H-series 45W CPU, as they have much larger caches and better single-threaded performance than the Ryzen 7 3750H counterpart. I did own that Zephyrus G for about a week, and I actually did like it for its battery life and overall build/footprint.\n\nI would stay away from the ASUS TUF, I haven't heard anything particularly great about that lineup.\n\nI have heard that the newer 1660Ti Helios 300 is a solid $1000-mark gaming laptop, despite it being bulkier/more gamer-y.\n\nThe HP Omen you mentioned has a reputation for poor CPU thermals (even more than its competition), and to be frank I'm not a fan of its design language.\n\nSSDs are typically very easy to upgrade, as long as the motherboard is not inverted like the MSI GS65.\n\nOut of your options, I like the Zephyrus G and the Helios 300 15.6\" variant.\n\nHope I helped!",
  "Fresh install of windows. I wouldn't say it's necessary to go any further than that. An SSD would be a great addition but I wouldn't say it's necessary because the HDD is compromised or anything.",
  "My question to you before I answer is, do you need a socketed desktop CPU in this device? Or would the mobile i7-9750h/i9-9880H\\[K\\] work for you?",
  "I am going start off with that I am not an expert on laptops, but I do own the Legion Laptop with similar specs. (Different GPU, 2060, and just 1 1TB SSD)\n\nThe laptop is pretty good for what I use it for. I have been able to run every game I have wanted so far. The battery life does not matter because it is a gaming laptop. I get about 4 hours before I need to recharge my laptop again. That does not really bother me because I use this as a portable desktop. I never plan to use this near people due to the jet engine sounding fans. \n\nThe battery life for the legion does not matter because it seems it was geared more towards a portable desktop if that makes any sense. I travel with this laptop just fine, but I won't whip it out and start typing a report on the train. It does weigh quite a bit and barely fits into most backpacks. \n\nI hope this makes sense and gives you a rough idea to how I experience the laptop.",
  "Battery life is pretty abysmal on the Y740, but pretty much outperforms the MSI in every other way (thermals, noise levels, etc.) \n\nThe MSI is also lighter, but is nearly impossible to upgrade/maintenance with ease due to the inverted motherboard.\n\nBecause I am so keen on servicing my own laptops and I hate inverted mobos, I'd choose the Lenovo despite its shortcomings.",
  "I'd go with that HP Envy you linked; they are basically the HP Spectre, without the Spectre pricetag, and use mostly the same materials in their build.\n\nAs far was what to watch out for, just make sure all the ports work, there are no dead pixels, and that the thermals under load are acceptable. If all those check out, you should be good to go. \n\nThere really is no way to validate/check if a motherboard is about to die, but you can check the health of a hard drive with CrystalDiskInfo when you purchase a refurb! :) Sometimes there's some leftover manufacturer warranty on those refurbished units as well, check the S/N when you purchase one and see if you get lucky!",
  "I'm not entirely too familiar with the Canadian market for electronics; are they typically just more expensive when compared to the US? Because for $640 USD (which is what it converts to), those are respectable specs for a laptop given its price! :)",
  "I've owned two Razer Blade 15s in the past year, and I found the build quality of the machine to be exceptional, on par with a MacBook Pro. Zero chassis flex anywhere, sturdy hinges, the whole 9 yards. I think the challenges and issues that arise with those machines come from a lot of the heat introduced from the CPU and GPU that gets dissipated to the rest of the machine, particularly the VRMs and the motherboard. If you do a good job with keeping thermals in check, I think the Razer Blade is just as capable in the longevity department as any other brand, bad luck aside.",
  "I LOVE THINKPADS! The X1 Carbon is such a badass machine with an amazing keyboard, and is super lightweight. I had a 7th gen X1C and fell in love with it, wishing I could keep it but couldn't pass up the profits from selling it.",
  "The Precision will have a bigger battery, be slightly lighter/smaller, and probably throttle a bit more under dual (CPU+GPU) loads.\n\nThe P53 will definitely be a better choice for heavier, more consistent loads for rendering/AutoCAD, as long as you don't mind the extra weight of the machine. It has a 90WH battery, too, so its not like it won't last a long time either.\n\nI'd go with the Lenovo in your case.",
  "Any laptop that is thin/light that houses an i9 will throttle, so its often recommended to save the money on the CPU and put it towards the GPU for a gaming laptop, so we should probably stick with an i7-9750H, instead.\n\nHow important is battery life to you? How thick (or thin) can this machine be?",
  "I actually just never have used it or had my hands on one personally, so I don't really know much about it outside what I've read. Thats the only reason :)",
  "Ah mate brilliant, helped a ton! Like I said it would've been a dice roll in the end. Will look at the fund situation when I'm ready to make a purchase, the Zephyrus and the Helios have around £200 difference at the moment and both are equally tempting haha.\nThanks again man.",
  "New SSD with a new install of Windows. All worries of a virus should be crushed by then. :)",
  "i was thinking the mobile i7-9750h would be more than enough and is at reasonable price point currently. also the rtx 2070 mobile and 2070 max Q mobile seem at a good cost to benefit ratio too. was thinking the non max-q 2070 mobile if the thermals are ok.",
  "Thank you!",
  "Thanks for the comment! The last time I had a laptop were like 1st or 2nd gen Intel; so I really want to get something that has solid build quality and will last.  UHD Screens tend to eat up a lot of battery life; I wish MicroCenter had the normal 1080p screen, but it's pretty difficult to find an MX 150/MX 250 with good build quality on a budget! \n\nThe conservative side of me is leaning towards the UX433 or maybe a slightly upgraded Envy via HP.  I don't really need a 4K screen or a touchpad -- they're just really cool as a value proposition.",
  "Hi thanks for the reply! Yes all electronics will be more expensive here. For example a macbook air is $1449 CAD vs $999 USD (approx)\n\nThe Intel i5 version of this laptop is $999 CAD on sale (integrated graphics, 8gb ram, 512gb ssd).",
  "Thanks for the info!",
  "How does it compare to the XPS 13 in your opinion?",
  "No problem :)",
  "Great thanks! So there's no way of storing a virus on the motherboard or ram?",
  "Would the 17\" Lenovo Y740 work for you? The 2080 Max-Q variant can be had for sub-2k when it goes on sale, and performs amazingly well, as the max-fan mode grants the GPU 10 more watts to use under load, and the thermals on my last unit were absolutely fantastic. It benched better than most desktops!",
  "Oh, I would definitely go with the $849 Ryzen version and upgrade it to 16GB of RAM if it isn't soldered then!",
  "X1C has a better keyboard and slightly better thermals under load, but is louder and has a dimmer screen (when comparing FHD to FHD and 1440p from Lenovo to 4k from Dell). It also has slightly worse battery life, if I recall correctly.\n\nXPS 13 definitely has a better screen and is quieter under most loads, and the 1080p variant of it lasts forever on battery, nearly 12 hours in a web surfing test performed by Notebookcheck.\n\nI'm also pretty sure the XPS is cheaper by a few hundred dollars, especially if purchased at the right time from the Dell Outlet.",
  "Not that I am aware of!",
  "Thanks for the detailed response :)",
  "Laptop Recommendation pls Hello, I am looking for a laptop that i can replaced my LG gram 15z90p. I will be using this for working and travelling and it should have the best ram, battery life and specs. If anyone of you have any reco, pls feel free to comment. I would highly appreciate your help. Thank you ",
  "How much is your budget",
  "Lenovo Carbon X1",
  "hello! max $2,500",
  "Well I'd take the macbook pro if that much if the budget. But if you are insist for a windows laptop with good battery life look for Razer Blade or Dell XPS.\n\nEdit: Get the macbook pro M3, 16GB RAM, 1TB SSD and the new M3 chip, costs $2000,  released just 1 day ago. Check reviews and all and decide. Else look for Dell XPS.",
  "2019 Dell XPS 15 7590 vs alternatives. Personal experiences? **======EDIT======**\n\n**Thanks for the advice, all!**\n\n**After researching all of the options here, I went with the MSI Prestige 15 in the end.**\n\nI read up on the MAG 15, and apparently Dave2D's review was a bit optimistic about the thermal profile, and was actually a bit more expensive than the (rather prettier) Prestige. Based on Razer's track record, I didn't figure the Blade 15 hardware would last as long as I wanted. The XPS is looking a bit dated, and moreover that old chassis design hasn't allowed for improved cooling over the years. Thinkpad X1 Extreme seemed really solid, but was much pricier for similar specs. I couldn't find the Acer Concept D models on Amazon, and with so many other options I didn't really research it in earnest.\n\nThe XPS was definitely the book to beat, but [this video](https://www.youtube.com/watch?v=95DSVCvWvxM) from Jarrod'sTech showed a great test of the Comet Lake chip in the 15 against the XPS's 9750H, and the results were favorable, despite it being a low-power chip. \n\nThe MAG 15 and several others run the 9750H as well.Was a little skittish about getting the first laptop to integrate Comet Lake, but I felt better that Comet is the same 14mm architecture that was in the Prestige's predecessor (Amber Lake), and [not a new Gen in that sense](https://youtu.be/1eiI4dxjnVU)... which might make consumers feel a bit cheated, but as long as it's on par with the XPS I'm happy.\n\nThe build quality on the Prestige is surprisingly solid overall, especially for a slim package. Resistance on the hinges is a tad high, but you can still open the screen with one finger- we'll see if they stand the test of time. The trackpad is pleasantly huge, though. Quite smooth, physically and virtually. I'm cautiously optimistic, but again, time will tell.\n\n&#x200B;\n\n**======ORIGINAL POST======**\n\nHi all,\n\nI've been surveying the laptop market off and on for a week now. I'm looking to do some video editing on the go, maybe a bit of gaming, so I want something light and powerful. My old MSI is 5.5 lbs and it's just too chunky to travel with. My budget is around $2000 USD, though I'd prefer closer to $1500. I want it to last for several years, so build quality, ability to add RAM later, and resolvability of common problems is absolutely crucial\n\nThe latest XPS 15 (7590) seems to fit the bill - [link to Amazon.](https://www.amazon.com/Dell-XPS7590-7572SLV-PUS-i7-9750H-DDR4-2666MHz-GeForce/dp/B07T1DTF4F?ref_=ast_sto_dp) Creators on YouTube seem to like this model, but a lot of them don't go into detail about owning it long-term, and they're reviewing a new laptop every month or two. I've heard about miscellaneous problems from this XPS series over the years. **Does anyone have experience, positive or negative, with this particular laptop or its predecessors?**\n\n**Are there other alternatives for a similar price you would vouch for?** Asus Zenbook Pro, Lenovo Thinkpad Carbon, HP Spectre, etc.",
  "What about Acer Concept D models?",
  "[removed]",
  "The XPS series is expensive. The Eluktronics MAG 15 is a very light and powerful all around laptop with good battery life, powerful specs, in a light chassis",
  "Of course you don't get the XPS 7590 long term review. It's just released about 3 months ago, so it doesn't fit the term of long term review. Some reviewer like [Ultrabookreview.com](https://Ultrabookreview.com) actually provide some longer term review (like, 2 weeks of usage), which you can find it [here](https://www.ultrabookreview.com/29145-dell-xps-15-7590-oled-review/). Also, from past post in this subreddit, Dell XPS has problem with Samsung EVO SSD (frequent BSOD, which doesn't happen with SK Hynix SSD), so if you plan on upgrading the SSD, stay clear from Samsung SSD.",
  "MSI has also released content creation laptops under their prestige series. The XPS laptops are notorious for overheating",
  "I got a thinkpad x1 extreme with pretty similar specs with the xps 15 and I am very happy with my purchase. I was thinking of buying the xps 15 at first but the thermal issues are too big imo. I have used my thinkpad for editing with premiere and for some houdini and I am very happy with what I get from rendering times.",
  "msi prestige 15 pretty god lol",
  "asus zenbook pro kinda just has looks, it doesnt have a very bright screen, lenovo thinkpad carbon is a solid choice but i cant deal with that red nipple, and the hp spectre has infamous heating problems everything really has its on problem you shoot for the dell xps 15, its a solid laptop for light gaming expect high temperature, make sure to buy from a seller with great customer service and a good return policy",
  "**Thanks for the advice, all!**\n\n**After researching all of the options here, I went with the MSI Prestige 15 in the end.**\n\nI read up on the MAG 15, and apparently Dave2D's review was a bit optimistic about the thermal profile, and was actually a bit more expensive than the (rather prettier) Prestige. Based on Razer's track record, I didn't figure the Blade 15 hardware would last as long as I wanted. The XPS is looking a bit dated, and moreover that old chassis design hasn't allowed for improved cooling over the years. Thinkpad X1 Extreme seemed really solid, but was much pricier for similar specs. I couldn't find the Acer Concept D models on Amazon, and with so many other options I didn't really research it in earnest. \n\nThe XPS was definitely the book to beat, but [this video](https://www.youtube.com/watch?v=95DSVCvWvxM) from Jarrod'sTech showed a great test of the Comet Lake chip in the 15 against the XPS's 9750H, and the results were favorable, despite it being a low-power chip. The MAG 15 and several others run the 9750H as well.\n\nWas a little skittish about getting the first laptop to integrate Comet Lake, but I felt better that Comet is the same 14mm architecture that was in the Prestige's predecessor (Amber Lake), and [not a new Gen in that sense](https://youtu.be/1eiI4dxjnVU)... which is kind of bad news and might make consumers feel a bit cheated, but as long as it's on par with the XPS I'm happy.\n\nThe build quality on the Prestige is surprisingly solid overall, especially for a slim package. Resistance on the hinges is a tad high, but you can still open the screen with one finger- we'll see if they stand the test of time. The trackpad is pleasantly huge, though. Quite smooth, physically and virtually. I'm cautiously optimistic, but again, time will tell.",
  "there was talk of an xps with a 1650ti in it im not sure if that true i havent checked around sources but if you want good gaming performance and rendering speeds id go for that. im using the xps 15 rn with 8gb ram and a 1050ti and its good for most games (the most demanding ive played is either gta or witcher 3 and i get solid frames) but i also edit as well as do CAD/drawing so it helps since its a 2 in 1.\n\nmost laptops nowadays will last pretty much 5ish years before you want to upgrade to do ancient hardware",
  "Do not get an XPS",
  "Do you have personal experience with that series?",
  "Sounds like you'd recommend. Any issues along the way?",
  "I've never even heard of that brand before, but I'm checking it out on Amazon now. How long have they been around, and do you have daily-driver type personal experience with them?",
  "Fair enough, my wording was poor. What I mean is I haven't seen a long-term review of last year's XPS, the 9570 (e.g. this was used as a daily driver for a year, what hardware/driver problems popped up along the way)",
  "And thanks for the tip about Samsung SSDs, I was planning on doing that upgrade",
  "Highly doubt this is a trend.",
  "I went with the Prestige 15 in the end. Barely unboxed, but it's pretty slick so far",
  "I'm checking those out now. Not finding a ton of info on the latest Prestige lineup - only a couple months old. The specs on paper seem better all around, but the price is significantly lower. Now I'm trying to figure out what the catch is...",
  "Gonna have to give me a little more info than that",
  "I dont have any experience with them, though I wish I did buy the laptop after watching the reviews. Eluktronics has been around for awhile, and make solid laptops. The chassis itself is made my Tongfeng, and is used in many laptops worldwide under different names. I believe this laptop was developed in coordination with Intel itself",
  "Nice mate glad you were able to find something that works for you",
  "The catch is that it is made with cheaper materials and the build quality isn't on the same level. Plus the xps screens are unrivaled.",
  "They are built like shit and have a ton of issues. Not worth the money.",
  "Sounds cheap to me...",
  "Did go with the Prestige in the end. Build quality feels pretty good, and it's a pound lighter. I didn't want the OLED if I did go with the XPS, and I got the Prestige's 4K IPS. Same manufacturer makes both screens, though I do think the XPS has a nicer-looking bezel on its 4K displays.",
  "What was the trouble with yours?\nI've had nothing but good experiences with my 9560. \nThe only drawback is thermal throttling when gaming, but i knew that would be the case before the purchase, because that's not what it's for.",
  "Opened it up to an immediate error screen. On both I had. No matter what I did it would crash 7/10 times I did anything even after a fresh install. The hinge broke after only a few weeks of use on one and the power button broke off of my second. And the plastic “carbon fiber” peeled off the sides. All within a few weeks. Not to mention the thing would basically cook itself in my bag if I left it asleep. MS said that’s just what they do and advised me to completely shut it down before carrying it around. Overall they are just built like complete shit.",
  "Sounds like user error and possibly abuse here. If those were wide spread issues there would be a million threads about it",
  "Nope. Worked in IT for a decade I know how to treat electronics. All of the issues accorded as soon as I got it or within a few weeks even tho the device pretty much just sat at my desk the whole time. And there are a million threads just check out r/Dell and this sub lol. The XPS is widely known to have issues.",
  "Laptop suggestions please...  \n\nMy budget is around 100K, my primary use of a laptop is coding/running heavy CPU and memory intensive applications, with a little bit of gaming on the side... I have grown up with crappy PC's all my life and I count consistent 25-35 FPS as a playable/enjoyable experience... Currently I am using Honor magicbook ryzen 5 3500u... Plus I am gonna be looking at the screen for really long so something which might make that experience a bit better...  \nSo currently I am torn between these laptops, and if you any other suggestions please feel free to add:\n\n1. ROG strix g16 : price 89K, i5 13450hx, rtx 3050, 16 GB DDR5 RAM, 2.5kg...  \nIt ticks a lot of boxes except that I have heard 3050 is a really bad GPU, but it looks so freaking awesome.\n2. Ace predator helios: price 104K, i7 1700hx, rtx 4050, 16 GB DDR5 RAM, 2.6kg...  \nIt is a performance beast and the reviews have been really positive, the only downside being it's weight and it looks like a 10 year old designed it (looks are subjective)... Plus I don't have any idea how good acer's service is in India...\n3. Lenovo LOQ: price 99K, Ryzen 7 7840hs, rtx 4050 16 GB DDR5 RAM, 2.4 kg...  \nThe laptop is awesome but looks boring to me...\n\nSo if you have any other suggestion please feel free to add... or should I just buy anyone laptop out of this list? or should I also be looking at other criteria... Thank you for your time.  \nAll the currency is in rupees... According to me they are kind of fair priced...",
  "Max out a thinkpad, either the T line or X line and see if you like it, there's also the X1 Extreme which should support up to a 3080 IIRC.",
  "Work Laptop: Thinkpad Yoga X1 6th gen or Surface Laptop 5? My work is replacing my 5yo Thinkpad with the option of a newer Thinkpad Yoga X1, or the latest Surface laptop.  Similar specs, with the Lenovo using an 11th gen i7, the Surface the 12th.\nEmotionally I'm leaning towards the Surface, despite the lack of ports.  I can work around that.  But of course every review rates the Lenovo higher.  3:2 vs 16:10, included pen/extra cost.  \nThoughts?",
  "I’m late to seeing this but I just got a SL5 and so far like it a lot. Which did you choose and do you like it?",
  "I've had my 13\" SL5 for a week.  Other than the dongle I carry in my backpack, it's fine!  Also got a dock2 for home.  No regrets, but I'm sure i'd be happy with the X1 too.",
  "Cool! How much ram is on it if you don’t mind me asking?",
  "i7, 16Gb, 512Gb",
  "Best Windows mac alternative for students?? Laptop with incredible battery life - student in need of help\n\n \n\nEngland - maximum spend of £1300 stretching to £1500 with a student discount\n\nNot open to refurbed\n\nPriority is battery life, a laptop that could last from 9-4 with 6hours of sporadic screen on time would be amazing, also something that can multitask well, current laptop with 8gb ram really struggles\n\nNeed something that I can carry around with me, doesn't have to be super thin but a good finish and thin bezels are nice, currently have a really old xps and its about its only redeeming factor\n\nScreen between 14\" and 15.6\", possibly worth going for larger laptop for increased battery life?\n\nNot doing any video editing, just using lots of the windows programs, do some light gaming such as Football manager which my current XPS somehow struggles with, possibly some Fortnite/Minecraft, nothing extreme\n\nHave no specific requests, just looking for a really good all round laptop for a student, would rather find something towards the top of my price range with longevity as supposed to saving money now, would also heavily prefer windows as already used to the ecosystem and not at all in the apple eco system.\n\nhave been looking at laptops such as the new Dell xps 15 and the Lenovo Slim 7 pro 14.5, The AMD version both with 16gb ram - apparently AMD is better for battery life but read some bad reviews of the Lenovo battery life on here. Any help greatly appreciated.",
  "Lenovo ThinkPad ? I have the X1 carbon tenth gen for schools and it lasts the whole day and handles everything I need with no struggles. I even do light gaming too like octopath traveler which it also handles fine. You can get slightly last gen models of the most current one is too expensive they're still great.",
  "Honestly, I doubt you need to spend close to 1300. I've got a Dell Inspiron 5415 Ryzen 7 5700U, 512gb SSD and upgraded to 24gb RAM and it plays esports titles, Minecraft and older games like black ops 2 well and it only cost me £280. \n\nI use mine for productivity, so 8c/16threads and the boost of the 5700u makes it a powerful little machine. Typically I have VMware open with 3/4 different machines running as well as some other pen testing ones and it performs amazingly. Battery life is amazing too, I can stretch it out for a solid 10 hours, maybe more, when doing work. The 14 inch screen isn't large but it's good since its so portable.",
  "Purchase help for coding simulations (Python) and student work Hello all, I'm currently looking for a laptop with a budget of around £1500 give or take that I will be using next year for a job involving coding and simulation models aiming to produce a digital twin. I definitely want a laptop but already have a desktop PC (so I won't be gaming on the laptop)  and can't decide if I want to have a laptop as a dedicated work machine or if I should just get a decent laptop that I can take with me when I feel like it and use my desktop for the majority of the work. I have asked the company about any specific software to check if compatibility would be an issue and I'm awaiting a response. It should also be noted that I will be using this laptop for studying and casual use like consuming content (but this is a minor thing for me) so good battery life and lightweight is desirable.   The laptops on my radar currently are: \n\n* [Refurbished M1 MacBook Pro 14\"](https://www.hoxtonmacs.co.uk/products/refurbished-macbook-pro-14-inch-m1-pro-8-core-space-grey-2021?variant=44131503735100) (possibly main choice though conscious of possible macOS compatibility issues and general personal teething issues)\n* Framework 13\" (would be my ideal choice though I'm conscious of its drawbacks and it might not arrive in time)\n* HP Pavilion 14 Plus\n* MSI Prestige 13 EVO (has a £600 discount)\n* Lenovo ThinkPad X1 Carbon (quite pricey with recommended specifications)\n* HP Spectre x360 14\"\n* HP ENVY x360 13\"\n\nI've watched quite a few reviews and used [Just Josh's spreadsheet](https://docs.google.com/spreadsheets/d/1GnjVQEU-iofL-1CuppklFgbYESPhYWZoHo8J1zSjvHs/edit#gid=0) (though I'm not sure how regularly it gets updated) and I just can't decide as it's quite the investment. I would love to hear your guy's thoughts and how you use your laptop and any other recommendations you might have. Cheers.",
  "Laptop recommendation I will be going on a trip for a year, to work and travel. Currently, I work as a software engineer and I'd like to find some software related job during my travels. At home I have a desktop, which I won't be taking with me on the trip. \n\nI'm looking for a laptop to take with me, on which I can do work (coding), consume media and potentially do a bit of gaming.\n\nMy ideal laptop would look like this:  \nGood battery life (like 9 hours of text editing or general web browsing), performance to compile code quickly when needed, something that looks like a GPU for the occasional gaming (something like a Nvidia XX60 series, the mid range), a higher than 1080p (or 1200p for 16:10 displays) resolution screen that is preferably 16 inch for that extra real estate. I also don't want it to look gamery and have good build quality. Also, large trackpad and centered keyboard (no keypad) are a plus. 32 gigabyte of RAM is preferred since that is handy for coding.\n\nSince I code mostly C# for now, I need a Windows laptop. I have never used MacOS and don't really want to get into that, just because I couldn't find a windows laptop. If C# WPF applications ran on MacOS, I would buy a macbook for sure.   \nI'm used to the Windows ecosystem (if that's even a thing).\n\nNon the less, if it turns out that MacOS is actually very friendly to software development, I should maybe consider a Mac? To be clear, software development to me means coding C, C++, C#, Java, Python... Using the full fledged Visual Studio, or creating apps with Qt Creator. No web related things.\n\n&#x200B;\n\nMy budget is between 2000 and 2500 euro's\n\nI've been browsing the web over the last few weeks and I just can't seem to find the one.  \n\n\nI compiled a list of strong contenders but all of these still seem to have downsides.\n\n* Lenovo ThinkPad X1 Extreme Gen5\n   * (+) Good looking laptop, good build quality\n   * (+) Has a  1600p display, 16 inch\n   * (+) Expandable RAM and storage\n   * (+) 3050Ti\n   * (\\~) High capacity battery (it is sadly Intel exclusive and has worse battery than AMD alternatives)\n   * (-) Around 3k, except for when it's on sale.\n* Lenovo Yoga Pro 9i\n   * (+) Very nice build\n   * (+) 3.2K display, 16 inch\n   * (\\~) Intel processor so good performance but bad battery life, I'd rather give in some of that performance and have way better battery.\n   * (-) The base model only has 16 gigs of non expandable RAM, going for the higher spec (64 GB) bumps the price up to 3.3k euros, which is too much. A 32 GB alternative would be the 7i, but that one doesn't offer a dedicated GPU (it did for a few days but then the option vanished on the website), and it's only a 14 inch display, which would be sub optimal.\n* Lenovo T16 / P16s (same laptop different name from what I could gather)\n   * (-) No option at all for dedicated GPU\n   * (+) Has AMD \n   * (+) Right display\n   * (\\~) trackpad / keyboard setup not what I prefer\n* Lenovo Z16\n   * (+) Looks good\n   * (+) Has AMD \n   * (+) Right display\n   * (+) Can game\n   * (+) Good battery life\n   * (-) Seems to have mixed reviews, for one, it does not have nearly as many reviews as other laptops by the big tech youtube channels. People report that there is a hardware issue with the motherboard or something which makes these laptops shut down and whatever\n* Dell XPS 15\n   * No need for description, everyone knows this. Excellent machine and runs too hot so not really usable then\n* Dell XPS 17 2023\n   * Does not run as hot with the vapour chamber cooling but is above 3k\n* Dell XPS 17 2022\n   * Good price, has everything I need, but since I'm from Belgium, I'm used to typing with an AZERTY layout, and this 2022 model only offers English QWERTYs (the letters are no issue, it's all the special symbols that are in other places that would be a pain to learn. But I could get used to it. It's a compromise non the less)\n* Asus Zephyrus M16 or G16 \n   * Has the stupid gamer lights on the back which I can't unspec. I can leave them off but still there are the perforations for the lights and I just don't need that crap.\n   * Also don't know if I trust the build quality and reliability as much as I would trust a Dell or Lenovo\n   * also uses the barrel connector charging with a huge brick which I really don't need. It's 2023, just use USB C already\n   * Minor issue but the font on the keyboard is stupid imho\n* Asus Flow X16 whatever thing\n   * Has the ribbels on the back which are also not needed at all.\n\n&#x200B;\n\nAll of this just gets me wondering how hard it can be to just design a macbook-like brick that is a square box with a big battery, a lot of slats for ventilation, a bright 1600p screen, centered keyboard, big an haptic glass topped touchpad Windows laptop. I guess the Dell XPS or Lenovo Yoga Pro 9i come the closest but have other issues being either expensive af, and / or run hot.\n\n&#x200B;\n\nI wonder if I'm missing something or if I will have to make some compromises since the perfect laptop doesn't exist."
]