[
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "Yoga 7 (2020) died after 5 years. Worth trying again? Hey everyone,\nI had a Lenovo Yoga 7, bought in 2020, and it unexpectedly died after five years of use. Tech support said it was likely a motherboard issue (possibly the charging port, which is tied to the board), and the cost to repair just didn’t make sense. They also mentioned it was probably a one-off case and that these models usually last longer.\n\nOverall, I had a good experience with it. About a year before it died, I did get a blue screen of death and had to reload Windows to fix it, but it ran fine after that. . . until it didn’t.\n\nNow I’m debating whether to give the Yoga line another shot. I liked the form factor and performance, but I’m hesitant after this sudden failure.\n\nAnyone here using newer Yoga models? How’s the reliability, performance, and build quality lately? Would love to hear your experiences before I decide.",
  "I just don’t really understand majority of the companies start to make their laptops unrepairable now compared before even the charging port can be replaced with no problems, hard drives can be replaced, but now they start to make it not replaceable. If you are looking for laptops i suggest going with the Thinkpad lineups since they are really built well and last for a lot longer. yoga lineups are good but repairability wise not really good or worth it tbh.",
  "No. Try again with a business laptop. At least they last. Yes, even the modern ones. No laptop should die after five years.",
  "Nah, go for think pad instead they last a lot longer. Yoga and Idea Pads can often face build quality issues.",
  "5 years is a good long run for a laptop. Much longer than that and you're going to start needing to do maintenance such as a deep clean and repasting the CPU/GPU. I would say you overall had what sounds like a good experience, so I wouldn't hesitate to do another Yoga.",
  "Yeah, I was pretty disappointed, because at the time I purchased it, it wasn’t a cheap laptop. My previous laptops slowed down over time, or battery life decreased. This one went out with no warning",
  "I was told otherwise by many other users, especially for the level of use. Also, it would be one thing if it slowly started having those maintenance issues you named, but it literally just stopped on me mid use. I appreciate your input and thoughts nonetheless. I believe if I give Lenovo another chance, I’ll do the thinkpad vs the yoga.",
  "Admittedly, I'm out of the consumer game. Back when I was selling and repairing laptops the general rule of thumb was to expect 1 year for every $200 spent. Again, just an estimate, but it's what we'd tell people to do the accounting in their head.\n\nI'm in the business sector now. We only support machines that are under warranty when it comes to hardware. If we can't extend a warranty and your PC has an issue, we sell you a new one.\n\nThinkPads are great. Yoga's aren't bad by any means, but ThinkPads are better built for sure.",
  "[Help] Deciding Between Lenovo Yoga 7 (Ryzen AI 7 350 - Kraken Point) and Yoga 7i (Intel Core Ultra 7 258V - Lunar Lake) – Real-World Multitasking Hi everyone,  \nI'm currently torn between two very similar laptops and I was hoping to get some help based on *real-world multitasking experience*, especially with the Intel model.\n\nThe two devices I'm choosing between are:\n\n* **Lenovo Yoga 7 2-in-1 16\" (AMD Ryzen AI 7 350)**\n* **Lenovo Yoga 7i 2-in-1 16\" (Intel Core Ultra 7 258V)**\n\nBoth have **32GB of RAM**, identical displays, and very similar overall designs.  \nThe main differences are:\n\n* The **Intel version has 2x Thunderbolt 4 ports (40Gbps)**\n* The **AMD version has 2x USB 3.2 Gen 2 (10Gbps)**\n* The **Intel version offers better battery life** from what I’ve seen in reviews\n\nI ended up choosing between these two models because I **need a 2-in-1 with a numeric keypad**, which is important for me. Unfortunately, comparable Asus models don't include the numpad, so these two Lenovos are basically my only options at this level.\n\n# Here's the deal:\n\nI've read all the benchmarks, and I know the AMD Ryzen AI 7 350 generally beats the Intel 258V in multi-core performance. But I'm not sure how that translates to the **kind of multitasking I do**. If the Intel version can handle my workload well enough, I’d prefer it for the ports and better battery life. But if it's going to struggle, I'd be okay with going AMD.\n\n# My typical workload looks like this:\n\n* **3-4 browser windows** open (usually Chrome and Brave), each with **\\~20 tabs**\n* **Excel spreadsheets** for management control (some light, some around 1MB with decent formulas)\n* **Word**, **Discord**, **TradingView** (in browser or desktop app)\n* **NordVPN**, **Bitwarden**, **OneDrive**, **Dropbox**, **Google Drive** running in the background\n* Regular Windows background tasks\n* Occasionally, I’ll have other apps open too\n\nIn the near future, I’d like to start learning Python — partly to replace some of my Excel work (used in my job), and partly as a hobby, to run basic simulations on historical stock data (in this case I suppose I’d mostly use libraries like **pandas** and **numpy**).\n\nI need the system to stay smooth and responsive under that kind of load.\n\n# What I’ve found so far:\n\nFrom what I’ve read, I believe the **AMD AI 7 350** shouldn’t have any trouble handling this workload smoothly.\n\nI’ve read mixed things about the **Intel 258V** — some reviewers say it’s fine with heavy multitasking, others say it struggles under load. I haven’t been able to find many real-life experiences on the Yoga 7i with Intel Lunar Lake. \n\nIf anyone here has tried this system under heavy multitasking and want to share his experience I’d really appreciate it.\n\nThanks in advance!",
  "The Ryzen is quite a bit faster, I'd get that.",
  "I have expertbook P5 258v. I don't have problem having multiple excel and chrome tabs. AMD battery life sucks big time; they are last on almost every battery life benchmark and real world cases vs Intel, Qualcomm and Apple.",
  "The Intel is definitely fine for your use case.",
  "Hey guys, i just got my Yoga 7 Gen10 2 in 1 with AMD Ryzen 7 350 /32GB Ram / 1TB SSD\n\nNow my question is, was that the right coice ? \nI need it for my School with some CAD (smal solidworks things) and some 3D-Slicing\n\nIt feels good Over all, but the battery feels very weak, what are your experiences with it and expecially the battery life",
  "Thanks for your reply! I know AMD is faster, but do you think I will benefit from it in my usage? I'm considering also that Intel's version has Thunderbolt 4 (vs USB 3.2) and better battery life, so if Intel's performance is enough for me I'd take this version..",
  "Thanks! Just curious—do you know from direct experience, or is it just that you understand CPU specs better than I do? 😅",
  "Im looking into it with the same intensions, so not so happy with it? Im worried about the hinges as i dont want them to fail after warranty expires. Also how happy are you with the display, it should have 1100nits which should be insane",
  "I wouldn't care about the Thunderbolt or battery life, but those things are important to you, then maybe get the Intel. They're both good computers.",
  "It is just that none of your tasks are individually heavy (except perhaps Excel?). If anything, my experience as a tab hoarder (300 tabs+) is that most modern CPUs are fine, you just need enough RAM. For example, I used to have a i7 8750H, which is fairly weaker than the 258V, and it used to run absolutely fine even if I was doing heavy dynamical systems numerical simulations in the background (in that case you just have to set core affinities such that you have one core left for the OS otherwise everything does slow down to a crawl). \n\nMy educated guess about the Excel is that you'd know if you needed something more powerful; I doubt most cases will scale beyond needing 4 strong cores + 4 fairly strong cores (258V 4P + 4E cores).\n\nAbout you learning Python, it should also be fine. If you are going to deal with big matrices and linear algebra operations the Ryzen would probably be significantly faster (but it's not like the Intel would be awfully slow).  \n\nI asked ChatGPT to come up with some sort of benchmark related to what you said (which, to be honest, I know nothing about). It seems to be taking a price time-series, calculating some moving averages, standard deviations and correlations and then some calculations based on weighting each stock differently.\n\n\n    import time\n    import numpy as np\n    import pandas as pd\n\n\n\n    def run_simulation(n_stocks=1000, n_days=5000):\n        # Generate synthetic stock price data (log-normal to resemble stock prices)\n        prices = np.random.lognormal(mean=0, sigma=0.01, size=(n_days, n_stocks))\n        df = pd.DataFrame(prices, columns=[f'Stock_{i}' for i in range(n_stocks)])\n\n        # Simulate typical operations\n        start = time.time()\n    \n        # Daily returns\n        returns = df.pct_change().dropna()\n    \n        # 20-day moving average\n        ma_20 = df.rolling(window=20).mean().dropna()\n    \n        # Volatility estimation (std dev over 20 days)\n        volatility = df.rolling(window=20).std().dropna()\n    \n        # Correlation matrix (last 250 days)\n        corr_matrix = returns.tail(250).corr()\n    \n        # Portfolio simulation: mean-variance portfolio\n        mean_returns = returns.mean()\n        cov_matrix = returns.cov()\n        weights = np.random.random(n_stocks)\n        weights /= np.sum(weights)\n        port_return = np.dot(weights, mean_returns)\n        port_volatility = np.sqrt(np.dot(weights.T, np.dot(cov_matrix, weights)))\n    \n        duration = time.time() - start\n        return duration, port_return, port_volatility\n\n\n    run_simulation()\n\n\nThis takes about 600ms on my Ryzen 8845HS independent of the number of threads (I think Pandas is mostly single-threaded while Numpy can use more threads for its operations, but in this case it didn't make any difference). This would probably be about the same performance you'd expect from both the 258V and the 350 in this particular scenario.\n\nOutside numerical stuff, they should all be roughly equivalent, specially since Python doesn't really like multiple threads.",
  "The Display is really Great ! \nThe hinges look kinda good, but to whole screen shakes if u touch it with the pen (or finger) to write somerhing\nThe good thing is, every laptop i tested so far does this (checked with 40+ laptops/convertibles) \n\nMy Screen turned black whenever i pluged or unpluged the power cable, now after a complete reset the laptop is working just fine.\n\nI kinda miss an Ethernet connection \n\nSo far so good, i will keep you updated.\n\nAre you looking for the intel or the amd version ?",
  "Thank you very much for your answer, very comprehensive!!",
  "Sounds like a great info,\n\nThe ryzen looks a lot better, but i would miss the 40gbps thunderbolt. Which could have been there :D\n\nI can live with wifi or some dongle, so the ethernet is not the worst thing.\n\nWell sounds good so far from your standpoint, i was also looking into vivobooks but they are more expensive and have max 500nits of brightness.\n\nYeah, keep me updated if you can :)\n\nEnjoy it!",
  "I've just bought and received the Yoga 2-in-1 with the Ryzen 350, if you have any questions.",
  "Yesterday i tested the battery life \nI opened a Youtube video an let is run on 35% brightness, it lastet 7h (started with 70-\n%) \n\nI realy dont know if thats the right Notebook for my school, imagine i cant charge it ther 😬😬",
  "Thanks, but I received mine two weeks ago — I ended up choosing the version with the Intel 258v. So far, performance seems fine. Maybe we could do some comparisons :)  \nHowever, the Windows taskbar is driving me crazy: I have it set to \"automatically hide,\" but it often stays visible, covering part of the windows. The only way to hide it again is to open and close the Start menu, which is *super* annoying.  \nDo you happen to have the same issue?\n\nP.S. (Initially, when I kept the taskbar always visible, I had a different issue: sometimes the icons wouldn't respond to clicks, and I couldn't switch between open apps. Again, the only fix was opening and closing the Start menu).",
  "would be interested in knowing how you like it so far",
  "I have 10years old gaming laptop that at its prime could do 2-3hours and now the battery is so cooked that its just there for the sake of it.\n\nI can imagine 35% being a lot if the max brightness is 1100.\n\nIn my books these are good numbers, but i am really sceptical about the hinges, i cant justify spending so much money to then get fucked with hinges. Also the thunderbolt could have been there with amd :P\n\nThx for info.\n\nHows the pen, have you used it?\n\nEdit: i can imagine you buying a 100W powerbank to improve the battery life while in school. \n\nIf it would have been a 20000mAh, that could add you about 65Wh which is about 70-80% of the whole battery.",
  "Man, I don't use the laptop too often for anything other than taking notes or just bed time sleep procrastination watching something, so I haven't really noticed that. I gave it a quick test and it seems to be working \"fine\". Fine in the sense that I have this overall feeling that everything in Windows behaves a bit wonky and erratically sometimes, but it has been mostly not too annoying.\n\nMind you that I've done a clean reinstall of the system because I originally was just going to use Linux but unfortunately for now it seems that the system is not well supported by any distro I've tried.",
  "It works fine.\n\nI think the screen is really nice, OLED and all that, as well as 120hz. The keyboard is really nice to type on and performance is all right (I haven't tested too much because for heavier stuff I use my desktop). In regular use it is silent and doesn't heat too much.\n\nNotebookcheck somewhere mentioned the Moiré effect for older models screens and I haven't noticed in this model, so maybe it doesn't suffer from that or maybe I just haven't noticed or came across. In any case I love the screen.\n\nWebcamera is all right but not anything really to write home about (but it is actually usable unlike most other laptops it feels like). Mics I haven't really got a chance to test it properly.\n\nBattery I'd say is all right as well. I am a bit disappointed mainly because it is not much better than what I already had with my old 2018 XPS, but still, I'd say you can get maybe 12h of web browsing, maybe 9-10h of Youtube. Local video watching probably around 12-14h. I believe note taking only I'd be around 15h-ish. \n\nIf you plan to use Linux, I'd say for this system in particular driver support is still a bit messy, specially regarding the WiFi and Bluetooth. Older kernels seem to work better than newer, but still not great. Might be just a case of skill issue, but I couldn't be bothered trying too much. I'll give it a go again later this year. \n\nAnother thing in this case that Windows does better is handling touch and pen. Specially the onscreen keyboard, which in Linux I found that only Ubuntu had a usable experience; however the pen was not well recognized and I couldn't alter pressure settings (it did work, however).\n\nI enjoy taking notes with the pen but it is not perfect. If you orient the PC so that the hinge part is near your body and you wrest your wrist on it, it squeaks a little bit; the flipped orientation is better. Another problem is that for some reason when the pen is tilted the lines are not drawn straight anymore; like you try to draw a diagonal line and it comes out a bit wobbly. I don't know if it is a pen issue (the default one that came with it \"Lenovo® Yoga® Pen\") or with the screen. This is unnoticeable with notetaking but I guess if you are drawing it could be a deal breaker. I actually feel like this is a pen issue and maybe other models work better, because with less tilt this doesn't happen at all (or at least I don't notice).\n\nFor anyone curious, Linux says that the screen pen thingy is called \"wacom hid 5402\".\n\nAnother thing that pisses me off is no USB 4 (even the AMD predecessors have, so like wtf) and the HDMI is gimped (HDMI 2.1 TMDS 6Gbps). It doesn't matter to me but it seems like a such unnecessary cost cut, specially the USBs. Bright side is that both USB-Cs at either side support charging so that is cool.\n\nLet me know if you have further questions.",
  "Ah yes, i guess it could be ok and i just have to try it. \n\nIm not so worried about the hinges to be honest. Thunderbolt is nice to have but i dont really miss it.\n\nThe pen is pretty nice, works great for me. (But it is the first pen i am using so far) \n\nYes the idea with a powerbank was already there but i dunno, thanks for you Feedback!!",
  "thanks a lot for this extensive review, appreciate it!",
  "HP OmniBook vs Lenovo Yoga So, I previously had a 15.6\" 16 GB RAM 512 GB Asus Vivobook Creator Laptop, but it kicked the bucket since I got water on the keyboard. I got a gift card from Best Buy since it got junked out and I'm debating on what laptop to get next. I work from home and use Photoshop and Illustrator on the side (not relevant to work). Nothing too heavy, just basic photo editing and occasional 3D stuff. I also play The Sims here and there with CC. I've got about $720 on the gift card and don't mind spending a little more as long as it's not more than $900 or so hence why I'm looking at mostly open-box laptops. I'm between these three shown in the picture.\n\n[HP OmniBook X Flip 2 in 1 Copilot+ PC 16\" 2K Touch Screen Laptop AMD Ryzen AI 7 24GB Memory 1TB SSD Meteor Silver 16-ar0033dx - Best Buy](https://www.bestbuy.com/site/hp-omnibook-x-flip-2-in-1-copilot-pc-16-2k-touch-screen-laptop-amd-ryzen-ai-7-24gb-memory-1tb-ssd-meteor-silver/6613862.p?skuId=6613862)\n\n[HP OmniBook X Flip 2 in 1 Copilot+ PC 16\" 2K Touch Screen Laptop Intel Core Ultra 7 32GB Memory 2TB SSD Eclipse Gray 16-as0033dx - Open Box - Best Buy](https://www.bestbuy.com/product/hp-omnibook-x-flip-2-in-1-copilot-pc-16-2k-touch-screen-laptop-intel-core-ultra-7-32gb-memory-2tb-ssd-eclipse-gray/6613866/openbox?condition=excellent)\n\n[Lenovo Yoga 7 2 in 1 Copilot+ PC 16\" 2K LCD Touchscreen Laptop AMD Ryzen AI 7 350 16GB Memory 1TB SSD Seashell 83JU0003US - Open Box - Best Buy](https://www.bestbuy.com/product/lenovo-yoga-7-2-in-1-copilot-pc-16-2k-lcd-touchscreen-laptop-amd-ryzen-ai-7-350-16gb-memory-1tb-ssd-seashell/6615767/openbox?condition=excellent)\n\nI heard mixed reviews when it comes to HP, more bad than good. Lenovo more good than bad. I've had a Lenovo before, and it lasted me awhile until it finally kicked the bucket and I never fixed it since I didn't have the money too back then.\n\nAnyone with personal experience with any of them or knowledge on what to recommend?",
  "What did you end up buying?",
  "I’m also curious",
  "I ended up going with the Lenovo. It’s a good laptop, but I don’t like the resolution of the screen as much. Maybe because I had an OLED one on my last laptop 😅 other than that it works fine and runs everything well",
  "HP Omnibook 5 ($800) vs Lenovo - Yoga 7i (750$) Hey guys, need some help. My laptop shit the bed and I had to get a new one, I ended up grabbing the Lenovo Yoga 7i from best buy after watching a lot of reviews.\n\nI haven't had any problems with it so far, but I have been keeping my eyes open while I'm still in the return window. Today I saw this HP on sale at Costco. It seems far better, and I feel like I'm missing something. It has double the ram (32 vs 16), and a 12 core Ultra 7 255U vs the 8 core Core Ultra 7 256V with 8 cores. However, I think the Intel Arc is probably better for graphics than the generic \"Integrated Intel\" on the HP.\n\nThe HP seems almost too good to be true to be so similar but have what seem to be such a better processor vs amount of ram. Please let me know if y'all have any ideas or input!\n\n  \nEdit because I did forget my usage details: I would like to be able to do some light gaming on it. Not consistently, I do have a gaming PC, but maybe basic games while traveling or such. I've been able to play Wrath of the Righteous on the Yoga, and that's been great. I don't plan on running any crazy intensive games. That's the Arc seems like it might be the reason for the pricing confusion?",
  "I think the V series processors are better at performance right since Memory, GPU all are bundled in a single chip ? If you prefer battery longevity, you can go for the U series processors. I have been using the HP omnibook 5 but the AMD AI 7 edition, 16GB variant. It's fine for a college student like me. My opinion is the lenovo Yoga is a better option due to the processor but if you prefer more RAM or battery, omnibook can be a solid option",
  "Does anyone know anything about Lenovo Yoga 7 Gen 9 2-in-1 I was thinking about buying this laptop (all the specs and link below) for Uni. It suits all my needs with perfect display, ram, storage and even the processor is the latest Ryzen 7 8840HS. The only problem is I can't find a lot of reviews online so I am a bit hesitant. This is also my first time buying a laptop. Can anyone help or does anyone own this laptop?\n\n\n\nLenovo Yoga 7 2-in-1 14\" Gen 9\n16/512 GB\nAMD Ryzen 7 8840HS \n83DKCTO1WWSE1\nhttps://www.lenovo.com/se/sv/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7-2-in-1-gen-9-(14-inch-amd)/83dkcto1wwse1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=se:sem:ct8unv&gad_source=1&gclid=CjwKCAjw9cCyBhBzEiwAJTUWNXUrJ5x-w227jxQp2vYnQ71IqP8y5_VG3k3MMfo0Butw24YpmNvpyhoCZbQQAvD_BwE&gclsrc=aw.ds#features",
  "I don't have this laptop but I bought and setup my cousin the previous gen yoga 7i and it looks like a good laptop but I would be a bit hesitant about the amd version solely because for some reason lenovo keeps pairing their amd 2 in 1s with sub par screens and with the current gen 7i also receiving a screen downgrade so I would honestly say get the last gen 7i (the one with the 13th gen intel and oled screen)",
  "How has it been? Im looking at this exact model",
  "I actually just bought this computer for Uni😭really hope its good ill comeback once i receive it this Friday",
  "Ok Thanks. But I think the screen on this one is upgradable to OLED. Also if it's a sub par screen in what ways are they bad as in like would they break easily or?? And I'll check out the last Gen 7i",
  "Just bought this model (Lenovo Yoga 7 2-in-1) when I went in dead set on getting a MacBook. I felt like this was more bang for my buck, they also include Xbox gaming on here, which I am a gamergirl so that's a plus.  Although, upon initial start-up it's seeming like this laptop is kinda slow/buffering? IDK maybe wrong choice of words but definitely have experienced some lagging to where I was like WTF? this is a brand new damn laptop.  I also live outside of the local city, my WIFI is bootycon meaning ABSOLUTE TRASHHHHHH so I am just hoping it's because of that.  I bought this laptop instead of the Macbook for 2 main reasons, the 1TB for roughly $700 & I was spoiled to the touch screen concept. (my other/previous laptop is a lenovo 2-in-1 ideapad? thinkpad? IDK but its a small laptop with google chrome), I needed the upgrade bc my exams are required to be proctored online and google chrome blocks the Guardian browser, which is what they use to proctor), Overall I'm hoping I don't regret this buy.  Any one know how long I have to be able to return for a full refund at bestbuy? \n\n\n\nAlso, if you come across any great pros about this laptop I'm here for it, this thing is apparently capable of alot so I want to reap all of it's benefits.",
  "Lmaoo I found a guy who bought it and was really positive about it...I'll also be buying it once I am back from vacation but lemme know when you get it",
  "Hey man, How is the experience with this PC? any heating / battery issues?",
  "updates?",
  "hey can I get a quick review on it ? performance overall, heating and BATTERY LIFE. How is it?",
  "Screen quality, I ordered one, still havent picked it up, but have heard about it not being very color accurate or bright",
  "hello!! Thinking of buying it, what do u think of it now? I personally also need it for school :) Thanks in advance!",
  "Hmm hopefully its just your wifi, ive read it comes with a lot of bloatware sp maybe that? It does seem the best bang for buck especially for a 2 in 1.",
  "Ciao, anch’io volevo comprare questo modello quindi volevo sapere se ti ha dato problemi fino ad ora. Per il gaming com’è? Poi riguardo al riscaldamento e consumo batteria durante il gaming?",
  "Phew okay what a relief that its a good laptop, it was recommended to me by a best buy employee and yk how they be so i HOPED they where being honest, since I was initially going to get the Microsoft Surface 5. yea ill let yk fs🔥💪🏻",
  "Heyy im back i didnt get the ryzen one but i got the intel one, its a solid computer it can handle games, school work, its not heavy or light its okayy, pretty good for school. I didnt find myself using the folding too much other than for movies. Got any questions? I can prob answer them!!",
  "Yea that's what I also saw somewhere...which screen did you get oled or ips?",
  "[removed]",
  "Hellooo did you buy it?",
  "Yea lol it has amazing specs imo I just wanted some reviews and from that one person it seems to be doing well",
  "hows the battery backup? and heating  \n and do the fans get loud?",
  "how long have you had it for? is there any issues?",
  "Ips, got a really good deal for the specs but idk, might cancel and get a Dell XPS (2022) or M1 Mac air (8gb version)",
  "I personally don't mind the color accuracy, I personally don't edit photos or videos, it's just my work laptop, hell I don't even watch YouTube on it. \n\nSo what are my notes:\nGlass: fingerprint magnet, reflective, makes colors more vibrant\nScreen: too dim for outdoor use, perfect for class/work conditions but not great outside",
  "Looking at this same machine. How did it turn out?",
  "The battery is pretty good depends on what you have it doing obviously but if you are doing homework most of the time you‘ll be good. The fans dont get loud. There is different performance settings when I play games i usually set it high and its not really loud but you could hear it. Its good tbh. Keyboard is fine, screen is good, good computer for a uni student although i recommend you get a mouse just cuz, the pad isn’t bad i just Dont really like pads a lot.",
  "Ive had it for about 7 months",
  "I was thinking about macbook but it's not my thing so imma check out the dell xps as well",
  "[removed]",
  "Love it bro got it like a couple days ago and I am very satisfied",
  "[removed]",
  "Yea it's not mine either but price to performance wise it's a smart buy",
  "Yea fs",
  "[deleted]",
  "Thanks for the response!",
  "Yea it works well i suggest you to buy a type of stylus pen obviously, but yea its works good. Theres prob settings to make it better that I dont know of. But i dont really use it a lot.",
  "[removed]",
  "Hello! Can I ask if you bought it? Im also debating whether I should buy it rn. But a lot of people have been complaining about the battery aswell which I assume you've already seen considering that you're asking about it too lol and how it breaks in just a year or two :') , and how about games too?",
  "They seem fine. Idk about 5-10 years of use but they seem sturdy for now",
  "Lenovo Yoga 7i Vs Lenovo Yoga 9i Hello! I'm buying a new laptop for college and I'm having a hard time deciding between the Yoga 7i and Yoga 9i. For reference I'm majoring in biology so lots of tabs will be open. Primarily I'll be using my laptop for school work and some light gaming like Stardew Valley and Hades.\n\nYoga 7i Specs:\nProcessor: AMD Ryzen AI 350\nGraphics: AMD Radeon 860\nStorage: 1 TB\nRAM: 16 GB\nScreen size: 16\"\nScreen Resolution: 1920 x 1200 \nBrightness: 300 nits\nBattery Life: Up to 15 hours\n\nRelevant pros:\n- Much cheaper than the Yoga 9i at ~$750 USD\n- Larger screen which is nice, but not wholly necessary \n_________________________________________________\nYoga 9i Specs:\nProcessor: Intel Core Ultra 7 Series 1\nGraphics: Intel Arc\nStorage: 1TB\nRAM: 16 GB\nScreen size: 14\"\nScreen Resolution: 2800 x 1800\nBrightness: 400 nits\nBattery Life: Up to 12.5 hours\n\nRelevant pros:\n- Comes cheaper (than other Yoga 9i models) open box at ~$810 USD\n- Smaller, making it more portable for commuting\n- OLED Screen which is nice but not super necessary \n- Comes with a sleeve and slim pen \n\nNgl the sleeve and slim pen are pretty tempting but again not necessary. Both seem to be pretty decent and I really like the design of the Yoga when compared to other Lenovo laptops. There's this whole debate regarding AMD and Intel processors and that's kind of the thing I'm thinking about the most here. Any advice would be appreciated, thanks!",
  "Try to find something thats 32gb ram",
  "Both battery life estimates are false. Companies always put out fake battery life hours. Expect between 5-8 hours in real-world use. \n\nThe Yoga 7 with the AMD chip has a better CPU and more power efficient, but the integrated graphics are slower than that of the Yoga 9. I wouldn't like to have FHD+ resolution on a 16-inch laptop in 2025.\n\nThe Yoga 9 still has a powerful CPU but performs slightly worse than the Yoga 7. It's less power efficient, but the integrated graphics are better, so slightly better gaming performance. On top of that, the OLED screen is big plus along with higher resolution.\n\n\nThe deal with AMD vs. Intel is that the new 8000 series chips have very good power efficiency and way better graphics, but this Yoga 7 has the AI series chip. The integrated graphics are actually less powerful than the Intel one. So it only ticks 1 box, which is power efficiency. \n\nBoth laptops are very nice. It's a decent deal on both. Take Yoga 7 for better battery life. Take the Yoga 9 for ultimately better screen and more portability.",
  "Ideapad Pro 5/5i or Yoga Pro 7 * **Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:**\n\n$1500 AUD, Australia\n\n* **Are you open to refurbs/used?** \n \nWould prefer not to unless it's exceptional\n \n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?** \n\nI would like a decent mix of all of the above, battery life would be important as I'd prefer to be less limited as a student. \n \n* **How important is weight and thinness to you?** \n\n I am flexible but lighter would be better all else equal. \n\n\n* **Do you have a preferred screen size? If indifferent, put N/A.** \n \n 14\" minimum but I'll take anything 15\" or 16\" gladly.\n\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** \n \nCAD yes, video editing/photo editing no, gaming would be nice but if the sacrifice is cost and battery life then probably not worth it for me. I have access to consoles so I can live without for now. \n \n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?** \n \nIf I could play something like Cyberpunk, Ghost of Tsushima on high or greater at 60FPS that would be a dream come true but if it's limiting to a 2/3 hour battery it wouldn't be worth it to me. \n \n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** \n \nReliable build, good keyboard and input devices would be ideal. Couldn't care less about touch screen or finger print reader. \n \n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.** \n\n \nMy original post was going to be (until I discovered the form):\n\nHello, this is my first post so apologies if it's not in the right space. \n\nI'm in Australia and in my second year out of five, studying electrical/engineering and computer science (ai/data science). I know these laptops may be overkill for my coursework but I do need a laptop (desktop isn't really an option, need something portable) and I'm tired of the uni desktops freezing/buffering when I have excel and simulations open simultaneously. \n\nMy budget is ~ $1500 AUD\n\n\nIdeaPad Pro 5i (16\", Gen 9)\nhttps://www.lenovo.com/au/en/p/laptops/ideapad/ideapad-5/ideapad-pro-5i-gen-9-16-inch-intel/83d4cto1wwau3 \n\n- larger 16\" screen but slightly worse quality, still OLED 400 nits 120Hz\n- only has iGPU\n- ram limited at 16GB (soldered)\n- 84Wh battery\n\n\nIdeaPad Pro 5 (14\", Gen 10) AMD\nhttps://www.lenovo.com/au/en/p/laptops/ideapad/ideapad-5/lenovo-ideapad-pro-5-gen-10-14-inch--amd/83jlcto1wwau2#reviews\n\n- 14\" screen but slightly better quality otherwise\n- only has iGPU\n- 24 to 32GB ram possible (soldered)\n- 84Wh battery\n- seems to have the best GPU from what I could compare at:\n https://nanoreview.net/en/cpu-compare/amd-ryzen-ai-7-350-vs-amd-ryzen-7-8845hs\n\nhttps://nanoreview.net/en/cpu-compare/intel-core-ultra-7-155h-vs-amd-ryzen-ai-7-350\n\n\n\nOR \n\n\nYoga Pro 7 (14\", Gen 9) AMD\nhttps://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/yoga-pro-7-gen-9-14-inch-amd/len101y0048?orgRef=https%253A%252F%252Fwww.google.com%252F&srsltid=AfmBOor2vQe8lMrhCPmFBWECp_gW8AePy8qi6_AY96Htxz7K5ict6wT4\n\n- 16GB ram (soldered)\n- RTX 3050 GPU, may be useful for basic ML hopefully in future? or other graphically demanding tasks? \n- 14.5\" IPS screen, 350 nits and 90Hz, 100% sRGB\n- less battery 73Wh\n\nI'm leaning towards the Yoga Pro 7 currently just as I figure the 16GB ram is probably enough and not having or being able to upgrade to having a GPU (except external) may give me issues. But I would love to experience what is might feel like to have the 32GB ram (if at all different). \n\nI'd also like decent battery otherwise I am tempted by options like:\n\nASUS TUF F15, DELL G15, Lenovo LOQ 15IRX9, Acer Nitro V 15. \n\nThank you for any opinions/advice on offer and for alleviating me of any ignorance I may hold. \n\nCheers! \n",
  "Get laptop with recommend spec for CAD. \n\n[https://www.autodesk.com/support/technical/article/caas/sfdcarticles/sfdcarticles/System-requirements-for-AutoCAD-2025-including-Specialized-Toolsets.html](https://www.autodesk.com/support/technical/article/caas/sfdcarticles/sfdcarticles/System-requirements-for-AutoCAD-2025-including-Specialized-Toolsets.html)\n\n[https://www.autodesk.com/support/technical/article/caas/sfdcarticles/sfdcarticles/System-requirements-for-AutoCAD-LT-2025.html](https://www.autodesk.com/support/technical/article/caas/sfdcarticles/sfdcarticles/System-requirements-for-AutoCAD-LT-2025.html)",
  "Thank you, I've had a read. It looks like the 32GB ram may be worth it for CAD.",
  "Anyone using a Lenovo Yoga Slim 7i 9th gen? I recently came across a pretty good deal on Lenovo's website for this laptop.\n\nAs I said, it's a 14\" Yoga Slim 7i with an Intel Core Ultra 7 155H, 16 GB of RAM, 512 GB SSD and integrated Arc graphics for 850 €.\n\nI've watched a few reviews, and it seems like a great option for general laptop use (browsing, basic productivity and media consumption) but also for content creation (I use Adobe apps fairly often).\n\nI was wondering if anyone her has this same laptop and can tell me their real world opinion.  \nThank you!",
  "HP zbook firefly or Lenovo yoga slim 7.. or something else? I need to buy a new laptop because I finally had to update to windows 10  my old HP zbook (Intel i7 4600U - 8Gb ram AMD FirePro M4100) and now it is too slow and I can't use the dedicated gpu anymore because of the drivers. \nI need a laptop for data analysis, heavy multitasking, some CAD and 3d graphing of data.\nI would like a lightweight laptop, with backlit keyboard, preferably 15\" but 14\" is also ok, not glossy... \nSince I liked my old zbook I looked for HP laptops and found this one:\nHP firefly with ryzen 7 PRO 8840HS processor and 16Gb ram (upgradable). \nBut I couldn't find a lot of reviews online. \n\nIn a shop I saw the Lenovo Yoga slim 7. I liked it because it felt quite sturdy compared to the other displayed laptops, and very compact and lightweight.\nI have seen that there is a ryzen version 14\" , and also a 15\" version but only with Intel processors. Unfortunately the ram is soldered, so I don't know if I should go for 32Gb or 16 Gb are enough. \nThey cost approximately the same.  Which one is better? \nOr could I find something less expensive, in the 900-1200 range for example?\nProbably I need more the ram than a fast processor...? \nI think the modern integrated GPUs are better than the old dedicated ones so I don't think I need a dedicated gpu anymore..\n\nThanks\n",
  "For the Firefly, you can also look at reviews for HP Elitebook 845 G11.  Exactly the same machine, the ONLY difference is the BIOS.  Physically identical machines.\n\nI have a Firefly G10 A (7940HS) and an Elitebook 845 G11 (8840U) and I'm impressed with them.  I have the 2.5K 500-nit screen for both, and they're very powerful, INSANELY nice displays, with better than I would have expected battery life given the lcd.",
  "Thank you! This is very good to know.",
  "Lenovo Yoga 7-14 vs Asus Vivobook S14 (insane specs) Hello guys,  \nI'm looking for a new laptop that is light (less than 1.5kg), quiet and has excellent battery life. The machine will be used for study purposes (Data Science Master's Degree) and some software dev in my free time so it has to have relatively good specs. When at home it will be connected to an external monitor (27in/1440p/144Hz).\n\nI've searched in and out every major store in my country (Poland) and came up with these two (I have a massive discount on them {-$630 or -580euro}):  \n\n**Lenovo Yoga 7-14 (standard grey color) $1.1k / 1k Euro** (pre discount)**:** \n\n* Ryzen 7-8840HS (8 cores, 16 threads, 3.30-5.10 GHz, 28 Watt \\[20Watt down - 30 Watt up\\]) with Radeon 780M\n* 16GB RAM (LPDDR5x, 6400 MHz)\n* SSD 512GB\n* 14,0\" glossy OLED 1920 x 1200 (WUXGA) 400 cd/m^(2) , touch screen\n* 1.49 kg\n* 71 Wh battery\n* (reviewers say it's rather quiet under heavy load - 47dB, but I couldn't find a review with this particular CPU)\n\n**Asus Vivobook S14 (silver) $1.3k / 1.18k Euro** (pre discount)**:** \n\n* *Ryzen 7-8845HS* (8 cores, 16 threads, *3.80-5.10 GHz*, *45 Watt \\[35Watt down - 54Watt up\\]*) with Radeon 780M\n* *32GB RAM* (LPDDR5x, 6400 MHz)\n* *SSD 1TB*\n* 14,0\" *matte* *OLED 2880 x 1800 120Hz*  400 cd/m^(2)\n* *1.30 kg*\n* *75 Wh battery*\n* (It has 2 fans, and I found a review where they produced 57dB noise under heavy load, which is a lot. Asus says it produces 37dB on standard load)\n* I'm aware of increased battery drain by stronger CPU and higher res/freq screen, but is it possible to play with the asus' software to reduce the drain a little bit?\n\nFrom what I've seen, Asus reputation is dropping rapidly, because of bad quality and 2 yrs of average lifetime of a laptop before something breaks or it becomes unusable. I'm concerned it would be also the case with this Vivobook and I've seen mixed opinions about it (from glorifying it to absolutely dumping Asus for good).  \nIt is also the most spec-ed up Vivobook I've seen so I suppose it's of similar quality as the Zenbook 14?\n\nI don't really have the budget for the Vivobook but the specs are just perfect so I might turn the blind eye on it and just eat plain bread for a month. \n\nI'm looking forward to seeing what you guys have to say about it. Have you used them? What's your opinion about Asus nowadays? Which one would you recommend for programming?\n\nCheers!",
  "The Asus looks like a much better deal. \n\nNote that for OLED screens, Full HD is way too low a resolution, you will see rainbow coloured pixels at the edge of text. Even the higher-resolution screen on the Asus will have less-clear text than an IPS Full HD panel. It will be better for videos and games, but not for text and studying.",
  "Thanks, I'll keep that in mind. On the other hand, I'm afraid that this 3k resolution on Vivobook will have too small text, icons, taskbar etc. and because of that my eyesight might get worse or my eyes and head would hurt.",
  "Windows resizes everything, so higher resolution screens are always better",
  "Is My New Lenovo Yoga Pro 7 Worth It? Seeking Advice on Battery Life and Performance Hi everyone, I'm just looking for advice on a laptop that I've recently purchased. I bought the Lenovo Yoga Pro 7 on sale for €780 (\\~$850). The laptop is certainly an upgrade from my previous laptop, a Dell Latitude 5410, but I'm worried it's not as good as advertised.\n\nReviews and advertising promised an all-day battery life, with some asserting it was easily over 10 hours. However, in my limited time with the laptop, I have only been able to get 5/6 hours and that's just with some web browsing (job applications, filling forms, etc.), some MS Word, & watching videos and TV. I was wondering if this is the best I would realistically be able to get at this price point, especially since this laptop was on sale for \\~50%. Ideally, I would also use this laptop for some video editing and media stuff so I wouldn't want it to die too quickly.\n\nI've been looking for a 16GB RAM/512GB SSD as the min spec for a laptop, with battery life as a huge factor, as I would like to bring this laptop to college without worrying about needing to charge it. I was initially looking at the ASUS Zenbook and some Macbooks, as they seem to be the best portable performance options with reliable battery life. However, Macs are a bit out of budget, and I haven't really been able to find a Zenbook.\n\nThis laptop does have a 100w adapter and some pretty fast charging, which is good, but I'm wondering if I should go through the return process and look for an alternative, or am I being neurotic and did I get a good bang for my buck considering this is a Windows machine?\n\nI will leave the specs for the laptop below\n\nProcessor: AMD Ryzen™ 7 8845HS Processor (3.80 GHz up to 5.10 GHz)\n\nOperating System: Windows 11 Home 64\n\nGraphic Card: Integrated AMD Radeon™ 780M\n\nMemory: 16 GB LPDDR5X-6400MHz (Soldered)\n\nStorage: 512 GB SSD M.2 2280 PCIe Gen4 TLC\n\nDisplay: 14.5\" 3K (3072 x 1920), IPS, Anti-Glare, Non-Touch, 100%DCI-P3, 400 nits, 120Hz\n\nCamera: 1080p FHD RGB/IR Hybrid with Dual Microphone, E-Shutter\n\nBattery: 4 Cell Li-Polymer 73 Wh",
  "Choosing between a Lenovo Yoga Slim 7 Pro X 14 & Macbook Air M2 So I am shopping around for a laptop due to upcoming travels and I am torn between these two. The specs of each system are as follows:\n\n**Lenovo Yoga Slim 7 Pro X 14**\n\nCPU: AMD Ryzen 9 6900HS CE / 3.3 GHz\n\nRAM: 32 GB (6400Mhz) LPDDR5 SDRAM\n\nHDD: 1 TB SSD M.2 2280 PCIe 4.0 x4 - NVM Express (NVMe)\n\nDisplay: 14.5\" - IPS / 3072 x 1920 (3K) / 120 Hz /400 cd/m²\n\nGPU: NVIDIA GeForce RTX 3050 / 4 GB GDDR6 SDRAM (integrated GPU: AMD Radeon 680M)\n\n[Macbook Air M2](https://www.apple.com/shop/buy-mac/macbook-air/midnight-apple-m2-chip-with-8-core-cpu-and-10-core-gpu-512gb)\n\nThe base version of the more expensive one:\n\n* Apple M2 chip with 8‑core CPU, 10‑core GPU, 16‑core Neural Engine\n* 8GB unified memory\n* 512GB SSD storage\n\nThe price points are roughly the same (buying in Sweden FYI) so it's all down to choosing the rig I want really.I certainly understand that I get \"more\" hardware with the Lenovo option but would like to hear what the better pick would be in your opinion and what you would consider before choosing.\n\nI never owned a laptop before, strictly a desktop guy and I am not looking to replace my desktop. I am happy if I can watch movies (Netflix & downloaded), manage 15+ tabs while browsing and play some lightweight games (like Hearthstone) while traveling, obviously I wouldn't mind playing some more demanding games but it's just a bonus. I don't do any video editing or anything like that. I would use it mostly for the things mentioned and work related tasks which is mostly trading via web browser.\n\nI can not upgrade anything on the Macbook Air version without getting outside of my budget. I would have looked at Macbook pro 14 m1 if I had US prices, alas I do not.\n\nI really like the design/look of the M2 and the fact that it has a long battery life. Since I also handle sensitive data I like that Mac inherently have less malwares going around and being developed to target them (even though that number is steadily increasing). It also feels like less of hassle when on the go, lighter, won't have to always bring a charger if I know I have a full charge when heading somewhere etc. My concern is that 8 gb of ram will be pushing it even for non heavy workload stuff (I heard conflicting things, as a PC user 8gb ram sounds like nothing in 2023 tbh) as well as being shoehorned into not ever doing anything demanding would the need arise (I really can't think of anything myself on the spot though).\n\nThe Lenovo clearly is a stronger machine (not in all, but most areas) and since I am a PC guy it's slightly more intuitive to use (I have a Macbook pro from 2015 and honestly, I never found it very confusing when I used it either). Another positive is that I can simply transfer a lot of the stuff I need from my desktop, mostly a convenience thing though. I have tried my best to find reliable reviews of the Lenovo as specced above but they are rare to find, I am concerned that the battery life would be a disappointment.\n\nI am a Android user so I won't be syncing anything with the Macbook if that is a consideration at all.\n\nAny advice or just ideas that could tip me in either directions would be great. Thanks a bunch!",
  "[deleted]",
  "What did you end up with if you dont mind me asking? Are you happy with the decision?",
  "Thanks a bunch for your input. I think the price is due to Apple being significantly marked up in Sweden and there's no costco/amazon to bail us out either :< The Lenovo is a returned unit so it's marked down about 100 bucks or so which helps as well. I am def. leaning towards the Lenovo at this point.  \n\n\nEdit: I did some research, seems like the Lenovo is on sale for [1099 USD at costco](https://www.costco.com/lenovo-slim-7-pro-x-14.5%22-touchscreen-laptop---amd-ryzen-9-6900hs---geforce-rtx-3050---120hz-3072-x-1920-display---windows-11.product.100976621.html). I wish I had access to US prices lol.",
  "In the end I bought a ROG zephyrus g14 w and Ryzen 6800HS and Radeon gfx. I'm very happy with it, got a lot for the money I spent I feel and it's discreet enough if I turn off the led lights on the lid that I don't mind using it on business trips.\n(I was looking to buy the Lenovo but the one configured as mentioned above had a really long lead time in Sweden, I think it was like 6 weeks, that's why I didn't get that one)",
  "Lenovo Yoga 7 16\" (2023) Review - [ unboxing, benchmarks and more ] ",
  "Lenovo Yoga 7 14 G7 14ARB7: How last the battery? I have bought a Lenovo Yoga 7 (14″, 2022) 14ARB7 , did anyone buy it?  How last the battery ?\n\nThis is my specs: \n\nRyzen 5 6600U\n\nRAM 16 GB DDR5\n\nReview:\n\n [Lenovo Yoga 7 14 G7 review: Multimedia convertible shines with AMD Ryzen 7 6800U - NotebookCheck.net Reviews](https://www.notebookcheck.net/Lenovo-Yoga-7-14-G7-review-Multimedia-convertible-shines-with-AMD-Ryzen-7-6800U.645586.0.html)",
  "Lenovo IdeaPad Slim 7 GTX reviews? I notice that the IdeaPad Slim 7 GTX (with 15.6\" FHD display, 16 GB RAM, discrete GTX 1650 graphics) has recently become [available](https://www.lenovo.com/us/en/laptops/ideapad/ideapad-gaming-laptops/IdeaPad-Slim-7-15IMH05/p/88IPS701407) for purchase in the US on Lenovo's website. However, I can't seem to find any reviews online yet, so I'm wondering if anyone has experience with this laptop or similar models available internationally (i.e., Yoga Slim 7 etc.)? I'm particularly interested in the configuration with the 6-core i7-10750H - specifically re thermals and noise.",
  "[https://laptopmedia.com/review/lenovo-yoga-slim-7-15-review-powerful-ultrabook-for-your-content-creating-needs/](https://laptopmedia.com/review/lenovo-yoga-slim-7-15-review-powerful-ultrabook-for-your-content-creating-needs/)",
  "Same here",
  "Looks pretty slick, IMO.  If only it didn't have the number pad and had a centered track pad I would be all over it.  Instead I'm trying to decide between the Slim 7 14\" i7 or waiting a couple more months to see if we get any better AMD or Tiger Lake options.",
  "Lenovo Yoga 720 15 (4K) Review Hey all. As the titles says, I recently bought the new Lenovo Yoga 720 - the 15 inch, 4k model. Here are my thoughts after about two weeks of us. For the record, I bought this laptop as a replacement for the now old Asus Zenbook Pro, so many of my opinions are based on comparisons with that laptop. There is a quick & and dirty tl;dr at the end.\n\nI bought my model at Best Buy at a discounted rate. It has the following specs. You can find the full list of specs here: http://www.bestbuy.com/site/lenovo-yoga-720-2-in-1-15-6-4k-ultra-hd-touch-screen-laptop-intel-quad-core-i7-16gb-memory-512gb-ssd-platinum-silver/5722755.p?skuId=5722755\n\n4K Touchscreen Display,\n7th generation Kaby Lake Core i7 (2.8 ghz),\nGTX 1050 GPU,\n512 gb PCIE NVMe SSD,\n16 gb DDR4 RAM,\nThunderbolt 3 Port,\nFingerprint Reader for Windows Hello.\n\nBuild Quality: Quite good. It feels very light for a 15 inch laptop, even though it’s only half a pound lighter than the Zenbook Pro. In handling it, I don’t hear any worrying creaks or sounds or anything of that nature. That goes especially for the 360 degree hinge. I was a bit skeptical about how long it would last but, after using it, I think it can go the distance under reasonable strain. Overall, I would rank the build quality above that of the Zenbook Pro, slightly.\n\nKeyboard: Lenovo’s expertise with keyboards shows here. It has pretty good key travel and feels comfortable. It’s a bit of a learning curve for me because my past laptops have included a number pad along with the keyboard (this gives the overall keyboard a pronounced shift to the left). The Yoga 720 doesn’t have a number pad, so the keyboard is centered. Whether that’s a win or a loss is up to you – but I don’t miss the number pad. Keyboard also comes with backlight which has 2 lvls of brightness… to be honest, the two levels are hardly different – still, it’s nice to have. \n\nTrackpad: Also very good. It is very precise and, texture wise, actually reminds me of the Macbook Pro (minus the size, of course). No complaints at all with the trackpad.\n\nDisplay: This is both the laptop’s strongest and one of its weakest aspects. The screen is nice and very sharp – it actually made me look at the Zenbook Pro’s screen (also 4k) with a bit of disappointment. It’s a bit brighter than the Pro (maybe around 300 nits) and is, again, very sharp. I don’t have a colorimeter or a way of measuring color gamut but, to my naked eye, it looks to have better contrast and colors than the Zenbook, and I know that the Zenbook has somewhere North of 100% of sRGB. The XPS-like lack of bezels is also a very nice touch and helps reduce the overall footprint of the machine. \n\nMy opinion on the screen (which is touch, BTW) would be blazingly positive were it not for a long line of black, dead pixels that appeared after maybe 5 or 6 days of use. The line is diagonal and streaks horizontally across the top of the screen. It’s actually not too incredibly distracting as doesn’t stray more than a millimeter away from the edge of the screen. Still, it’s clearly a manufacturing defect. I will talk more about my experience trying to get this rectified later when I discuss warranty issues….\n\nSpeakers: They are okay. Much better than the tinny speakers on the Zenbook Pro, but nothing too incredibly special. Probably good enough to watch movies and certainly good enough to watch videos. I mostly use headphones, anyway. \n\nStorage: Fast AF. ‘Nuff said. \n\nGaming: I’m not a very heavy gamer, but I do play games such as World of Tanks and Armored Warfare, among others. Set at 1080p, it does do a good job of playing those games at medium-high settings. As expected, it does outperform the 960m on the Zenbook Pro, though not by an incredibly wide margin. Don’t expect to play anything at 4k, though. \n\nCooling: Laptop remains remarkably cool under load. In situations (gaming, for example) where I would expect the Zenbook Pro to reach 80 or 90 degrees C with a laptop cooling pad, the Yoga 720 would sit at 65 or lower without a cooler. I can put my hand underneath the grate on the bottom and actually feel cool air coming out. That’s pretty impressive, given how compact it is. \n\nPhoto Editing: I don’t have experience using Photoshop, but I do use Capture NX-D to retouch my photos. Surprisingly enough, the Zenbook Pro actually performed better. The photo previews came up faster and edits were generated quicker on the Zenbook pro. Given that the Yoga 720 has the better CPU, Integrated Graphics, and dGPU, I am assuming this is any issues with drivers and optimization. Regardless, the performance gap is not very big and I have no issue with using the Yoga over the Pro for photo editing.\n\nBattery Life: Admittedly, I am too much of a power-user to ever just sit and use my laptop moderately for long enough to completely run out the battery. That being said, from what un-plugged use I have had, I think you could easily manage 5-6 hours on a charge with keyboard backlight off and brightness set to 60% or lower. Perhaps more if you were really anemic with your usage. Given the fact that it has a 4k display and only a 74 whr battery, that’s pretty impressive.\n\nWifi: It couldn’t be all fun and roses now, could it? I am not sure if I got a bad copy or not, but the wifi capability of this laptop is quite bad. I’ll offer a few real-world examples: in one case, I was staying somewhere where the wifi router was located in a common area, and where I slept was perhaps 25 feet away from that area. While sitting in the common area – perhaps 6 or 7 feet away from the router – the connection was very strong, as expected. No issues here. However, when I moved to my room, the signal would fall out almost completely. It would be almost impossible to get onto the web. The odd part is that I actually still have the Zenbook Pro with me and it connects perfectly fine from the farther location (for the record, it has a the Intel 7265 wireless card). I dare say it connects almost as if it were still only 6 feet from the router, yet the Lenovo just can’t. I’ve downloaded all of the intel and Lenovo updates, but the connection still remains unstable and weak. \n\nI am actually hoping this is a matter of a bad wifi card, because the alternative is that most models of this laptop may have this issues of poor wifi connectivity. It is quite sad, because I find it to be a very good laptop, but this is a borderline deal breaker for me, personally. If you don’t plan on being very far away from your router, though, then this shouldn’t be a (big) problem for you. \n\nQC and Warranty: Regarding warranty, my situation is a bit exceptional. I bought this laptop in the US and, within 3 days, I left the country to travel to Asia (I am still there). After experiencing these QC issues involving the screen and the wifi, I took it to a Lenovo support office out here. I came to find out that, According to Lenovo, there are certain models of the laptop made for western countries, and certain models made for Asia. I had the model made for the west (obviously), and so the Asian centers didn’t have the necessary parts to replace or repair the laptop – either the screen or the wifi. To translate the agent directly, she said something like “this model does not exist in Asia.” My warranty is still very much valid and I can still get it addressed, I just have to do it whenever I return to the states.\n\nOn that note, there was a bit of a disagreement with the wifi. I told them about my experience with both laptops regarding the similar positioning but vastly different connectivity results, but the agent connected to the office’s wifi and connected without a problem. She went on to say that the office router was actually far away, and yet the laptop connected just fine. That being the case, I am not sure what’s going on – whether there is an issue with the router, with my wifi card, or something else…\n\nConclusion: When I first got this laptop, I was eager to find what sort of corners Lenovo cut in order to produce it so cheaply. For the first several days, I simply couldn’t find those corners. The laptop functioned admirably during that time, to the point where I was ready to say that Lenovo had produced a winner. With the QC issues, though, that kind of comes into question. If you can manage to snag a model without these issues, I imagine you will be very happy with your purchase. I know that I would be!\n\nTl;dr: very capable machine. If you can get past some possible QC control issues, Lenovo has a winner here. \n\nOpen to questions/comments 😊\n",
  "Looks like a pretty decent laptop. ",
  "gtx1050 is not a good display card I think. Its too weak conpared with the power of 1060and 1070.1060 is better than 980 while 1070 is better than 980ti. But the 1050 are even weaker than 960. Sick.",
  "Also had this laptop for a bit. The glossy panel is SO reflective. If you have to do any kind of color sensitive or just intensely detailed work anywhere with natural light, get another laptop. (imo)",
  "Just a note concerning the \"dead pixels\"- I have the exact same problem, and having read through some other forums (and finding someone who took the screen apart) it appears that it's actually an internal piece that's come undone. From what I can gather, it only affects the 4K screens. Regardless, on mine it's less noticeable than you'd think: it doesn't even reach the \"x\" in the top-right hand corner of Chrome. That it hasn't gotten any worse since the issue cropped up a couple of weeks ago is also good news- at this level it's hardly an issue (I'm actually more annoyed at the fact that the Thunderbolt port has 2 lanes rather than 4 (it seems like a lot of current laptops are like that, though).",
  "Most 1070 to 980 Ti comparisons aren't clocked at equal limits. The 980 Ti when overclocked actually comes close to or surpasses the 1070. I don't quite remember what their FPS numbers come down to when both are at the absolute limit, but between the 1070 and 980 Ti it's kind of a wash. Well aside from maybe some of the new driver options and optimizations (if any) the 1070 has going for it.",
  "Yes. you are right.  Im only to show my disappointment to 1050. Actually 1070 always have the same performance with 980ti and when they are both unlocked 980ti will be a little bit stronger. Same for 980 and 1060. I suppose that 1050 are equal to970 or only weaker a little bit, but the reallity is that its even weaker than 960. WHAT A PITY！",
  "Lenovo vs HP for multitasking I’m starting a new job soon and am having trouble picking between these two laptops. My job (attorney) involves heavy multitasking and multiple monitors (3-4). I’m looking at these two laptops below and would appreciate some advice. I’m looking at Best Buy specifically. My firm is paying but I want to be respectful of cost. I’d also be open to any suggestions for monitors in the 100-200 range. \n\nhttps://www.bestbuy.com/product/lenovo-yoga-7i-2-in-1-16-2k-touchscreen-laptop-intel-core-ultra-7-155u-with-16gb-memory-1tb-ssd-storm-grey/JJGYCX6PWR\n\nPros: Lots of Positive Reviews, Lenovo is a trustworthy brand, good specs\n\nCons: I won’t be using the 2 in 1 feature, several reviews mention the screen having a lot of glare for when I use it without a monitor or as an additional screen.\n\nhttps://www.bestbuy.com/product/hp-17-3-full-hd-laptop-intel-core-i7-16gb-memory-1tb-ssd-natural-silver/JJGH2YK4ZP\n\nPros: Anti Glare Screen, good specs, large screen when I use without monitor. \n\nCons: HP as a brand is a bit of hit and miss in my experience. \n\nEdit: I’ve looked at the thinkpads as well but unfortunately all of the Best Buy’s near me don’t have them in stock and I’m on a bit of a time crunch. I’m going through BB because I have their premium membership which includes free geek squad repair/support. \n\nDoes anyone have any advice on Dell? I’ve used the latitude 3520 for the past three years through my old job and it’s worked well. \n\nEdit 2: Any thoughts on this Dell Laptop?\n\nhttps://www.bestbuy.com/product/dell-15-6-2k-touchscreen-laptop-intel-core-i7-1355u-2023-16gb-memory-1tb-storage-carbon-black/J3K4L6J6ST",
  "Never buy any hp essential series (no name)",
  "Get a Lenovo Thinkpad T or P series with 32gb ram  and their docking station.",
  "Ditch the consumer-grade laptop, a man of your stature should get a business-grade laptop. I'm talking about thinkpad.\n\nWhy? While consumer-grade laptop would be usable for 2-3 years, business-grade laptop are good investment for 5 years. And, on-site support.\n\nTry looking for thinkpad T14 series or X1 carbon.\n\nPerhaps P14s with a dock for monitor is a great option for you.",
  "Yoga , absolutely not , it will not last long. Look into a Lenovo Thinkpad T series , it will last your YEARS , upgrade comparability, durability,  portability if you invest in T14. I can’t stress enough how overpowered this laptop is.",
  "I also work in law and will tell you a little secret: people in the upper echelons of this field only use Lenovo",
  "If you aren’t gonna use the 2-in-1 feature, why not just get a Lenovo Thinkpad? Not sure that Best Buy’s deals on them are that great atm but they’re great for work and very durable. Between these two you listed I’d get the lenovo 100% especially at that price, but you can get a thinkpad for like $900 with 32gb ram",
  "Get the X1 carbon  gen 13 aura edition \n\nOr the t14s gen 6 Intel \n\n\nGood battery life, light, good build",
  "Of those two, its the Lenovo. [A fuller choice here. ](https://smbtech.au/features/best-laptop/)",
  "So I went on to take a look at the BB site for offerings and it is...abysmal. \n\nNothing decent at that price point besides 2-in-1s that are *meh* at best. \n\nPersonally I'd suggest getting whatever is inside of your price point and has a good warranty. Both Lenovo and HP in the \"lower\" tiers will have some issues/ failures so brand loyalty won't get you far.\n\nIf you can, consider springing for an ARM laptop (unless some software doesn't allow for it) as they're usually far more superior battery wise. Otherwise; choose for specs/ ports and price/ dimensions (carrying around a 17 inch is not as easy if you'll be out and about)\n\nDon't go below 16GB RAM, pick any modern CPU and...good luck.",
  "Never buy a HP laptop is my experience",
  "I'm also a lawyer, but when I think of 3-4 monitor set ups, I think of financial applications and bloomberg terminals. If your employer is restricting you to a single PC (as opposed to a desktop and a companion tablet/laptop), I recommend you get *any* Lenovo Thinkpad L or T series or literally any HP Elitebook. (HP's Elite line has the same reliability and long term support as the Thinkpads). 16 gb RAM will be enough. Unless you expect to be dealing with video files (I regularly get 100's of gbs of body camera footage to analyze each month), 512gb storage should be enough. \n\nYou will want an external blu-ray burner so you can archive/back-up your files and for sharing discovery with outside counsel. As far as monitors, I suggest you get a single 32\" or larger display. If you somehow need more screen real estate, you can leave the screen open on the PC when it's docked.\n\nAs far as a dock, get a Thunderbolt dock, so you have a single cable going into your laptop that includes power.\n\nSince you're buying this for firm work, have the firm just spec and order it from HP or Lenovo. That way you can also get it configured with a 5 year extended support contract that includes on-site support by an HP or Lenovo technician and *accidental* damage protection.",
  "3-4 monitors... I would get a Dynabook. HDMI + 2 type C ports, neither of which are the charger. You can connect 3 monitors while charging it.\n\nIf not that, the Lenovo for sure. Connect a docking station and/or chainlink DP for the monitors.",
  "check this out, lovely laptop - \n\n[https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C](https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C)\n\nAnother pick - \n\n[https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z](https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z)",
  "For Monitors - \n\nFHD 24 inch - [https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252](https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252)\n\nQHD 27 inch - [https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW](https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW)",
  "For multitasking and connecting to multiple monitors, I would be looking into a higher spec machine. Lenovo is a good brand. Make sure you budget another $200 - $300 for a good quality docking station.\n\nBut for your profession and your needs, you should be looking at $1,000+ machines that are geared towards business use.",
  "You're better off buying I used Lenovo T-Series off Craigslist or Facebook or local computer shop. Should be able to find a decent one in the $200 range. You're not really going to need any support on the thing unless someone throws it down the mountain.  I may even have one of those left at home to sell, but I won't be back from my business trip until next week.\n\nFor using three to four monitors with the laptop, you're going to need a thunderbolt docking station. And I would also suggest getting monitors that have DisplayPort Daisy chaining capability.",
  "Dell latitude, Lenovo thinkpad and HP elite book",
  "Are they imposing a price limit?\n\nYou don't need to go crazy but you shouldn't be getting cheap junk for something you're going to rely on every day for work.\n\nI'll leave aside any commentary on how insane it is that a law firm would be okay with client materials being on random PCs (well, I guess I won't, but that's nuts).",
  "this is the only answer",
  "Which one's better?",
  "I second this, also Thinkpads last way more than 5 years",
  "think pads are in there own category.",
  "Which T14 though my issue is that each laptop line has so many variants??",
  "What do you think the chances are that their offerings improve for Black Friday?",
  "Another Option in FHD - [https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G](https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G)",
  "P=Performance. Workstation class. \n\nT is their traditional, main line.",
  "i say that depends on budget , i have a refurbished $200 one that i’m very happy with. \n\nI was planning on getting another $300 G2 version for Linux conversion.",
  "Sorry I haven't got the slightest clue since I am far from the US, was just offering some tidbits in general",
  "Thank you",
  "If I prefer something that's more lightweight, should I go for the X1 instead? I don't care to need to upgrade any of the specs because I'd rather buy a new one in a few years.",
  "I am legit confused what to buy. Please help me out I am college going student so a portable laptop helps me but is it okay to compromise over proccesor for a smaller laptop? And obviously I would get an oled if I don't compromise over proccesor. What would be my potential regrets ??",
  "Getting a worse processor would mean that some programs will likely not run that well or at all and if you have to use apps like blender you should get a laptop with a dedicated graphics card so you can run it better but between the 2 the first one is better",
  "My laptop is small and I love it, the size is ideal, it doesn't weigh much and when you use it you realize that the screen is really good.",
  "Both the Ryzen 7 7000 or 8800 series or Intel ultra core 7 have nice speed and a good iGPU.\n\nScreen is up to. However FHD or 2k is fine if not an art or film major. The cheaper FHD laptops often use less power.\n\nI subscribe to consumer reports. The liked the Yoga 7i as well as Thinkbook or Thinkpad E 16.",
  "This is solid as a comparison item.\n\nhttps://www.bestbuy.com/product/lenovo-thinkpad-e16-gen-2-16-laptop-amd-ryzen-7-with-16gb-memory-512gb-ssd-black/JJGYCC5KVL/sku/6589815?sb_share_source=PDP",
  "No yoga\n\nFrom a yoga730-15 user",
  "Are both of these ship & sold by BB?",
  "Core ultra 7 one better anyday",
  "Just picked up an HP Omni book flip x 14. 24 gigs of ram is quite nice. 32 preferred but for the price it was $700",
  "In this case you don't really \"compromise\", because 14-inch laptop is also 100 usd cheaper than 16-inch laptop. You simply pay less for getting a bit worse CPU and less storage. But for 650 usd, you still get a very good CPU Intel Core Ultra 5 226V (which has similar performance to e.g. Intel Core Ultra 7 255U) and 14-inch OLED display. So for these prices, both laptops seem pretty good deals.",
  "if you do not game, microsoft surface laptop snapdragon cpu will give you best battery life.",
  "I don't have first hand experience with these chips, but from what I understand, the difference between the Ultra 7 (256v) and Ultra 5 (226v) are quite marginal.\n\n\nHowever, once you go OLED, it's hard to go back. The 14\" has the nicer screen; much more color accurate, higher pixel density, and it's more portable for students. In theory, the 226v is meant to have better battery efficiency too, but again, what I've seen online has shown that these are marginal differences. + you can save $100 on it? I pick the 14\" here",
  "go for a 14 inch ideapad pro 5i.",
  "Whyyy? Could you gimme the reasons??",
  "hmm Yeah",
  "I thought to take it 😂.But many have told that it has lots of hinge issues so I am seeing other options. \n\nit has an amd chip right?",
  "Yeah Exactly. I mean ultra 5 is still better than i7 so its better deal. I will buy either of em for sure",
  "hmm, But its arm based and might have some compatibility issues with the softwares I'm gonna use",
  "How much does it cost?? And could you gimme a link?",
  "Yoga was the laptop I used when I was studying at university. I was an AI major student who loved drawing at that time.\n\nIf you want a thin and light laptop, the Yoga is very expensive and its value for money is not good.\n\nIf you are studying a university major that requires the use of engineering software and want a laptop with good performance, the Yoga's performance is not ideal.\n\nIf you want a touch screen for drawing, etc., I would recommend a drawing tablet. But if you are a professional artist, then you can consider buying a yoga, but it still won't be your first need.",
  "Just asked because BB has 3rd party sellers too, and I won't trust them. Ultra core 7 looks great. For $100 more 512GB more storage and core 7 over core 5, worth it. Which gen of core 7 and 5 btw?",
  "Yeah I heard ppl mention it but not specifically about the Omni book, did you?  I had a Lenovo IdeaPad flex and it also has hinge issues but mines been great after 4 years.\n\nYeah and ai 7 350",
  "What software",
  "The Cost may vary. I have a Pro 5i (it cost me about 1k bucks us). \n\nbut here's what u are looking for  \n[https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-14-inch-intel/83krcto1wwus1](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-14-inch-intel/83krcto1wwus1)",
  "yesh but portability is the issue. like 16 inch and 4lbs is not ideal. I mean I could still take it but I am not sure if that's the correct decision",
  "idk yet. But I did hear that there'd be compatibility issues so I can't afford to do a gamble here",
  "Thanks for the advice. But it's out of my budget for the specs I need",
  "16\" is crazy",
  "Unless you are Engineering, or Stem, you won’t have a issue, \n\nBut get Intel ultra copilot pc.",
  "https://ebay.us/m/avuSgP\n\nBuy this and upgrade memory to 32 or max it support",
  "haha ikr 😂",
  "I am doing engineering actually 😅",
  "Windows laptop.  Intel Based. for you.",
  "Looking for a Laptop under $600 anyone have recommendations? I haven’t bought a PC in several years so I know nothing about the market\n\nBest Buy is running some great deals and I included those in the pictures (but I’m open to suggestions to look on other sites)\n\nWhat are some brands you’d recommend and what are some brands I should avoid?\n\nI know I want at least 16 gigs of RAM\n\nStorage doesn’t matter to me\n\nWhat about processers? Intel Core 5 series 2, AMD Ryzen 7 7000, Intel Core 7 series 1, AMD Ryzen 5 7000?\n\nI’m leaning towards the Lenovo or the Samsung\n\nAny other tips, advice, or suggestions would be greatly appreciated!\n\nThanks!",
  "Samsung laptops are generally hard to find parts for when they break. When it comes to memory make sure to check to see if it is upgradable down the road. Many modern laptops solder the memory to the board and don't have any slots for expansion.",
  "Are you looking to game on it?\n\nThis one has a 4050 dedicated GPU and 16GB of ram:\n\n[https://www.walmart.com/ip/HP-Victus-15-6-inch-FHD-144Hz-IPS-Windows-Laptop-Intel-Core-i5-13420H-16GB-RAM-512GB-SSD-Mica-Silver/13987763030?nrtv\\_cid=c9ggkf97thbwg](https://www.walmart.com/ip/HP-Victus-15-6-inch-FHD-144Hz-IPS-Windows-Laptop-Intel-Core-i5-13420H-16GB-RAM-512GB-SSD-Mica-Silver/13987763030?nrtv_cid=c9ggkf97thbwg)\n\n  \nThis one has a better/newer CPU, but no GPU so it'll likely have better battery life: [https://www.walmart.com/ip/HP-Omnibook-5-16-inch-Windows-Laptop-AMD-Ryzen-7-AI-PC-16GB-RAM-512GB-SSD-Glacier-Silver/13943258180?filters=%5B%7B%22intent%22%3A%22retailer%22%2C%22values%22%3A%5B%22Walmart%22%5D%7D%5D&classType=REGULAR&athbdg=L1300&from=/search](https://www.walmart.com/ip/HP-Omnibook-5-16-inch-Windows-Laptop-AMD-Ryzen-7-AI-PC-16GB-RAM-512GB-SSD-Glacier-Silver/13943258180?filters=%5B%7B%22intent%22%3A%22retailer%22%2C%22values%22%3A%5B%22Walmart%22%5D%7D%5D&classType=REGULAR&athbdg=L1300&from=/search)",
  "hp victus",
  "None of them, they're barely repairable, and have terrible quality.",
  "The Lenovo Yoga is a good laptop. If you want good battery life, go with the Amd ryzen 7",
  "MacBook Pro M1",
  "hp victim",
  "I should’ve included that in the post 🤦🏻‍♂️",
  "Thank you for your recommendation, I don’t want to seem ungrateful (I really do appreciate the advice), but no Apple products. I know they’re a superior brand but I’m so comfortable with Window Operating System I’d rather not switch horses midstream so to speak",
  "The only victims are the hinges",
  "Will the ASUS ROG Strix G16 (2025) Handle My Workload ArcGIS Pro + AutoCAD & Tons of Multitasking? I am looking for a laptop to use as a workstation in case I need to provide my own equipment in the future. I am a Design Engineer working with Aerial & Underground fiber optics in the Telecom field. I mainly use ArcGIS Pro & AutoCAD for drafting & designing routes. While I have one of those programs open, I also must have MS Teams, MS Outlook, MS Excel, Adobe Acrobat, Google Earth Pro, 2 to 3 File Explorer folders, plus a web browser running Katapult + Katapult Photo + Katapult Map + Client Engineering Support Platform + Sharepoint + Smartsheet (around 6-7 tabs depending on Google Earth Pro/Google Maps) all running at the same time. I can get away with Google Maps most of the time. Long story short heavy multi tasking processing is a must.\n\nI do not know much about the difference between AMD & Intel processors but from what I have heard AMD excels at multi tasking & Intel is better at running single tasks. Please correct me if any technical information is wrong. Things have evolved a lot since I last purchased a laptop a decade ago for college.\n\nMy current position supplied me a laptop I am very happy with. Here are the specs:\n\nDell Precision 5690\n\nIntel Core Ultra 7 155H (3.80 GHz)\n\n32 GB RAM Speed 7467 MT/s\n\n1 TB SSD\n\n128 MB Intel Arc Graphics\n\n16 inch touchscreen\n\nI have had bad experiences with the Dell I used throughout high school. After having it serviced 7 or 8 times because of the cheap plastic hinge, I replaced it with an all metal Asus in 2017 when I started college. Here are those specs:\n\nASUS Q504UA\n\nIntel Core i5 7200U (2.5 GHz)\n\n12 GB RAM Speed 2133 MHz\n\n1 TB SSD\n\n128 MB Intel HD Graphics 620\n\n15.6 inch touchscreen 2 in 1\n\nEven though I had bad experiences with Dell in the past, this Precision 5690 is really nice. I like the all metal design for the shell & hinges. My only problems with it is that I have yet to see them go on sale and I hate that it only has USB C ports. The XPS goes on sale from time to time but I do not know if that will give me what I need.\n\nAfter doing research the unanimous answer from coworkers, gamer friends, the internet, & even AI was that the bare minimum I need is 32 GB RAM, 1 TB SSD, an AMD Ryzen 7 or 9 / Intel Core Ultra 7 or 9 / Intel Core i7 or i9 processor, & a dedicated graphics card. Preferably I want something that has an extra RAM slot & an extra M.2 slot so that I can upgrade RAM & storage in the future.\n\nI pulled an all nighter last night going through all of the Best Buy Black Friday deals trying to find THE ONE. I narrowed it down to Lenovo, & Asus. I ended up with three options: Lenovo Yoga 9i Pro, Lenovo Legion Pro 5, & the ASUS ROG Strix G16. All three had 16 inch screens but the Yoga got kicked out because it does not have expandable RAM or storage. That left the Legion Pro & Strix G16. I watched a ton of review & comparison videos, checked rtings, & I think I finally did it. I chose the ASUS ROG Strix G16 based on my personal preferences, AMD over Intel processor, & the nail in the coffin was my childhood friend’s recommendation plus his father’s recommendation. They preferred Asus over Lenovo. His fathet owned a Legion Pro, the best Alienware 16 inch, & recently switched to the Strix G16 & loves it. The only difference between my choice & his is that mine has the RTX 5070 while his has the RTX 570Ti, which in my opinion is not worth the extra 800 dollars which is the current difference with the black friday sale favoring mine.\n\nHere are the specs for the winner:\n\nASUS ROG Strix G16\n\nAMD Ryzen 9 9000 9955HX3D (2.5 GHz with boost up to 5.4 GHz)\n\n32 GB DDR5 RAM (5600 MHz)\n\nExtra SO DIMM slot (tool free)\n\n1 TB SSD PCIe 4.0\n\nExtra M.2 slot (PCIe Gen 5 ready)\n\nNVIDIA GeForce RTX 5070 with 8 GB GDDR7\n\n16 inch 2.5K 240 Hz 3 ms Nebula Display\n\nNow here are my questions for you all:\n\n1) Will this do what I need it to do?\n\n2) Do these laptops last or will it brick in a few years?\n\nI plan on babying this laptop if that helps.\n\n3) Is 20% off the best sale I am going to find for a current generation ROG Strix G16?\n\n4) Do I need an external cooling pad or fan? If not needed, would you still recommend one, & if so which one works best with this laptop?\n\nThis is going to be my personal computer that can double as a workstation if I need it. The fact that it is a gaming laptop is a plus for when I finally make the switch from console. I like the fact there are 2 x USB-A 3.2 in addition to the the 2 x UBS-C ports. I do not know if I will ever be a full PC person since I like being able to move around, laptops are my power meets portability. My job tried to give me a computer but I declined as I visit family and a tower is not a realistic option for me to travel with.\n\nI am sure this is probably way too much information & I might be making too big of a deal out of this. This thing will probably do everything I need & more. I just like doing my homework before sinking a grand or more into something. Buying a new car took years & the only reason I finally did it was because squirrels totaled my old one.\n\nThanks for your help guys and gals I really appreciate it!",
  "Honestly, think about if you actually NEED a laptop. With this budget you can build a WAY faster desktop.\n\nPersonally, I'd build an equivalent desktop which would save some cash, sell my current laptop and use that money to buy like a 4050 laptop.\n\nYou'd have a capable workstation at home, and a machine to get you by during the day.\n\nThat's of course if you don't NEED portability at all times. \n\nIf you do, this should be fine. I know a engineer who uses a RTX 2060 laptop for work to this day. And my dad's company (which is for construction), had some similarly powerful workstations a few years ago.\n\n\n\nTldr; This is fine, but if possible get a desktop + a reasonable laptop, for your use-case.",
  "I would say get intel, it had a lot more cores then amd, but in all fairness the laptop should be enough for all of your tasks, 32gb might not be enough so consider upgrading, but i think you should get the laptop",
  "I appreciate your feedback. I actually did think about it. Right now I'm doing well in my position, just was getting worried about the future. I have that ASUS that still works, & a back up Lenovo that was a hand me down to replace the eye sore that was my old Dell. The 2 in 1 ASUS got me through college using AutoCAD, Inventor, ArcGIS, & Solidworks. I don't think I need a new laptop (or desktop), I may have just been giddy at the prospect of getting a deal. I am a sucker for deals & have been known to be impulsive not to miss out on them. The deal is good for 1 more day so I'm going to sleep on it again tonight, but more than likely I may not move forward on it right now. As long as things are going well with work I don't need a personal work station. If I do need it in the future I will have done all this research & it will be an easier ordeal not having to start from scratch. \n\nThank you for your candor!\n\nEdit: I slept on it. I did some more research based on the other person's comment I looked for more comparison videos between the Intel Core Ultra 9 Series 2 U9 275HX & AMD Ryzen 9 9000 Series 9955HX3D on the ROG Strix G16 (2025). Based on that research I've decided to move forward on my purchase but have switched from the AMD to the Intel processor since the Intel model is newer, has an improved chasis,  & has a lot of newly improved features that support more future proofing and quality of life than the older AMD model. \n\nI am not a desktop kind of guy, portability is more important to me than strictly power & perfomance. I understand PC will outperform & be lower cost when compared to laptops. Also having both isn't a realistic option for me, it would be one or the other. My personal preference or bias is laptop > desktop.",
  "I did more research after posting & it looks like you were right. JarrodsTech compared the Intel & AMD versions. The Intel Core Ultra 9 Series 2 U9 275HX model came out ahead of the AMD Ryzen 9 9000 Series 9955HX3D in most cases. It also has easier access to the internals with a pull tab instead of 12 plus screws just to remove the bottom panel. The Intel model supports the next generation PCIe 5 for future proofing on both SSD ports whereas the AMD only supports PCIe 5 on 1 of 2. The Intel version includes 3 USB A ports where as the AMD only has 2 USB A ports. They have the same number of USB C ports but the port speeds are faster on the Intel than on the AMD model. The Intel also has WiFi 7 compared to WiFi 6 on the AMD.\n\nThe Intel model looks better with the 360° RGB, & it runs cooler thanks to the updated vapor chamber design. It also uses liquid metal & cools both the CPU & GPU, while the AMD version only cooled the GPU. The Intel also support facial recognition whereas the AMD does not. The Intel was more energy efficient and has a 29% longer battery life when compared to the AMD.\n\nI really appreciate your comment because it pushed me to dig deeper and helped me make a better informed decision. I was close to skipping a laptop upgrade this year, but based on Jarrod’s testing & how this newer Intel model performs and looks, I have changed my mind & am going to stop by BestBuy after work today to go ahead and place my order!\n\nIn case you wanted to see the comparison video I was talking about here is the link to it. [ASUS Strix G16 (2025) Review - Intel or AMD? Don’t Choose Wrong!](https://youtu.be/Qd-SXvTEjbk?si=wKORVbO8jDhPyMsf)",
  "I just realized in the checkout that the Intel has the RTX 5060 GPU (the 5070 is available but at a +$400 price hike) vs AMD which has the RTX 5070 GPU. The sale price between these 2 is exactly the same at 1,699. I'm thinking about sticking with the Intel because of the new and improved chasis, both M.2 SSD ports being PCIe Gen 5 compatible, improved cooling, ports, wifi, battery life, energy efficiency, and RGB.",
  "Help, not sure which to buy for my nephew. My nephew is getting into 3D printing and has started the modeling process. He also wants to get into gaming. I wanted to get him a great laptop as a gift. I narrowed down my search to these two dont know know which is the better machine.\n\nhttps://www.bestbuy.com/product/dell-plus-copilot-pc-16-2-5k-2-in-1-touchscreen-laptop-intel-core-ultra-9-288v-2024-32gb-memory-1tb-storage-midnight-blue/J3K4L6XFCG/sku/6620390?sb_share_source=PDP&ref=app_pdp&loc=pdp_page\n\nhttps://www.bestbuy.com/product/lenovo-yoga-7-2-in-1-copilot-pc-14-2k-oled-touchscreen-laptop-amd-ryzen-ai-7-350-16gb-memory-1tb-ssd-seashell/JJGSHC5C4H/sku/11277475?sb_share_source=PDP&ref=app_pdp&loc=pdp_page\n\nIm willing to pay $1100 (before tax) if you guys have any other recommendation.\n\nI wanted the laptop to have\n\n32g of ram\n1tb of memory\nTouch screen (since my work laptop has that feature and I think its great to have, it also means the screen is stronger, I think).\n\nThrough Amazon, I also saw this laptop, but reddit and other reviews mentioned an overheating issue.\n\nhttps://a.co/d/5Xe9o6z\n\nAll three laptops \nAre being sold by the store itself, not a 3rd party.\n\nThank you all for your input. ",
  "That Dell would be a great one in my opinion, but check out the HP OmniBook X Flip. You might be able to get a 32gb memory 2TB for $1k right now for Black Friday. I just paid $1150 recently but I love it!",
  "[https://www.bestbuy.com/product/hp-omen-16-2k-144hz-gaming-laptop-intel-core-ultra-7-255h-with-ai-boost-16gb-memory-nvidia-geforce-rtx-5060-1tb-ssd-shadow-black/JJGH2YRCT5](https://www.bestbuy.com/product/hp-omen-16-2k-144hz-gaming-laptop-intel-core-ultra-7-255h-with-ai-boost-16gb-memory-nvidia-geforce-rtx-5060-1tb-ssd-shadow-black/JJGH2YRCT5)\n\nor\n\n[https://www.bestbuy.com/product/asus-tuf-gaming-a16-16-fhd-165hz-gaming-laptop-amd-ryzen-9-32gb-ram-nvidia-geforce-rtx-5070-1tb-ssd-jaegar-gray/JJGGLH8Y2Z/sku/6617666](https://www.bestbuy.com/product/asus-tuf-gaming-a16-16-fhd-165hz-gaming-laptop-amd-ryzen-9-32gb-ram-nvidia-geforce-rtx-5070-1tb-ssd-jaegar-gray/JJGGLH8Y2Z/sku/6617666)\n\nThey don't have touchscreens but gaming laptops rarely do. These two are much better choices for gaming.",
  "Which one I choose I’m a designer and I need a good laptop that can run photoshop, illustrator and indesign.\n\n I don’t know if I buy a 2 in 1, cause then I can also draw but I’m worried about how it will perform long term or a MacBook which I know it will last but then I wouldn’t be able to draw (I tried a Wacom but I tried so much how to use and I couldn’t get used to it) \n\nThey’re $800,00 ish \n",
  "Both laptops are great but it really depends on your needs. For the performance concern with the Lenovo is mostly windows side that's causing the slow downs not the laptop itself",
  "My personal experience, Lenovo's screen is not as accurate, especially for the Yoga line + LCD. It gets worse on battery.\n\nI would consider this a deal-breaker for any professional designer. So MacBook, doesn't even matter if Lenovo have advantages in other areas.",
  "Needs matter. For your needs I’d go with the MacBook. Although I think the Lenovo would have more ability for hardware upgrades if that’s something you’d want.",
  "Lenovo, it's better",
  "Choosing laptop Hi, I am a uni student needs coding and playing games, probably esports game but sometimes AAA. I have searched for some laptops with large screen (>=15\"), portable (probably less than 2.2kg) and wifi 7, including the new processors and a discrete gpu. \n\nThen I have found several laptops with the price I found, all are new and converted to US dollar, price vary by the processor 7 or 9\n\n\\- dell xps 16 9640 core ultra 9 4060: $1300\n\n\\- asus proart p16 4060 ryzen AI 9 $1700\n\n\\- lenovo yoga pro 9i aura edition 5060: $1650\n\n\\- lenovo thinkbook p16 gen 6 core ultra 5060: $1350-1650\n\n\\- lenovo legion 5i gen 10  core ultra 5060: $1300-1400\n\n\\- lenovo legion 7i gen 10 core ultra 5060: $1550- 1650\n\n\\- msi creator a16 AI+ 4060 ryzen AI: \n\n\\- msi stealth 16 AI studio 4060 core ultra 9: $1370\n\n\\- msi summit e16 core ultra 4060: $1650\n\n\\- msi summit A16 AI+ core ultra 4060: $1700\n\n\\- msi prestige 16AI studio core ultra 4060: $1700-1850\n\n\\- dell inspiron 16 plus 7640 core ultra 4060: I have not found one with wifi 7\n\nIf you have used one of these please give me some review about it like the battery the fan noise, GPU (some like the summit e16 has only 55w which may not fully use the 4060),... \n\nAlso, based on the price, with my budget about 1300-1400, which one should I buy, if the laptop worth the price, I would probably raise my budget to $1700-1800\n\nThank you",
  "The thin laptops are going to run hot while playing AAA games due to lack of room for good cooling.\n\nThey will all do well with everything besides the AAA gaming, unless you run lower settings to control the heat and they are all solid laptops.\n\nI have seen a lot of posts about MSI build quality not being great, maybe the business ones are better.",
  "yeah but am looking for a portable laptop as well, I sometimes play AAA games so not that important for cooling",
  "Getting a new laptop through my work at a discounted price, looking for stylus note taking, modelling, gaming and office use. Help me choose \nI'm able to get one of these laptops through my workplace for a somewhat discounted price with a 3 year warranty. My main use case is going to be writing some notes on the device as a tablet with a stylus, lightish gaming, CAD and video editing. Then some general office and Uni work. So Clair Obscur is a game I want to play, some light modelling in blender maybe or autocad, and editing 1080p footage and possibly short 4k video in Da vinci. Any thoughts? May be able to get others a slightly lower cost than standard but curious to see what people think. Thanks.\n\nMSI Summit E16 AI Studio A1VETG-002, 32GB RAM, 1TB, RTX 4050 – price £792\nSKU # 9S7-159621-002\nMSI Summit E16 AI Studio A1VETG-002UK Intel Core Ultra 7 155H Hybrid (2-in-1) 40.6 cm (16\") Touchscreen Quad HD+ 32 GB LPDDR5-SDRAM 1 TB SSD NVIDIA GeForce RTX 4050 Wi-Fi 7 (802.11be) Windows 11 Pro Black\n \nAsus Proart PX13 32GB RAM, 2TB RTX 4070 – price £1604.40\nModel: HN7306WI\nASUS ProArt PX13 OLED HN7306WI 2-in-1 Laptop | 13.3 Inch 3K OLED Touchscreen | AMD Ryzen AI 9 HX 370 | NVIDIA GeForce RTX 4070 | 32GB RAM | 2TB PCIe SSD | Backlit Keyboard | Windows 11 | Stylus Pen : Amazon.co.uk: Computers & Accessories\n \nLenovo Yoga Slim 7i Gen 9 Aura Edition (15\" Intel) – price £943.20 \nPart Number: 83HMCTO1WW\nLenovo Yoga Slim 7i Gen 9 Aura Edition (15″ Intel) | AI-Fueled Creativity | 83HMCTO1WWGB4 | Lenovo UK\n \nLenovo Thinkpad E14 Gen 7 – price £764.40\nPart Number: 21U2CTO1WW\nThinkPad E14 Gen 7 (14 inch Intel) | Next-Gen AI PC for Business | 21U2CTO1WWGB2 | Lenovo UK \n\nAny particular standout? Very tempted by the Proart but not sure if the £800 extra over the MSI is justified for better specs. The Lenovo are more hoping the IGPU will be enough for me, instead being lighter for portability and better battery. Unfortunately can't find many reviews on the MSI, I know the 4050 isn't great but wondering it it'll do for me. Thanks.",
  "Laptop comparison Looking to (finally) upgrade from what some would call an ancient laptop that I got back in 2017 while I was in college. An HP ENVY 2:1 with Intel Core i7-6560U - it worked great back then, but I’ve already had to replace the battery once and the newer one just flopped on me a month or two ago. \n\nSo - there are three I’ve found that I think I would like and need opinions mainly on the first two - all have the same storage and RAM. The available ports are the same except for the Legion which offers a SD card reader while the others just have MicroSD card readers. And yes, I’m aware a RTX 4060 is insanely better than an integrated GPU, but I’m contemplating if the extra $250 up from the Intel Yoga is worth it from a performance standpoint. Otherwise… Intel Yoga or AMD Yoga?\n\nMy needs would be general everyday use, web browsing, light gaming (Valve games FTW), and maybe the occasional PC exclusives that you can’t get for Xbox.\n",
  "If you want to game, the Legion by a mile.",
  "the ryzen 7 isnt bad for light gaming tbh, but it really depends on you budget.",
  "Either get the AMD Yoga or the Legion. AMD will have a better iGPU than Intel, but a 4060 will definitely be better than the iGPU. If you want to play newer games and it’s in your budget, get the Legion.",
  "Between the first 2, go for the amd version. Its a better processor than the base ultra 7\"u\". I also prefer amd processors better than the ultra series 1 processors. Just make sure if they both come with the pen, cause I know 1 amd model doesnt come with it. For the legion, I would personally get that one, its the perfect graphics card for value in a laptop imo and it comes with 32gb. Youre not going to need 32gb but its nice to have especially since the yogas cant be upgraded. Just keep in mind that it is significantly heavier than the yogas and will take more space as well. \n\nEdit: the legion is a i7 14th gen hx processor, way better than any of the yogas. It would be an overkill for basic use but it can run pretty much any program, software and 99% games on high settings.",
  "I just got the yoga 7i with that same Ryzen but instead it was the 14inch and it's amazing. No problems so far and plenty powerful enough. I have even done so light gaming on it just to see",
  "Following the consensus, I would go with the AMD Yoga.\n\nBy Valve Games, I assume DOTA and CS (with possibly some Half Life thrown into the mix). The iGPU would be more than capable of handling those titles. \n\nAlso to consider: does battery life matter to you? The Legion would have significantly less battery life than either of the Yogas. I think Intel would have batter battery life than the AMD model. \n\nBased on your post, it looks like Xbox is your preferred gaming medium, so while the Legion would be more powerful but the extra cost might not be worth it to you.",
  "Tossup additional question, just because I’m curious:\n\nMy work laptop is a Dell Latitude 5520, with an Intel Core i5-1145G7 processor. I’ve used it extensively for CAD software (OpenRoads Designer) and multitasked with typical Microsoft office products and it can support up to 3 additional monitors (2 comfortably). How would these 3 computers match up?",
  "Bro, better wait for new legion laptop's with RTX 50s series.",
  "Brother you can get a hp envy with rtx 4060 for 1200 dollars and that was when 4060 was lastest gen",
  "For gaming the Lenovo legion, for 3d modeling, rendering, etc the first one",
  "There are better choices for your use case. You should look at an Intel Core Ultra (1 Series) H CPU (not the U chips you found), or even better Ultra 2 Series CPU. These come with Intel Arc 8/140V iGPU that have better performance than the AMD Radeon 780M/880M graphics. They also last longer on battery than the Ryzen 8000 Series. If you need multi-core performance go with Ultra 1 H (Meteor Lake). If you want longer battery times go with Ultra 2 (Lunar Lake). Intel also just announced the multi-core successor to Meteor Lake H CPUs called Arrow Lake H CPUs that should become available in a few months.",
  "Update: went with the AMD yoga! Thank you everyone for your help and advice!",
  "hi",
  "I enjoy gaming but my primary use for this next laptop would be standard home office use, like working on my income tax returns. (I’m def getting old lol)\n\nAs far as budget goes, I could afford the Legion but that’s also extra money that could go towards over 70K in student loans. Likewise, the AMD Yoga would be $350 cheaper than the Intel Yoga but I don’t want to buy solely based on price.\n\nMy biggest question is just between the Intel and AMD processors. I know Intel has more cores but I’ve been told AMD handles multitasking a little better (voice chat + gaming) as far as frame rate and what not. But the most gaming I would do is like Minecraft, TF2, maybe D:BH or Phasmophobia. Not trying to play CoD, that’s what I have my Series X for lmao\n\nEDIT: just found out Phasmophobia is available on Series X for $20. Shoot, I’d rather do that than get a laptop specifically for those types of games that won’t be playing ALL the time like I would my Xbox. (Of course, I find myself with even less time to play video games these days but more Xbox than pc for sure.)",
  "i am not forcing you to buy the amd one, just saying.",
  "The Legion I’m looking at is 16GB, which is $1,300. The 32GB Legion is $2,000 and definitely not trying to spend that much.",
  "How long do you have this? The hinges are okay? ",
  "Battery life would be nice. And yes, all of those games plus TF2 / L4D2 lmao, I know I’m old. \n\nAs far as the intel battery goes, that’s what I’ve heard is those are slightly better but not too noticeable. If the AMD & Intel Yogas are comparable in most which ways aside from GPU, then maybe I should go with the AMD. But will think about it for a couple more days. Thank you for the feedback!",
  "I would love to wait, but April 15th is coming up soon and my HP Envy is currently toast and only runs on adapter power. At times it’s pretty sluggish to even boot up Excel or Microsoft edge.",
  "For this laptop life cycle, I think I’m just gonna steer away from HP… the hinges are kinda sus. \n\nAnd I think I also like having a numeric keypad, not sure if it has that.",
  "What’s the difference between H and U for Intel? I did notice that there was 100 series and 200 series but mostly have only seen the 100 series in retail stores. Trying to not go over $1,000 unless the laptop is worth it for at least a few years no problem.",
  "Phasmophobia will need a good dedicated graphics card. I have had both AMD and Intel systems and could not tell a difference in the voice chat + Gaming. But the GPU will significantly improve the gaming.",
  "the ryzen 7 isnt bad for light gaming tbh, but it really depends on you budget.",
  "The Radeon 780M in the Ryzen based laptop is roughly equivalent to a desktop GTX 1650 in gaming. I'm not sure about Phasmo but it will run the other games with no issue. Intel has made some noticeable improvements in the Igpu space ever since ARC, but they aren't on AMD's level yet.",
  "OP I would suggest the Lenovo Ideapad Pro 5i at B & H for 1099$ as it has a core ultra 9 2K 120hz oled touchscreen, 32 gigs of ram, windows 11 pro and rtx 4050 graphics card as it can play most games well and is also thin and light\n\n [Lenovo 16\" IdeaPad Pro 5i Multi-Touch Laptop](https://search.app/AiggPrUELESjXDxaA)",
  "My bad, just noticed that but even then the legion is upgradeable so if u plan on keeping it 5+ years u can always upgrade the ram if u need to.",
  "I've had it a few weeks now, and the hinges are fine I do wish they were smoother and the main place where it sits didnt wobble as much. With that said I owned a previous generation with similar hinges and they still work fine",
  "Nope this hp envy has a singular long hinge at its actually pretty well built but it doesn't have num pad",
  "The main and most significant improvements from Intel over the last few years are their new (integrated) Arc graphics, followed by greater power/battery efficiency. On the 100 Series (Meteor Lake, Ultra 1 Series, e.g. Ultra 7 155H), the new Arc graphics is only available on the H chips. (U chips still use their old, not so good iGPU.) H chips can draw more power and has more multi-core performance compared to U Series. The newer, late 2024, 200 Series (Lunar Lake, Ultra 2 V chips, e.g. Ultra 7 258V) have an even newer, and even more improved generation Arc 140V GPU (suitable for more demanding (AAA) games on 1080p low settings). They are also more battery efficient, faster in single-core and memory operations, but slower in multi-core (simply has fewer cores). For most people this is a great trade-off because they don't do multi-core compute intensive calculations (e.g. 3D model rendering, heavy code compilation).",
  "Makes sense. CPU / GPU is really the only hangup for me atp. Like I don’t have to have 1 TB of storage but if it means getting a decent processor and graphics card that will last for a long time, I’d rather do that than just settling for a $400-500 “value” laptop",
  "You’re good! I appreciate the feedback!",
  "Ohh, good to know. Thanks :))",
  "Gotcha. Which in my case I don’t really anticipate any heavy 3D modeling or doing coding. At most, I might load up some games or run discord with Fortnite or another web-based gaming platform. So in my situation, the AMD and Intel yogas pictured above are pretty much similar but AMD has theirs on sale right now for $350 less than the Intel 155U, whereas it would otherwise only be $150 less if AMD wasn’t on sale.\n\nI suppose my last main question is just performance - how do the cores work? Does AMD fire all at once and Intel has a couple cores that run constantly with other ones available if need be? I’m not too well versed in computer engineering but I understand basic things like how long it would take for a processor to process tasks or what a graphics card can render at a given moment.",
  "The legion will have the highest build quality, so if you value longevity, then I would recommend that.",
  "If you want to save some money, try this. [https://www.amazon.com/Lenovo-Legion-i7-13650HX-GeForce-83DG00EEUS/dp/B0DPM91Z6B/ref=sr\\_1\\_5?crid=1CXJCRKY65QXB&dib=eyJ2IjoiMSJ9.sp77n58yvB9e4fK\\_-mRmN0mxjQjitfDEKTF6L12bOEBMkN2v1hRzJz3PBQgqzW\\_Gw4zAIMvCDr4AuXBEE\\_6i6FyuPENgwi\\_SgtwRfXjThGmSCkd3iIew9ZM8bT1zaaEy1VGcysDD7ju\\_TLMAYkcEomHWfPKD3\\_\\_m4do-wWYExhpjwe5H0QQc4pVqH96H3SqdffdqSoNpJ4\\_3EsgeWEMiEXsHJCxyym0Klm31TTkYjcs.zD4kt4VGKAxGSP-aHGDmH6mkbRwkG6mMK0WOGUAP4mc&dib\\_tag=se&keywords=i7+4060+laptop&qid=1737649608&sprefix=i7+4060+laptop%2Caps%2C135&sr=8-5](https://www.amazon.com/Lenovo-Legion-i7-13650HX-GeForce-83DG00EEUS/dp/B0DPM91Z6B/ref=sr_1_5?crid=1CXJCRKY65QXB&dib=eyJ2IjoiMSJ9.sp77n58yvB9e4fK_-mRmN0mxjQjitfDEKTF6L12bOEBMkN2v1hRzJz3PBQgqzW_Gw4zAIMvCDr4AuXBEE_6i6FyuPENgwi_SgtwRfXjThGmSCkd3iIew9ZM8bT1zaaEy1VGcysDD7ju_TLMAYkcEomHWfPKD3__m4do-wWYExhpjwe5H0QQc4pVqH96H3SqdffdqSoNpJ4_3EsgeWEMiEXsHJCxyym0Klm31TTkYjcs.zD4kt4VGKAxGSP-aHGDmH6mkbRwkG6mMK0WOGUAP4mc&dib_tag=se&keywords=i7+4060+laptop&qid=1737649608&sprefix=i7+4060+laptop%2Caps%2C135&sr=8-5)",
  "Yeah, if it's just between those choices you quoted then the AMD Yoga at $350 less is really a no-brainer and the best choice.",
  "Definitely a thought to consider. I appreciate the feedback!",
  "When since are plastic bombers better than full alu shells",
  "Need advice on potential purchase Hi all, \n\nThis is the laptop I'm looking at buying currently \n\nhttps://www.bestbuy.com/site/lenovo-yoga-7i-2-in-1-copilot-pc-16-2k-touchscreen-laptop-intel-core-ultra-7-processor-16gb-memory-1tb-ssd-luna-grey/6615776.p?skuId=6615776 \n\nMy husband is a gamer and knows more about tech than I do, and he told me to look at laptops that aren't Lenovo because they're crap (his words summarized)\n\nFor more context, I am looking for a laptop just for general use and light gaming (nothing that requires intense processing or graphics)\n\nThe must haves for my laptop because I loved them on my previous HP include: numeric keypad, 2 in 1 design, around 15.6\" screen, and touchscreen. \n\nCan anyone please weigh in and let me know if this would be a good buy? If it isn't, can you recommend any laptops that have the features I'm looking for? \n\n",
  "Lenovo ain't no trash. It builds one of the most robust laptops around here which are known as Think Pads.\nI know brand ain't perfect but it's better than many .\nI would suggest you to go for ThinkPad with graphic card.\nLight weight and will allow you to game a little as well.",
  "I know someone who has the same laptop but for other purposes than gaming\n\n\nSound/Display quality are decent, only thing i might be cautious about are the hinges. + the screen is 16 inches and it weights 4.2lbs so keep that in mind\n\nThey bought when it was on sale so it was cheaper.",
  "[deleted]",
  "Yeah, I looked at Thinkpads and didn't like the look of them. When I say I'm gaming, I'm playing stuff like club penguin and papa's pizzeria, not actual like heavy graphic gaming 🤣🤣",
  "Others can point out if that laptop is suitable for gaming or if you can get a better deal/laptop for that budget \n\nThat’s all i know tbh hope that helps",
  "Okay. I had an HP laptop that was 360 and never had any issues with the hinges; I'm not sure how Lenovo compares in that sense. Do Lenovo hinges just break easily?",
  "Ok; like what?",
  "Damn thanks for clarification it's good I didn't suggested you RTX 4050 or 4060 graphic card laptops.\nThen I guess you would be good with High end CPU like AMD Ryzen 7/9 or Intel i7 / i9 . As these has integrated graphics which will run the games like you have mentioned.\nAnd even RYZEN 5 or Intel i5 will work too",
  "Well some people have problems with both HP and lenovo\n\nBut i guess that if it was taken good care off/treated gently, it’s all good.\n\nSee that post for example [Lenovo yoga 7i hinge problem](https://www.reddit.com/r/Lenovo/comments/15u8mqv/lenovo_yoga_7i_hinge_problem/)",
  "Is the one that I have okay for what I want? This one has Intel core 7 I think",
  "Yes , the laptop you mentioned in the post can play games you mentioned and other games like \n\nAmong Us  ,Stardew Valley  ,Minecraft (low settings)  , Roblox (most games)  ,Older AAA titles at low settings.",
  "Ok great! I'm not like a gamer gamer, and Papa's pizzeria and club penguin don't really require anything crazy I don't think 🤣🤣 \n\nI laughed when I posted my previous comment because I'm 26 and still like to play these games",
  "Yes those are basic 2D games.\nIt's alright there's no age that' you should stop playing games.\nDo whatever makes you happy, that's important.",
  "Can you look at this one and tell me which you think would be better? I'm limited on laptops that have the features I'm looking for.\n\nhttps://www.bestbuy.com/site/samsung-galaxy-book4-360-2-in-1-15-6-fhd-amoled-touch-screen-laptop-intel-core-7-16gb-memory-512gb-ssd-gray/6572181.p?skuId=6572181\n\nThis one is comparable but offers a little less storage at 512 GB SSD just a little more expensive.",
  "Link not working here in my country. Now I wouldn't trust Samsung much in terms of Laptop.",
  "I have a Dell laptop I found with similar specs. Would Dell be a better pick over my original?",
  "Is this a good laptop I’m wanting a Lenovo laptop that’s good for games and I can use for school would this be a good choice? ",
  "Nope 👎 \nNo gpu (nvidia) \nIt a big L for me so don’t buy it \nTry finding a good pc like alien or OMEN or Lenovo",
  "If you want gaming performance, there are better ways to spend $750 that will accomplish that:",
  "I dont know if I'd consider any computer named \"Yoga\" to be good",
  "really good for the price. ram might not be enough tho(for a long time)",
  "Is it this year's ultra 7 (258v I think) or last year's 155H.. I'm trying to buy a similar laptop at the moment and that ones with deals all seem to use the last gen processors.. really not sure how big a deal that is.. I'm finding the whole thing a right PITA",
  "What kind of Lenovo? I know I want one of those",
  "Yeah I have no clue what I’m doing when it comes to pc or laptop gaming I e always been on a ps5 do you have any recommendation?",
  "All the numbers in your comment added up to 420. Congrats!\n\n      7\n    + 258\n    + 155\n    = 420\n\n^([Click here](https://www.reddit.com/message/compose?to=LuckyNumber-Bot&subject=Stalk%20Me%20Pls&message=%2Fstalkme) to have me scan all your future comments.) \\\n^(Summon me on specific comments with u/LuckyNumber-Bot.)",
  "If you want a good pc try OMEN 5",
  "Look for spending with an RTX 5050 or 5060 graphics card. A 4060 is also good if you can find it. \n\nI would also recommend actually going to your local Best Buy and seeing if there’s a floor units or an open box unit that you can get on a good discount. Best Buy will usually take 20-30% off a floor model. I was looking at laptops last week at best buy and they had a $2200 model marked down to $1400 because it was the last floor unit.",
  "Thinking of Upgrading to HP OmniBook X (Snapdragon X Plus) – Advice Needed! Hi laptop community,\n\nThis is my first post in this community and I could really use your advice!\n\nI’m considering an upgrade and need some advice, especially from those who’ve used the new HP OmniBook X with the Snapdragon X Plus. There’s a deal going on at [Officeworks ](https://www.officeworks.com.au/shop/officeworks/p/hp-14-omnibook-x-snapdragon-x-plus-16-512gb-copilot-pc-hpfe1000qu)in Australia right now for this laptop.\n\n**Current situation:**  \nMy Lenovo Yoga 7 Slim Carbon 13\" (Intel i5-1135G7, 8GB RAM, 257GB SSD) is showing its age. Here are my main problems:\n\n* *Small SSD:* I regularly download and watch movies, but 257GB fills up fast.\n* *Slow performance:* The i5-11th gen feels outdated and sluggish.\n* *Low RAM:* 8GB isn’t enough for my workflow—I keep many job application tabs open and learn coding.\n* *Poor battery life* and unreliable keyboard (some keys need to be pressed VERY hard).\n* *Noise:* The single fan runs constantly and isn’t quiet.\n* After this experience, I’m pretty much done with Lenovo.\n\n**Why I’m considering the HP OmniBook X** Snapdragon X Plus\\*\\*:\\*\\*\n\n* It’s got a Snapdragon X Plus chip, which from what I’ve read should be super snappy and efficient (ARM chips = long battery life).\n* 16GB RAM and 512GB SSD solve my speed and storage issues.\n* Slick design and solid build quality—I’ve only heard good things about HP from friends and Officeworks reviews seem positive.\n* Hoping for much better battery life and a quieter, cooler experience.\n\n**My usage:**\n\n* Watching YouTube/movies\n* Learning coding and applying for jobs\n* Lots of browser tabs (mainly job portals)\n* Want a laptop that’s quiet, with solid battery, good keyboard, and enough power for everyday multitasking.\n\n**Questions:**\n\n* How’s real-world performance on ARM Windows laptops? Any compatibility issues for daily use?\n* Is battery life genuinely as good as advertised?\n* What’s your experience with HP build quality and support?\n* Should I consider anything else before making the switch?\n\nAll thoughts, insights, and experiences are very welcome. Thanks in advance for the help!\n\n\\-------------------------  \nUsed perplexity to organize, gather my thoughts and create this post\n\n[HP OmniBook X Qualcomm Snapdragon X Plus](https://preview.redd.it/jqkb1usvyzhf1.jpg?width=1000&format=pjpg&auto=webp&s=bd6d40bd0a6a248242d1a0fc11db0186f4ba031c)\n\n",
  "These ARM chips are indeed super snappy - as you described. However, if you plan on gaming, I would steer clear as many games are simply not available yet.\n\nIf you don’t game, or know your games work, I would highly recommend. But check everything is compatible, or at the very least, will work via Prism.\n\nI personally have been daily driving a Snapdragon X Elite (but MS Surface) since November and absolutely love it. About 90 - 95% of apps I’ve come across have worked (I’ve tested hundreds for my job). The only ones that have problems are driver related (such as printers). But even then, many print vendors are supporting ARM now. \n\nIn terms of battery life and thermals - they’re sublime. It never gets hot and I’ve never heard the fan spin up (even while working in bed!). Battery lasts 8-10 hours I’m and I have to charge it roughly one every day and a half.\n\nSummary: for a work daily driver, I wouldn’t go back to x64-x86. Hopefully Microsoft can keep up the momentum.",
  "Personally ARM on microsoft is still not where it needs to be. Be prepared to get random compiling errors when coding if the VSC plugin even works to begin with.\n\nFun fact, when these snapdragon chips launched, the windows arm version of chrome just didnt work for two weeks. It was broken and you were relying on a third party vendor (google) to fix their shit.\n\nIf you want an arm device, mac is where it is. If you want x86 linux is where it is. If you want to game, windows is where it is.\n\nWindows on ARM is you running beta testing for software, firmware and hardware while paying for the privilege.\n\nAs for your current device, honestly the big hold back would be the ram. It likely is not enough so you are having to use the page file on your ssd which is slower and if you are running out of space on your ssd it would be even slower. Additionally it is likely not dual channel memory so it is kneecapping the processor's performance. In terms of the fan you could redo the thermal paste yeah that likely is not really fixable.",
  "Did you get omnibook x? Planning to get this one too",
  "Thanks so much for the detailed insight!   \nYour real world experience with snap is helpful, I’m not a gamer, so that side effect isn’t a big issue for me, but I’ll definitely double-check the specific software I need (i use vs code and someone mentioned not all plugins are compatible), and look into Prism compatibility.  \n\n\nI went to Officeworks the other day to try out the laptop, and I was impressed with its sleek aluminium build. The keyboard felt a bit odd to the touch, but that’s fine since I’ll be using an external keyboard anyway. I opened around 30 tabs—YouTube, Reddit, news sites, job portals—and there was a slight lag (which I expected), but it didn’t heat up and the fans never kicked in, which was nice!\n\nThe only letdown was the touchpad. It felt premium, but it didn’t always register my single-tap clicks, which got a bit frustrating. Still, I’ll be using an external mouse most of the time, so it’s not a dealbreaker for me.",
  "hey do u mind if i get ur opinion on a few laptops?",
  "Of course you can go for it",
  "If you had to pick one which would it be\n\n-ASUS ZenBook 14 – Intel I7 12th Gen | 16GB RAM | 512GB SSD | Intel Iris Xe Graphics \nspecs: Model: ASUS ZenBook 14\nProcessor: Intel Core i7-1260P (12th Gen, 12 cores, up to 4.7 GHz)\nGraphics: Integrated Intel Iris Xe Graphics\nRAM: 16GB LPDDR5 (soldered)\nStorage: 512GB PCIe NVMe SSD\nDisplay: 14\" Full HD (1920 x 1080) IPS, Anti-glare, 400 nits\nOperating System: Windows 11 Home\nAudio: Harman/Kardon-certified speakers\nKeyboard: Backlit keyboard with precision touchpad\nPorts:\n2 x Thunderbolt 4 (USB-C)\n1 x USB 3.2 Gen 2 Type-A\n1 x HDMI 2.1\n1 x 3.5mm Combo Audio Jack\nMicroSD card reader\nConnectivity: Wi-Fi 6E, Bluetooth 5.2\nBattery: 75Wh, up to 16 hours of battery life\nWeight: Approx. 1.3 kg (2.87 lbs)\n\nORRRR\n-Lenovo ThinkBook 14 G8 - 21SJS00300 - 14\" - Core Ultra 5 225U - 16GB RAM - 512GB SSD - Intel Graphics\nspecs: Processor: Intel Core Ultra 5 225U, 12C (2P + 8E + 2LPE) / 14T, Max Turbo up to 4.8GHz, 12MB\nMemory: 1x 16GB SO-DIMM DDR5-5600.  \nStorage: 512GB SSD M.2 2242 PCIe® 4.0x4 NVMe. \nDisplay: 14\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC, 60Hz. \nGraphics: Intel Graphics.  \nPorts:\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1)\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On\n1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.0 and DisplayPort™ 1.4\n1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n1x HDMI® 2.1, up to 4K/60Hz\n1x Headphone / microphone combo jack (3.5mm)\n1x Ethernet (RJ-45)\n1x SD card reader",
  "Id personally lean towards the Asus",
  "swift go 14 sfg14-72-53bp (125H, OLED) UPDATE: 4 months later. i love love love it. it's perfect for me. a 14\" MBP that can do everything that i could ever imagine. no problems thus far. :fingers\\_crossed:\n\n[https://store.acer.com/en-us/swift-go-14-laptop-sfg14-72-53bp](https://store.acer.com/en-us/swift-go-14-laptop-sfg14-72-53bp)\n\ni was writing a comment on [Im planning on getting the Acer Swift Go 14 with the oled screen... is this a good idea? : ](https://www.reddit.com/r/laptops/comments/1dh9jne/im_planning_on_getting_the_acer_swift_go_14_with/) and basically ended up writing a review, so:\n\nI just got the 125H version (mis-posted as 135H) off eBay for $550 \"like new\"/\"open box\". It's incredible, especially when coming from a limiting chromebook and an even more limiting iPad mini, lol! The 125H goes for $850 and the 155H goes for $1000 on the Acer US store.\n\nof note: the older [Acer Swift X 13500H RTX 3050 version](https://store.acer.com/en-us/swift-x-14-laptop-sfx14-71g-5911) (an older *non-touch* IPS screen) is going for $800 new! That's a significantly better gpu, but likely more power-hungry and perhaps limited by the 65w battery and even 100w charger, but who knows: those AMD ryzens seem to do way better than the intels of their time. Highly likely to find one going for a low price compared to bigger names. The next jump is at $1300 for a new swift go 14\" 155H rtx 4050.\n\nhere's a quick useful video review about it: [https://www.youtube.com/watch?v=0E3I3q48674&](https://www.youtube.com/watch?v=0E3I3q48674&t=180s)\n\nmajor notes:\n\n* **the version with the OLED screen does not have touch input.** I found this out the hard way. :( I guess i assumed that the swift's \"go\" series was like \"flipbook\" and \"spin\", in that the touch-screen is it's main feature, without the flipping/spinning part. I was wrong. (the 155H version has touch-screen: [SFG14-72T-71QF](https://store.acer.com/en-us/swift-go-14-laptop-sfg14-72t-71qf) along with a 16\" version. Look for the icon with a finger pointing.)\n\nmajor cons:\n\n* the battery life is lower compared to other ultrabooks, maybe 6-10 hours vs 10-14 hours zenbook, perhaps due to the 65w vs 75w battery(?). I can't say yet, and maybe windows (and it's bloatware) is still doing something, but i got 10 hours on my first three charges, draining at \\~10%/hour; But i also always use minimum brightness, and just had the normal 30 tabs open (edge, most tabs sleeping) with music playing. Conversely, perhaps because it has a smaller battery, it charges very very quickly: an hour or so (with the given charger). It's also nice that usb-c was standardized for charging, though i wished the usb-c cable would detach from the power block... A minor gripe. After the first few drains, i've kept the laptop charged, and used some pre-installed Acer program to limit charging when plugged-in (to 80%, no choice). This really is it's only major con.\n* the OLED is glossy. so glossy you can see a deep, deep, and rich reflection of yourself. It's like looking into a dark mass of water. It raises self-awareness and horror :cold\\_face:\n\nproblems likely similar to other ultrabooks, and other notes:\n\n* fan noise, and heat. when it speeds up, it's clearly audible in a quiet bedroom when it starts up. it can start with very little computering ([the zenbook got panned in a review for being worse](https://www.notebookcheck.net/Asus-Zenbook-14-OLED-review-The-1-2-kg-subnotebook-with-120-Hz-OLED-and-Core-Ultra-7.805236.0.html)), then it goes back to silent mode, and thankfully, *stays* silent. And when it's silent, it's *absolutely* silent! It's apparently not louder than it's competitors tho?? sounds fine to me... *Thank goodness!* Along with fan noise, it can get a little warm at the palms. I think this happened during the beginning of it charging. Thankfully, the aluminum(?) case ensures it cools down quickly, and keeps it cool. (this is my portable-desktop-laptop, wherein i plan to use a separate mechanical keyboard most of the time anyway). However, when it's not charging, it seems to stay quiet 'n cool, which is the most important time.\n* the speakers are bass-less, but the amp is surprisingly incredible(!!).. but then again, i've never heard good laptop speakers in my life. Zero bass, which i'm okay with, as i'm a dreamy-pop treble music person, but just say no to lo-fi/city-pop. It's interesting to hear bass guitars without the bass.. It reminds me of my old purple 'n gold ATH-AD700 headphones that i adore, but far worse mixing. The audio goes through some artificial spatial surround sound software: the mids seem to live recessed in the bottom center of the laptop (vocals), then are overtly forwarded to every direction / speaker in the artificial speaker system (piano), the highs are all over the place, moving from one part of the laptop to another; and the lows remind me of bad midi music. Your favorite music will *not* move you. You will however listen to your favorite music in a very different way.. Having said that, the speakers can get very loud, easily able to fill up a room(!!), and most importantly: beyerdynamic 300r 32ohm headphones sound great at a mere 10% volume!\n* the up and down arrow keys share a single key area. I use wasd for gaming, so it doesn't bother me. This also keeps the keyboard's shape to a neat rectangle.\n* the left modifier keys aren't big. they're the same size as the letter 'n number keys. The right modifier keys, however, are slightly wider. They had to do this to make space for the function key. UPDATE: i re-mapped/swapped left-control with left-alt, mac-style. much better. i'll likely re-map holding caps-lock to left-control too.\n* the keys feel only slightly better than my $40 samsung chromebook 4, which, now that i'm looking at it, surprisingly, has the big fat left modifier keys and complete arrow keys too! Not bad, that thing! (for programmers the tilde key and delete keys are nice to have, and nicely placed, as are the half-size function/special keys... tho, i'm scared of what bloatware the acer key will manifest..!) UPDATE: in retrospect, it's actually a great keyboard. I ordered a keychron k6, and those red keys are god awful. Seriously, who want's to press a key down for a one-half inch?? I've become used to the tiny distance of laptop keyboards..\n* the 14\" screen is a huge surprise coming from an 11.6\" chromebook (2.4\" is a lot!) and even the 13.3\" macbook, yet it's dimensions are only very slightly larger (<1\"). There's about an inch of empty space on both sides of the keyboard--I'm the sort of person who saw the 15\" Macbook and thought, *\"ugh, what is all that space for!?\"*, and didn't buy one until the 13\" came out. The massive OLED screen gets as close as you'd want to the edges--any closer, your fingerprints would smudge the beautiful screen when opening/closing it. As does the massive trackpad.\n* the bigger touchpad may cause more accidents. I haven't had enough experience, but thus far, it seems fine for my hands, for the most part. I did have had it click on random parts of this review i'm writing quite a few times.. but then again, i'm currently sitting at a bad angle. UPDATE: i love it. bigger is better. i must have gotten used to it, as i don't accidentally touch it anymore..\n* the ports are perfect for me, as i'm not updated on current technology: two thunderbolt(?, new to me), two usb--one on each side!!!, one hmdi, a headphone jack, an sd card reader, and a good ol' kensington lock, lol. I've never used a lock before, but have always found it intriguing . I feel the port choices are very old-school, like me. :) It might be possible for 4 displays for this chip...!? (note: smaller 13.3\" laptops can compromise on ports)\n* bloatware. after 20 years, this still exists. Why? McAfee still exists..?? I did however use the 1 year of 100GB dropbox. Could someone please ship me a usb flash drive or sd card so that i can re-install windows? ;(\n\nwith all the similar \"ultrabooks\" (Asus zenbook, Lenovo yoga, HP spectre, Dell xps 14, maybe even the lower-end Acer spin, Asus flipbook, Asus vivobook, HP pavilion plus, Dell inspiron plus, 'n so on), i felt it's pretty hard to decide on one, and just went with what good deals i found on eBay, and checked the review on notebookcheck, and double-checked that the specs are indeed \"ultra\" (weight, size, build quality--not plastic).\n\nit's direct local (to Taiwan) competition is the asus zenbook, and i actually think that's a better notebook. Better speakers, better keyboard (i prefer big keys over the macbook chiclet-style), betters looks (premium business ultrabook vs macbook clone), lighter (an insane 1.3kg), and most importantly a better battery (75w vs 65w, 12+ hours vs 8 in tests!), but, notebookcheck's review noted a fan noise problem, due to it having a single fan / heat-sink vs this Acer's double fan 'n heat-sink. The problem could just be a fluke, but def worth researching other users experiences about it. Beyond that single problem though, i def prefer the zenbook. However, if a macbook clone is what you're really into, this Acer is just that!: a 14\" Macbook Pro (possibly for half the price due to bad resale value)\n\ni personally chose the Intel ultra series for it's great games/power balance, and x64 architecture. I missed out on the entire AMD marathon. An older asus rog flow x13 (g14 doesn't have touch-screen), razer blade 14, or microsoft surface pro (intel ultra series, not the newer ARM arch models) would have been my top choices, if i were to accept something more used. The previous gen surfaces were way too expensive! But i'm super stoked with what i got for $550. Wow! Also, i love Taiwan (made in Taiwan <3), so Acer 'n Asus were actually my top choices (they do all the hard work of making everything, and are absolutely lovely people with an incredible culture to behold, so let them have all my monies!). Actually, i've been fond of the swift series laptops, particularly swift 3 series and 5 series, ever since that time i went to a physical store to test 'n compare laptops. They were by far the best deals in the \"budget\" range. They were all ultrabooks in my eyes, for a fraction of the price of one.\n\nthe OLED is stunning. Now there's absolutely no need for a Macbook for me. My last one was a late-201313\" MBP. Hello again, Windows. How i've missed you dearly. And oh my, how you've accepted Linux..?? I don't even need Linux anymore, and that's coming from Arch! Also, having done some programming, i can't justify the sufferings that Apple has made programmers go through over its reign. Microsoft has since made a big turn towards accepting open-source, linux, programmers, etc. Strange, but good... i hope.\n\nfor my personal needs, the lower-resolution IPS touch-screen would've been ideal, for both touch input and possibly better gaming performance (*does native resolution matter nowadays..?*). It is indeed a major bummer. However, i feel that without the the ability to swivel the screen around (\"convertible\"), it would've made an odd touch-screen experience anyway, quite different from tablets. Also very important to note, **there's quite a few touch-screen OLED notebooks--**[**including the zenbook**](https://www.reddit.com/r/ASUS/comments/13wdvxm/oled_touchscreen_is_awful/)**--, that suffer from a grainy screen problem**--though, i don't know which exact models / year have this problem. So, in the end, i feel it was more of a blessing. Anyway, i'm hoping my next job will pay for a premium laptop. At the moment, if money were not a factor, i'd go for either the Asus rog flow x13 or dreamy z13. The z13 is all i've ever dreamed for, ever since the iPad came out. ;) ...but i've read that even the z13 suffers from a very low battery life. :/\n\nUPDATE: now that i've got OLED, i can't imagine ever going back.. o.o\n\nso, if i were to choose again, a \"new\" 2022 asus rog flow x13 ryzen 7940HS would have been my choice, and very very surprisingly, it's going for a mere \\~$800!! So, unless you find a deal like mine, you should just go for one of the best out there! Otherwise, this is an incredibly solid laptop for its price. It has also easily convinced me macbooks aren't worth it anymore, as it was a decade ago, even considering the newer ARM M-series. I'm a believer of Acer/Asus/Taiwan!",
  "Is the fan noise not that big of a deal? I plan to buy this same model, and will be using this inside my university's computer laboratory. And I don't want to distract others with the fan noise.",
  "I bought my Acer Swift Go 14 on September 28, featuring an Ultra 5 125H processor, 16GB RAM, 512GB SSD, and a 90Hz OLED HDR display running Windows 11 (23H2). I got it for 60,000 INR after discounts, down from around 80K. My previous laptop was the ASUS FX504, which I used for 6 years.\n\n# Negatives:\n\n* Wi-Fi Speeds & Performance: The ASUS consistently outperforms the Acer in download speeds, and I occasionally feel a static sensation when touching the metal surface while charging.\n* Sharp Trackpad Edge & Heat During Charging: The trackpad edge is uncomfortable, and the right side gets hot while charging, making it tough to use on my lap.\n* Useless Copilot Key & Keyboard Backlight: I remapped the Copilot key to Ctrl using AutoHotKey, but the keyboard backlight turns off too quickly, which is frustrating.\n* AI Features & Webcam: The AI eye contact feature is poorly executed, and the wide-angle webcam captures too much of my surroundings.\n* Glossy Display: It's highly reflective, which isn't ideal for bright environments.\n\n# Positives:\n\n* Stunning Design & Trackpad: The laptop looks sleek, almost like a MacBook, and the massive trackpad is so good that I hardly use a mouse.\n* Solid Hinge & Great Keyboard: The hinge is easy to open with one hand and feels premium, while the keyboard is clicky and visually appealing.\n* Outstanding Display: It's bright and colorful, with excellent HDR for movies.\n* Useful AI Features & Decent Speakers: The AI background blurring and noise cancellation work well, and the speakers are good for a laptop.\n* Convenient Charging & Good I/O: I can use my phone's USB-C charger, and there are multiple USB ports and useful features.\n\n# Performance:\n\nWhile I haven't tested it with games or benchmarks yet, the Acer is significantly faster than my ASUS for everyday tasks. It handles multiple apps smoothly, even on battery.\n\n# Battery Life:\n\nYou can't expect stellar battery life with a high-resolution H-series processor. I got around 5 hours of SOT with regular use and 4 hours while looping a 4K movie. There are ways to extend battery life, but I prefer using it to its full potential since it stays on my desk most of the time.\n\n# Conclusion:\n\nFor the price I paid, I believe I found the best laptop for my needs. I'm very satisfied overall. **For the full review, check out my post** [here](https://www.reddit.com/r/AcerOfficial/comments/1g75rhv/new_acer_swift_go_14_ai_pcs_review/). Thanks for reading!\n\n**All photos:** [View here](https://postimg.cc/gallery/Cgq5mgP)  \n**Follow me on IG:** [@jon.images](https://www.instagram.com/jon.images)",
  "I've ordered one and I'm really excited. coming from a thinkpad x395. mainly hoping for better battery with performance that can cope in 4k video editing. the colour accurate oled will be a lifesaver! :)",
  "before install:  \nbackup everything  \nget the acer/dropbox promotion for a year of 100gb for free\n\nsetup \"media\" (usb disk, sd card, etc.)\n\n* set-up disk via \"media creation tool\"\n   * [https://www.microsoft.com/en-us/windowsinsider/cleaninstall](https://www.microsoft.com/en-us/windowsinsider/cleaninstall)\n   * add a wifi driver to the disk\n   * https://www.intel.com/content/www/us/en/download/19351/intel-wireless-wi-fi-drivers-for-windows-10-and-windows-11.html\n      * this worked for me; i didn't need the specific one on the acer support page for this model  restart\n\nf2 to bios:\n\n* go to \"main\" page\n* press control+s to show hidden settings\n* turn off \"Intel VMD\" (volume management device)\n   * otherwise my hard drive didn't show up when installing windows\n   * **caution: with this setting off, windows will now blue screen! turn on to continue using current windows os**\n   * also, wtf intel!!\n* turn on \"f12 to boot\"\n* save changes and restart\n\ninstaller:\n\n* (restart)\n* press f12\n* select the disk/media to \"boot\" from\n* ...\n* at hard drive screen\n   * delete all of the partitions until a single \"unallocated space\" exists, then select that and continue\n   * note: there were 4 partitions for me: esp?, msr, acer, and the main one; i was a little apprehensive, but at last deleting them all turned out to be fine\n* ...\n* at the wifi screen\n   * if you didn't have the wifi driver like me, skip this screen: shift+f10 to open command prompt, enter this command: \"oobe\\\\bypassnro\". go through the screens again, but this time, \"i don't have internet\" option will pop up. then \"continue with limited setup\"\n* hello windows!",
  "install wifi driver\n\n* i used the .exe installer, but maybe could've manually done it cleaner with an inf file\n\nupdate windows\n\n* **this will download and install all of the drivers auto-magically!!** (forget the acer support page!)\n   * (windows is wayyyy better than linux and mac at this)\n* if touch-pad isn't working, may have to press f10 to turn it on (despite it being set to on in settings)\n   * i wasted effort installing the \"intel serial io driver\" to no avail\n\ndone.\n\nmuch much much better than all the crap it came with. c'mon Acer!... but then again, i'm not mad at ya' getting that advertisement money..\n\nonly thing left is the acer software, which i haven't quite decided on... i remember one was terrible, but i used the other one for limiting charging to 80%, which somehow seems to have persisted through the re-install... hmmm, maybe that was a deeper BIOS change..??",
  "Hi! I have the same unit but with the 155H processor. How do you achieve 6 hours of battery. My 80 percent of battery wont even last for 3 hours. My battery went from 78% to 62% percent after an hour just by opening windows explorer and microsoft edge loll",
  "Hi, do you think it's a good idea to buy the acer swift go 14 155h version for 730 USD (outlet) with touch screen and no oled",
  "If anyone has removed the back cover, can someone confirm if there are 1 or 2 nvme slots?",
  "how well does fortnite run? or other similar games?",
  "I can hear fan noise for a few seconds each time I turn on the Acer Swift Go laptop that I purchased from Costco.  However, it's generally very silent when watching youtube videos, browsing the web, and doing office work.  Can the fan noise be permanently controlled via BIOS (if I wanted to install Linux on the system) or is one forced to use the AcerSense app?  Frankly though, I've been spoiled by the Thinkpad laptops (X230, T450, and T460s) which are really silent.  I would have continued to use the T450 and T460s laptops had not Microsoft refused to support Windows 11 on those machines.  Are HP/Asus/Acer laptops generally noiser?",
  "I bought this exact laptop (yoga pro 7, Intel ultra 7, rtx 4050, 32gb Ram, 1tb) for Christmas. I’ve been searching for the perfect lightweight, slim laptop that’s ideal for schoolwork and gaming. However, when I play games like *Cyberpunk* or *Hogwarts Legacy*, the fan noise is unbelievably loud! The fans are getting enough airflow, so that’s not the issue. I’m just heartbroken by the noise.\n\nEven with my AirPods Pro and noise cancellation turned on, I can still hear the fans loud and clear. I measured the noise using an app on my phone, and it registered at 56 decibels.\n\nPlaying my favorite games on energy-saving mode isn’t an option either—it’s unplayable at 5 FPS. Unfortunately, the difference between balanced mode and performance mode is barely noticeable.\n\nCan someone please help or give me advice on what to do?",
  "Hey OP this goes for the same price as the MacBook Air M3 16/256 GB in my country, what would you recommend in this case? ",
  "When I am watching netflix in fullscreen my screen is flickering sometimes, are you also encouring this?",
  "Hey op,  how's it now?\nI have to keep charging since i will be using this laptop throughout the day. \nSo will you still recommend me i  buy this? Heard,  it heats a lot while charging. This laptop is perfect for me, except thermal issues..",
  "I have the laptop I haven't heard the fan. I doubt it is even in there.",
  "you won't hear it in a lab setting. you've gotta be in a quiet bedroom. it's not a gamer laptop, lol.",
  "nice! i thought i dissuaded everyone with my highly critical review, lol. i still love it. now that i've got OLED, i don't think i could settle for less. i'm spoiled.",
  " how's it now?\nI have to keep charging since i will be using this laptop throughout the day. \nSo will you still recommend me i  buy this? Heard,  it heats a lot while charging. This laptop is perfect for me, except thermal issues..",
  "Im so glad for your write-up. I have an Acer Swift Go (Ultra 7 155H) and reinstalled windows too. I had trouble with the installation not finding my SSD so I had to fiddle around, in my case I installed a Intel Rapid Storage Technology driver during windows installation, I hope Ive known about the VMD setting but I couldnt find it in BIOS, the hidden setting tip woudlve been a lifesaver.\n\nFor the drivers, did you remove the acer included ones or did you let it stay in your system? particularly useful is acer care center for 80% battery charge limit and touchpad light control, other than that all of it were junk.\n\nedit:  \nlist of acer default apps\n\nAcersense - useful for battery limit to 80%, touchpad light brigtness and some stuff. Manufacturer-bound, cant change in windows so dont delete this. Just dl from product support on acer website just type the SFG14-73 ​  \n  \nAcer QuickPanel - Garbage. Features; Pureview - just open in settings>bluetooth>camera for things. PureVoice - some mic/recording related features essentially its just realtek audio console so delete this garbage its just essential features just repackage by acer   \n  \n​Acerliveart - Garbage. Create sticker from photos.",
  "yikes... i dunno.. i've mostly been using it for simple web browsing.. I usually just have chrome with a billion tabs open (chrome seems smarter nowadays..), spotify, a bunch of terminals, and visual studio code. The only time the fan will come on, which is how i'm informed the cpu is working hard, is if i jump through many chrome tabs, or, is if some extension in vs-code has a bug / is poorly programmed. I haven't got into games yet, but i'd expect it to kill my battery.\n\nalso i think i had battery saving mode set to on when unplugged... but i really  love the transparent windows which lead into the deep deep photos of the world in the background... so i may have to turn that off as well. :/\n\ni'd say try ..chrome? i haven't gotten deep into removing all the crap that microsoft runs in the back yet...\n\n\\`winget/scoop install ungoogled-chromium\\`",
  "Heya, I'm looking at a similar laptop model but with Ultra Core 9 185H.\n\nHow's your current experience with the Swift 14 GO? Is the battery life still abysmal and fan noise? Thanks!",
  "i personally wish i had touch-screen, as i've literally lived off an ipad mini 2 for a long long time, and anything without a touch-screen seems ancient to me... heck, using a laptop feels ancient! but the OLED is kinda amazing.. ;) i don't feel i can make that judgement for you. maybe you can find a local store to physically see the equivalent of both resolutions/screens, and then decide..?\n\notherwise, i've been loving this little laptop. absolutely zero regrets, zero problems. super quiet. charges fast. love the keyboard and trackpad, which is something i'm usually super picky about..",
  "there is 2",
  "no idea, never played fortnite. though i hope it can play emulators!",
  "i haven't used a laptop in ages, so i'm not the one to ask, lol... but my guess is that it depends on the model. Very inconsistent.",
  "the \\[lenovo\\] yoga pro 7 is not an acer swift go 14... maybe this was an accident..? but i feel for ya. :pray:",
  "MBA!.. if liked Apple.\n\nMacBooks still are luxury, unless something major happened, lol. A Macbooks’s screen, keyboard, touch pad, micorophone, web cam, all those details are just guaranteed to be top notch. You just don’t have to worry about anything. And most of all it will have insane, best-in-class battery life.\n\njust do a little research to see if there’s something wrong with the model, otherwise, get it!\n\nThe only reason to go for a windows laptop is for a proper gaming laptop, because Apple doesn’t care about games: gamers nor game developers (nor software developers for that matter). Oh also, if you actually need to use windows, i’m not sure if windows even runs on ARM..?? (see link). And what about all those games/apps made for x64 or even older 32-bit? You’d have to research into Mac’s emulation. I would hope the x64 emulation is good, as it takes time to transition cpu architectures.. I personally just wouldn’t want to bother with all of this, so it better be dang good! The intel Macs was a good time imo, having Mac and windows run natively via boot camp. ARM, i have no idea. I haven’t bought a computer in a decade! lol. But that’s the reason I didn’t even bother with the surface pro with ARM (Snapdragon). The whole thing reminds me of proprietary charging cables. It’s not, but that’s how it feels.\n\nBut do note, I have two very strong biases: as a childhood gamer turned game maker, and having at one time the horrific experience of using objective-c and Xcode to make a game for iPad, I value being able to play games (and apps) and not adding more complexity to making games (and apps). Forcing people to buy a Mac product just to deploy to it is insane to me (though surely there’s a service for that now..). Adding restrictions such as which programming language you can use (no JIT, meanwhile Android runs on JVM..). I’ll take the messes that are windows and android/linux any-day. I don’t even know if OpenGL supports ARM. Ooooh, what a mess. ;(\n\nhttps://www.reddit.com/r/macgaming/comments/t44vqc/comment/i0kcxy2/",
  "Yeah, I already bought it too. And unlike the reviews, I haven’t heard the fan at all, even while charging.",
  "Yeah, I already bought it too. And unlike the reviews, I haven’t heard the fan at all, even while charging.",
  "Thank you! \nOLED is 🩵",
  "ah yeah, the biggest thing i remember was the VMD / not finding the drive problem.\n\nhmm, i don't quite remember what acer software i installed. At least the care center. Maybe that's it..? i try to keep it minimal in general... i'm travelling at the moment with the shitty chromebook, so i can't check at the moment.\n\nmaybe you'll save someone the headache by sharing information / experience too! :D",
  "How is it for running vsc? I'd get a version with Ryzen 7 and use it for coding (vsc, codeblocks, eclipse), running a virtual machine, some simpler video editing and usual internet surfing. I'm kinda worried the battery life won't be great (as coding is a heavier task) and I would often use it in spots where power plugs aren't available lol",
  "there is no fan noise when unplugged. it starts when charging the laptop or when doing something intensive. unfortunately i can't compare to other laptops because it's been so long... i can't even recall if my old macbook (2013) even had fan noise...?? but it distinctly starts up, runs a bit, stops upon starting certain applications. i have speakers near where i charge it, so i don't pay much attention there, but it does make noise charging.\n\ni personally have no gripes with it. i love it.\n\nnot sure how much worse the battery will be with ultra core 9 tho..",
  "thanks, your review helps me a lot",
  "I opened mine and there was one",
  "Oled is the only thing holding me back atm",
  "eyyyy, nice! hope you like it. i feel i was overtly-critical in my review too... so far, it's been perfect for me. incredible what people can buy nowadays..!",
  "i dunno, i typically use it in 0-6 hour sessions and haven't really been tracking it. vs-code, however, does start the fan up upon startup of the app, and probably does some menacing stuff..  \n  \n i didn't know eclipse still existed..! wow.. i highly recommend [focus editor](https://github.com/focus-editor/focus) for trivial non-LSP use. otherwise i've been using helix editor, which is tougher to recommend, as it uses vi-like key-bindings and currently runs in a terminal. Each take <100mb ram and very little cpu.",
  "The other one is covered by the flex cable below the dual fans. ",
  "Yeah, the aluminum build makes me confident to use it while lying down on my bed, plus it's small enough to not get uncomfortable when flipping around. The perfect laptop for a lazy bum like me. HAHAHAHA",
  "Found it, installed the new SSD but it's not showing up in the partition wizard, thoughts?",
  "Update to latest bios version ",
  "Btw have you tried using windows buildin partition tool? On start, type disk management.\n\n\nIt should show a shortcut for \"create blablablabla\" ",
  "Already on 1.04",
  "Yeah, that's how I've been checking, to try to initialize the drive",
  "Bios detected it or not? If not then maybe it's sata ssd or not fully slotted in ",
  "Bios is the only place that I can see it, shows name and serial. Can't get it to show up anywhere within windows",
  "Try installing latest Intel rst driver.\n\n\nIf it also doesn't work. I have no other idea ",
  "How long does best buy's \"compare value\" last? Im probably going to get this laptop, but i dont have the money currently , I will in 2 weeks , but I was wondering if this would be on sale for 2 weeks? Im sure it won't, but just wondering",
  "No promises on pricing but that’s not a sale they are saying it’s comparably to a 950 laptop but they are selling it for 550",
  "Not exactly sure, but PLEASE get that laptop because that actually is a steal.",
  "I am not 100% sure, but as per the banner \"4th of July SaleEnds Sunday. Limited quantities. No rainchecks.[Shop now](https://www.bestbuy.com/site/clp/sale-page/pcmcat185700050011.c?id=pcmcat185700050011)\". Maybe till Sunday.\n\nIf possible, try those financing or Pay Later options if they seem legit with not paying more than laptop's price.\n\nEdit: Gladly, its not under 4th of July Sale. Just checked, so we dont know the exact duration of that Sale now.",
  "From my experience, either forever or it will come back in a week",
  "Also will this laptop be fine using lightroom's Ai denoise? I know its built for Ai,  so im guessing yes, but just wondering",
  "Update: got it, seems very smooth,  but sadly I cant test something like lightroom Ai denoise because I haven't gotten a pc membership yet 😢",
  "On lenovo ~950 dollars for the same laptop , so im confused on that",
  "Im not sure if its actually a \"sale\" , its confusing",
  "First party sellers don’t lower prices on old stock often",
  "I think its a sale. I tried to go as far as possible being non-USA. I went to checkout. I saw a Sales Tax of $48.81 totaling $598 (rounded off to $600) for that laptop.\n\nI almost bought it using Financing option, but it failed to connect at the last moment.\n\nIt didnt say any last date for the Comp. Value anywhere on the site.\n\nEdit: I clicked on the comp. value icon and its a bit confusing on what they are trying to say. I didnt quite understand that feature.",
  "True, just confused on what its compared to for pricing it at 550",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "Which one between these two? ",
  "Intel laptop (x64/amd64) has a better compatibility with all the apps, you may have a app compatibility issue with snapdragon (it's ARM based), that said the snapdragon will have a better battery life.\n\nrest depends on what you want to do with it",
  "First one is a very good deal. Ram is soldered tho but 650$ for a Core Ultra 5 gen 2 is really good. Also snapdragon is not really recommendable except in some cases.",
  "are there more choices\nfirst of \n\nthe yoga \ni wouldn’t recommend lenovo to anyone \nif its not a thinkpad \n\nand the asus zenbook snapdragon is ARM based (most apps dont run on it….yet)\ndepends on what you want to do though (you should actually check what apps you would be using and see if they could run on that)\nbut you would get exceptional battery life\n\nso yeah choose your poison \nif not choose something else",
  "None",
  "I'd go with the laptop with a higher screen resolution; those are much better for your eyes",
  "Depends on your use case. Both are priced the same. It will depend on how much you value software compatibility and portability.\n\nBoth are suitably lightweight, quiet, have good battery life, and have upgradeable storage.\n\nThe Zenbook is exceptionally lightweight even among similarly built 13-14” laptops (that’s its biggest selling point), while still being durable by modern standards. The Yoga is larger at 16” and weighs more, which is fine for less frequent travel and if you want more screen.\n\nThe Yoga has an x86 processor, which basically eliminates software incompatibility that the Zenbook’s ARM processor will inevitably run into if you plan to do more than just browser and office tasks. Game compatibility is the biggest advantage in favor of x86 for consumers, and other specialized tasks like video editing and 3D modeling work better on x86 due to the lack of native ARM versions.\n\nDue to the relative infancy and uncertainty of Windows ARM support, and Snapdragon X growing pains alongside that, I have to give the overall nod to the Yoga if you want a primary laptop, but I would certainly shop for the 14” model first if that’s within your budget (it’s pricier and limited to 2242 m.2 SSD upgrades, but it’s smaller and has an OLED option). The limited software compatibility kind of makes the Zenbook an otherwise solid companion device or school laptop for if you already have another computer and you know what Snapdragon X can and cannot do.\n\nOther notes:\n- The Zenbook has a color correct OLED display, while the Yoga has poor color reproduction (62-67% sRGB), though the Yoga has a touchscreen and 360 degree hinge while the Zenbook lacks touch support. Only the 14” Yoga gets an OLED option, which is also color correct.\n- The Zenbook has HDMI 2.1 while the Yoga has HDMI 1.4. The AMD variant of the Yoga gets 2.1.\n- The Yoga’s battery can be charged on either the left or right side, while the Zenbook’s battery can only be charged on the left side.\n- The Yoga’s hinge is extra tight so the laptop cannot be opened with one hand, but that’s actually a benefit ‘cause of the tablet feature so the display remains stable for notetaking and illustration.",
  "Copilot PCs are hot garbage and is riddled with AI.... ew.\nx86_64 is prolly compatible with everything and is better",
  "What happened with snapdragon? 3 months ago everybody on this sub swore they were the best thing since sliced bread.",
  "It’s been a year or so now, only good thing is battery life, otherwise there’s a lot that isn’t supported and performance isn’t that crazy due to emulating most stuff.",
  "Laptop buy help Hi im about to buy a new laptop this weekend, haven't been able to check on physical stores if they have them or not so i just did initial research using their website. I'm currently under IT program, I play valorant from time to time, I also use After effects and Adobe Illustrator for some projects (no heavy 3d work). So far I've researched reviews on these laptops  \n\n\n|Model|CPU|GPU|RAM|\n|:-|:-|:-|:-|\n|Thinkpad T14 Gen 6 14 Inch| AMD Ryzen™ AI Pro 5 340  |AMD Radeon™ 840M|16 GB DDR5|\n|Yoga Pro 7 (14'', Gen 9)|AMD Ryzen™ 7 8845HS|AMD Radeon™ 780M |16 GB|\n|ThinkPad X1 Carbon G12 [](https://www.lenovo.com/ph/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-12-14-inch-intel/21kc0070ph#reviews)|Intel® Core™ Ultra 7 155H Processor|Intel® Arc™ Graphics|16 GB|\n|DELL XPS 14 |Intel  Core™ Ultra 7 155H or 165H |RTX™ 4050, 6 GB |16GB LPDDR5x |\n|Dell 14 Premium Laptop |Intel^(®) Core™ Ultra 7 255H or 265H|Intel^(®) Arc^(™) 140T Graphics or RTX 4050|16 GB|\n|ASUS Vivobook Pro 14|R9-5900HX|RTX 3050|16GB DDR4|\n\n  \nI'm eyeing on thinkpads however they're quiet expensive, so my second choice would be the yoga however I've been seeing comments on how bad the hinges are, and I'm quite worried about it since I really want this on the long run as much as possible I don't want any issues or replacements much. I've had this Dell Inspiron 5570 for about 6-7 years, I've had replacements with it such as the HDD to SSD then ram upgrade, it's been great with me on the long run however the battery is broken. With my experience with Dell, I'm considering to get the Dell XPS or Premium or whatever is good with them right now but they're not really a hot topic now so i can't get much info on the current dell laptops. \n\nAnyways please do recommend on which are really worth getting",
  "*Dell Premium* is supposed to be a successor lineup to the *Dell XPS* family as Dell does not produce new XPS models anymore. That's why the Dell Premium you see there has the Series 2 ultra chip, whereas the XPS has the Series 1 since that was the latest chip they came with. Between those two I would just choose the *Premium* as the Series 2 chips from Intel are a significant improvement over the Series 1 in every circumstance.\n\nIf you really value performance within Adobe After Effects, I would suggest choosing a laptop with a GPU such as the 4050. Integrated graphics are fine for *lightweight* effects work, assuming you go with at least the 780M or Intel Arc, but it's highly recommended to get even a low-power card, such as the 4050, to assist with graphics acceleration.\n\n**The Vivobook is the worst option you listed. I wouldn't buy it.** Great processor for its time, but it is outclassed by processors of this generation. The RTX 3050 was never even a decent GPU, but it doesn't consume a lot of power which is why it's favorable for graphics acceleration within laptops. Still, a 4050 mobile GPU is better.\n\nI would choose between the Thinkpad T14 and the Dell Premium 14 with an RTX 4050. The Thinkpad is built to last, but the Dell Premium gets you better hardware for the price. **The memory in the Thinkpad is upgradable**, while the Dell is soldered LPDDR5X. Take your pick.",
  "Help picking a laptop for multimedia studies. Hello! I am a first-year university student studying Multimedia Design. I am in desperate need of a new laptop and can’t decide between two options.\n\nMy first option is a MacBook Air M4 with a 10 core CPU, 10 core GPU, and 16 GB of RAM. While I'm not the biggest fan of macOS, this option seems very compelling to me because of the MacBook’s power efficiency. I love the fact that I could use the laptop unplugged without it turning into a potato. Additionally, its battery life will likely outperform most Windows laptops. However, I am a bit worried about its performance. While I won’t be playing many or any games, I’m concerned that it might struggle with exporting larger Blender files. Based on online reviews, this laptop seems powerful enough for most tasks I need, but I’m still a bit skeptical.\n\nMy second option is a Lenovo Yoga Pro 7 with an Intel Core Ultra 7 155H CPU, 16 GB of RAM, and an RTX 4050. I really like this laptop because of its OLED 120Hz display and solid specs. However, I’m concerned about its battery life and performance when unplugged. As someone who currently uses an older gaming laptop, I know that performance can be really poor when it’s not plugged in, and the battery drains quickly under heavy workloads. I’ve also read reviews mentioning that the laptop’s fan can be quite loud, even under light loads. Since I’ll have three roommates, I don’t want a jet engine blasting while I’m studying late at night or just watching YouTube.\n\nReddit, I hope you can assist me with this decision! Thank you!",
  "Opinions needed a laptop please! Is this good for my son for his 1st year of college?",
  "All windows pc that has \"Copilot+\" branding is a good ones. \n\nit need to meet minimum spec. \n\nHowever, 16\" would be heavy to carry. \n\nI would suggest 14\" One for lighter weight. \n\n[https://www.microsoft.com/en-us/d/surface-laptop-copilot-pc-certified-refurbished/8v7gkbzd5v58?exid=28806A&activetab=pivot:fulltechspecstab](https://www.microsoft.com/en-us/d/surface-laptop-copilot-pc-certified-refurbished/8v7gkbzd5v58?exid=28806A&activetab=pivot:fulltechspecstab)",
  "need laptop that'll last me for all of college + more possibly! hi everyone! my dad is offering to buy me a new laptop (budget \\~$860 before taxes), and although i'd like to consider myself a computer nerd, everywhere I go I see mixed reviews on every laptop possible. I'm looking for a laptop with a solid battery life that'll last me for about 9+ hours on battery (although I'll be keeping it plugged in at the dorm), 16gb+ ram, 512gb+ storage, and good cpu/graphics for multitasking and light gaming (Roblox, light steam games, video editing, photoshop, Minecraft etc..). I'm leaning more towards a 2-in-1 as well to have it as a tablet too, but I'm not sure if that's the biggest priority. Any advice/suggestions? I'll link some here that I'm looking at. I'm leaning more towards the Lenovo Yoga 7 2-in-1 14\" AMD.\n\n[Yoga 7 2-in-1 (14″ AMD)](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7-2-in-1-gen-10-14-inch-amd/83jr0004us?nrtv_cid=fqad7eni4xvk3&clickid=Tv230RVEbxyKU6bQni0uPS8ZUksS%3A2XvIzp7Rk0&irgwc=1&PID=376373&acid=ww%3Aaffiliate%3Abv0as6&cid=us%3Aaffiliate%3Acxsaam)\n\n[Yoga 7 2-in-1 (16” AMD)](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7-2-in-1-gen-10-16-inch-amd/83ju0000us#tech_specs)  \n  \n[IdeaPad 5i 2-in-1 (16″ Intel) - Cosmic Blue](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-16-inch-intel/83ks0012us?orgRef=https%253A%252F%252Fwww.reddit.com%252F&nrtv_cid=0ksjdhb4p4cne&clickid=Tv230RVEbxyKU6bQni0uPS8ZUksS%3A2xmIzp7Rk0&irgwc=1&PID=376373&acid=ww%3Aaffiliate%3Abv0as6&cid=us%3Aaffiliate%3Acxsaam)\n\n[Dell 14 Plus Laptop](https://www.dell.com/en-us/shop/dell-laptops/dell-14-plus-laptop/spd/dell-db14250-laptop/usedb14250hbtshksp?cjdata=MXxOfDB8WXww&cjdata=MXxOfDB8WXww&nrtv_cid=zbgr0qsjqic9t&cjevent=379929c1473211f08331002b0a1cb826&dgc=af&publisherid=6431646&publisher=&aff=Howl+Technologies%2C+Inc.&affid=6431646&aff_webid=100815679&aff_user_id=zbgr0qsjqic9t&gacd=9684992-28463632-5750457-345576786-177846717&VEN1=13502820-100815679-zbgr0qsjqic9t-Howl+Technologies%2C+Inc.&nrtv_cid=b57v6a2j3rkt1&gad_source=7&gacd=9684992-28463632-5750457-345576786-177846717&dgc=af&VEN1=13502820-100815679-b57v6a2j3rkt1-Howl%20Technologies,%20Inc.&dclid=CL3ik9_qwo4DFdPcuAgdtX0HrQ#customization-anchor&cjevent=ca1066a262b411f08244004f0a1cb825&dgc=CJ&publisherid=6431646&publisher=&aff=Howl+Technologies%2C+Inc.&affid=6431646&aff_webid=100815679&aff_user_id=b57v6a2j3rkt1)",
  "I actually just bought the yoga 7i 2 in 1 14 AMD for the same uses.",
  "ooo how is it?? i keep seeing mixed reviews on intel's CPU being better and the hinges losing support over time. I'm still more tempted to get that one though.",
  "I actually don’t even know yet I’m still waiting for it to come in. I really hope the hinges dont break over time",
  "definitely keep me updated on how things go! i wish the best of luck on your laptop experience.",
  "you too! In whichever you pick",
  "Worth $650 for incoming CS student Cop or drop, going into cs and may use for some casual gaming? Don’t know if this is an actually good deal or just marketing shenanigans.",
  "All in all it's a great deal (coming from someone who'd pay at least 1k for this in europe), but it doesn't fit your needs all too well.\n\nIf you want to play somewhat demanding games but don't plan to play any too-intensive ones, go for a laptop with an RTX 3050 (like the ASUS Vivobook 15 OLED D3500) or the like. You can find them for pretty cheap, as well. If you have a higher budget, find something with an RTX 4050, it's a bit more capable and more future-proof.\n\nAlso, my condolences for having chosen cs.",
  "I own this laptop. It’s great. Amazing battery life, good performance, and fast RAM. I have two external monitors that I are almost always plugged in. I regularly have multiple applications running at once as well as 25+ chrome tabs open, and it still runs fast. I’ve never tried gaming on it, though.",
  "Worth it",
  "yes",
  "I recommend the Lenovo Ideapad 5 2-1. I’ve had it for months and never had problems with it! It was 500 ish dollars at Micro Center. The battery is great and for casual gaming, it’s awesome. I mostly play dead by daylight, dying light, supermarket sim, terraria, or lockdown protocol on it and it runs these game fairly well. I got the intel 7 with the intel graphics, 16 inches. It’s truly everything that I needed checked off. Cheap, plays non heavy games (it’s able to run dying light well which I love), large screen and touchscreen, great camera, okay mic, and can run heavy engineering programs well!",
  "$50 you get a Zenbook 14 OLED with a much better specs and screen.",
  "I think it's a good price.",
  "It's fantastic for the price and will be a perfect option for CS. \n\nIt however is not a gaming laptop. Will get hot and not run AAA games well.",
  "i mean, why do you want it 2 in 1? it basicaly makes every other component way more expensive compared to a normal laptop, you only buy 2 in 1 if you are going to use 2 in 1, like for taking notes or drawing",
  "Best bang for the buck cs device is a m<1> Mac. You don't need anything stronger and it will last years.\n\n- source did my degree on a sandy bridge Intel chip only a few years back now.",
  "Walmart had the M1 MacBook Air for $650. No issues for me except I would definetly be better with more than 256GB of storage. Nothing stopping you from connecting external storage which I do. Also the battery life is insane which is the main reason I wanted it in the first place.",
  "How’s the 2-1 or do you just use as laptop?",
  "But for a CS student wouldn't be very good because of compatibility with the software needed",
  "To be honest, I have the two in one, but I’ve never even touched the touch screen once. Only use as a laptop.",
  "Watch out for the Mac fanboys, they can run any programs on Mac and suggest anyone to get a Mac. They down vote anyone that dare to question Mac’s compatibility. I’ll probably get downvoted even more than you, but someone has to spit the truth. Cheers.",
  "For cs most software works better on unix based oses like macos over NT (windows) \nBut this cancels out because probably most proplr in your uni including your professor would use windows and also you can do sorts of things like wsl if a problem comes up\n\nWhat software are you thinking about in cs? Theres just visual studio i guess…",
  "People have said Parallels gets the job done",
  "What's the difference between these two laptops? ",
  "While I'm posting here, is this laptop even good for me? Will be used for general college work and video editing, I have a budget of $1000. Need it to last 5 years. All my research has led to the yoga 7i",
  "one comes with ai bullshit one is normal with no ai bullshit 😊",
  "Id get the one with the ryzen 7 much better integrated graphics",
  "The difference seems to be Intel™ Defective Cpu tax",
  "The cheaper one is better, but it doesn't come with a pen, which will cost you like $30-100, depending on which. It's likely a Microsoft Pen Protocol (MPP 2.0) stylus, and the MS Surface pens are excellent.",
  "I think its CPU. And I'd pick AMD.",
  "Do yourself a favor and ignore the posts of the others as they're clearly clueless. \n\nI do recommend AMD over intel almost all the time however in this case based on your needs the intel is the way to go, video editing heavily relies on encoder. AMD's vcn encoder is lightyears behind intels QuickSync encoder, infact Quicksync even pulls ahead NVIDIA's NVENC, which is by no means a small feat. \n\nIf video editing is a priority, you're basicially stuck with Intel, even tho AMD has intel beat in any other department.",
  "Lenovo trash",
  "One is Intel, one is AMD. The color on the AMD is supposed to be Arctic. The AMD one is the same price from Lenovo with a coupon, the Intel model is actually cheaper from Lenovo. I hesitate to say that these will last you for 5 years with only 16GB and 1TB, but they don't come with more memory. For $50 more, $999, there's an HP with the same Intel 155u but 32GB of memory and a 2TB SSD.\n\n[https://www.bestbuy.com/site/hp-envy-2-in-1-16-2k-touch-screen-laptop-intel-core-ultra-7-32gb-memory-2tb-ssd-glacier-silver/6572057.p?skuId=6572057](https://www.bestbuy.com/site/hp-envy-2-in-1-16-2k-touch-screen-laptop-intel-core-ultra-7-32gb-memory-2tb-ssd-glacier-silver/6572057.p?skuId=6572057)\n\nOr there's an MSI for $849 with 15.6\" screen, Ryzen 7 7735HS, 32GB. It only has a 512GB SSD but it's upgradeable. And it has RTX 3050 graphics.\n\n[https://www.bestbuy.com/site/msi-thin-a15-15-6-144hz-gaming-laptop-fhd-amd-ryzen-7-7735hs-with-32gb-nvidida-geforce-rtx-3050-with-4g-512gb-ssd-cosmos-gray/6595455.p?skuId=6595455](https://www.bestbuy.com/site/msi-thin-a15-15-6-144hz-gaming-laptop-fhd-amd-ryzen-7-7735hs-with-32gb-nvidida-geforce-rtx-3050-with-4g-512gb-ssd-cosmos-gray/6595455.p?skuId=6595455)",
  "Price",
  "The difference is $309. 7 is AMD CPU and 7i is Intel. If you choose between the two, that AMD is a solid bet. \n\nNeither of these will last you 5 years with 16GB ram. You want either expandable or 32GB upfront.",
  "Check Best Buy open box items just snagged an Alienware m16 for 791",
  "How did you skip the 1080p vs 2k screen part?",
  "Out of these two the Ryzen is a better all round system for your needs. Let alone being $300 cheaper. \n\nRyzen machine has a much well rounded cpu with better battery life. Intel model would have a higher peak but both are still more then fine. The Ryzens big feature for you though is the built in GPU, much better than intel - this will help more with the video editing. \n\nLastly the 16gb ram. I don't agree with others here. For general college work this is perfect and will last 5-6 yrs. The video editing is where it may struggle if you go beyond basic 1080p hobby editing. 4k would be a push with 16gb and you'd probably want a dedicated gpu.\n\n\nEither way go for number 2",
  "It's probably not gonna last you close to 5 years due to lenovos bad hinges and power button placement",
  "Why not Dell or Acer?",
  "A 3050 for $849 with only 512gb of storage is a joke and a scam. I've seen 4050s go for hundreds lower. Don't buy a 3050 unless it's in productivity/creator laptop or extremely cheap like $500 or less. The first option is a little more reasonable. Also for college and video editing 1tb should be more than enough, plus a lot of people put their video footage and files on external drives anyways. Ya and the intel 155u comes with the arc 4 core igpu which is much weaker than a 780m. The ultra h series chips come with the more powerful arc 7 and 8 core igpus which is a more direct competitor to thee 780m and 680m which isn't listed here.",
  "Thats a crap chassis from MSI, it wil have broken hinges next year.",
  " Mostly agree although quicksync on an intel chip could be helpful for video work",
  "Thanks so much for the detailed comment, really helpful. I recently came across the HP Spectre 360 on sale for $1000, how would that compare?\n\n[https://www.hp.com/us-en/shop/pdp/hp-spectre-x360-2-in-1-laptop-14t-eu000-14-7k635av-1](https://www.hp.com/us-en/shop/pdp/hp-spectre-x360-2-in-1-laptop-14t-eu000-14-7k635av-1)",
  "Thanks I just ordered a couple refurbished yesterday. Appreciating all the comments lol",
  "lenovos hinges and power buttons not mounted vertically are way better than other dells, hps and others.",
  "I've had a Lenovo legion laptop for almost 5 years, and it still looks like the day I got it.",
  "With just a quick look the only Dell or Acer laptops I could see in your budget were refurbished. They tend to be older models.",
  "The Lenovo would perform better but the spectre is a more premium device. Especially good when you consider the Lenovo is $350 cheaper.",
  " these aren't legions...",
  "Official websites mate. Amazon has a very limited choice. I'm talking new.",
  "I'm aware. Traditionally, Yogas are built better than the legion 5...",
  "the last two flex and yoga 2-in-1's i've had, the screen hinge separated from the chassis at about 24 months.",
  "Is this a bad buy? Need a laptop for college this fall for civil engineering. Never had a laptop so Im kinda lost here. Thanks guys.",
  "No, it’s a Best Buy.",
  "I have the one in the second pic with the Ryzen 8840HS currently, and I also had the one in the first pic with the old i7 1165g7 back in 2020/2021.\n\nBoth of them are pretty similar build wise, they are metal Yoga laptops and feel and weigh basically the same due to their similar size, but I wouldn't pay more than $300 for the older one due to the older battery and the performance. I got the new one with the 8840HS when it was on sale for $649 and it performs way better and has longer battery life than the i7 version did when it was new.",
  "Not bad, It Is a good price, but since Is used make sure tò get some more photo, also of the sceen",
  "Bruh 😂",
  "Jokes aside, my two cents: \n1. Get a smaller laptop as you’ll be dragging that thing around with you from class to class. \n2. Don’t get a touch screen on a laptop. You’ll hardly use it and pay more because of it. \n3. Go to your department and ask someone to see what software you’ll be used for your degree. If you’re going to do some 3D stuff, might be worth getting a laptop with a dedicated gpu. \n4. Don’t get laptops that turn into tablets, those type of hinges add an extra point of failure. \n\nIf you want to take digital notes in classes, you’re better off getting an iPad or iPad mini with an Apple Pencil.",
  "Need some perspectives on my final choices of new laptop purchase Hello laptop experts/enthusiasts!\n\n  \nI'm in search of a new laptop and have been using an old desktop for more than 10 years and am not too familiar with the laptop market. I have been doing some homework and trying to get a grasp of the specs and how they pertain to my needs.\n\n  \nI plan to continue using my desktop (which maybe just need an upgraded memory as it only has 8GB and I frequently get \"your computer is low on memory\" messages. The laptop will be used mostly plugged in at home, and occasionally be taken out for some light video editing (I'm an artist and need to edit self tape auditions but nothing fancy in terms of graphics or rendering, just cut and paste filmed footage together, adjust audio levels, crop, and fade transitions), web browsing, and media consumption (YouTube, NetFlix, and video playback of films that I physically own, mostly DVD quality and some Blu-ray). I prefer to keep an equipment long term and don't plan on replacing/upgrading every few years, though I understand tech moves quickly and laptops do become obsolete relatively quickly compared to other electronics.\n\nI live in Canada in the west coast and have a budget of around $1000 \\~ $1200 CAD\n\nNote: I don't need ample storage as I plan to store my data on a 5TB external hard drive, so the lower the onboard storage the better as that would lower the price of the laptop. I also don't need AI.\n\n\n\n(I have added taxes in the prices I've listed below for accuracy)\n\nAsus Zenbook 14\" OLED (i7 13700H, 16GB/512GB SSD)\n\n$1232.49\n\n[https://www.staples.ca/products/3098023-en-asus-14-touchscreen-laptop-intel-core-i7-13700h-512gb-ssd-16gb-ram-windows-11-home-bilingual?listId=search](https://www.staples.ca/products/3098023-en-asus-14-touchscreen-laptop-intel-core-i7-13700h-512gb-ssd-16gb-ram-windows-11-home-bilingual?listId=search)\n\n\n\nLenovo \n\nIdeaPad Slim 5 16\"\n\nRyzen AI 7 350, 16GB/512GB SSD\n\n$895.99\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-ai-7-350-16gb-512gb-ssd/19355524](https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-ai-7-350-16gb-512gb-ssd/19355524)\n\n\n\nYoga 7 14\"\n\nRyzen 5 8640HS, 16GB/512GB SSD\n\n$861.28\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-5-8645hs-16gb-512gb-ssd/17756080?source=search&adSlot=1&slotPos=1](https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-5-8645hs-16gb-512gb-ssd/17756080?source=search&adSlot=1&slotPos=1)\n\n\n\nRyzen 7 8840HS, 16GB/1TB SSD\n\n$1006.88\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7-2-in-1-laptop-14-ips-glass-ryzen-7-8840hs-16gb-1tb-ssd/17904929](https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7-2-in-1-laptop-14-ips-glass-ryzen-7-8840hs-16gb-1tb-ssd/17904929)\n\n  \nI was really leaning towards the Asus Zenbook 14 and was set on getting it but I keep hearing negatives about its build quality, battery life and longevity (my brother had a Zenbook from 10+ years go where his SSD failed within one year, and he had it replaced under warranty, and it failed again quickly after that; there's also a ton of negative reviews on it on Taiwanese forums). It is the priciest of all the final options I have probably due to the OLED display which is really nice to look at, but I'm not sure if I'm willing to deal with the trade-offs (if they're true).\n\n  \nThe Lenovo Yoga 7 with Ryzen seems to be a good option for my budget. Though I'm noticing the Yoga 7i with Intel processor is significantly more expensive in my region:\n\nLenovo Yoga 7i 14\" (Ultra 5 125U, 16GB/512GB SSD)\n\n$1343.99\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7i-14-2-in-1-touchscreen-laptop-storm-grey-intel-core-ultra-5-125u-16gb-ram-512gb-ssd/17732148](https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7i-14-2-in-1-touchscreen-laptop-storm-grey-intel-core-ultra-5-125u-16gb-ram-512gb-ssd/17732148)\n\nI'm wodering if there's significant advantage that the Intel Core has over the Ryzen that justifies the price increase? Though the pricing might be the way they are due to the promotions they have at the moment. \n\n  \nI think that's all I have for now. Please help me choose, or offer any insights/knowledge you might have! First hand/real world experience with any of the aforementioned models are always greatly appreciated!\n\n  \nThank you in advance for your time! ",
  "The Dell 14 Plus is a good option to add. They also have a sign up coupon for 10% off: https://www.dell.com/en-ca/shop/laptops-ultrabooks/dell-14-plus-laptop/spd/dell-db14250-laptop/caedb14250hbtshksp\n\n\nThe newer Intel Lunar Lake (256V, etc) CPUs offer good performance with greta battery life and has a great integrated GPU.",
  "Thank you for the rec. Will check it out!",
  "Best Choice? Hello,\n\nI'm in the market for a new computer as I just started grad school ( business, so mostly web browsing and excel) and my [current laptop](https://www.bestbuy.com/site/asus-flip-2-in-1-15-6-touch-screen-laptop-intel-core-i5-8gb-memory-1tb-hard-drive-black/2995123.p?skuId=2995123) is from 2015 when I started undergrad.\n\n\nI narrowed my search to these 3:\n\n[Lenovo Ideapad 5](https://www.costco.com/Lenovo-Ideapad-5-14%22-2-in-1-Touchscreen-Laptop---AMD-Ryzen-7-8840HS---WUXGA-(1920-x-1200)---Windows-11.product.1816898.html?sh=true&nf=true)\n\n[Lenovo Ideapad Slim 5i](https://www.costco.com/Lenovo-IdeaPad-Slim-5i-16%22-Touchscreen-Laptop---Intel-Core-7-Processor-150U---WUXGA---1920-x-1200-Display---Windows-11.product.1816969.html?sh=true&nf=true)\n\n[Lenovo Yoga 7i](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-9-14-inch-intel/83dj0003us)\n\nAny significant differences between Ideapad, Ideapad Slim, and Yoga?\n\nAny significant differences between AMD Ryzen 7 8840HS, Intel Core 7 150U, and Intel Core Ultra 5 125U?\n\nThank you in advance",
  "First one, the amd two in one is def a good deal especially if you like the two in one feature.",
  "First fosho, that’s a great price and I *love* having a 2 in 1. If you are a student, see if you can get a discount to bring that down even more and that will be a godly deal",
  "In this case choose AMD Ryzen 8000 Series over Intel Meteor Lake U Series. Similar battery efficiency but the AMD has better integrated graphics.",
  "First one, no contest",
  "Lenovo IdeaPad 5 2-in-1 WUXGA IPS AMD Ryzen 7 Octa Core 8845HS - (16 GB/ 512 GB SSD/Windows 11 Home) 14AHP9 2 in 1 Laptop (14 inch, Luna Grey, 1.6 kg, With MS Office) is way better with better GPU",
  "1",
  "Pure garbage. Don't buy this thing, many reported hinge problems including mine. Few months after the 2-year warranty expired, my left plastic hinge cover cracked and crushes the display glass. Thankfully the LCD still works fine, touchscreen is dead 1/3 of the display. \n\nTried to complaint to Lenovo service center and whaddya know, 2 people also had the same problem (they still got their warranty). Unfortunately they couldn't do anything.\n\nThe screen is also dim and muted in colors. The addition of touchscreen is nice, but not as nice when it broke. Do yourself a favor and get a Thinkpad or Ideapad 5 Pro if you're going Lenovo as they are much more robust.",
  "I have the second one, the Slim 5i and I would not recommend it for $700 in 2025 for three reasons.\n\nIt is slim but takes up a lot of surface area with the taller 16:10 screen ratio. Not something you want to carry around. \n\nThe big screen would be great but it isn't color accurate or bright. Has a 45% NTSC rating where everything including YouTube feels washed out with a layer of white colors. Basically the same screen they were using in 2021, and likely just threw it on here because they have a lot of old stock.\n\nThe internals feels underpowered and lacks quality. Trackpad makes a flimsy clicky noise, keyboard isn't as polished with key travel, speakers sound tinny with no bass, webcam feels like a phone camera from 2015, it doesn't have 40 GBps thunderbolt 4 instead just basic 5GBps USB c ports. The Core 7 is a rebranded 2023 processor, not to be confused with the new Core ULTRA 7 processor from 2024.\n\nIf you haven't already you can go to a Costco and see these on display and play around with them. I doubt this lasts anywhere near 10 years like your old laptop, maybe just 3.",
  "duly seconded. the processor is a beast, the laptop itself is a good size, and it's too good of a value",
  "the second one is a bad deal considering the processor......its no way near close to the 8840hs performance...also the IGPU is very good",
  "you're right!",
  "Help me choose between these laptops # candidates\n\n- Asus vivobook s14: oled screen (FHD 60hz), 16GB/1TB, intel core ultra 7 256V, 70whr battery. \n- lenovo yoga slim 7 AMD: oled screen (FHD 60hz), 32GB/1TB, amd ryzen ai 7 350, 70whr battery.\n- lenovo yoga slim 7 intel: oled screen (2.8K 120hz), 32GB/1TB, intel core ultra 7 258V, 70whr battery.\n- acer aspire 14 AI: oled screen (FHD 60hz), 32GB/1TB, intel core ultra 7 258V, 65whr battery.\n- acer aspire 16 AI: oled screen (3.2K 120hz), 32GB/1TB, intel core ultra 7 258V, 70whr battery. (Just because it's the acer with a bigger battery)\n\n# comments on choices\n\nOnly 1 asus model because any of the zenbooks are 4 to 6 hundred euros more expensive.\n\nReviewers praise zenbooks, and say yoga and vivobook are a little behind\n\nI don't like the 16gb ram of the asus but it's the cheapest so it's ok.\n\nAcers have apparently worse build quality, battery life and screens compared to asus and lenovo according to reviews. But other says it's totally okay for the price.\n\n# my opinion (correct me if wrong)\n\nI'm leaning toward lenovo, but i don't know which. intel had several problems in previous years, everyone said AMD was on top. Now they say lunar lake is smoother than ryzen AI, even though amd can be more powerful at times. Is intel the right choice?\n\nHowever I'm worried that the 3k screen will result in bad battery life.\n\nTherefore I considered the other models. the Acer A14 has 1 more usb port and double the RAM of the asus for only 20€ more. Although the acer has a slightly smaller battery\n\nIs the 256v enough? I want to keep this machine for several years and hopefully have it be smooth.\nOr do you need at least a zenbook with a 255H to have a good laptop? Were the reviewers right?\n\nAll the models are also oled for some reason, i am reasonably worried about burn in so i wouldn't have minded a bright IPS, but it wasn't a choice.\n\n# why i need help\n\nWatched and read several reviews and video comparisons of these chips and laptops. Unfortunately none of the reviewers actually had these exact SKUs (even reviewers in my region), so someone complaining about screen quality while having a worse screen or boasting good battery life with a FHD screen instead of a 3K oled is not really helpful. Also price varies differently and what is perceived cheap/a good deal is very different in different markets.\n\n# what criteria did i use to choose these laptops?\n\nI need windows and i want decent battery life. I avoided ARM for compatibility issues.\n\nI'm leaning heavily to newer lunar lake/ryzen AI chips for declared battery life. I would assume none of them actually reach the ~20h of claimed battery life, but i would hope for at least half. I'm hoping to get 10-12h of usage with several chrome tabs (<10), office programs (word, powerpoint) and video calls. (High school teacher). No gaming. Maybe some occasional very light video editing, meaning putting a presentation together for school.\n\nI need at least 6-700gb of space for my work, so 1tb SSD is a must.\n\n16gb of ram is enough now, but since these new intel chips cannot have the ram upgraded i prefer 32 for future-proofing\n\nI would actually prefer a FullHD screen to get more battery life. Don't really need higher resolution at 14\".\n\nI need a light device, easy to carry, but i don't want it to run HOT and having loud fans because of restricted/poor thermal design\n\nI tried to find models with dark keycaps, because i want them to be easy to read.\n\nHDMI port is a must, so are as many usb ports as possible, and I need at least 1 fast usb C for video+charging so that i can connect to a dock.\n\n# why only these specific models?\n\nI have to buy a laptop because my old windows 10 is slow and i need to upgrade to w11 before w10 is EOL.\n\nI have to to buy it from a retailer because my job gives me up to 1000$ gift card (anything over i pay)\n\nThis gift card format is not supported by laptop manufacturers websites, only physical retailers in my country and Amazon. Therefore i cannot go to a manufacturers website and order a laptop to my desired specifications, i have to find a suitable model between the one available in stores right now.\n\n",
  "new laptop experience: lenovo 9i 2-in-1 & omnibook ultra flip My old Yoga c920 (bought in 2018) ended its own life a couple of months ago, so needed a replacement 2-in-1. Discovered I wanted a Lunar Lake cpu, as on the HW side my main wants are single threaded processing and battery life, so LL suits me perfectly. Also, I care about build quality, I want at least several years of usage.\n\nFound that by far the best reviews are [https://www.notebookcheck.net/](https://www.notebookcheck.net/), but its a bit awkward to get the ones you want listed neatly.  Go there, select \"reviews\", search once & it will show advanced search options, set device class to \"convertible\" and type of review to \"notebookcheck reviews only\".\n\nSeems clear that right now the Lenovo Yoga 9i 2-in-1 and HP Omnibook Ultra Flip are the best candidates (also: ASUS Vivobook Flip looks good; and Thinkpads are nice but battery is not so good).\n\nImo Lenovo has an really unacceptable amount of \"bad hinges\" reviews around, mostly on their mid/low end machines: the cause is that they've been using glue where they should be using screws to attach the hinges to the display chassis (many other manufacturers also do/did this - however my old c920 with the \"watchband\" style hinge did it the proper way). For this reason I avoided the Yoga 7 series entirely, maybe they've fixed its problems by now but idk. With the Omnibook Ultra Flip you can check its maintenance manual online and find a diagram showing that all of its hinges are screwed into the metal chassis as they should be (looks not that hard to disassemble either). However Lenovo treats the whole display+hinge assembly as a single \"FPU unit\" which means you can't see inside it in the manuals to find out what's going on, or easily disassemble.\n\nSo I bought the Omnibook and it arrived 24 hours later. Build quality on it felt really great, looked like a really nice machine. Sadly the keyboard was not a proper UK keyboard (tbf to HP they do warn about this  - [https://support.hp.com/sg-en/document/ish\\_7481525-7481612-16](https://support.hp.com/sg-en/document/ish_7481525-7481612-16) \\- but I hadn't noticed it). It is just a US layout with some keys relabelled afaics. Result is that, for the UK, backslash is in totally the wrong place and is obtained as fn+L, also enter and backspace are the wrong shapes & in slightly wrong place. So back it goes, I use all those keys a lot and I'm not spending this amount of money to have to fiddle with a different keyboard layout to all my other machines. HP support was easy to deal with, they accepted the return without any problems or extra cost.\n\nSooo I bought the Yoga 9 2-in-1 as second choice. Only the \"aura edition\" is available currently in the UK, so I have that. On that:\n\n\\- It doesn't feel quite as solidly built as the Omnibook ultra did, but it still feels very good. I'm happy here, but can't tell if hinges are screwed in screen chassis vs some less good construction, so I'll just have to treat it gently.\n\n\\- Screen is awesome. I have the 2.8K screen, which all reviews recommended over the 4K. (Had some fun with my custom rainmeter skins and UI scaling but sorted it out.)\n\n\\- Battery life is very good, I get well over a whole days usage doing light work on it.\n\n\\- Keys and touchpad feel good, I don't think I am very fussy here. See bit below about the \"extra\" keys on the lenovo 9 series.\n\n\\- Ofc I've gone for a 2-in-1 because I sometimes need to write on the screen. It came with a pen that works well. The screen is smooth glass - I guess it is not as nice as e.g. a Remarkable tablet to write on, but it still works well. I made a presentation with 25 handwritten slides as the first usage of the new machine, no complaints.\n\n\\- No fan noise unless it is under load. I'm happy using it.\n\n\\- It took about 3 weeks to arrive.\n\n\\- I got the \"base\" lunar lake 9i 2-in-1 model with the 256V and 16GB RAM. If you need more RAM (I don't) then maybe worth getting one of the other models, otherwise not worth it afaics.\n\n\\- There is some bloatware but its easily dealt with. I have no idea what all the \"aura\" stuff even does, probably uninstalled it without using it, idk. Also my first time doing anything non-superficial with win11...  seems like many of win11s original UI regressions on win10 have been sorted out, but the Win11 taskbar/startmenu is still a horrible disaster (it still looks like it was built for a phone ffs) so I did get Stardock Start11, and that works nicely.\n\n\\- All the \"AI\" stuff isn't much use to me. It's cute that windows Click To Do can recognize text from within images but I can't find anything else useful than it can do (also, that really did not need a special chip with 40 TOPS...). I tried asking questions to copilot a few times and it was waste of time - for simple stuff it was no better than better using a search engine yourself and for complicated stuff it just talks crap.\n\n\\- There is a row of four \"extra\" keys on the right of the keyboard. They get in the way a bit at first but I've got used to them in about a day - had to learn that \"smack little finger down near edge of laptop\" is no longer a good strategy when I want to press enter. Overall I like the features these keys access but I'd rather the keys weren't there, not the best use of space imo, but its ok. (Page up/down + home + end keys would be more useful imo.)\n\nI didn't find much info about the keys online so here goes: one changes the \"power mode\" (3 modes: battery, balanced, perf) and is fairly useful because the cpu has both P and E cores, so (amongst other things) it gives some control over which set of cores you want to be using. Discovered this by running hwinfo whilst changing the power mode.\n\nThe next one changes the \"audio mode\" and is totally pointless, the machine has great sound whatever mode its in. The third changes \"eyecare mode\" and is a slightly useful to me - I have f.lux on constantly filtering blue light, and this key then acts as a toggle to add some extra strength to the filter on top of what f.lux does. The fourth key is configurable, I set it to open my most-used application.",
  "hello there, thanks for this comparison. I'm currently deciding between these two. May I know if you have the 2025 gen 10 for the Yoga? Do you see any screen door effect on the Yoga? I currently have the Omnibook Ultra Flip 14, got it at a really nice price but the screendoor effect on the OLED display is killing the deal for me. I'm wondering if the Yoga also has the same issue?\n\nI was trying out a Yoga 7 Slim (with touchscreen), it doesnt have such issue.\n\nThanks a lot!",
  "Yes, the gen 10 (gen 9 does not have lunar lake). I did not see a screen door effect on either the omnibook or the 9i with 2.8K. Imo the 9i 2.8K has the better screen, but I would have happily had either screen.",
  "2.8 k def worth it over the 4k?",
  "Is this a good laptop? I bought this at Christmas for $449.00\nIs this worth it and good laptop?",
  "Not for that price you’re showing, being on sale for closer to $400, that’s better, but it’s hard to recommend anything with only 8GB of RAM. Check the Intel or the Ryzen 7 models with 16GB and wait for a sale. It’s not a bad laptop, the RAM is the only trouble with it.",
  "Junk",
  "For 449 it's a decent pick, however 8gb is too little. If you stick to basic tasks you will be fine though.",
  "According to the psref on that machine, it's soldered LPDDR5, which means no upgrading.  Even at $449, too expensive for 8GB soldered non-upgradable.",
  "It is worth it lol. For 445$, its a good laptop for general use.\n\nYes for 2024/25 Standard, the Ram is low and not upgradeable. But for the price its hard to beat.",
  "Absolutely not for that price. 8GB ram is not cutting it in 2024, let alone tomorrow in 2025 ;). I'd suggest trying to look for a laptop with at least 16 GB of ram if you want to be able to use it a couple of years.",
  "He already bought it, too late for that.",
  "For $449, just upgrade the ram",
  "$449",
  "If it’s from Best Buy, the return period is until the 14th",
  "True but the photo showed 700$",
  "You can't, these ones have soldered ram.",
  "What laptop to buy? I already have a high end gaming pc and my laptop which I use to take to campus for homework on the go. My current laptop can’t even hold a charge for 30 minutes now and is about 9 years old so I think it’s time to upgrade. I don’t need anything to play games with because I have my pc I just need something fast, able to process my vs code, and multitask. I don’t have a huge budget but I saw this one and I’m wondering if it’s good for what I want. I’m pretty knowledgeable on the desktop world but know nothing of laptops.",
  "This is really good laptop for the price point. This could easily cost 200$ plus without sales. The processor is really good. The only drawback is, it uses a bit cheaper ips display, which don't have good color reproduction (Really usable, but don't use for any editing works). Also a bit on heavy side as well, around 2kg. For full specs: https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7-2-in-1-gen-9-(16-inch-amd)/83dm0003us (does actually cost 900$, So the deal is really good) \n\nMaybe u can get better deals during Black Friday. Still a really good laptop for the price.",
  "I have tried the previous gen, it was awesome. \n\nCareful with this specific model the screen isn't on the bright side and color coverage is only 45% NTSC.\n\nThe processor and integrated gpu are good, so don't worry much about performance.\nRam is not upgradable so make sure 16GB is all you need.",
  "Lol it’s like one on the best possible portable no gpu laptop, for the price in France it’s crazy good, idk for other countries tho (800€ here)",
  "I found a review for the Intel model:\nhttps://www.notebookcheck.net/Lenovo-Yoga-7-2-in-1-14IML9-convertible-review-Classy-for-under-700.864443.0.html\n\nThis website is a really good source of information for Laptops, and it goes into the nitty gritty details if you are interested. \n\nBut to summarize, the biggest pros would be the Zen 4 processor. It is both efficient and really fast, enough to meet any programming needs. Build quality is A+ and is military-grade certified. Fan noise is quiet with this model. The warmest area under load reaches 38 celsius which is excellent and much cooler than average. Battery life is also fantastic (around 16 hours with the Intel model, and yours should last more). The 2-in-1 form factor is useful if you will take notes on it, but since this is on the larger and heavier side (16 inches), don't expect to use it as a tablet. \n\nSome average stuff about this laptop would be the speakers, display, RAM, and integrated graphics. When I say average I don't mean bad; they are perfectly acceptable. You can absolutely run esports titles on high fps, and older AAA games can run just fine (GTA V on the highest 1080p can reach 60 fps). The biggest downside would be the non-upgradeable RAM. \n\nGiven the awesome price, I would 100% go for it if you know what you are getting and not planning to run Cyberpunk or don't care about an ultra-portable laptop.",
  "yeah I think this THE deal for this kind of laptop, doubt you can go better",
  "According to \"The Greatest Technician That's Ever Lived\" (Salem Techsperts on YT), you should go down to your local electronics recycler, get a business grade laptop (think Thinkpads from the T and P series and Dell Latitudes) and refurbish it. Personally I agree, those laptops are perfectly fine and built to last (I did fall into the trap of buying a gaming laptop when I started college and now I'm paying the price for it)",
  "Can you share the link?",
  "The 16GB RAM is its achilles' heel, $549 seems about right for 16GB RAM",
  "Yeah I was thinking this. The 45% ntsc is not the best. It's acceptable if you know & accept what it will look like.",
  "Yeah like i said not super concerned on ram because I won’t be gaming at all on it. Just need a simple fast laptop to get the job done when I can’t use my desktop.",
  "You could buy it, however be prepared that the hinges might fail after 3 years of usage, because it just happens with almost all consumer laptops nowadays",
  "Is this a good laptop for an incoming university student? Will be doing extensive programming and photo/video editing",
  "Yeah it's really good. I have the same model but with the i9 13905H. I heard the ultra chip has better battery but a little less performance",
  "I use a $150 Asus for programming and video editing and it’s working well for me so I don’t see how this could be bad lol",
  "You could do way more than just video editing with this lol\n\nYes it's good, but if you really only want to use it for programming and video editing you could go for a cheaper model without any problems (this one should be quite good for gaming too tho)",
  "You could get a better GPU for that price",
  "unless you need the screen size, you might want to look at the 14” premium gaming ultrabooks",
  "Touchscreen will be heavier and worse quality than normal screen. Anything else is great! For student, I think weight and battery life are super important.",
  "Yes - very good.",
  "That is an excellent overall computer and honestly a very good price for it. That said you won't good battery life, so if you want to actually bring it to class, you may be better off with something that gets a little more battery life..",
  "You betcha!  My laptop was outdated when my dad bought it.",
  "Did you get it with a matte or glossy screen?",
  "\"Will this 1k usd laptop be good to read My pdf's and watch Netflix?\"",
  "I'm not familiar with computer specs, so does this one also have good specs?\n\n[Lenovo ThinkPad E16 Business Laptop](https://www.amazon.com/ThinkPad-i7-1255U-Business-Thunderbolt-Aluminium/dp/B0BDLBYQ4G/ref=pd_ci_mcx_pspc_dp_d_2_t_1?pd_rd_w=aZWWZ&content-id=amzn1.sym.568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_p=568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_r=G2AVW86X79434R0P0QJW&pd_rd_wg=0BO1M&pd_rd_r=be2b371c-fdc2-42da-a4b5-e0f7c7833a33&pd_rd_i=B0BDLBYQ4G&th=1)",
  "Op hasnt guven enough info on whether they even need a dgpu lol.",
  "Does this one also have good specs? Is it better or worse than the Yoga?\n\n  \n[Lenovo ThinkPad E16 Business Laptop](https://www.amazon.com/ThinkPad-i7-1255U-Business-Thunderbolt-Aluminium/dp/B0BDLBYQ4G/ref=pd_ci_mcx_pspc_dp_d_2_t_1?pd_rd_w=aZWWZ&content-id=amzn1.sym.568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_p=568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_r=G2AVW86X79434R0P0QJW&pd_rd_wg=0BO1M&pd_rd_r=be2b371c-fdc2-42da-a4b5-e0f7c7833a33&pd_rd_i=B0BDLBYQ4G&th=1)",
  "What are your thoughts on this laptop?\n\n[Lenovo ThinkPad E16 Business Laptop](https://www.amazon.com/ThinkPad-i7-1255U-Business-Thunderbolt-Aluminium/dp/B0BDLBYQ4G/ref=pd_ci_mcx_pspc_dp_d_2_t_1?pd_rd_w=aZWWZ&content-id=amzn1.sym.568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_p=568f3b6b-5aad-4bfd-98ee-d827f03151e4&pf_rd_r=G2AVW86X79434R0P0QJW&pd_rd_wg=0BO1M&pd_rd_r=be2b371c-fdc2-42da-a4b5-e0f7c7833a33&pd_rd_i=B0BDLBYQ4G&th=1)",
  "I got the glossy screen because it gives more contrast and the colors pop more. However, in direct sun you can still see your reflection. If you work near windows you would be better off getting matte",
  "Lol yes\n\nFor the stuff you want to do 16gb ram 512gb ssd is enough, and you don't need a high-end gaming gpu",
  "Why wouldn't you get the max for your money. He picked a computer with a GPU. Lol he could get a 14900hx and 4070 for that price",
  "E16, it goes with an old gen-10 processor, Yoga is super powerful, but the battery is not great on paper, so it's the only downside I think.",
  "U mean the Helios Neo 16?",
  "Is this a good deal? Are there any other laptops similar to that price range you would suggest",
  "I got this for the same price, had it for like two months I absolutely love it definitely worth it",
  "if u dont plan on gaming at all ig its worth it",
  "If you don't plan on doing any heavy gaming then yeah it looks decent",
  "The 155H was a lot better I think (I forgot the price range though), same for AMD but it's still a very solid deal. What do you plan on using it for?",
  "Yes for everyday use not for gaming i bought the 125u ultra 5",
  "The only difference is mine has an amd instead of an intel processor",
  "Does it have any lagging issues ??? How it is for general use cases??",
  "Generally speaking it’s an awesome little cpu. I have it in the amd version and it’s quick and does all the tasks I need from excel spreadsheets and pivot tables to streaming in 4k and some old emulators gameplay. I bought it for this same price and am super happy with it. Upgraded from a 2008 Sony vaio!",
  "Which laptop should I get for uni I’ve been looking for a laptop for school but each one has problems I like the dell but I’ve heard it has trackpad problems,my other option was hp but I’ve heard of people have if hinge problems or Lenovo(doesn’t have to beep the one in the photo). Which one of these options are the best I don’t really know the difference a. And if you can please recommend any other laptops with at least 16 ram. I would like to use it for gaming nothing too heavy. If you have one of these can you tell me your experience",
  "Looks like a good pick. You would be fine. My personal rules when looking for a laptop are: \n- get Lenovo (Acer/Asus can have good cheap laptops, but Lenovo is solid and can be pretty cheap) \n- AMD not Intel (Intel can be good, but they've had stability issues recently and I personally wouldn't buy a new Intel laptop)\n- at least 16gb \n\nThere's a lot of great YouTube videos. Also you could get a really cheap refurbished thinkbook from Amazon for around $200, but it wouldn't be able to game.",
  "Do NOT go for 15\" or 16\"laptop.   \nGo for 14 or 13.   \nYou will thank me next year.",
  "None of those.\nBuy a snapdragon X laptop or a MacBook for uni.\nUse nano review to compare them.\nPrioritize display, build quality and battery life.",
  "Go with the 3rd one. The others are a oxidation hazard. Can also upgrade with an another 16GB RAM for cheaper.",
  "HP does have reputations for hinges breaking so, I would say to get a Ryzen laptop from Lenovo. Or use Macbooks. Unless you like dealing with browser applications, don't get the Snapdragon X series laptops. Intel, hmmm, oxidisation. No no. Ryzens have pretty good battery so, do get them.",
  "Seems you want the 16\" screen because of gaming, but have you thought about portability? That could become a bit annoying to carry it after a while",
  "Honestly, for uni 16 inch laptops can be pretty annoying and the 14 inchers are perfectly fine. I would find a 14 inch alternative to these",
  "Look for snapdragon laptops! Surface laptop 7, yoga slim 7x etc.",
  "What types of games will you play in this?",
  "Which one has the higher max display resolution? i would go with that.   \nWould double check if either of them have issues with upgrades you might want to make in the future (like soldered ram or not enough slots for additional ssds or pcie modules)  \nWould also double check the ports and see if there is anything you dislike about their respective layouts that could deal break one of them.  \nFinally I would also double check how many displays and resolutions each one is capable of (with and without an adaptor) incase you want to add more in the future.",
  "Only the Thinkpads are good. The Yoga is pretty meh. No different from the H(inge)P(roblem)s",
  "This",
  "This",
  "What about asus?",
  "Laptop charger I’m not sure where my laptop charger went so I was going to order a new one. Will this charger work https://a.co/d/7l8QkZt for the laptop pictured?",
  "Go for a ugreen or Anker one. Don't go for the cheapest thing.",
  "Which do you recommend, can you link me to one? \n\nEdit: I found a 65 watt charger from green. Will that work even though the max wattage for my laptop is 67?",
  "It might work but will be slower"
]