[
  "Guys is this genuine? Like seriously 1 rupees? ",
  "likely a phishing page, open a new tab type \"store.lenovo.com\" manually and make sure it's still in your cart there",
  "Proceed with caution. For that price, I'd say to just go ahead and buy it and see what happens, considering you're on [store.lenovo.com](http://store.lenovo.com), but I'm still very suspicious about it. There's no reason they'd actually sell anything for that price, unless it was a mistake on the website. However, if it is a mistake and it lets you place the order, it's possible that they might still honor the purchase and just eat the loss as a result of their mistake and still send it to you. It looks like the actual Lenovo website. Look closely at the URL, and type in the Lenovo website URL manually and navigate there directly to make sure you're at the right place. If you still see it there, maybe try and see if it lets you order.",
  "Try and find . Pay 1 rupee",
  "If this is real some intern finna be fired",
  "Could be an accident. \n\nI found an issue on HPs website once and got some accessory stuff for Penny's on the dollar.",
  "Already seen that on the Lenovo Page. They released a new device and instead of 2000€ it said 200€ the Order got canceled. Might be mistakes or Intention to get intention",
  "Looks like a scam",
  "Whenever I Google the Indian version of Lenovo's website, it takes me to lenovo.com/in/.\n\nFeels like a scam. If you have a prepaid debit/credit card, it may be worth trying. I wouldn't give any information linked to my bank if I were you.",
  "I have orderd 2 of them at 2 rupees , lets see what happens,  haha",
  "Show us the whole url.\n\nIf that's phishing, all they needed were your payment credentials.",
  "Well Rupees are a fictional currency from The Legend of Zelda video game series so I’d say it isn’t genuine.",
  "Next time just order it and don't post it on places like this",
  "they brought the store down since",
  "Do you think it can be true?",
  "Happened to me. Threatened them with commerce commission and they gave it to me",
  "Its a phishing site, just went to it myself, its pure fishy. Also look at the copyright in the bottom",
  "Just got a new pc! For some reason, every time I try to launch steam, it keeps giving me the error message \"Glory to the CCP.\" Any fixes?",
  "Go for it, the worst that can happen is you lose 1 rupee, the best outcome, you effectively get a free laptop, just make sure to use a single use card number (like zip pay single use card, or something similar)",
  "Use a throw away card from Walmart",
  "Check the website, yours might be fake.",
  "Make sure it's the actual site 1st and not just some phishing website to take your credentials and payment information",
  "How?\n\n**Edit:** I found the same bug. Placed an order. Few minutes later some guys from the store called and said they cannot sell it for ₹1 and cancelled the order.",
  "1 rupee and you still asking \"is this genuine\" how old are u boy?",
  "i think OP has done inspect element   \nhe just wanted some attention",
  "This is a scam for sure  it’s just a copy site and it’s even in html 🙃\n\nOfficial site : https://www.lenovo.com/in/en/laptops/",
  "Guys here is the url \nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Run it with PayPal and just see",
  "Bhai 2 4 mere liye karde paise deta mein",
  "Buy 2.",
  "Tip\nIf its too good to be true, its fucking scam.",
  "try to trace and get the complete URL and look for signs the website might be a phishing site.\n\nor you just found a pricing error and started chaos",
  "Checked. Website is genuine, having Google sign in option as well. The item looks like a wrong entry.. They will correct it and cancel orders before shipping.",
  "I haven't seen any malware that attacks android phones and modify the webpage content / hosts file to redirect you to a phishing page. Looks like a real website, but the pricing is definitely a glitch, which they would either honor it as another redditor mentioned, or cancel the order if you place it. Yet - the company has all rights to cancel an order at anytime and refund you the money. \n\n  \nI'd go for it and see what happens if I were you, no harm in losing a rupee. Virtual cards are best, I remember SBI had this feature at least 10 years ago but not sure now. Proceed with due diligence.",
  "It's only 1 ruppee... Plus shipping maybe? Not the worse scam I've ever seen. Because that's barely a profit",
  "Try and see if it actually arrives",
  "Make a rando paypal, add one dulla to it, disconnect your all your stuff form it, buy.",
  "It is just a glitch, but with a credit card and make sure they charge 1 r",
  "I'll take 8000. I can't figure out how to get the page OP is on though.",
  "hold on i gotta place that order",
  "Scam Alert ❗❗❗",
  "Why is that website so sketchy?  Visiting from the US and it still gives me info as if I'm in India?",
  "First you should paste the link so that other users go try it out. \nSecond you buy it and choose the shipping method as STORE PICKUP. \nLastly DON'T GIVE ANY BANK DETAILS EVEN IT'S FREE (they surely want consumers to prepay it).",
  "Not too sure but could of just been a fuck up on their end when pricing. Had it happen a few times on websites, once at JD sports with some AF1 marked down to $20 instead of $200 but they ended up refunding everyone lol and once with a skate deck that was FREE, again they just emailed me saying lol no 😂",
  "Rupees? Yeah totally legit. No scams ever.",
  "I have bad vision but it can’t be this bad to see 1 rupee",
  "It seriously went out of stock lmao",
  "What's the harm in trying bro",
  "Make sure that's really the store site (security certificate and all that).  It might be bait to get you to enter your credit card details.",
  "I guess not..",
  "For me it shows 137k",
  "I think it depends on your country's law system. For example, in Mexico, we have a consumer protection enforcer, which forces the seller to honor their stated price, even in case of human error or similar snafus. This has led to several incredible bargain stories over the years.",
  "Share us the laptop link",
  "I checked it. does show just 1 but currently out of stock. Update us OP",
  "[deleted]",
  "This happened with me too and then they cancelled the order after 2 days",
  "Looks like someone turned friendly fire on.",
  "Back end website error. Some one pushed a change to the store front and really fucked up. Lucky for you. Hope they don't catch it before it ships. Ive worked on retail websites and seen this happen.",
  "[store.lenovo.com](http://store.lenovo.com) its a malicious site nor official one, don't fall for it.",
  "It happened in my country once, and they honored the purchase. Mistakes happen sometimes.",
  "Think you cut out the banner there that should apply to you right?!\n\n[imgur](https://imgur.com/a/04Bwbtx)",
  "Aaw a similar thing for legion go for 90quid didn't trust it as the reservation counter always update over and over again.",
  "Go for it, but you might want to use a virtual credit card using for example Revolut. So you won't leak ur credit card info if this turns out to be fake :)",
  "Any updates?",
  "That's probably a colored cardboard brother...",
  "At best you get an almost free Thinkpad, at worst you're on a spoofed website that's collecting your credit card details. What could go wrong?",
  "Did you buy it or not?",
  "https://privacy.com\n\nNo reason to not give it a go. Use a burner card from above. First twelve each month are free.",
  "It’s an obvious scam jfc",
  "It's out of stock now 😭",
  "Better order 10 more",
  "Keep us updated OP!",
  "Bro at least sign in \nThen check the price",
  "That website looks suspicious to me.Your card might get blocked or u might get scammed.Lenovo website is secured website while the website you are showing is not secured.I would not make the payment.",
  "Credit card sir",
  "Please update us if it actually comes through",
  "You should not have posted this. You should have tried first. .\nExpect the order to be cancelled",
  "I am really interested to know if you really got it",
  "Just buy it whats the worst that can happen",
  "Order it but make sure you're at a public place and not near/at your house",
  "Link ?",
  "Pay with a throwaway account or if none make a virtual debit card from your banking app, set the lowest possible limit on it so it can't be used for scam, use it, purchase, receive and then delete that card.",
  "I would definitely take the bait",
  "Phishing or error.\nEither you get scammed or you get refunded",
  "So any update?",
  "In Germany it's a different shop. https://www.lenovo.com/de/de/d/sale/\n\nI would be careful",
  "They just want your bank details. Check at the end of website is it really lenovo website or a fake one",
  "i often buy mispriced products on aliexpress, and about 30% of the time i actually get them.",
  "Update us if it gets delivered",
  "They didn’t honour their error in my experience. I purchased a machine on a fantastic sale. The website said that they had it in stock. They in fact did not have it in stock. I only learned this after a month of waiting for it to arrive and it being in the ready to ship stage, still showing that they had stock. When the error was discovered they offered to cancel my order and find a machine that “fit” my needs at whatever price they were selling it at. No, I wanted a machine with the closest specifications at the price that I ordered and paid for the first one that you said you had in stock. They didn’t budge at all. I ordered a machine at $250, the next one that had the closest specifications was $750. The original price of the machine I ordered was $950. Some brands are better than others when it comes to errors. Lenovo isn’t one of them.",
  "i dont remember lenovo's official site looking like this. There was no green color, all the accents were black or red in my memory",
  "I had the same bug on the HP website, €1 for a computer that is worth €1,400, I paid but after a few hours my order was cancelled. They'll probably do the same to you, it must be a bug in the site.",
  "Order it I guess but pay with PayPal or something",
  "Could be a pricing error too. Order it",
  "Which store was it?",
  "Get one for me 😜",
  "If the website is legitimate I'd fuck around and find out 😂",
  "Is store.Lenovo.com strictly for India? I’m in Canada and it’s showing me rupees",
  "What do you fucking think?",
  "Well probably a key logger that want's your card details.",
  "Just create an internet bank account, deposit a small amount of money and purchase it. Simple, end of story.",
  "Yeah, genuinely stealing your personal information.",
  "Could be a price mistake. If you want try it out with a safe payment method",
  "link??",
  "any update what hapeend ,i am curious......................:;:::::",
  "obviously not legit. \n\nThe real website link is lenovo.com\n\nnot site.lenovo.com",
  "Plot twist...\n\nOP made this site so people go and buy/log in and THEY are now stealing your info. This seems way to scummy/scammy. \n\nWeblink isn't true. Copied page.",
  "Be careful could be a wrong Site or sometimes Like Amazon a Price Tag was wrong I could buy it but often the offer was then canceld",
  "Seems like that one incident where the gas prices were mistaken at a station and one comma was off (10 times cheaper price).\n\nAnd some dude was filling like the back of his truck with gasoline. Not sure how specific the action was, but basically they were taking advantage of the situation.",
  "RUN",
  "SCAM!!!!",
  "Purchasing a product at the advertised price isn't illegal. Not selling you a product for the advertised price is illegal in a lot of places. Hopefully in your country too.",
  "Use a burner card if you can. Doesn't hurt to try it.",
  "Is like one of those amazon errors where some products are like 1 dollar",
  "Send me the full link pls",
  "Well this is because the prices are set by the individual store owners. Something like that happened with me too. A laptop I wanted to buy was showing for 50% less at only one lenovo store. It was hella skeptical. I contacted that store and they clarified that is not the correct price and will be changed that morning. ",
  "Why is it when I go to [store.lenovo.com](http://store.lenovo.com) that it instantly sends me over to India?  I live in NY, USA.  That seems suspicious.",
  "cod karwa le",
  "https://ibb.co/7xSwZjMb\nhttps://ibb.co/Pz17nqVC\n\nCheck these links store .Lenovo.com seems to be a fake site. The actual one is Lenovo.com",
  "Try without keeping more than 5 rupees in your account. If it goes you are super lucky !",
  "Shouldn't have posted it on Reddit",
  "Make a wallet like family pay and pay 1 rupee with that and never use it again",
  "Use a prepaid one use Revolut card",
  "Store.Lenovo isn’t owned by Lenovo.",
  "Website copyright 2021 - Almost real. Its a scam don't fall for it.",
  "that is the Shipping price",
  "Hmm low risk...",
  "Never heard the phrase if it’s to good to be true it’s not?",
  "Is it's in India, everything is a scam, they even spread to other countries",
  "Link ?",
  "Link ?\n\nIf possible let us know if order",
  "Well, it's been 3 days, have you purchased it already? If so then no problem but if you're still planning to, then I would say they likely have corrected this mistake by now, or even earlier, like 10 hours after you saw it",
  "Might as well give it a shot lol",
  "Link shared by OP seems to be individual local store link and they are free to set their prices so someone probably made a typo. Ordering it will likely result in the local store cancelling it as 'Out of Stock' and 1 Rs. refund.\n\nHere's the online store link: https://store.lenovo.com/in/en/nb-yg-slim-7-14ill10-u7-32g-1t-11s-83jx001min-2191.html",
  "It's sketchy my malwarebytes browser protection on an android phone blocked it when I turned the protection off the page loaded. It's a phishing page.",
  "Any updates on what happened?",
  "It's a scam, check the cert\nThe main page is a wild card, the store subdomain is a free SSL cert from last week. Someone has poisoned the DNS most likely and stolen the sub domain? Lenovo has a year long cert from a different company and wouldn't be using a free public cert from last week.",
  "Naah.\nPricing issue maybe",
  "Naah, pricing issue maybe",
  "Browser inspect element go brr",
  "bro found the deal every parent is haggling for",
  "prolly not but 1 inr, might as well",
  "how to avail this offer, bro😭",
  "soon as you make an account or log in... it's likely gonna change the price. that shit happens all the time with aliexpress too",
  "Paid for my laptop 2 years ago\nAll fine, still have it\nIf tis official website youll be fine",
  "Buy it and see why happens!",
  "Had something similar happen with HPs website a few years ago - sadly my order got cancelled :(",
  "Pay with a gift card",
  "From my understanding, it seems that this site is acting as a marketplace where the verified Lenovo stores are adding their inventory and setting their prices based on their offers/etc. So, it might be that this particular seller listed this product at a mistake price.",
  "Any update?",
  "If it looks like a scam and sounds like a scam.....",
  "I guess he didn't get it.",
  "Use a through away virtual card with a limite and get it",
  "Did you ever get it",
  "Intern: oh shit i'm in danger",
  "This looks like either a pricing glitch or a placeholder/test price. Big brands don’t just sell ₹1.8 lakh laptops for ₹1 unless it’s some promo for employees or a contest. If it actually lets you check out and ship, you’re extremely lucky — but 99% of the time the order gets cancelled or refunded",
  "100% legit. Good deal",
  "probably phishing website \ntry to copy past the URL into different word processing apps like notepad and more > check carefully for discrepancies like ś that might pop out.",
  "Do it.\nWhat's the worst that could happen?",
  "do it bro",
  "[Real link.](https://store.lenovo.com/in/en/nb-yg-7-2-in-1-14ill10-u7-32g-1t-11s-83jq000nin-1525.html) \n\nPrice is showing up as ₹137,490.00 for me\n\nI would scan your shit for anything malicious",
  "scam, there ain't no fucking way lenovo giving out cheap ass price's, let alone a laptop.",
  "Obviously not",
  "In Brazil we have a saying that roughly translates to \"When the offering is too good even the saint gets suspicious\"",
  "Thats literally a fake single page , go to original lenovo website and compare with it . Don't be dumb Nothin ever gonna be free",
  "Too good to be true",
  "scam.",
  "A general life lesson is:  if it seems too good to be true, it probably is.",
  "Is it even logged in brother? It still shows sign in option . I suppose u can't order without signing in . Or u can ??",
  "[deleted]",
  "No",
  "100% scam. \n\nDone very convincingly but it's not the official lenovo India. \n\nLike someone else said the official lenovo site doesn't start with store in the url.",
  "Lenovo's store is not [store.lenovo.com](http://store.lenovo.com)\n\nThe whole website is a scam\n\nLenovo's actual store website is [https://www.lenovo.com/gb/en/d/sale](https://www.lenovo.com/gb/en/d/sale)\n\nGo to [lenovo.com](http://lenovo.com) | Click \"Products\" and look at the URL\n\nWhole website seems to be a scam, the only thing different should be the location and Language after [**lenovo.com/**LOCATION/LANGUAGE](http://lenovo.com/LOCATION/LANGUAGE)",
  "What do you think bro?",
  "Bro that's not official lenovo website",
  "It's still there lmao 😭.",
  "Did you got the laptop",
  "Wait... I just went to [store.lenovo.com](http://store.lenovo.com) from the USA and I'm getting a bunch of ads talking about how many INR (Indian Rupee?) discount I'll get.\n\nWTF?",
  "They're not gonna eat the loss just because it's their mistake.",
  "uppercase i and lower case L look alike so they might have switched them to make it look like the official Lenovo website while it's actually ienovo website :b",
  "Lenovos webshop has been notorious for having odd bugs, my father purchased a laptop years ago and for some reason the payment failed so he got pissed off and went to a store and bought one. Like 2 weeks later he got 2 laptops from Lenovo and a reminder in his email that his laptop is waiting for payment to be shipped out.",
  "From just the image I can't see the whole link. It looks like a / at the end indeed, so it might be safe. But it's also possible the website can look like this: \"store.lenovo.com_custom_link.net\" be careful about these kind of links. I encountered one like this saying they are airbnb.",
  "You cannot see if they are on store.lenovo.com - they could be on store.lenovo.communityscams.in",
  "Lenovo sold me a defective laptop and then refused to replace it, instead offering a refund and a discount on future purchases that was less than the discount I'd bought the defective laptop with \n\nThey don't care about honouring shit",
  "Happend to my brother on an other site for idk which item, and they did not honor the purchase",
  "I once found a mistake where they sold a 4tb m.2 ssd for like 50 bucks. I bought 2 and 2 days later got an email that the order was canceled due to pricing mistake.\n\nLuckily for them the ssd was not in stock for about 1 week so they had time to fix it. But if they sent it then I'm pretty sure they would have to eat the loss.",
  "it could be a pharming scam so it even has the same URL but is in reality a different site, scan your pc for malware",
  "Sacaría todo lo q pueda de la tarjeta registrada (dejando solo un poco de dinero) o la cambiaría para luego comprar   \nCuestión de no perder en caso de reclamos.  \n  \n(Escribo en español)",
  "could be a risk, whole account might be swiped clean",
  "Well I ig thy already did cause it isn't showing now",
  "If an intern even had the access needed to do such a thing its not the intern that needs to be fired",
  "Ohh lucky you!",
  "Same, had an infinite amount of 50€ off vouchers, vot a backpack, mouses, speaker, storage with it",
  "lucky guy. My order got cancelled.",
  "Excuse me here, but how the hell can a subdomain of a **genuine** lenovo site be a scam?",
  "That's a legit site and ig the product entry was incorrect I don't think they'll shop it but if they do let me know brother and congrats if that happens ",
  "Really? Did it say \"Only 3 left\" when you ordered them?",
  "any updates?u got laptop?",
  "How did you guys order",
  "https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F\nWell I barely have around 150 in my bank account 😅",
  "Real talk: My brain immediately thinks of Zelda instead of India when I hear “Rupees”",
  "[deleted]",
  "U ain't tuff my guy!",
  "I loaded it myself earlier and saw the same thing.",
  "Nah it was real and a tech-error",
  "I don't have PayPal",
  "Also shows copyright from 2021. while other lenovo domains like psref.lenovo.com have it at 2025.",
  "Really?",
  "!RemindMe 1 week",
  "No",
  "It didn't allow me to make the payment",
  "This is exclusive store site",
  "I didn't buy",
  "Here is the url-\nhttps://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Here's the link or if u find this sus u can google lenovo official store new bel road and try  https://store.lenovo.com/in/en/marketplace/seller/profile/shop/1686114094?orgRef=https%253A%252F%252Fwww.google.com%252F",
  "Somebody needs to learn how domain names work.",
  "LoL there is a thing called dns you should learn it",
  "Are u dumb?\nIt's a Fcking subdomain of lenove. It can't be a scam unless someone has Fcking access to the Lenovo domain or is doing. Mitm attack on opm",
  "What makes you think so? Like this is from official website! Unless it might be some glitch or smtg",
  "Well it's from lenovo exclusive store website and search for the branch new bel road",
  "You don't know how subdomains work.",
  "[deleted]",
  "The site has enough reputation to show up in google searches for \"store lenovo\". It wouldn't be the first time someone both hijacked a subdomain and also got it into a google search.\n\nThe cert is signed by Lets Encrypt instead of Lenovo's cert which is just what a scam site would do.\n\n*edit* store.lenovo.com/in/en has been in use since 2023. \n\nhttps://web.archive.org/web/20230314012913/https://store.lenovo.com/in/en/",
  "Entirely true : entered the url store.lenovo.com and arrived on an Indian version while living in Europe.\nVery few redirection links working. \nProbably a scam to steal credit card informations.",
  "But u can find the same from lenovo exclusive store website and search for new bel road branch",
  "[deleted]",
  "Seems like they've taken down their online store, when I just visited there was no way to buy online",
  "They may not even catch it. The order is probably processed by a computer and then packed and shipped automatically.",
  "They are many reasons they might eat it, particularly because it may be too much work to undo.\n\n*EDIT* If 1000 people start ordering it, they'll notice and cancel them all. OP you blew it by telling the rest of us.",
  "A little bit unrelated. I went to buy some expensive craft beer at a local shop and it was extremely cheap for some reason, like the whole thing cost less than the bottle. Cashier called the manager about it and they clearly stated that it is not what it suppossed to be, they can't do anything about it and they let me buy all of them for that very low price. Felt like winning the lottery.",
  "Had the same thing happened to me, they just sent a follow up email saying the price was a mistake on their end and they won't process the order.",
  "You can go to consumer court. They have to honor the purchase. You can’t just back out of contracts when the contract becomes a loss for you.",
  "Loss?",
  "The margins on these things are insane, my company buys their devices and they pay 20% of the public retail price. They make billions, it's probably not worth making the customer unhappy",
  "Most of the time they will, my boys in a telegram group where they post all types of these website bugs where the price is stupid low, all the guys on that telegram including my mate all buy and resell the shit they bulk buy off these websites and they pretty much all clear and get delivered",
  "It has happened before. I remember when a code was floating around for free Razer stuff, including laptops, and they said it was their mistake and honoured the orders.",
  "in eu they are required to sell it to you at the price its posted, i bought a portable AC from a site in slovenia because some fked up and instead of 450€ it was posted for 45€ and i got it for 45",
  "Sennheiser did when HD 600 were selling for 50$ instead of 500$",
  "One time I caught designer jeans they missed a 0 on. They sent it and fixed the price after. ",
  "Lenovo while not being an American company does a lot of business here, and one of their dual hqs are here, so legally, if they fucked up, they have to eat the loss, if any corp sends you something you didn’t order or they wayyy undersold it to you(like this case) legally you can view it as a gift and are under no obligation to return it, it happens with apple all the time where someone orders an iPhone and they get 5 instead of",
  "In germany if they send it out to you before realizing the mistake it's yours for that price so worth trying i guess",
  "Have you ever worked retail?",
  "Social media clout init",
  "Yes they will. I got a 3k laptop for under 300 dollars because they ate the loss. I did have to speak to someone on the phone, but I was polite and assertive about it. All in all, less than twenty minutes.",
  "Depending on region, ie. Quebec, they're legally required to honor the list price and eat the loss. Even outside of Quebec the amount of times I've gotten something better than what I actually ordered on Amazon is impressive Amazon always ate the loss. There's a good chance Lenovo just eats the loss.",
  "Second this. Currently dealing with Lenovo trying to return a laptop I bought that was advertised as having a feature I wanted, and shock horror, it doesn't. Their only response has been 'we know it can be upsetting to not get what you expected'. Can confirm they will refuse to eat the loss of their mistakes.",
  "They have to....",
  "They will, if you order from the EU. The fine they would pay otherwise due to consumer protection laws will be devastating.",
  "You can't have uppercase urls.",
  "That's a good idea. You could get like a visa gift card and order it with that.\n\nI'm writing in English.",
  "but the website is legit [store.lenovo.com](http://store.lenovo.com) \n\nu/Inevitable-Owl-550  you should log in with the same account in another device and then pay and see what happens",
  "People still keep all their money in an account linked to a card???\n\nMy pay goes into a secondary account with no cards linked to it, if I want to spend money, I manually transfer it, if someone steals my wallet, or a phishing site gets my card number, the most they'll get out of me is about $50 (which is all I keep in there for convenience)",
  "google pay then or single use card.",
  "Keep 2 rs in the account",
  "Upi lite se karo payment",
  "Bro your should have just ordered it, and if they didn't honour the purchase you can easily file a case against them",
  "I’m curious whether this was a scam link (My personal knowledge says that’s not possible coz store.lenovo.com seems legit, and doesn’t make sense to be a scam in terms of how DNS works) or the real store but someone messed up prices",
  "Did you buy it?",
  "Dude next time just go for it. Don’t let Reddit talk you out of a good deal. It’s the legit Lenovo website you scored yourself an absolute steal.",
  "Yeah but that's not how the corporate world works unfortunately",
  "Check the URL Certificate attributes and certificate chain. It will or should have Issued to as Lenovo.",
  "Domain takeovers exist, and through some VPN, Proxy, Public WiFi, really anything between you and the server can redirect to a scam server instead of loading the real page.",
  "[DNS Hijack, for example](https://www.imperva.com/learn/application-security/dns-hijacking-redirection/)",
  "they didnt confirm the order, looks like incorrect entry.",
  "u/U_GET_ME yes now its only one left, but order is not showing in **my order** sections",
  "No , it was just an entry mistake by a store owner in Karnataka. Order was cancelled by their side",
  "If I'm you, I'd probably buy it using my virtual card and limit the transaction to 1 rupee then lock the card and generate a new one after purchase.",
  "It isn't working now.\n\nDid you order it?",
  "Yeah no shit lol",
  "Does Indian credit cards have protection against fraud or are you out the money if your card gets stolen",
  "I will be messaging you in 7 days on [**2025-08-29 06:58:15 UTC**](http://www.wolframalpha.com/input/?i=2025-08-29%2006:58:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/laptops/comments/1mwcbkj/guys_is_this_genuine_like_seriously_1_rupees/na17fd3/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Flaptops%2Fcomments%2F1mwcbkj%2Fguys_is_this_genuine_like_seriously_1_rupees%2Fna17fd3%2F%5D%0A%0ARemindMe%21%202025-08-29%2006%3A58%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201mwcbkj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
  "Unfortunately it's not, no green color is used on the checkout page for me anyways",
  "Im unable to open the website so probably a scam",
  "... yes, it's right there.",
  "Please explain",
  "[deleted]",
  "This isn't helpful.",
  "Go ahead and try it then I guess 🤷‍♂️",
  "Yeah some people can be quite rude and dismissive in here",
  "Please explain",
  "Provide a link for that please.",
  "But it's a phone",
  "I see the same product using my Macbook.",
  "OP is clearly on a phone though",
  "Bruh unless it’s modifying webpages locally, it’s still a price served from Lenovo server.",
  "uppercase letters aren't allowed in domains",
  "Yeah I'm sure that's much more likely than a simple pricing mistake that happens all the time and would never ship",
  "This is what I'm thinking. Not that they'd do it intentionally, but the order would probably just get entered into their automated system to process it and the request to package and ship the laptop would be passed into their fulfillment/shipping department and someone there might ship it, not knowing or caring what people paid for anything.",
  "Yea, like my dad saw a wrong price on jbls site, 0 euro soundbar, and he ordered one, but then he ordered 15 more. Im pretty sure thats the reason that they catched it. A while ago i saw a wrong price on jbls site, 25 euros for a flip 4 camo. I ordered one and actually recieved it",
  "Most likely true. I work at a very large company and work in picking and shipping orders, and it's generally the same for every company. If a product is in stock and is purchased, the order is automatically added to the queue and dropped in the next wave of orders for the warehouse workers to pick and ship it. \n\nMany times the packlist/order receipt will show the total price of the order, but nobody really pays attention and even if a warehouse grunt sees it, they will assume nothing and still send it out. No managers or financial workers will see the order until well after it is shipped and delivered in most cases",
  "I have worked at a popular grocery store for over a decade. In the U.S. if a store has a price sign in front of a product that indicates an incorrect price, we have to honor it. Otherwise it’s called bait and switch. I have no idea how this is handled online or internationally however.",
  "They don’t. Law undergraduate here. This falls under contract law. A website listing or product is considered as an **invitation to treat**, and not an **offer**. To define an offer, I will quote it from the case of Preston Corpn Sdn Bhd v Edward Leong: An offer is an intimation of willingness by an offeror to enter into a legally binding contract. Its terms either expressly or impliedly must **indicate** that it is to **become binding on the offeror** (buyer) assoon as it has been **accepted by the offeree** (seller).\n\nEven if the customer were to send an offer (by checking out), a **binding contract** is not yet formed because Lenovo has yet to accept that offer and they can choose to back out as there is no **legally enforceable agreement** yet. (A confirmation email is also not signifying of acceptance of order!)\n\nA similar example to this would be Chwee Kin Keong v Digiland Mall Pte Ltd. TLDR is that an employee keyed in a pricing for a product at $66 instead of $3,854 (MSRP) and the company obviously didn’t want to fulfil orders that were made and got taken to court. Court ruled in the company’s favour.\n\nIn consumer court, courts do consistently rule in favour of the seller during obvious pricing mistakes like a $1 phone etc. because they take the view of a **reasonable person in consideration and apply the objectivity test**. \n\nFor example, in this case, the court said:\n“I find ... that the plaintiffs, given each of their backgrounds, would in any event, each have separately realised and appreciated, before placing their purchase orders,that a manifest mistake had occurred – even if no communications on the error had taken place between them. Further, the character of the mistake was such that **any reasonable person** similarly circumstanced as each of the plaintiffs would have had every reason to believe that a manifest error had occurred.” . \n\nOtherwise, the court would also simply treat it as a **clerical or unilateral mistake** and not punish the seller. Similarly in this case, Lenovo would win.\n\nIf there’s any Law graduates reading this and want to improve on my stand, please do! I’m still studying and open to improvement",
  "Nope where it's clearly a mistake and you know it, they don't need to honour it",
  "They are not and three seconds of googling will support that. Just because you once managed to slip one through doesn’t mean that’s the law.\n\nImagine a computer store mislabelling a €4000 laptop at €1 and a large amount of units are ordered overnight while nobody’s at work. Your argument is that EU law now effectively forces this company into bankruptcy by being required to honor these sales that were clearly made exploiting an error in pricing?",
  "No....",
  "Depends on the Ts and Cs",
  "Yeah.... depends on if that's enforceable to a website in another country.... Much like the GDPR fines the EU charges.... a US website isn't subject to that....  even if they decide to keep data on you... because they're not breaking THEIR laws.",
  "had this happen in the us with a 5000 dollar tv listed for 5.\n\n  \nthey cancelled the order and gave us a 20 dollar off of 100 or more coupon.\n\n  \nthis was on Samsungs website a few years back.\n\n  \nmaybe the uk is protected against this somehow but I’m almost positive there’s some loophole that companies could take advantage of to cancel it. regardless, it’s worth a try if it’s from the legit website",
  "Well it's the same in other accounts too",
  "This is the way to do it imo.",
  "I don't think that's how it works. Especially considering that OP is checking it on a phone. Like imagine if disc.google.com could be swapped by something malicious? \n\nCorrect me if I'm wrong, but aren't sites check response and then send info about a site, judging from 1) the subdomain, 2) the page (/in) and then parse arguments passed in the url if there are any? It's server-client thing – client sends response (get/post etc.), site's backend transfers specific data to the client (rendering the page if needed and so on). Done.",
  "you really think that there is a malware that will only affect lenovo's website dns? Most stupid way to snatch someone's credit card infos.",
  "Yup as expected ",
  "Bro i also paid but it shows incorrect entry and it got cancelled 🤣",
  "overthinking final boss",
  "[deleted]",
  "And look at the Lenovo logo, the padding is absolutely way off",
  "It took me about 30 seconds to load.\n\nThe first time it came up I had the same 1 rupee deal. I reloaded and it's gone. They may have just found it.",
  "Can u google lenovo official store new bel road and check?",
  "store.lenovo.com is a subdomain of lenovo.com, which is Lenovo's parent public domain.\n\n*anything*.lenovo.com is legitimate Lenovo.\n\nDomains are ordered right-to-left. \".com\" being the top level, \".lenovo.com\" being Lenovo, and anything else is just a host or subdomain belonging to Lenovo.\n\nWhat you need to watch out for is what is *after* the \"company\" up until the first \"/\". So for instance;\n\n- https://store.lenovo.com is the store at Lenovo.com.\n- https://lenovo.estore.net is \"Lenovo\" at eStore.net.\n\nAnything after the \"/\" is just a path to a file on the host. So;\n\n- https://store.lenovo.com/in is the \"in\" folder on whatever resoirce store.lenovo.com points to. In this case, it contains the India version of the store pages.",
  "Cant say about the India site but yeah, Lenovis site in general is pretty garbage.",
  "Well yeah if you're wrong. Learn about DNS.",
  "[deleted]",
  "Android run on a version of Unix, which contains a hosts file that can technically be edited to redirect specific URLs to a specific IP address.\n\nThis is technically a way you could target someone, but would be a weird angle of attack honestly \nThere are better ways to fake a website.",
  "They gave out a free $350 tablet when I bought a $400 phone last month so they might just be trying to dump old inventory and they don't care about taking a loss.",
  "Completely understandable. My situation was a bit different though, the product had the correct price sign and it became extremely cheap when it got scanned by the cashier.",
  "I’m fairly certain we have the same rules here in the Netherlands (from the law classes I’ve had during my first year of business admin)",
  "Depende del país y de muchas cosas q poco importa lo que cites",
  "I didn't read the wall of text, but I meant if they accept the order and send a confirmation email then they have to honor it. Obviously if they don't accept the order they don't have to to honor it.",
  "Not just that, but if you know that it's an error and you accept it, they can claim it's theft because you should've known that the price was an error.\n\nAn example often give is when someone sets the gas pump price accidentally to $0.32 USD when it should've been $3.20/gal USD.... if you fill up at $0.32/gal, you can technically be charged with theft.",
  "bamkrupcy? because of a couple ten thousand dollars ? bro you have no idea how companies finances work",
  "Well.. retail eats cost for mistakes all the time. If we have an outdated sign that didn’t get removed for a sale and a customer complains or seems upset we give it to them instantly no questions asked. Especially customer service oriented retail.",
  "Not really, you can't sign your rights away. At least in the EU.",
  "Not true. It's a common misconception. I",
  "u/Inevitable-Owl-550 i have ordered 2 of them, if i actually get , i will send you one",
  "the certificate is the first thing that is being validated, after opening a tcp connection to https, even before sending commands to the web server.",
  "Trust chain will be broken in that case. This validation happens even before the API call could be made, as a callback. There is no way to bypass it other than manually adding the root certificate to trusted root authority which I did not do, in every other case it will not qualify as HTTPS. Even if I manually add it, even then it will be not a real HTTPS and a warning will be displayed when I open the site for HTTPS containing a self signed certificate. \n\nPS : I work in security domain.",
  "I'd imagine if you do this type of attack you'd likely try to redirect as many possible large sites as you can (banks, large companies, big retailers, etc), so it wouldn't have to be this one specifically, but it is plausible if they failed to hijack more",
  "Are you aware of jokes? Jesus Christ lol",
  "I googled it and it works so this must be a phishing website",
  "Oh, I see. Thanks for the explanation.",
  "Thats such an unlikely attack vector lol. Why would you even suggest this?",
  "is it rooted",
  "Only modifying the hosts file would show dire HTTPS warnings in the browser because the site certificate wouldn't match.",
  "Bro be quiet it is 100% a glitch on the website, since it is on offical lenovo website he should buy it and if it charges full price then just refund lmaoo",
  "Or it can configure private dns to do the same thing. No root required.",
  "Good lord, I very much doubt the guy has such a threat model someone is going to do that.",
  "Keeping said inventory is probably losing them more money",
  "Oh yeah, that’s a weird one! Lucky purchase!",
  "We don't. Webshops have to honor the order, unless the error they made was big enough for the buyer to know beforehand that is was a typo. So in this case, yes, they would not have to honor it, but they have to honor the agreement generally when you purchase something on their website.",
  "True, but I was just giving an example to explain. However, if we look at it in layman terms, the universal legal principle will be the same. You simply cannot reasonably expect to enforce a contract based on a price that is **obviously an error**. So in any jurisdiction, I’m highly confident that Lenovo would win should this be taken to court. \n\nIf you search up similar topics, you will find that across common law (Singapore, UK, US) and civil law (France, Germany, EU), the courts follow the same reasoning:\n1.\tObvious pricing errors = no binding contract.\n2.\tBuyers cannot exploit a mistake they recognize.\n3.\tThe worst that happens to the retailer is refunding the money.\n\nHowever, if we are referring to say, a $599 MSRP laptop being listed erroneously at $499, the court may order the seller to honor some of the orders, which has happened in many jurisdictions before, since borderline errors (e.g., 10–25% off normal price) can be interpreted as a discount/promotion and would lead a reasonable person to believe that there is no mistake in pricing.\n\nIn this case though, it’s a laptop for $1. So it’s pretty obvious and no court would side with the buyer.",
  "Incorrect.\nTL;DR Lenovo (and most other companies) explicitly states that a confirmation email does **NOT** signify acceptance of the order. **No acceptance = No contract.** (This clause is commonplace for every business) Consumer will lose if he tries to go to court, even if he has the best lawyer. Below, I will cite Lenovo.\n\n**Full explanation:**\n\nA confirmation email, if you dig deep into any businesses’s Terms and Conditions (the thing that everyone ignores), has built in protective clauses in their Terms of Sale, and they’re not obliged to provide the consumer with any goods or service with a confirmation email alone. **Confirmation email ≠ acceptance.** A confirmation email only signifies that they have **received** the order.\n\nHere, I will specifically cite for this case, Lenovo. Under their T&Cs, it clearly states that **a confirmation of Lenovo receiving and/or processing your order does not constitute acceptance of the order.** (1.2)\n\nSource: https://www.lenovo.com/au/en/legal/new-products-and-warranty-services/?srsltid=AfmBOop9YcXqtlgbWWSEtLd4WCy7paTFtCMABKIs8xZmfYyPvIBRyTbc&ut\n\nIt also states under 1.1 that:\n\n1.1) **No contract** for the purchase of Products or Services will be formed until Lenovo accepts your Order by **one of the following**:\n\n**(a)** shipping the hardware Product and sending you a shipment confirmation email; or\n\n**(b)** making the software Product available to you; or\n\n**(c)** providing the Service to you.\n\nTherefore, that confirmation email is **not a binding acceptance** and is more of an acknowledgment that they’ve received your order and are processing it. Until shipping occurs (or software is delivered, etc.), Lenovo **reserves the right** to cancel or adjust your order **even if** you’ve already received a confirmation email or any other form of confirmation.\n\nI personally think that TV shows these days make the law seem very shallow to the average person, like; “Little guy sues company and wins!”. \n\nThe reality is, that every business has multiple built in protective and failsafe clauses layered into their contracts etc. to make sure that real consumers **will never win against them** in court. I feel like the average person should read more into the T&Cs so they know what they’re getting themselves into, but we don’t, so companies take advantage of that; and that is why we have lawyers :)",
  "Do enlighten me. 99% of companies in the EU are labeled “micro scale”. And also, way to deflect from the question about legislation ;)\n\n“A couple ten thousand dollars” in this case would be 5-10 laptops sold at the wrong price. You can see from this topic that ppl flock to these things like moths to a flame.\n\nMy most commonly used online computer store typically has a stock of about 50 of each gaming laptop, do the math on a say 5 of those products being mislabeled overnight and each those selling out at a €3999 discount. That’s about a million euro lost on a clear database error. “Just suck it up, it’s the law”, yeah not so much bro.",
  "Perfectly legal to have Ts and Cs that reserve the right to cancel orders where there has been made an obvious mistake",
  "Give an update if the order actually gets processed. Unlike what others said, the website itself is not a scam for sure. The items listed by that seller is controlled by them afaik, so either it is their mistake and they will simply not process the order, or, if you're lucky, there must be some kind of flash sale for a few units and they might actually give it.",
  "How were you able to order it ?\n\nDo you have a link for the page ?",
  "Update if you get it",
  "Mind helping me out as well?👀",
  "did u get em",
  "See dm",
  "[removed]",
  "what’d they say",
  "They wouldn’t dare go through the Ardennes /j",
  "Have to redeem themselves when they were wrong the first time lol",
  "I agree, but like... The laptop is not one rupee..",
  "Wow. Someone here finally has some common sense.",
  "[deleted]",
  "you dont know where im from, my country has 2 million pop.. the site in question gets about 5 thousand people traffic everyday.. and the amount of people looking for acs is like 100 every day, there were only 30 of those acs in stock..thats 12 grand and yes statistics matter and not every error is amillion loss dude, get over yourself",
  "this is how Samsung weaseled out of a similar pricing mistake a few years back. both us and eu orders were cancelled ( this was around 10 years ago tho)",
  "Depending on place it might be even law. In Poland for example it's literally in civil code.",
  "Website might be a scam. The copyright is linked to 2021.",
  "It's over bro , was a technical error",
  "See dm",
  "happy cake da",
  "[deleted]",
  "LOL he deleted it?! He legit thought I was serious when I was saying Rupees are a fictional currency from Legend of Zelda and when I said no shit he still thought I was being serious. Social IQ of a dead tree I guess.",
  "twice",
  "exactly, like nobody cares about this bla bla bla rooted phone host files like man he tried other things and it was was the same, it's just a damn glitch.",
  "to be correct: a non rooted phone also has a hosts file \\^\\^",
  "We’re not talking about that specific site though, are we? Nor are we talking about your country. You brought up EU law and some fantasy story that they have to sell it at the shown price no matter what it is. Apparently you’re more interested in arguing than taking a minute to check the applicable rules, have fun with that and have a good night.",
  "Did they say it's been cancelled or that they'd honor it lol?",
  "I don't see ur DM",
  "dm me",
  "People on reddit\n\n50% chance it's a scam\n49.99% chance you're the target of elite state sponsored cyber attack. \n\n0.01% chance it's a genuine error / mistake. \n\nPeople have lost all sense of logic nowadays!",
  "Exactly I 100% agree with you, the dead internet theory is real.",
  "Talk me out of it — Notebook Lenovo ThinkPad P16s Gen 4 Specs:\n\n[https://www.sklep-lenovo.pl/notebook-lenovo-thinkpad-p16s-gen-4-21qr003cpb.html](https://www.sklep-lenovo.pl/notebook-lenovo-thinkpad-p16s-gen-4-21qr003cpb.html)\n\nPrice:  \n[https://www.x-rates.com/table/?from=PLN&amount=8649](https://www.x-rates.com/table/?from=PLN&amount=8649)\n\nMainly office work with plenty of chrome tabs opened; chatGPT, youtube, email, business research, etc. + a few logistics programs opened\n\nNo video rendering, 3D modelling, etc. so the lack of dedicated GPU should not be a problem.\n\nQuite the contrary, no dGPU = better battery life, less heat, more room inside, etc.\n\nCorrect me if I am wrong though/\n\nedit:  \n\\*IT’S GOT TO BE LIGHTNING-FAST — TRULY INSTANTANEOUS when switching between windows, tabs, etc.\n\n\\*\\* It's going to be used for another 5-7 years.\n\n  \n\\*\\*\\*  \nThe current laptop is:\n\n\\>>HP ProBook 470 G5<<  \n\\-Intel Core i7-8550U  \n\\-RAM: 32 GB DDR4 2400 MHz  \n\\-NVIDIA GeForce 930MX (2 GB) + Intel UHD 620  \n  \nand it's too slow.",
  "2300+$ for a laptop to do tasks that can be done on  500$ one",
  "[https://delkom.pl/p/laptop-lenovo-l...qxga-240hz-64gb-1000ssd-rtx4060-dlss-3-109779](https://delkom.pl/p/laptop-lenovo-legion-pro-5-gen-9-16irx9-83df00elpb-i7-14700hx-16-wqxga-240hz-64gb-1000ssd-rtx4060-dlss-3-109779)  \n  \nMuch cheaper and better guts than  \n  \n[https://delkom.pl/p/mobilna-stacja-...50-16-wuxga-lp-64gb-1000ssd-int-w11pro-177759](https://delkom.pl/p/mobilna-stacja-robocza-lenovo-thinkpad-p16s-gen-4-amd-21qr003cpb-ryzen-ai-7-pro-350-16-wuxga-lp-64gb-1000ssd-int-w11pro-177759)  \n  \n  \nBut the main reason I'm interested in it is the 'improved' airflow with so many vents all round. He might not be using that dGPU for his work, but that improved ventilation might come in handy.  \n  \nUnfortunately that Thinkpad is a slim version so it's a bit squished. There are also reports of it running hot, though mainly because some drivers' issue.",
  "Current pick (specs are at the lower part of the page):\n\n[https://delkom.pl/p/mobilna-stacja-robocza-lenovo-thinkpad-p16s-gen-4-amd-21rx0010pb-ryzen-ai-9-hx-pro-370-16-wuxga-lp-64gb-1000ssd-int-w11pro-177762](https://delkom.pl/p/mobilna-stacja-robocza-lenovo-thinkpad-p16s-gen-4-amd-21rx0010pb-ryzen-ai-9-hx-pro-370-16-wuxga-lp-64gb-1000ssd-int-w11pro-177762)",
  "Trust me. 500$ cannot pull this off. I'm not talking about some sh1tty performance, where I have to wait till something loads up. IT’S GOT TO BE LIGHTNING-FAST — TRULY INSTANTANEOUS when switching between windows, tabs, etc.\n\nI should have added this.",
  "Which can be done on a much cheaper laptop as well. Dude, you're just trying to justify your purchase and look for validation. Which is fine, but let's be real..",
  "The current laptop is:\n\n\\>HP ProBook 470 G5  \n\\-Intel Core i7-8550U   \n\\-RAM: 32 GB DDR4 2400 MHz  \n\\-NVIDIA GeForce 930MX (2 GB) + Intel UHD 620  \n  \nand it's too slow.",
  "And? That doesn't make 2300$ lenovo thinkpad a worthy purchase if your only task is.. What.. Opening Google tabs and email fast? Which any newer machine can do easily, not just a 2000$ one.",
  "Then what is in your opinion 'worthy a purchase for opening google tabs and email fast' with a great build quality and that's going to be futureproof for another 5-7 years?\n\nOne concrete example (link) would be enough. If you feel strong about your opinion, make it two :)",
  "I don't care enough to search for you but I assure you these specs are a massive fucking overkill for the tasks you specified lmao. And I'm polish as well, so I am not a delusional American thinking with cheap American prices. It's a good laptop. Just overkill for your tasks, that's it. If you want it to feel premium or whatever go for it, but just get it being fully aware it's going to be an overkill.",
  "It definitely is. But it's also quality build, future-proof, and fast.\n\nYour 500$ laptop is none of those.\n\nSo, is it really an overkill where you care about those three things?",
  "Brother in christ, you already made the purchase mentally long ago. You came here for emotional validation. If you want cold data, then my 1000$ lenovo legion 5 slim that i got on discount has 2560x1600 240 hz display, 1,5 TB of expandable ssd space, 32 gb ddr5 5600mhz ram to change as i will (realistically \"average joe\" doesn't need more than 20GB anyways), r7 8845hs, rtx 4060 140W (like dgpu's or not - they rise the price up), 80wh battery, aluminum build. All of these specs are better than that thinkpad you linked except maybe the chassis, at best and it **costs more than twice the amount I paid for my laptop**. And let's not forget your tasks are still \"opening web pages and reading emails\". I don't think \"browsing web pages\" will be any demanding in the future, thats regarding \"future-proofness\"",
  "No, I did not. I don't even like laptops lol. I'm still using my 13 years old PC, and it's enough for my needs, although it chokes with a few too many tabs opened.\n\nThe laptop is for my brother. In his line of work every second counts, so he cannot wait for tabs to load up, hence max performance required.\n\n'And let's not forget your tasks are still \"opening web pages and reading emails\". I don't think \"browsing web pages\" will be any demanding in the future, regarding \"future-proofity'\n\n  \nYou couldn't have known that in a few years time a few more chrome tabs could choke your system so much, could you? So wouldn't you say going with 64GB RAM is not a safer option if he plans to use the same laptop for at least another 5 years?\n\nAlso, anything below 16\" screen won't fly.\n\n  \nBuying a gaming laptop is wasted money in his case. Most of the money goes into the dedicated GPU, which he needs the least. Not to mention less airflow, more heat, and another thing that can cause problems.\n\nIf that money goes into a better build quality, and RAM. This is what counts for his use.\n\nI like your point, that you can get a slightly better CPU for cheaper, but it fails almost everywhere else.\n\nIt's near impossible to find anything worthy with:\n\n16\"\n\n1TB\n\n64GB RAM\n\nand in similar price range as what is in the title\n\n\n\nYou gave your best shot, but still failed to convince me, that there's anything better for the job.  \n\n\nIf I were to find anything cheaper, I would have to compromise on one of those three crucial aspects I've mentioned above.\n\nI'll keep on looking though.",
  "How long have you had your lenovo legion 5 slim?",
  "What do you think about the new Lenovo IdeaPad Slim 5 Gen 10?  Ryzen AI 7 350, OLED and 32Gb RAM for 900€ ",
  "I have one but with sadly a ryzen 7 7735hs and not an AI 7 350. But I have all maxed out options.\n\nIt's an absolute BANGER of a laptop. It's very light and thin, build quality is pretty good and the OLED is really bright. \n\nPerformance wise it performs as you'd expect from the specs as far as mine is concerned, but i can't tell for the RAI7 version obviously. \n\nKeyboard is good as well. The integrated microphone is *extremely* good for a laptop, hands down best laptop mic I've heard. I'm running Linux on it, it's very well supported and everything works as expected except the mic which needs a kernel edit to work (I've sent a patch a month or so ago, but i think it got forgotten :/ )\n\nIn the bios you can dedicate from 256mb to 4gb to the igpu. However the bios is fairly limited in terms of what you can do in it.\n\nNow that I know the ryzen ai 7 version exists I'm sad I didn't wait :( \n\nOh and one last thing, at least with mine I bundled a 2year accidental damage warranty for 35€ which is nice, idk if that's still available but it's a nice to know.",
  "[removed]",
  "I got the Ideapad Pro 5 version, I believe Slim is a bit less sturdier. That cpu is slightly better than the 8845HS, but the graphics are worse (780M>860M). Screen is absolutely gorgeous. I would recommend mine, this one probably is also fine (If it has 2.8K 120hz oled, if it doesn’t then an Ideapad Pro 5 would be better in this case)",
  "does it have a haptic trackpad? I can't stand the trackpad on the yoga aura 15 edition",
  "Hi, I just ordered mine ;)  \nSpent some time comparing and looking through different laptops and ended up filtering the lenovo PSREF.  \nthe fact it has  \n\\- 2\\*SODIMM RAM (user swappable DDR5)  \n\\- 2\\*M.2 SSD Slots (2242 preinstalled, 2280 free) => added a 110€ 2TB  WD\\_Black SN7100  \n\\- full aluminium body (unlike previous ideapads)  \n\\- oled   \n\\- the newest gen ryzen with Ai dedicated core architecture  \n\\- 2\\* USB-A + 2\\*USB-C  \nwere my reasons to got for it. The only thing I'm worried about is the lack of a 40Gbit usb port. It looks like it has only 2\\* 10Gbits so I wonder if I it'll work if I try to use it on a dock with 2\\*4K @ 60 Hz\n\n[https://psref.lenovo.com/Product/IdeaPad/IdeaPad\\_Slim\\_5\\_14AKP10?tab=spec](https://psref.lenovo.com/Product/IdeaPad/IdeaPad_Slim_5_14AKP10?tab=spec)\n\nHW-maintenance manual showing the 2\\*SSD + 2\\*SODIMMs: [https://pcsupport.lenovo.com/us/en/products/laptops-and-netbooks/ideapad-s-series-netbooks/ideapad-slim-5-14akp10/document-userguide](https://pcsupport.lenovo.com/us/en/products/laptops-and-netbooks/ideapad-s-series-netbooks/ideapad-slim-5-14akp10/document-userguide)",
  "I'm so confused between this one and MacBook air m4 16/256 :(((\nWhich one should I go for?",
  "Hy , can u provide the link ,\nAnd is the storage upgradable?",
  "You get a think pad for same price but base ram",
  "Is the one you have with amd radeon 660m version? Im looking to buy this model for around 700 euros where I live. I really want a portable lightweight laptop with a nice oled screen, I only play Runescape which is like a 20 year old mmo. And mainly gonna use it for multimedia like youtube and netflix.",
  "what about the hinges? i've read bad reviews about it",
  "Hi man, I am considering buying the same laptop, I would like to know how’s the battery life? Do you have the 13” or 15” inch one? Thank you",
  "Hey mate, i got the same one , waiting for delivery. In this price range I doubt you get anything better.\nHow is the fan noise? I'm a little worried as there are so many people complaining about it and even returning it. Cheers",
  "could you tell me how to increase igpu allocation? I got mine with 24 GB of ram specifically so I wouldn't struggle on light games like minecraft and it's coming in a month or so but I wanna know how to do it",
  "How is it with casual gaming like Roblox and others in the same level? Even if I wouldn't go for AAA gaming I might go for it takes two. Do you think it could run those?",
  "hi, how's going today after 5 months? would you still recommend it? I'm planning to get a 15\" Ideapad Slim 5 with 7735hs and 16/512Gb with an IPS display for 680€.",
  "Have you every noticed any PWM flicker when using it on low brightness?",
  "You're Australian I believe",
  "jesus christ i dont even know what to say..",
  "How's the battery life? I'll use it for programming and/or heavy browser-work",
  "Hey, I am considering getting one myself. Got the Gen 9 just a couple of weeks ago for my wife, and for the price it's really great.\n\nJust wanted to add, that the ram is soldered, not swappable by the user as u stated. Check the Lenovo Product website. It was soldered in Gen 9 as well. You can change the SSD(s) and the Wifi Card. Gen 9 only had one ssd slot for 2242 btw. So that's definately a plus having 2 now.\n\nAh and btw, it has 2 USB-C 40 gbit ports, just like Gen 9 did. From the Lenovo Product Website \"Ports2 x USB-A (USB 3.2 Gen 1) + 2 x USB-C (USB4, 40Gbps, DP2.1, PD3.0) + 1 x Novo Button + Audio Jack + HDMI 2.1\"\n\n\nEdit, sorry. Thought you guys were talking about Ideapad 5 Pro 14.... ",
  "same! what did u end up going with?",
  "Thinkpads are just not worth it brand new, stop recommending those. They’re just absolute trash for their price. Lenovo is surfing on their name.",
  "r7735hs has rx680m",
  "They're fine as of now, they don't feel too flimsy unlike some HP or MSI pos, but they're not the strongest hinges ever compared to the ones of an xps or high end thinkpad. Not super good, not bad, just okay",
  "Hii\n\nIf you're on linux the cpu won't even go above 40°c for general desktop use so the fan won't even spin. It's however not the quietest if you're loading the cpu hard (compiling code, virtual machines or heck even games since the 680m can game pretty well), but nothing too terrible. \n\nOverall on linux it's not even making any noise for most tasks.\n\nAnd yeah, you're not getting anything better for that kind of money. I recommend getting the fat (70wh battery) for best experience.",
  "It's in the bios is dont recall the settings name but you'll find it easily",
  "Is the ram upgradable upto 32 gigs ?",
  "Yeah for sure, the radeon 680m is more than capable for those. But I'd suggest getting an actual gaming laptop if you're only doing gaming.",
  "Hi,\n\nYeah for sure. Still a great laptop. I'd recommend getting the OLED screen if your budget allows for it, it's really worth it in my opinion. Also since the memory is non upgradable getting the 32 gigs of ram is not a bad idea either (and if you can't get both the oled and the ram, get the ram) especially if you're running windows",
  "[removed]",
  "Something around 5-8 hours ? I get 5 because I’m always on HDR at 120hz with the ram set to 7500MT/s (they added a setting in the bios to change it), but I remember getting closer to 7 hours before I did all that, even 8. So with web browsing and programming it’ll last you half a day maybe. It also charges pretty pretty fast.",
  "hi, can you explain why? i've seen a lot of people recommending thinkpads, so i was considering it",
  "hey, could you tell me if the hinges have held up. i have had lenovos before and the hinges are awful , they usually fail in 1-2 years.",
  "Thanks for the detailed reply.\nI'm on Windows. Hopefully it's gonna be manageable, im pretty sensitive to loud fan noise especially for no reason ... Have a good day",
  "It has SODIMM so yes",
  "is the keyboard satisfying enough? I come from a Matebook D 14 2020, which has a great keyboard.\n\nMy main use would be office 365 suite, videocalls, powerBi, so the Oled screen could be risky due to the Burn-in to me... am I right?\n\nComing to the Ram, if I choose 32gb, I also have to choose the OLED screen; budget is not a problem, the fact is that the size of this laptop is perfect for me and I love the 16:10 form factor on a 15\" display.",
  "is the keyboard satisfying enough? I come from a Matebook D 14 2020, which has a great keyboard.\n\nMy main use would be office 365 suite, videocalls, powerBi, so the Oled screen could be risky due to the Burn-in to me... am I right?\n\nComing to the Ram, if I choose 32gb, I also have to choose the OLED screen; budget is not a problem, the fact is that the size of this laptop is perfect for me and I love the 16:10 form factor on a 15\" display.",
  "LMAO",
  "Dang that's great battery life!",
  "Hello, i want to buy a YOGA with either a 256v or a ryzen ai 350, i want a good battery life. i mainly want to use the laptop for websufring and media consumption (streaming and local), which would be the good choice ? thanks",
  "Old ones okay maybe if decently priced. Problem are new ones, being super overpriced while offering very little. An example : A mid range T14 G5 with a core ultra 5 125U, 60hz 1200p sRGB IPS display, 8gb of ram and 256gb of storage, which for those two are getting below today's standard, is priced at 1200€. Those are specs you'd find on a 600-700€ laptop, not a 1200€ laptop. At 1000€ you can already get something well built with a Ryzen 7 8th gen, 32gb of ram and 1tb of storage (Asus Zenbook, HP Elitebook, etc). In this case that laptop OP showed was a pretty fine deal, but if you took a Thinkpad for the same price you'd have an E14 Gen 6 with even worse specs. They stay good, don't get me wrong : but at any price range there's pretty much always a better deal.",
  "They still good",
  "Unfortunately windows randomly spikes the cpu even on idle so a same pc can sometime run *MUCH* hotter on Windows...\n\nBut im confident it wont be too bad, just not as good as on linux.",
  "I am less sure the RAM is upgradeable depending on the model actually. Just double check I'd say.",
  "Keyboard's alright. As for the burn in, I think it'll be fine, especially if you don't run max brightness (the screen is very bright, even half brightness is much brighter than most laptop screens) and auto hide taskbar. Bonus point if you use a OLED friendly theme (iirc the O365 suite has one where the background and ui is pure black). Those are only preventive measures and not really 100% necessary unless you're really scared.",
  "Yeah, I think it’ll perfectly suit your use. You can even play games on it like Fortnite at native res with amd adrenaline’s capper on 75 at 70 fps, Minecraft at 100 fps, the 780M is great.",
  "The AI 350 is slightly better, but the 256v does it all at 17W. Normally the Intel one should have better battery life. Will very easily handle what you said, even some more intensive tasks like gaming.",
  "Hi dear, how about the fan noise? Do you often hear them?",
  "Strangely it's hard to find an 8845hs or 8840u ddr5, good battery life + screen laptop here in India without overpaying a lot. \nBut I found an almost equally good Ryzen 7 AI 350 laptop with 860M igpu, 32 GB ddr5 5600 MT, 60wh fast charge. I think that'll be almost equally good as your laptop?",
  "so the intel would be the better choice ? between it doesn't have the multi threading capabilities, that's why i hesitate",
  "The ai 7 350 has a weaker iGPU but is normally slightly better than the 8845hs, would be close or even better since it also consumes less.",
  "Eh, won’t affect much.",
  "HP EliteBook 845 G9 vs Lenovo Thinkpad T14 GEN 6 Hey everybody, \n\nI need help. I want to buy a new windows laptop for business. I can get both of them for the same price. Which one is better to go with?\n\nHP EliteBook has 16gb ram, 512gb ssd, Ryzen 5 Pro 6650U  \nLenovo Thinkpad T14 GEN 6 has 16gb ram, 512gb ssd, Intel Core Ultra 5 225U\n\nThanks :)",
  "In this case, Core Ultra 5 225U is much newer and hence better CPU than mentioned Ryzen Pro. So there is no dilemma - I would go for Lenovo ThinkPad.",
  "Thanks for your answer :) Is the quality from lenovo also good?",
  "In this case, both Lenovo ThinkPad T and HP EliteBook are industry leading models with premium build quality. So from the reliability perpective, both models are great.",
  "Lenovo is known for its reliability and durability while hp isn't.",
  "Not fully true. HP consumer lines are HingeProblems. But enterprise Elitebooks are of similar durability like Thinkpads.\nAlso consumer Lenovo lines have also their durability problems.",
  "Lenovo yoga 7 14inch 2 in 1, amd ryzen ai 7 350, oled 2.8k screen, 32gb and 1tbssd gen 10 I ended up purchasing this laptop in the end, I tried to cancel the order but it was already on a plane flying over to the UK from China which by the way was the quickest delievery ever, sailed through customs within a few hours and was at my door step within 2 days. Highly reccomend Lenovo UK website to order. \n\nAnyway, the laptop is better than I thought, I'm a student so that will be my sole purpose of use, I have a phone to watch ny yt videos and stuff, I just need Microsoft 365 and Google for research. \n\nWarning: it really isn't a gaming laptop from what I can tell, however you can still play but I don't think you will get the most out of the games. \n\nPossitives:\nThe screen is beautiful 😍  I paid extra for the 2.8k oled and it was worth it, crisp, sharp, colourful and overall vibrant. \n\nIt's a touch screen, using my fingers is smooth, you can adjust the settings for touch sensitivity which I did, it's responsive, smooth and quick. I'm not sure about the pen I'll mention that in the negatives. \n\nThe sound is beautiful, it's louder, and alot clear compared to my previous laptop. No issues with sound and comes from both sides of laptop which is good. \n\nMakes zero noise, since I got it and I've put the updates on, which was super quick by the way, but it's silent. Probably no sound or if there is a sound I cannot hear it. I can hear a fan it's pretty peaceful. \n\nCharges super quick.\n\nPen charges super quick and battery lasts a few days depending on use. \n\nI've used the laptop all day working and researching and it's smooth, handles the workload well, and hasn't heat up like my older laptop which heat up and made a bit of noise when the workload got heavy. \n\nThe battery has last me from 5pm Thursday to 10pm Friday night. I'm happy with this, I was constantly updating, and doing my studies so it definitely holds up good. \n\nYou can remove the ai features which I did. \n\nSimple setup \n\nLooks beautiful especially in Tidal Teal\n\n14inch is big enough for carrying around. The 16 inch is similar in price but I personally found it too big and heavy the 14 inch is the right weight and perfect screen size. And honestly the 16 inch in general is far too big to carry around unless you plan to keep it in one place. \n\nNegatives: \nThe hinges don't seem strong. I hate to say this. It's a shame but I will probably not be using tablet mode, although when placed in tablet and tent mode it's still smooth and works great. But the hinges are a bit concerning. When in laptop mode the screen wobbles a bit too much. So yeah those hinges are a concern... \n\nRyzen ai 7 350 is meh. It's still fast and smooth but it's definitely not as amazing as I thought. I would reccomend the intel version over the amd ai. But it's still a good laptop for school work \n\nThe pen is not as sensitive as the finger, they send the new release yoga pen with the laptop and it isn't the best. Better off getting another type of pen.\n\nThe slot for the memory card looks concerning, I have not tried it yet but I'm not sure if I will..doesn't look like it will ever come back out. \n\nYou'll forever be cleaning the laptop no matter how much you wash your hands and they are clean this laptop is a magnetic for finger prints, the keyboard too. The touchscreen isn't that bad I've not had to clean it much. \n\nOverall I reccomend this laptop to students \n\n",
  "Hi , thank you very much for this review, I'm looking into buying the exact same model , but I have a few doubts could you please clarify them \n\nU mentioned this is a touchscreen \nThe same model i found: [here on lenovo ](https://www.lenovo.com/in/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7-gen-10-14-inch-amd/83kgcto1wwin1?cid=in:sem:218hlv&gad_source=1&gad_campaignid=22385956031&gclid=Cj0KCQjwxo_CBhDbARIsADWpDH7jP6TxR9xBBmBMBMnYZi8RqzEZzOIFA1zIGyXw4jR5ZWVppoYqErsaAlw9EALw_wcB) \n\nSays it isn't touchscreen, can u confirm both are the same models \n\nI do not game , my use case for laptop is dev and design (figma and davinci resolve) , so do u still recommend this laptop?\n\nThis is costing me 725 pounds due to corporate discounts , is this a steal?",
  "Hi all, sorry if I haven't replied ive been busy with work and school work, \n\nJust an update, my laptop refuses to update, and the screen freezes consistently and doesnt save my work after, its always a reboot job, the track pad doesnt recognise my finger sometimes and lags sometimes the pointer goes missing on the screen and then... freezes all after a few updates. Before the update laptop was good. \n\nI would not recommend this for gaming and work in general it struggles to deal with basics. \n\nWhen laptop lid is closed it doesnt save anything, it will turn everything off ive changed setting etc and still doesnt just standy. \n\nUpdate seems to have left out important bits because new update refuses to download and says error. \n\nBeautiful looking laptop but not functional.",
  "u/Busy-Objective9718 Thanks for the post, currently looking at similar model. What did you not like about Ryzen AI 7 350?",
  "Still hinge issues!",
  "u/Busy-Objective9718 Where did you get it? I'm looking for that exact one but can't find it anywhere.",
  "Thanks for sharing. I recently bought a Lenovo yoga 7 2-in-1 touchscreen laptop too. I was hesitant since I’ve heard the hinges might become a problem in the future. I’m going to use it pretty much only for school so tablet mode is not too necessary",
  "Hi, what is your conclusion after a few months with this laptop, would you still recommend it? I'm considering buying it for school however I want to make sure im not disappointed. Thanks!",
  "I had an awful experience with this laptop (Yoga 7 14\" 2-in-1, 14AKP10). The sound drivers were so bad that even three OS reinstalls and a BIOS update didn't help. There were some AMD/Realtek sound issues that couldn't be fixed at the time (maybe because the CPU was brand new, or for some other reasons). The sound from the laptop's speakers was laggy. I tried all the suggestions from Reddit and other relevant websites and decided to return the laptop after a few days.",
  "That's not the same model, you've chosen none touch screen you have to change your options. \n\nBut in all honesty go for another laptop unless you dont mind disappointment",
  "Hey, I am currently trying to get my refund for Yoga 7 Gen 7 (14ARB7), which is basically 3 gen older than your laptop due to the screen freeze issue.\nThe screen freeze issue is a symptom of BSOD for 14ARB7, which many owners worldwide complain about this issue. Can you go to C:\\Windows\\Minidump and check whether is there any minidump there? If yes, is the bugcheck code DPC Watchdog Violation?",
  "Tbf, if you fancy a ai 7 350 but have a few money to spare i would reccomend to ai 9 hx 370 💯  \n\nI think for what I use the laptop for (school work, word, Google and researching the laptop is have handles it good) but if I was to to other stuff which are way more demanding it would struggle a bit. \n\nI wish I paid an extra for the 370 tbf and I would have removed the pen option. And I would have got it in silver the Tidal Teal shows the finger prints too blatantly no matter how much you wash your hands and clean the laptop. \n\nIf you're using the laptop for heavy professional stuff like editing gaming definitely upgrade... for light work like browsing and Microsoft 365 etc get the 350",
  "Yeah, seems like it. It seems safe using it as a laptop though but I wouldn't use it as a tablet just seems too fragile.",
  "Leneovo UK website . I'm in the UK",
  "Honestly, with the price point you can get a better spec, this laptop has its issues or \"teething problems\" yes it looks pretty, vibrant and colourful but it can lack in the performance, for example it freezes a lot when in tablet mode, the side buttons turn the laptop off when accidently pressed, the pen is not that great, the pen also leaves a lot of marks on the laptop screen which is hard to get off, almost like faint scratches, but the pen in general does not respond well to laptop and is not smooth, the laptop mouse or trackpad freezes, although the recent update did fix this, but ill be honest the tent mode and tablet mode freezes a lot, not sure why. \n\nThe hinges look weak! However not broken so far so cant be as bad as they look \n\nThe laptop for the price is not worth it and I recall somebody on here telling me to get a better spec but I didnt listen and I wish I did. \n\nThe web cam is terrible too almost like sometjing from the year 2000\n\nBattery life is terrible even in the power saver mode its awful lasts me around 4 hours maybe 5 when in heavy use my Dell lasted me 8 hours straight. This laptop needs charging often \n\n\nThe positives are I managed to turn AI features off besides a few which is great! \n\nThe 14inch is a godsend its perfect!!! If you plan to use it as a tablet or tent mode do not get anything bigger it will just feel and look awful and chunky \n\nThe laptop is slim in design looks sleek. \n\nBattery charges super quick like very quick the first charge I did up to 100 and then after that I set it to 80 to protect the battery life spam and it makes no difference either way it needs charging after 4 or 5 hours or heavy use. \n\nIts bright, the display is gorgeous 😍 \n\nIf I could return it and choose another I would opt for a thinkpad and opt for specs, performance over looks and the tablet mode gimmick \n\nHave a look after to see if there are better specs for the similar price range and ask ppl on reddit who know about laptops they gave me good advice which I didnt lsiten to much",
  "Do not buy it if you will enable virtualization feature and use touchscreen/touchpad. This freezing issue is reported since 2022 and Lenovo does nothing to solve it. \n\nThe [freezing issue ](https://forums.lenovo.com/topic/findpost/1516/5259004/6550013)occurs since Yoga 7 Gen 7 (14ARB7) and is likely still present in all newer models.",
  "Too late :( , i got mine  a week back , I had troubles on linux and jus 6 hours battery on power saving mode, what about you",
  "Thanks for sharing!",
  "Thanks, that explains why I can't find it.",
  "How much would you say is a fair price for this device?",
  "Oh dear, I do a bit of work on mine these days but around 5 hours battery saver mode\n\nIt gets worse after each update im not sure why\n\nI have 10 months warranty im thinking about taking it back in however I really need a laptop for work so im trying to finish off my work first lol",
  "I would get it in intel if you're thinking about it and also if you really want amd go for ryzen 9 ai 370 if you can get it",
  "I can't answer that. A device is only worth what you're willing to pay",
  "It even feels slow for it's specs",
  "Thanks, but I have somewhat bad prior experience with Intel (typing this now on a Yoga 7 with Intel 1260p) and their integrated graphics, especially on Linux. AMD on the other hand works like a dream, and Linux support for AMDGPU is the best of the bunch by far. That's why your laptop is exactly what I was looking for. And yes, getting a HX370 is next to impossible now. I guess AMD has really low yields with 300 series and all 370s and above end up in high-end devices with dedicated graphics (like ProArt and Zephyrus) - which doesn't make sense as 890M is already a really powerful GPU. But given no desktop-replacement GPUs from AMD right now (no 9000 mobile series yet) it seems the high-end gaming will be stealing our AMD CPU supply for some time to come.",
  "Yes ofc. You said you felt it wasn't worth the price. So I was wondering how much you spent on it",
  "Yep unfortunately I went for a 2 in 1 and lenovo focused on looks over anything else",
  "That's really interesting,  im a big fan of amd and and dont think I've ever used an intel except for at work maybe, but this is the only laptop I found intel runs so smoothly and is probs a bit better and for the life of me I cant figure out why. \n\nIt does do the job though, I only use it for research and Microsoft 360 light browsing so it fits me needs don't think its good enough as a gaming laptop",
  "I paid £995 when first released \n\nYou can get a better spec with this price",
  "Sorry double checked invoice I paid £1055 including blue light card discount",
  "Thinkpad T14S Gen 2 vs Asus Zen 14 OLED vs MacBook Pro M1 Good day, people! So, my old laptop (Lenovo Slim 7 14ARE05), which I loved, bit the dust (MoBo failure) and I will replace it. I would prefer to go for a used one, since I also have a desktop and, currently, I have 3 options:\n\n1. Thinkpad T14S Gen 2 (i7-1185G7, 16GB RAM, no SSD - I have one) for 335€\n\n2. Asus Zen 14 OLED (R7 5700U, 16GB RAM, 512GB SSD) for 470€\n\n3. MacBook Pro M1 (8GB RAM, 256GB SSD) for 510€.\n\nI am a Data Science/backend developer. This will be my secondary machine and, ideally, I would prefer Linux (Fedora/Arch), but I could live in MacOS, if needed. I need to take it with me all the time, so it needs to be light (all of them are). Battery life is secondary, but good-to-have.\n\nI am afraid, a bit, of the build quality of the ASUS, since it is much less upgradable/repairable compared to the Thinkpad. On the other hand, the ASUS has a bigger battery and better CPU, which, from what I saw, sometimes, can yield up to 40-50% battery life difference between the 2. I can tweak the Thinkpad with TLP, but it can only go up to a point. I am also a bit afraid of the OLED burn-in on the ASUS and the hinge wear and tear, since it is a used one.\n\nAnd, then, you have the MacBook. More expensive than anything, with MacOS. On one hand it has very small RAM, but, from what I have seen, with the fast SSD it has, the swaping is seamless and the M1 is more performant for my tasks compared to the R7 and i5. But, then, again, if something goes remotely wrong, I will be left with a brick (not repair friendly, except if you spend a lot on it).\n\nAny suggestions would be incredibly welcome, since I am torn on which to buy.",
  "If you are looking for your machine to last more than 3 years, avoid the OLED screen. ASUS machines are fancy, as a rule, but definitely less sturdy than the other two.  \n\n MacBook might be faster for now, but it is strictly not upgradable on any aspect and unless you have specific need for iOS, it is generally a chore for developers.  From the cost you save upfront, you might be able to replace/upgrade the Thinkpad's SSD soon enough.  \n\nThinkPad is the machine which balances things to avoid any major disappointments and gives most flexibility, among the three.  \n\nEDIT : Grammar",
  "This was exactly my thinking as well! However, I just saw, on a big online seller (no promotion here), an HP Notebook with an i3 1215U for 420€ and one with an R7 7530U for 466€. Both new. But I am a bit hesitant about HP laptops. I don't have them in high regard as far as build quality/problems are concerned.",
  "do you really have a Mac and an i3 as competing options, or am I misreading something?  \nWhat exactly will this device be used for again, in the coming 2 to 5 years?",
  "Yes, I do. Light development (mostly Python, SQL and some Rust) and data science (geospatial and ML). And some movies here and there. For most heavy uses, I have my PC. This will be for some development of the above, when I am away from home, not the main machine. Maybe ML will be excluded, if needed. No matter how good the M1 is, it is the lowest-end model, with only 8GB of RAM, only a 256GB SSD (non-upgradable) and MacOS, which is not my OS of choice.\n\nIn addition, it is a used one, which means higher chances of breaking down and higher cost of repair compared, for example, to the Thinkpad. So, for my use, in all aspects, apart from single core performance and battery life, the MacBook is worse compared to the other options, for my use.",
  "If you intend to do development on this machine, I wouldn't suggest skipping on RAM and GPU/NPU, but slight compromise on SSD and battery can be done for cost.  \n\nHP hinges do have a bad image. Handle with care.",
  "Lenovo Thinkpad X1 Carbon Gen 13 for € 1880 OR Acer Travelmate P6 AI for € 1540 Please help me decide between Lenovo Thinkpad X1 Carbon Gen 13 for € 1880 or Acer Travelmate P6 AI for € 1540. Prices are for Austria.\n\nBoth devices have many things in common, these are the things that are important to me. Nevertheless there's a € 300 difference, so should I opt for the Travelmate? Or ist it worth paying a little more for a Thinkpad? What are your experiences? What do you think of the pricing?\n\n|Acer TravelMateP6 14 AITMP614-54T-TCO|ThinkPad X1 Carbon Gen 13|\n|:-|:-|\n| €                   1 539,03| €                   1 881,78|\n|NX.BJMEG.001|21NSCTO1WW|\n|Windows 11 Pro|Windows 11 Pro|\n|Core™ Ultra 7|Core™ Ultra 7|\n|268V|258V|\n|5 GHz|4,80 GHz|\n|32 GB|32 GB|\n|PCI Express NVMe 4.0|PCIe 5.0 Performance TLC Opal|\n|IPS matt|IPS matt|\n|1 TB|1 TB SSD M.2 2280|\n|60 Hz|60 Hz|\n|5MP|8MP|\n\n",
  "Lenovo ThinkPad L15 Gen 2 Laptop 15.6” Ryzen 5 5600U 16GB RAM 256GB SSD Win 11 Just bought two L15 laptops.  I paid 270 each.  I have ram to upgrade to 32gb.  I also have NVME drives to upgrade to 1tb drives.\n\nI plan to run VMs on these computers for work.\n\nDid I over pay or pick a laptop that will de deficient?",
  "Should I buy the lenovo thinkpad X1 carbon 9th gen? ",
  "Lenovo Yoga 7i 2-in-1 Review (Gen 10 | 2025) Performance gets compared with AMD equivalent. Wins Best Laptop Award. [Full Review here](https://smbtech.au/reviews/lenovo-yoga-7i-2-in-1-review-gen-10-2025/).",
  "I had an Asus laptop with an Intel 258v, it gets hot and the fan is almost always on. Went back to Apple.",
  "Which model? Those clips are in ultraportables and gaming laptops and all of them have performance modes that let you adjust cooling and heat and power.",
  "Need your advice buy any used Lenovo ThinkPad E14 Gen 5 Hello guys i need your advice to buy a used Lenovo thinkpad E14 gen 5. It has an Intel ultra 5 125U and 16 GB of ddr5 and 512 GB NVME. I don't have a battery report yet but the seller promised me he will send me one tomorrow morning. It a small nick of the front of the laptop near the logo.\n\nThe price is around 400 dollars. \n\nI need your advice on what I need to look for also is there maybe other options better or is it a good deal etc.... ",
  "Samsung Galaxy Book5 Pro 360 vs HP OmniBook Ultra Flip 14 vs Lenovo Yoga 9i 2-in-1 Gen 10 Aura Edition Hi everyone!  \nI’ve been researching 2-in-1 laptops for months because I want to buy one during Black Friday and honestly, it’s been *hard*. I don’t know much about PCs or specs, so I’m hoping some of you can lend me a hand!  \n(I would love to be able to use it in uni, to keep it for a solid 5-6 years, to be able to use krita for drawing/ light animations and to do a little light gaming like vanilla minecraft and stardew valley)\n\nAfter a lot of digging, I narrowed it down to three main contenders:\n\n* **Samsung Galaxy Book5 Pro 360**\n   * **Pros:** part of the Samsung ecosystem, anti-glare display, comes with the S Pen, great battery life.\n   * **Cons:** only 16 GB of RAM available, 16″ feels a bit too big, and I’ve seen a few mentions of screen cracking? I couldn’t find many detailed reviews: almost no one seems to be talking about it, and the few reviews out there only cover the 32 GB model (which isn’t even available)\n* **HP OmniBook Ultra Flip 14**\n   * **Pros:** 32 GB RAM option, battery life, very sleek design.\n   * **Cons:** keyboard doesn’t seem great, and the audio quality apparently isn’t that good, pen not always included\n* **Lenovo Yoga 9i 2-in-1 Gen 10 Aura Edition**\n   * **Pros:** keyboard, build quality, OLED screen, 32 GB RAM, pen included\n   * **Cons:** battery life might not be as strong as the other two, and the display seems quite reflective with little to no anti-glare coating.\n\nIf anyone has real-world experience with any of these, or recommendations for better alternatives in the same range, I’d love to hear your thoughts!",
  "I’m planning on buying a lenovo yoga 7i 2 in 1 gen 9 14inch. Is there any problems with this laptop. \nI heard that it might have have low battery life, fan loud and laptop heating on easy tasks. \nHope it’s either just some people that got unlucky with faulty laptops \n\nHere are the specs\nLaptop Specs (Lenovo Yoga 7i Gen 9 - 14”)\n\t•\tProcessor: Intel® Core™ Ultra 5 125H (E-cores up to 3.60GHz, P-cores up to 4.50GHz)\n\t•\tOS: Windows 11 Home 64-bit\n\t•\tGraphics: Integrated Intel Graphics\n\t•\tMemory: 16GB LPDDR5X-7467MT/s (soldered)\n\t•\tStorage: 1TB SSD M.2 2242 PCIe Gen4 TLC\n\t•\tDisplay: 14” 2.8K (2880x1800) OLED, Touch, HDR 500, 100% DCI-P3, 400 nits, 120Hz, Low Blue Light\n\t•\tCamera: 1080p FHD IR Hybrid + Dual Microphones\n\t•\tBattery: 71Wh (4-cell Li-ion)\n\t•\tCharger: 65W USB-C (ANZ 3-pin, 90% PCC)\n\t•\tPen: Lenovo Digital Pen included\n\t•\tFingerprint Reader: ❌ None\n\t•\tKeyboard: Backlit (Storm Grey, English US)\n\t•\tConnectivity: Wi-Fi 6E (2x2 AX) + Bluetooth 5.1+\n\t•\tWarranty: 1 Year On-site\n\t•\tColour: Storm Grey\n\t•\tPart Number: 83DJCTO1WWAU3\n\n\n",
  "Help me choose. Lenovo LOQ-15 or ThinkPad P15 Gen 2 Hey everyone! I’m looking for a laptop and I’ve narrowed it down to two options. I’ll mostly use it for my OJT and some light gaming (I play The Sims 4 and Roblox). Would love your help or recommendations! TIA.\n\nLenovo LOQ-15 (Brand New)\n\nIntel Core i5-12450H (12th Gen)\n\n8GB DDR5 RAM\n\n512GB SSD\n\nIntel ARC A530 GPU\n\n15.6\" FHD 144Hz display\n\nWindows 11 Home\n\n\nLenovo ThinkPad P15 Gen 2 (Secondhand)\n\nIntel Core i7-11800H\n\n32GB RAM\n\n1TB NVMe SSD\n\nNVIDIA T1200 4GB GPU\n\n15.6\" FHD display\n\nWindows 10 Pro\n\n\n\n\n\n\n\n\n\n",
  "i would say it depend the thinkpad is going to have  better build quality, display \n\nand the loq will have better battey life and easier to carry",
  "No brainer, get the ThinkPad",
  "Gen 9 or Gen 10? Lenovo Yoga 7i 2-in-1. I've almost placed my order for the **Yoga7i 2-in-1 Gen 9** (Intel Core Ultra 7 155H; 16 GB RAM). But recently saw Gen 10 and realized that it was still somewhat within my budget.\n\nBut as the Gen 9 is fairly trusted (and as of now, Gen 10 isn't) I'd like to hear some opinions on whether Gen 10 might have any issues or not.\n\nPlease help me in making the final decision.",
  "Thinkpad T14S Gen 2 vs Asus Zen 14 OLED vs MacBook Pro M1 ",
  "Surface Pro 7 vs Lenovo ThinkPad Yoga X1 (3rd Gen) I'm planning to go on a backpacking trip quite soon and I was looking on eBay for cheap laptops to take along. \n\nThe issue is that I'm also a freelance designer and I want to work on my portfolio on the go. For Adobe, Rhino (no ARM), Affinity I figure I need atleast 16RAM, 32 is hard to find for cheap, and I don't want to take a 1.500€+ device around the globe right now. Also has to be thin and lightweight. I already bought a Surface Go 3 - lovely device but too small, too weak. \n\nI found two good offers in my city and need to make a quick decision.\n\nNr 1: \nSurface Pro 7, 12,3\", 16RAM, i5-1035G4, 256gb, Intel Iris Plus Graphics -- for approx 400€ (maybe I can bargain)\n\nNr 2.\nLenovo ThinkPad X1 Yoga (3rd Gen), 14\", 16RAM, i5-8th Gen., 256gb , Intel UHD Graphics -- 180€ (maybe can bargain)\n\nBoth are kinda refurbished with good battery life. Both convertible (need that for illustrations). \n\nI'm super unsure if 12,3\" will be too small for work, but also of the Lenovo is too bulky, even tho it's only 1,3kg or so. I love the design of the surface go, so thinking of going with the pro, but pro maybe more a target for theft and maybe not as durable... Also more pricy. On the pro side I think it's better to resell. Also nicer as a overall decide to make notes etc.\n\nWhat do you all think. I wish I could get a really good one for my work but I am still too scared of breaking it or it being stolen. :/ currently I have a surface book 2, 15\" that is way too heavy and both batteries are death and touchscreen doesn't work. So I anyway need a proper replace in the future, but maybe that will be a company device then. \n\nThanks! \n",
  "Lenovo ThinkPad P14s Gen 5 — Structural Creak Issue Tied to Missing SD Card Slot Reinforcement? Looking for confirmation from other users ",
  "Love my Lenovo L14 Gen 2, but ... ",
  "Lenovo P15 Gen 2 specs comparison. Hi, I'm currently choosing second-hand Lenovo P15 Gen 2. And I have 2 possible options, and I would love to hear some more experienced opinions.  \nI'm 100% sure that I want the P15, and I need 64 GB RAM.\n\nMy options are: (Everything else is the same)\n\n1. Intel i7 11850H, RTX A3000,RAM: 64GB, SSD: 1012GB for 987€\n2. Intel i9 11950H, RTX A4000, RAM: 32GB, SSD: 1256GB for 1075€ (+RAM upgrade: up to 280€)\n\nSo my question is: Is it worth the price? For this small upgrade.\n\nI'm adding benchmark comparison:\n\nhttps://preview.redd.it/3i945p4x89xf1.png?width=1521&format=png&auto=webp&s=02823e439a8695fc5058fc78e01f7a2762782ff1\n\nhttps://preview.redd.it/1ay7q2rz89xf1.png?width=1425&format=png&auto=webp&s=d148fd359c46d65a20c979cb6a8a2e2280103423\n\nTHANKS!!!",
  "Help me choose — ASUS ROG Zephyrus G14 OLED vs Lenovo ThinkPad P1 Gen 7 for an Engineering Student Hey everyone,  \nI’m an **engineering student**, and I’m trying to decide between two excellent-condition laptops. I’ll be using **MATLAB, CAD, and other engineering software** (like simulation and modeling tools). Both are high-end specs, but I’d love your take on which makes more sense for my needs and budget.\n\n# 💻 Option 1: ASUS ROG Zephyrus G14 OLED (2024)\n\n* **Condition:** Excellent (no dents or scratches) — original charger & box included\n* **CPU:** AMD Ryzen 9 8945HS\n* **GPU:** NVIDIA RTX 4070 (8 GB)\n* **RAM:** 32 GB\n* **Storage:** 1 TB SSD\n* **Display:** 14″ OLED, 120 Hz (2880×1800)\n* **Price:** €1,730\n\n\n\n# 🖥️ Option 2: Lenovo ThinkPad P1 Gen 7 (2024)\n\n* **Condition:** Factory refurbished / sealed, under Lenovo warranty until 2026\n* **CPU:** Intel Core Ultra 9 185H (with vPro)\n* **GPU:** NVIDIA RTX 2000 Ada (8 GB)\n* **RAM:** 32 GB LPDDR5x\n* **Storage:** 1 TB SSD\n* **Display:** 16″ IPS, 165 Hz (2560×1600, 500 nits)\n* **Price:** €1,990\n\n\n\n# ⚙️ My use case\n\n* Engineering software: **MATLAB, SolidWorks, Fusion 360, Simulink**, and some data visualization\n* Portability & battery life matter, but performance and reliability are my priorities\n* Hoping for something that’ll last 4–5 years through uni and early career\n\n# ❓What would you pick?\n\nFor an engineering student mainly using MATLAB and CAD, is the **ASUS worth it for the GPU and lower price**, or is the **Lenovo’s reliability and warranty** the smarter long-term choice?",
  "I would choose G14",
  "Asus Zenbook S14 Oled vs Lenovo ThinkPad X9 15 Gen 1 Which one should I buy from these 2 ? Specs are almost identical. The Lenovo is significantly more expensive. But is it worth that extra money ? ",
  "[Update on a previous post. The laptop wasnt available but there are two other options] should i buy an hp probook (image 1) i5-7th gen 8gb ram 256 gb or the lenovo thinkpad (image 2) with same specs as the probook [i need it for light gaming eg; minecraft, terraria, ultrakill...] ",
  "Both have 14 inch display",
  "buy the whatever feels nicer in your hand, they were directly competing products when brand new\n\nand ask if you can turn them on, and look at their displays",
  "Please remember this is a 8 year old machine. It's fine to go the pre owned route but buying an almost decade old laptop isn't exactly wise.\n\nFocus on more on the generation rather than i5/i7. 12th Gen is ideal.. And 8th Gen is the absolute oldest you should go. If it's ryzen then it should be at least 4500u/4700u.",
  "i must say ive only had good experiences with ThinkPads. Solid buisness laptops that last. \n\nHP on the other hand havent always been as reliable for me. \n\nI'd definitely reccommend the ThinkPad out of the two ☺️",
  "As someone who resells laptops, I usually sell 8th gen Intel laptops with 16GB for about $110-$130. The specs on these make them not worth it. Probooks tend to be bulky. Elitebooks are usually better for HP. If you’re wanting portability I’d suggest the hp EliteBook 840 G5, G6, or G7 for around the $150 price. FB marketplace has some. I got an elitebook x360 with an i7 16GB for about $200, but that’s because I was lucky and kept looking. \n\nHeck for $150 I have a Dell latitude with a 10th gen i5 and 16GB if you’re interested in something lightweight. Pm me and I’ll send you the specs",
  "Go with the thinkpad L470.. and just add another 8gb stick.. in some other time if you have a budget replace the ssd with a 500gb or 1tb.☺️",
  "The only problem with these is they are going to be unsupported after October due to Micro$oft cutting Windows 10 support.  You can kludge 11 on but it's not really recommended.  What is your budget?",
  "I had T460 and now Elitebook X360 1030 G2 and elitebook wins feel in hand by miles. It´s incredibly thin even for today, pretty light (1,3kg) and handles regular web browsing stuff on Win11 well with 6+ hours of battery life.\n\nI still prefer look and modularity of thinkpads.",
  "I dont have such a budget, bothe are around 150$. The one i buy will be my first laptop, and i dont see how the 7th gen will impact my gaming. I used one with a worse cpu and it ran the games mentioned normally with minimal problems",
  "Sure there might be such laptops for 150 but i dont do online shopping, and if i did it would be from out of the country  and i doubt someone would like to deliver into the middle east",
  "Thats the available choices",
  "About 150$ more or less. Hp is 165 and lenovo is 150",
  "150 is enough money to get a 8th-10th Gen machine no matter where you are. Please try more places around you, these folks are clearly ripping you off.",
  "This is the cheapest place around. I live in a country full of scammers, and this might be the fairest one out of the few that are close to me",
  "17k ; 2nd hand Lenovo Thinkpad L14 Gen 2 Hello guys, I just want to hear your thoughts about the laptop that is being sold for around 17k. I gonna use for more likely multitask, mid use of Cad and Simulation as engineering study, thank you for your answers.",
  "It is 17k pesos, my bad",
  "Check out Lenovo ThinkPad P1 Gen 4 16\" i7-11850H 32GB 512GB Quadro T1200 Win 11 No AC on eBay! Did I make a good purchase for $520?",
  "It has 4k resolution",
  "So a replacement AC is about additional $30 give or take?\n\nI'd just make sure it's from one of those reputable sellers with an icon. The thing is, you're going to need to buy the AC charger, then hope it works. And if it doesn't, you'll need to return everything back?\n\nSide note: I went with the T series just because they are less power hunger, smaller, and longer battery life. My use case is only for school and light browsing. \n\nWhat's your use case btw?",
  "I found a 135 w Lenovo original AC for $18 from a reputable seller. I also have one lying around from my workplace (use Lenovo) which I can test with. The seller around returns within 30 days if there’s any issue. \n\nUse case is for my wife as her primary computer, she uses Wix for design and dropshipping business, Netflix streaming, discord streaming, Adobe Photoshop and video editing as well.",
  "Sounds good, looks like you're on the right track with the P series given the info you provided.",
  "Which one should I get: Lenovo Ideapad 5i 2-1 gen 10, or HP Omnibook 5 bundled w/ other accessories? I'm looking for a laptop for studying and essay-writing, as well as occasional gaming and music production, especially one that would last for a number of years. I've come down to the two options mentioned above:\n\n* Ideapad (https://www.lenovo.com/gb/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-16-inch-intel/83kscto1wwgb2)\n* Omnibook (https://www.hp.com/gb-en/shop/product.aspx?id=BG3K6EA&opt=ABU&sel=NTB)\n\nIt's important to note that with the Ideapad, I can get a wireless mouse, pen and wifi 7 for +£30. However, the 2-1 functionality is not essential to my needs. The main things for me to consider is which one has the better processer (amd ryzen ai 7 vs intel ultra 7), which one would be more reliable, if the oled on the ideapad is worth it, which one has the better bundle of accessories, and how the each laptop feels to use (build quality, keyboard + trackpad feel, weight, etc)\n\nBtw I'm planning on using student discounts on both of them, taking the price of the omnibook down to around £680, and the price of the ideapad down to around £655. ",
  "Lenovo Yoga 7 or 7i (2-in-1 Gen 10) Hi everyone,\n\nI want to purchase a Lenovo Yoga 7/7i 2-in-1 but I'm not shure which one to choose.  \n(32 GB RAM, 1 TB storage, 2.8 K OLED Display)\n\n\\* AMD AI 7 350  \n\\* Intel Ultra 5 228V\n\nThe Intel is slightly more expensive than the AMD but it doesn't matter that much.\n\nThe laptop is intended for light use (mainly studying).  \nI want to have a smooth experience and great battery life.\n\nHow is battery life compared to each other and which one would you recommend?",
  "Edit: I could also upgrade the Processor to an Intel Ultra 7 258V for \\~ 120 € more, but I don't think it's worth it.",
  "Dell XPS 14/16 vs Lenovo Thinkpad T14 Gen 6/X1 Carbon Gen 13 I’ve spent a lot of time researching laptops for what I need and this is what it seems like it comes down to. I am moving on from my M1 MacBook.\n\nI just need a quick laptop that can run multiple chrome users/tabs at once. The Lenovo is tempting me as it is 32gb ram with accessibility to upgrade to 64gb however I could go with the 64gb ram XPS off the bounce. \n\nDoes anyone have any recommendations on what to go for? I’m really not too sure on the benefits of either I just need speed and volume as you can tell graphics is not what I need.\nThanks for the help.",
  "Either the T14 or the X1 Carbon.\n\nThe XPS units will give you nothing but trouble reliability wise.",
  "Anything you advise when deciding between those 2?",
  "I'm preferential to the T14 due to the thicker chassis and ease of maintenance and upgrades.",
  "Is there a better 2-in-1 than the Thinkpad X1 Gen 10 Aura Edition Intel Core Ultra 268v 32GB 2TB Arc 140v if cost is no issue? ",
  "Depends on your use case.\n\nPX13 is an absolute beast, you cannot find a better performing convertible, period. However only get the 4060 if it is on sale, as 2025 version likely will come out soon. The battery life is not super good though, and because it is a beast, unfortunately USB-C PD cannot fully power it.\n\nThinkpad is better if you use Linux. And I would personally argue nothing beats the keyboard/trackpad. Even MacBooks, I find myself prefer the Thinkpad two button style trackpad compared to my MacBook Pro.\n\nYoga I personally hate the keyboard so not really. It feels horrendous. I would rather use iPad keyboard than that shit.\n\nI have used all 3, just not the Aura edition and 9i exactly, but should be similar experience.",
  "It will be used for general web searching with a million tabs and photoshopping pictures with adobe (not videos or rendering). Being able to charge over USB-C would be a borderline requirement as well. \n\nMy gut says I won't come close to utilizing the preformance of the Artbook offers over lunar lake laptops with Arc 140v to an extent that it would justify drawbacks like the battery life and heat. \n\nWhat is expected with the 2025 version?\n\nHow do the screens and color accuracy compare between the thinkbook and ProArt? S",
  "My Thinkpad T14s gen 2 won't start or charge ",
  "Thinkpad L16 Gen 1 vs Thinkpad E16 Gen 2 vs Thinkbook 16 G7 IML I'm looking for a new laptop which I will mainly use for internet browsing, Office applications and watching the occasional film. I've narrowed my search down to the three models below. They all have the same processor/memory/storage/display. The main differences are in the USB ports (L16 has 5, E16 and Thinkbook have 4), audio chip/speakers and warranty. \n\nAny suggestions as to which I should go for?\n\n  \n**Model: Lenovo Thinkpad L16 Gen 1**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB SSD M.2 2280 PCIe® 4.0x4 NVMe® Opal 2.0\n\nBattery: 46.5Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Senary SN6147 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Audio™\n\nNetwork Card: Intel® Wi-Fi® 6E AX211, 802.11ax 2x2 + BT5.3\n\nUSB Ports: 1x USB-A (Hi-Speed USB / USB 2.0), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On 1x USB-C® (USB 20Gbps / USB 3.2 Gen 2x2), with USB PD 3.0 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n\nWarranty: 3 years on parts & labour\n\nPrice: €1226\n\n \n\n**Model: Lenovo Thinkpad E16 Gen 2**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB SSD M.2 2280 PCIe® 4.0x4 NVMe® Opal 2.0\n\nBattery: 47Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Senary SN6141 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Atmos®, audio by HARMAN\n\nNetwork Card: Wi-Fi® 6E, 802.11ax 2x2 + BT5.3\n\nUSB Ports: 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 10Gbps / USB 3.2 Gen 2), Always On, 1x USB-C® (USB 20Gbps / USB 3.2 Gen 2x2), with USB PD, 3.0 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n\nWarranty: 3 years on parts & labour\n\nPrice: €1138\n\n \n\n**Model: Lenovo Thinkbook 16 G7 IML**\n\nProcessor: Intel Core Ultra 5 125U\n\nMemory: 1 x 16Gb SO-DIMM DDR5-5600\n\nStorage: 512GB M.2 PCIe 4.0 SSD\n\nBattery: 45Wh\n\nDisplay: 16\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC\n\nAudio Chip: High Definition (HD) Audio, Realtek® ALC3287 codec\n\nSpeakers: Stereo speakers, 2W x2, Dolby Audio™\n\nNetwork Card: Wi-Fi 6, 802.11ax 2x2 + BT 5.2\n\nUSB Ports: 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), 1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On, 1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.1 and DisplayPort™ 1.4, 1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.1 and DisplayPort™ 2.1\n\nWarranty: 2 years on parts & labour\n\nPrice: €875",
  "ThinkPad L13 Yoga Gen 2 fan failure ",
  "Title: 7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Says It’s a Game Changer in 2025 🎮 Hey everyone,\n\nI just read this review titled *“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025”* and thought it’d be worth sharing/discussing. (Link included below.)  \nHere’s a quick breakdown + my take — would love to hear what you all think:\n\n# 🔍 Key Highlights from the Review\n\n1. **Top-tier graphics & processing** – It leans on Intel + latest RTX (5000 series) hardware for serious gaming punch.\n2. **Stunning OLED 240 Hz display** – Crisp visuals, high refresh, rich colors.\n3. **Performance & cooling optimized** – Good thermal design (especially on a stand) helps sustain heavy loads.\n4. **Strong build quality & premium feel** – Materials and finish got good praise.\n5. **Quiet / balance modes are effective** – You don’t always have to blast full power.\n6. **Decent audio & ports** – For a gaming laptop, it doesn’t skimp too much.\n7. **Some compromises & trade-offs** – Battery life is underwhelming, smudge-prone surfaces, and the new port layout (sides vs back) isn’t ideal for everyone.\n\n# My Thoughts & Questions\n\n* This looks like a beast if you mostly use it plugged in — for gaming, video, creative work. But if you're mobile and need long unplugged sessions, the battery life sounds weak (which echoed in other reviews too).\n* The OLED + 240 Hz combo is tempting, but in bright environments, reflections may kill the vibe.\n* Side instead of rear ports is a controversial change — ergonomics over aesthetics?\n* I’m curious: for folks who’ve tried it, how is it in real-world use (noise, heat, battery wear)?\n\n**Link to full review (for reference):**  \n“7 Powerful Reasons the Lenovo Legion Pro 7i Gen 10 Review Proves It’s a Game Changer in 2025” [mesnbot.com](https://mesnbot.com/7-powerful-reasons-the-lenovo-legion-pro-7i-gen-10-review-proves-its-a-game-changer-in-2025/?utm_source=chatgpt.com)",
  "ChatGPT review lol",
  "Looking for a compatible replacement screen for Lenovo 14w Gen 2 (82N9) \nI have a Lenovo 14w Gen 2 (82N9) laptop and the screen is broken. I want to replace it with a compatible screen.\n\nHere are the specs of my original screen:\n\t•\tSize: 14.0’’\n\t•\tResolution: Full HD (1920x1080)\n\t•\tPanel type: IPS\n\t•\tConnector: 44-pin eDP\n\nI’m looking for the cheapest option that will fully work with my laptop.\n\nIf anyone has replaced this screen before or knows a reliable place to buy a compatible replacement, your advice would be really appreciated",
  "Lenovo Thinkbook 14 2 in 1 gen 5 or Yoga 7 gen 10? Currently on the market for a new laptop to replace my 2 in 1 chromebook for uni work and sketching on the go.\n\nBoth of those options seem to be on my budget and seem to be highly regarded.\n\nSo, whilst I'm personally leaning towards the yoga 7 due to better screen, better chip, audio and battery. I'd love to know what everyone else thinks.\n\nThe main advantage I've gotten so far for the thinkbook is slightly better built quality, upgradability (but the yoga I'm looking at already comes with 24gb ram and 1 tb storage) and a built in finger print sensor.",
  "Thinkbook 2 in 1. Better thermals, good ips screen, upgradability.",
  "Solución: ThinkPad T14s Gen 2 no se apaga completamente (LED parpadea, ventilador sigue encendido, se calienta en mochila)\" Anteriormente cuando apagaba mi laptop de alguna manera no see apagaba completa y dejaba el ventilador encendido y el pequeño LED parpadeando, lo que resultaba incómodo de transportar porque al estar funcionado en espacio cerrado se calentaba.\nLa solución fue...\n\n¡Hola a todos! Comparto mi experiencia con un problema común en la Lenovo ThinkPad T14s Gen 2 (modelo 20WM, Intel), donde la laptop no se apagaba del todo al darle a \"Apagar\". Quedaba en un estado como de hibernación: el LED (bombillo) parpadeaba, el ventilador seguía corriendo, y si la metía en la mochila se calentaba mucho. Para encenderla de nuevo, tenía que forzar el apagado manteniendo el botón de encendido por unos segundos. La garantía ya había expirado, y ni técnicos locales ni actualizaciones estándar lo resolvían.\nEsto parece ser un bug conocido relacionado con un driver conflictivo (ELAN SMBus Driver), según boletines de Lenovo (como HT513888) y foros. Después de probar varios pasos, lo resolví eliminando ese driver específico. Aquí va un guía completa con todo lo que intenté y la solución final. Asumo Windows 10/11; si usas otro SO, adapta.\nPasos previos que probé (y no resolvieron solos, pero son recomendados para diagnosticar):\nDesactivar inicio rápido: Ve a Configuración > Sistema > Energía y suspensión > Configuración adicional de energía > Elegir el comportamiento de los botones de encendido > Cambiar configuración actualmente no disponible > Desmarca \"Habilitar inicio rápido\". Guarda y reinicia.\nDesactivar hibernación: Abre Símbolo del sistema (CMD) como administrador y ejecuta: powercfg -h off. Reinicia.\nReset de energía (power drain): Apaga (o fuerza), desconecta cargador y periféricos, mantén presionado el botón de encendido por 30-60 segundos. O usa el agujero de reset en la parte inferior (con un clip por 10-15 seg). Reconecta y enciende.\nActualizar todo via Lenovo Vantage: Instala la app si no la tienes, actualiza drivers, BIOS y firmware. Verifica que BIOS esté en la versión más reciente (en mi caso, 1.36.38 o superior; descarga manual desde support.lenovo.com si Vantage no lo detecta).\nTroubleshooters de Windows: Configuración > Sistema > Solucionar problemas > Otros solucionadores > Alimentación > Ejecutar. También en CMD como admin: sfc /scannow y DISM /Online /Cleanup-Image /RestoreHealth.\nModo Seguro: Reinicia con Shift presionado > Solucionar problemas > Opciones avanzadas > Configuración de inicio > 4 para Modo Seguro. Prueba apagar ahí para ver si es software tercero.\nReset BIOS a defaults: Enciende presionando F1 para entrar a BIOS > Exit > Load Optimal Defaults > Save and Exit.\nSi nada de esto resuelve, pasa a la solución principal.\nSolución que funcionó: Eliminar el driver ELAN SMBus conflictivo\nEste driver (no nativo de Intel) causa el bloqueo en el apagado. Lenovo recomienda reemplazarlo por el de Intel.\nConfirma el driver:\nAbre Administrador de dispositivos (busca en menú de inicio).\nExpande \"Dispositivos del sistema\".\nBusca \"ELAN SMBus Driver\" (o similar). Clic derecho > Propiedades > Detalles > \"Nombre de INF\". Anota el nombre (en mi caso, oem62.inf; puede variar como oemXXX.inf).\nDesinstala el driver via CMD:\nAbre Símbolo del sistema como administrador.\nNavega al directorio: cd \\windows\\system32\\DriverStore\\FileRepository\nEjecuta: pnputil /delete-driver oemXXX.inf /uninstall /force (reemplaza oemXXX.inf con el tuyo, ej. oem62.inf).\nVerás un mensaje como \"Paquete de controladores desinstalado\" y \"El paquete de controladores se eliminó correctamente\". Ignora la nota sobre /force si aparece; es normal.\nReinicia la laptop: Después, el driver Intel debería cargarse automáticamente. Prueba apagar: ahora toma unos segundos extra (normal), el LED se apaga completamente, y el ventilador se detiene sin calor residual.\nVerifica post-reinicio:\nEn Administrador de dispositivos, el SMBus debería decir \"Intel SMBus\" ahora.\nSi no, descarga manualmente \"Intel Chipset Device Software\" desde support.lenovo.com para tu modelo y actualiza via Vantage.\nChequea el Visor de eventos (busca en menú) > Registros de Windows > Sistema > Filtra por \"Kernel-Power\" para ver si hay errores (como código 41).\nDespués de esto, mi T14s Gen 2 se apaga y enciende perfecto. No más forzados ni calor en la mochila. Si reaparece (por updates de Windows), repite la desinstalación.",
  "Buying lenovo thinkpad e16 gen 2 and want to get the best deal ",
  "LOCKED BIOS - Lenovo ThinkPad T14 Gen 4 (21HE) I bought a Lenovo ThinkPad T14 Gen 4 (21HE) at an auction. The BIOS/UEFI is locked with a Supervisor Password. A repair shop reflashed both EEPROMs from scratch (64 MB BIOS REGION and 16 MB ME REGION), but the password remained. They concluded the password resides in the MEC1723N EC, which isn’t rewritable with conventional bench tools and also has epoxy underneath, making replacement difficult. I’m trying to contact the original company to have it cleared officially.\n\n**Device**  \nModel: ThinkPad T14 Gen 4 (Intel), Type 21HE\n\n**Repair shop’s assessment**\n\n* From their investigation (including reading and analyzing the extracted hex), they did not find any sector in the EEPROMs where the password might be stored.\n* Conclusion from their studies: on some T14 units, the Supervisor Password is stored in the **Embedded Controller (EC)**, specifically the **MEC1723N**.\n\n**Practical issues:**\n\n* The MEC1723N would have internal firmware with no known method for reflashing using standard bench tools;\n* Lenovo uses black resin/epoxy under the chip, making desoldering/replacement almost unfeasible;\n* Even swapping in a “blank” chip would require the proper EC firmware, which the shop does not have.\n\n**Technical confirmation:**\n\n* On a **ThinkPad T14 Gen 4 (21HE)** with **MEC1723N**, does the **Supervisor Password** indeed reside in the EC?\n* Has anyone here successfully **reprogrammed or replaced a MEC1723N** (preserving firmware integrity), or can confirm that it cannot be done without Lenovo’s proprietary resources/firmware?\n\n**Legitimate paths:**\n\n* Beyond **system board replacement** and the **official process via the previous owning company**, is there any **authorized route** (e.g., **Lenovo Authorized Service Centers**) that can **reflash/synchronize the EC** to clear the SVP?\n\nThank you.",
  "The MEC1723N does contain the SVP, and reading online from people who have attempted it, it is very much possible to remove the black resin, although with some roughness.\n\nhttps://www.badcaps.net/forum/troubleshooting-hardware-devices-and-electronics-theory/troubleshooting-laptops-tablets-and-mobile-devices/3498772-guide-to-transplant-mec1503-ec-chip-and-eeprom-reprogamming-for-t14s-gen-2-and-x13-gen-2\n\nMy best bet would be replacing the whole chip with a cleanly flashed one, and then after using this guide to change your model name, serial, etc back to original",
  "I suggest you would make a post on badcaps.net , they could certainly help you there better than any one here!",
  "Lenovo Thinkpad 11e Gen 5 $44 I want to get 2 laptops for my 7 and 6 year old for our homeschool program, I came across some of these Lenovo thinkpad 11e gen 5s for $44 ea, is that a good price point in This day in age? Seller says they are 2022/2023 models and have these specs:\n\nWindows 11 pro\n128 gb nvme SSD\nIntel Core N4100 processor ",
  "$44 for a working laptop of any age is good",
  "Lenovo yoga 13w gen 2 failing to post ",
  "Is ThinkPad P14s gen 2 i7-1185g7 NVIDIA t500 a good choice? ",
  "Amigo, ¿cuál opción vale más la pena? El precio está en pesos mexicanos. Estoy entre la ThinkPad T14 Gen 2 y la HP EliteBook 830 Gen 8. ",
  "No soy un experto en computadoras portátiles de ninguna manera, sé mucho más sobre PC, pero diría que evite HP a toda costa. Hay una razón por la que todo el mundo dice que HP significa Problemas de bisagra: siempre terminan agrietándose o rompiéndose. Obviamente, busque reseñas de productos y otros comentarios aquí, pero en mi opinión, nunca consideraría una HP cuando miro computadoras portátiles.",
  "Lenovo, son más confiables.",
  "Need help choosing between Lenovo ThinkPad X9-14 Gen 1 and ASUS Zenbook 14 OLED — big price gap, similar specs? Hey everyone,\n\nI don’t have the best knowledge about laptops, but I’ve been doing some research and narrowed it down to two options that seem to have very similar specs on paper — yet there’s a huge price difference. I’d love your input on which one makes more sense for my needs, and why Lenovo is charging so much more. Also open to other suggestions in this range.\n\n**Main use case:** Heavy Excel work, multitasking with Word/Teams/Excel, always have multiple browser tabs open, light editing, and long battery life.\n\n**Option 1:** Lenovo ThinkPad X9-14 Gen 1 — \\~$2000\n\n* **CPU:** Intel® Core™ Ultra 7 258V (LPE-cores up to 3.50 GHz, P-cores up to 4.50 GHz, 32 GB MOP)\n* **RAM:** 32 GB LPDDR5X-8533MT/s (Memory on Package)\n* **Storage:** 1 TB SSD M.2 2242 PCIe Gen4 TLC Opal\n* **OS:** Windows 11 Home 64\n* **Display:** 14\" WUXGA (1920×1200) OLED, Anti-Glare, HDR 500 True Black, 100% DCI-P3, 400 nits, 60Hz (Optional +$150 upgrade to 2.8K OLED Touch, 500 nits, VRR 30-120Hz)\n\n**Option 2:** ASUS Zenbook 14 OLED UX3405CA-PZ163WS — \\~$1350\n\n* **CPU:** Intel® Core™ Ultra 7 255H (2.0 GHz base, up to 5.1 GHz, 16 cores / 16 threads, Intel® AI Boost NPU up to 13)\n* **RAM:** 32 GB LPDDR5X (onboard, dual-channel)\n* **Storage:** 1 TB M.2 NVMe PCIe 4.0 SSD\n* **OS:** Windows 11 Home\n* **Display:** 14\" 3K (2880×1800) OLED Touch, 100% DCI-P3\n\n**My questions:**\n\n1. Which would you pick for my needs, and why?\n2. Is the ThinkPad premium purely brand and build quality or is there something else I’m missing?\n3. Any other laptops I should be considering in the \\~$1300–$2000 range with similar specs?\n\nThanks in advance for the help! I really appreciate it :)",
  "[removed]",
  "The x9 has a haptic touchpad, which is very cool and makes it seem much more expensive than if you don't have a haptic. If you take the x9, buy it without the operating system and install it yourself, saving yourself €40.",
  "Both seem to have a 120Hz refresh rate. I guess it’ll mostly come down to build quality and feel in hand. I’ll try to check them out in person before deciding. Thanks for your input!",
  "Lenovo Thinkpad e14 gen 6 et gen 7 ",
  "How do i connect 2 laptop screens together I have a lenovo thinkpad L480 and an ideapad slim 3i both running windows 11 and i want to connect them with a hdmi cable. I have a hdmi cable but when i try to connect my ideapad with my thinkpad  it said that the screen is too old. Is there anyway to fix this? ",
  "  \nTo do this follow these steps:\n\n1. **Do this on the computer you are using as the second monitor**\n   1. Click on the windows icon (bottom left)\n   2. Type **Project**\n   3. Click Projection Settings\n   4. If you see the message \"Add the \"Wireless Display\" option feature to project this PC\" follow these steps:\n      1. Click the Optional Features button\n      2. Search for wireless display\n      3. Install it\n   5. Change from \"Always off\" to On\n2. **Do this on your Main Computer**\n   1. Ensure both devices are connected to the same WIFI\n   2. Hold down the Windows key + K\n   3. Select the second monitor's name\n3. **Done**",
  "Solved: Thanks to u/BalanceField\n\nDecided to connect them wirelessly with u/BalanceField's guide\n\n[link to guide](https://www.reddit.com/r/laptops/s/nQf2fGb4zs)",
  "Fellow Tapir enjoyer o7",
  "You can use the wireless display feature on windows.",
  "Use a monitor? \n\nHDMI ports on laptops are outputs, not inputs.",
  "shit day on the markets I see....damn...",
  "1. Download Microsoft PowerToys\n2. Enable \"Mouse Without Borders\"\n3. Generate a security key on one computer and past it in the other one.\n4. Click refresh connection and your all set.\n\nFeel free to change the settings to your liking.\n\nYou can use both computers like you use to, but you can also move the mouse (and keyboard) from one computer to the other one.",
  "Use super glue",
  "nimi nightmare spotted",
  "nimi",
  "nimi jumpscare",
  "I've used Spacedesk for using a second laptop as a second monitor. Works fine and wireless.",
  "Windows comes built in with miracast, you do not need cables even, just a common wifi connection.",
  "That's quite the wallpaper haha",
  "Duct tape\n\n/s\n\ntho technically true",
  "Not possible since laptops only do video out. Why would you want to do that though?",
  "buy a good capture card",
  "you do not",
  "There's a fork of Sunshine called Apollo. It does a lot of the same local game streaming related things but it also allows you to create virtual displays out of the box. The Artemis client is currently only available for Android, but it works flawlessly with Moonlight too, which is available on everything.",
  "You can if you connect it as a wireless display, but is there a reason you're not selling both and buying one that can do both?",
  "Nice. Gonna have to try this on my setup now",
  "I think there is a software called barrier, which connects both the laptops together",
  "Is there a way yo do thing but each pc is on a différents os ? Lets say i want my main laptop (Endeavour) to have a second screen on the second laptop (Windows).",
  "awesome phone bro",
  "Probably not relevant anymore, but for future people searching for a more bandwidth efficient solution, there is a Microsoft Tool called [Mouse without Borders](https://www.microsoft.com/en-us/download/details.aspx?id=35460) which let you control up to 4 computers with a single mouse and keyboard.",
  "input director",
  "Duct tape",
  "WE'RE GONNA WIN SO MUCH YOU MAY EVEN GET TIRED OF WINNING",
  "set one up as a Wireless display in settings (can't do in windows home) or use a capture card to connect a hdmi cable to the laptop, then use OBS to display the image of the capture card, then set it to output the feed to the laptop monitor. Cheap capture cards are fine but have extra latency",
  "cast",
  "Stardock Multiplicity",
  "You could buy a cheap external hdmi to usb input device.\n\nThat way you could setup VLC for example to take the input and display it.\n\nI currently have a laptop with a set top box connected to it, but I can take my desktop and connect it the same way and have a resizable window it displays in.",
  "Do you want to use the a laptop as a second monitor for the other? Other people have already shown how. But if you want to control both laptops from either one PowerToys has a cool module called Mouse Without Borders, allows you to control multiple PCs from either one",
  "Make em kiss each other's ports",
  "Since you're on windows I'd recommend mouse without borders. It will let you use one computer as the input device for the other, as well as a shared clip board.\n\nIt's made by Microsoft so it works very well on their OS. I think it's a part of \"Power Toys\" now.",
  "you don’t need anything just download power toys from Microsoft store it’s official app from Windows. You can just go to any screen with the help of mouse wirelessly.",
  "wich specs for the ideapad tho",
  "stock is red, nimi is green, everything is balanced",
  "I use Barrier to connect my macbook and my windows pc together its great",
  "SpaceDesk",
  "there's an app called Input connect on Microsoft store aswell give that a try",
  "Use \"Mouse with out borders\".",
  "That’s now how it works",
  "based Nimi enjoyer",
  "duct tape",
  "Downloads Microsoft’s PowerToys and set up Mouse without borders",
  "My favorite anwser is Sunshine and Moonlight. \nAlthough it’s a little more nerdy.\n\nRequires WiFi or an Ethernet between the computers if you’re doing it right.\n\nHowever performance is a lot more reliable. similar to apples Sidecar if you’ve ever used it. Plus you can port forward and stream to whatever you want where ever you want. \n\nThis is a stretch of a scenario for the app but as someone who already has it setup this is what I would’ve done.",
  "Use Windows Wireless Display (Miracast):\n\t•\tOn the laptop you want to use as the second screen, go to:\nSettings > System > Projecting to this PC\nand enable it.\n\t•\tOn the primary laptop, press Windows + K, select the other laptop, and choose “Extend.”",
  "fellow napling 🙏",
  "This works very well",
  "Thank you. Great timing",
  "This is the way. And you don't even need to connect to wifi. It uses wifi direct connection.",
  "well TIL.. I didn't think that was possible.",
  "Would one be able to cast the phone screen this way perhaps?\n\nI have used Scrcpy till now.",
  "Is there a way to do this where there isn’t an entire second of latency? Is there some sort of cable…? I have piles of ridiculous HDMI and other cables and whatnot I’m sure one of them can do something.",
  "Sexy.",
  "TIL",
  "I'm more surprised this is possible..",
  "thank you kind stranger, learned something new today",
  "Apollo with moonshine/artemis is 10X better in my experience.  \nYou can set up \"headless\" with and advanced option that only activates the extra virtual display without disabling other displays.\n\nLess latency and higher visual quality in my experience.  \nAlso allows for using pretty much any platform as the extra display.",
  "Thanks sir I learned a new thing today",
  "Can I piggyback and ask how i can use my macbook air m2 as a secondary display for my windows gaming laptop?",
  "sometimes a hero doesn't wear capes, they share tips",
  "I have been looking everywhere. Is there any way to do this wires without a freaking capture card. I know you can from phone to pc with scrcpy, but haven't found anything for two pcs/laptop and pc",
  "it works better if on top of the wifi you connect the ethernet cable to the second laptop, where you are sharing the screen, although its connected through wifi, it smooths the connection to have it connected to ethernet 2 (preferably  both)",
  "How is the performance wirelessly?",
  "How to get it back to normal after this? (Separate them)",
  "Oh. Is there any other way to connect them?",
  "I think it was the screenshot of when Trump annouced his tarrifs.",
  "WHAT this black magic fuckery exists?? Thank you! I had PowerToys but never thought this was a thing",
  "A cross-OS alternative is Synergy by Symless, if anyone ever need to control a Windows, Mac, and Linux computers with one mouse and keyboard.",
  "Yeah... what is going on there?",
  "My thinkpad has 16gb of ram but a worse screen but my ideapad has soldered 8gb of ram but a better screen. If i manage to connect my thinkpad as my main machine and my ideapad as a second screen i can get a better quality screen while managing running heavy ram workload without the laptops drawbacks",
  "Absolutely that’s an impressive tool. It has lot many features apart from that. Every window user should use that tool and moreover, it’s open source",
  "I have never been able to connect my 2015 MBP to my windows laptop (2023). Have tried numerous times. Gave up, and started using Logi+ with logitech mouse and keyboard. Works flawlessly.",
  "Why does reddit shrink comments? I know that it happens when the post has like -3 down votes\n\nBut this has two UP votes",
  "Idk about other brands but I have used samsung dex on my old hp from 2014 to give mock tests using this same way.",
  "Duet display app, and then use actual cables. Even just worked isn’t too bad.",
  "Yeah, USB video capture device & OBS. I got mine for like less than 10usd. Yeah, but like you have said, it's expensive. And yeah, you will put one or two of the HDMI cables to use with the video capture device.",
  "Duet display app",
  "It can't use both simultaneously, that's not how networks function.",
  "Great. But a few weird colour alteration and patterns when its displaying anything black",
  "you should be able to use the windows + p shortcut on both computers and select 'PC Only'",
  "You could use a USB capture device and software like OBS to act kind of like a second screen.",
  "Yeah, most likely ",
  "There have been many apps for this in the past decades.  \nI combine this with Apollo/Moonshine to enable pretty much any device with decent wifi to be an extra monitor.",
  "Can that be used so sync files as well?",
  "That's such a weird problem. Sell both and buy a better laptop with good specs and a good screen. \n\nIt's not practical to use one laptop projected onto a different laptop's screen as it has lag. \n\nAnother solution I can think of is selling the idea pad and buying a good monitor. That way, you can output using HDMI.",
  "Is the RAM (partially) on DIMM-Sticks? Maybe you could switch them.",
  "It's nice to see I'm not alone.",
  "I think it does that when the person doesn't have a lot of karma",
  "Maybe it has something to do with his CQS (contributor quality score). There's a few subreddits that let you check it. (r/cqs)\n\nedit: contributor, not comment",
  "Depends on the crowd control setting of the sub.",
  "DeX is used to connect with displays like TVs and such, can it be used to cast the phone screen to a pc? \n\nThe accurate question i guess is \"can i cast my phone to the pc only with the built-in features, without using extra software.\n\nAnd my question is outside of the \"desktop mode\" scope. Since i got an Xperia on Android 12, so no functional desktop mode there.",
  "What kind of cables…\nNever mind… it’s expensive",
  "Nono I have the cables to use for that setup. It’s just that duet, which was suggested, is $100 a year. Also, why OBS? I’m not recording anything.",
  "Apollo/moonshine with the correct config worked better in my experience.",
  "Oh i know. But it still improved my connection",
  "You mean an [HDMI Capture Card](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.amazon.com/LinkBand-Capture-Camcorder-Streaming-Nintendo/dp/B089ZWX5MY&ved=2ahUKEwjj2a6A4P2MAxWx_7sIHc9mHCYQr4kDegQIHxAA&usg=AOvVaw31TJWTONaPBBL2ot0swmv3)?",
  "Yes I know of extra wireless monitor apps. This one isn't a monitor it's connecting the same mouse to two PCs",
  "If I remember correctly, you can copy and paste text and files. I haven't used it in almost 20 years.",
  "#WE CAN FIX IT! UPVOTE THIS FELLA!",
  "Could be that combined with the fact it's only short and will fit on one line to save space. Never happens when it's more than one line.",
  "Ohh thanks for rephrasing it, now I understand the questions and I think yes the screen should technically work as its same as sharing screen to TVs (or stuff like FireTV Stick) so if you phone can do that then it would also treat the laptop (or any windows machine) as something like a wireless display or TV and should be able to cast without any problem and I think Xperia do have the capabilities of sharing screen.",
  "you can see the output of the video capture device on obs !",
  "try super display. it's a lot cheaper and just works",
  "It would be USB for a laptop, not a card.",
  "They do. Also through the USB port. That's one more reason i got it except for the manual camera controls, the headphone jack and the SD card slot.\n\nNo functional desktop mode though. I miss LG.",
  "This my friend, is an [HDMI Capture Card](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.amazon.com/LinkBand-Capture-Camcorder-Streaming-Nintendo/dp/B089ZWX5MY&ved=2ahUKEwjj2a6A4P2MAxWx_7sIHc9mHCYQr4kDegQIHxAA&usg=AOvVaw31TJWTONaPBBL2ot0swmv3)!",
  "Lenovo Thinkpad X1 gen 13 vs Yoga 9i 2-in-1 gen 10 Hi, i'm thinking buying a new laptop which one of this do you recommend? Or if you have any toher suggestions i'm into programming stuff",
  "any reviews on Lenovo Yoga Slim 7X Gen 9? could anyone who owns this laptop give a brief review on its battery life, noises, and screen (burn in, etc)? \n\ni've seen reviews on just josh youtube and it seems too good to be true for its price, but what's holding me back is that it doesn't have an audio jack nor a USB port.",
  "I think the lack of answers is an answer in itself. I was also interested in this laptop, but I don't think it meets my needs, which may overlap with yours.",
  "i ended up getting an ASUS Zenbook 14 OLED instead hahahaha. but it's been great so far! the battery lasts about 10 hours, there's little to no noises, and i haven't experienced anything unusual with the OLED screen either!",
  "[EU/DE] Used laptop for uni + light gaming: HP EliteBook 840 G8 vs Latitude 7420 vs ThinkPad T14 Gen 2 - what would you pay? \nHi all,\nI’m in Germany and looking for a light, quiet, long-battery, Intel device that’s tinkering-friendly (serviceable RAM/SSD). Budget is ~€450 (can stretch a bit if it’s a great unit).\n\nUse case\n\t•\tUni (note-taking, VS Code, Office, lots of browser tabs), some light gaming (passable fps Minecraft, Stardew etc.)\n\t•\tPrefer good battery, quiet fans, DE QWERTZ keyboard if possible\n\nShortlist (11th-gen Intel)\n\t•\tHP EliteBook 840 G8 — i5-1135G7 / i5-1145G7, 2× SODIMM, M.2 NVMe, FHD (ideally 400-nit), ~53 Wh\n\t•\tDell Latitude 7420 — i5-1135G7, great 63 Wh option, but RAM often soldered (deal-breaker?)\n\t•\tLenovo ThinkPad T14 Gen 2 (Intel) — i5-1135G7, one SODIMM slot (partial upgradability), 50 Wh\n\nA specific local deal I found (Kleinanzeigen):\n\t•\tHP 840 G8 – i5-1145G7, 16 GB, 256 GB, FHD, charger included, “very good” condition (seller shows minimal wear). Ask is €305 VB (+ shipping).\nWould you jump on this? Any red flags to check first?\n\nWhat I’m asking from you ^^\nReal-world price checks (EUR) What would you pay for each of these in very good condition with 16 GB RAM and 256–512 GB SSD, FHD 400-nit if possible, and battery ≥80%\n\nGotchas to watch for on the 840 G8 specifically \n\nBattery reality for these at ~80–90% health, how many hours do you actually see with mixed uni use (Wi-Fi, 150–200 nits)?\n\nAny other recommendations?\n\nMy preferences / constraints\n\t•\tLocation: Germany (can do Kleinanzeigen, refurb shops like Lapstore/AfB, or eBay)\n\t•\tKeyboard: ideally DE QWERTZ, backlit\n\t•\tI’m okay upgrading RAM/SSD myself; would like to avoid soldered RAM if possible\n\t•\tHappy to buy a second battery/charger if it’s a steal otherwise\n\nThanks! Price guidance + owner experiences would help a lot before I pull the trigger.",
  "Lenovo ThinkPad P1 Gen 2 - Half Screen Black Issue, Faulty Display or Fixable? Hey everyone, \nI just bought a Lenovo ThinkPad P1 Gen 2 yesterday, but the screen issue is worrying me, as half of it appears black, and the middle part looks a bit whitish. Whereas on a dark black screen, it's fine. I have also run a Display BIOS diagnosis and there on black screen no shade is see. Is this a faulty display, or can it be corrected through the settings? \nNote: This is a Touch display.\n\nKindly help me out it's a worrying thing for me",
  "Need some opinions on lenovo ideapad 5 2 in 1 gen 10 14\" AMD Hey guys need some opinions on this not that tech experty. Im going to study economics no gaming on this laptop.\n\nhttps://preview.redd.it/zkvfwsipj8nf1.png?width=1891&format=png&auto=webp&s=b1bfa65c1f8e9f58dc1faed1b9cc827a13a1012e\n\nhttps://preview.redd.it/w2ix2abrj8nf1.png?width=1123&format=png&auto=webp&s=d081f10661543fb957cd78677c360ed2a6d25b66\n\nneed it to last solid 4 years min"
]