[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Lenovo Yoga 7i Gen10, 14-inch laptop (2025) review **UK-based Laptop Review**\n\n**1. Title:**  \nLenovo Yoga 7i Gen 10 (2025) Review: power and portability\n\n**2. Introduction:**\n\nThis is a review for the 2025 yoga 7i gen 10 model from Lenovo with intel core ultra 7 258v and 14 inch screen. I bought the configuration from the UK Lenovo website with 32GB RAM, 1TB SDD, 2.8k OLED 120Hz screen, Luna Grey colour and optioned the fingerprint scanner for an additional £10, paying £1090 in total (including the 10% VIP discount for healthcare workers). This is a premium grade 2-in-1 consumer laptop with a solid build, great for anyone who needs a portable and powerful device.\n\nI haven’t seen many user reviews for this particular generation of laptop so thought it would be useful for anyone considering it.\n\n**3. Design and Build Quality:**\n\nThe chassis all metal, which gives it a very solid feel. The build quality is great, there’s very little flex in the case or the keyboard. The body does not pick up fingerprints. At 1.4kg, it’s not the lightest laptop but it’s still very portable. It fits my 13 inch laptop sleeve. I don’t have much use for the tablet mode as I find it too cumbersome when compared with holding an actual tablet. The keyboard is very comfortable to type on and the trackpad is smooth and accurate. I appreciate the double height enter key. Coming from the LG gram 16, this is a much better typing and trackpad experience.\n\nPort selection is good. There are 2 USB-C ports, one on either side, with one USB-A, one full-sized HDMI, a microSD card slot and a headphone jack. The power key is on the right side which I’ve mis-pressed a couple of times so I’ve disabled it in the settings.\n\nThe display is a 14-inch glossy OLED touchscreen with 2.8K resolution (2880 x 1800), 500 nits brightness (1100 nits HDR Peak). I find the screen bright and vibrant. Watching video in a dimmed room is fantastic with zero light bleed. Reflections and fingerprints can be an issue, especially when viewing dark things on the screen and there is bright ambient. However it is still useable under these conditions.\n\nThe hinges are solid, with little screen wobble when typing but it does require two hands to open the lid. The look and feel of the laptop is very nice with smooth rounded outer edges.\n\n**4. Performance and heat:**\n\nThe Intel Core Ultra 7 258v is perfectly capable of handling my usual tasks of multiple Chrome/ Firefox tabs, connecting to my remote desktop for work and steaming video content.  I have tried some gaming and the experience with casual  games has been very good. Fortnite runs at 120FPS. Cities Skylines runs great. I’ve tried playing Watchdogs and although it could play it, the framerates were only around 40fps and the processor got quite hot with the fans getting noisy.\n\nThe keyboard and palm rest areas are always cool. The area under the screen gets warm under load but the hot air is blown out through the vents on the back, away from the user which is a good design.\n\n**5. Audio and Webcam:**\n\nThe speakers are fine, they are up firing from the sides of the keyboard and they are rated for Dolby Atmos. I can clearly hear the 3D effects when watching YouTube or Netflix. There isn't much bass but it is acceptable for a thin and light laptop.\n\nThe 5M IR camera is decent for video conferencing. There is a privacy shutter switch just above the camera. Windows Hello usually takes just a few seconds to log me in. I have found the fingerprint scanner works faster, especially when the lighting conditions are not ideal for Windows Hello.\n\n**6. Battery Life:**\n\nThe 70WHr battery lasts all day for me when web browsing/ streaming videos. I use a 100W Ugreen 4-port USB C charger to charge all my devices and the laptop fully charges within a couple of hours.  \n\n**7. Software and User Experience:**\n\nThe OS is Windows 11 Home 64 and comes with some minor bloatware including McAffee Antivirus, Lenovo support/ vantage/ AI shenanigans. The Lenovo Vantage software has some useful features including dimming various parts of the screen to save battery – I only use the taskbar dimming though as I find the background dimming too distracting. It also enables you to switch the laptop on just by lifting the lid, which means the much maligned side power switch is hardly ever used. There have been reports of this power button breaking easily on other models and thus bricking the device.\n\n**8. Price and Value:**\n\nThe base model costs £1000 (£900 for students or those that qualify for VIP member) and comes with the Intel Core Ultra 5 226V processor, 16GB RAM and 512GB SSD and a14inch WUXGA OLED screen (1920x1200, 400nits, 60Hz). I was happy to pay the \\~£200 premium for the better spec’d screen with double the RAM and SSD. Mine came with a 65W USB-C charger and a stylus pen which magnetically attaches to the lid.\n\n**9. Pros and Cons:**\n\n* **Pros:** Screen, performance, battery life, keyboard\n* **Cons:** Screen reflections, power key positioning.\n\n**10. Conclusion:**\n\nThis is a well-built laptop where the pros far out-weigh the cons. The OLED screen is fantastic and it has been a pleasure watching content in a darkened room. It is very easy to travel with, having all-day battery life and a thin and light form factor.\n\n**Final Rating:** 9/10",
  "Really nice post.\n\nIm looking into this as pretty much the only option as the price is really good compared to others.\n\nIm sceptical about the hinges, but you say they are fine. And also if the performance is okay, if i could spec it id go higher but there arent really any options. \n\nThe next thing is vivobook which goes about 50% more with worse screen",
  "How about the weight, does it feel heavy...do you think it's worth the penny and do you think it's a good investment until 2028 atleast?",
  "Im setting up my 16 inch model right now and the fans are running on low constantly and high pitch too, did yours do the same?",
  "Hey, I am curious how did you opt for the fingerprint scanner. I can't find it in the configurations. Thanks.",
  "Potentially stupid question...\n\nI'm comparing different Lenovo Yoga 7s on their website,  and nowhere does it say which generation is which... How do you guys know this information?\n\nThere's so many reviews out there 😵‍💫",
  "I'm thinking of getting this laptop but I'm wondering about the CPU performance for things like python and matlab number crunching(data/optimization/small simulations etc)\n\nJust curious what kind of work do you do on it and is the CPU fast enough for that? I'm still not sure whether the lesser multicore compared to a 200H arrow lake is a problem or if I'm overthinking about the 258V",
  "hello, here some questions:\n1. what version of hdmi port does it have?\n2. What components could you upgrade? ssd, battery, keyboard?",
  "Just a question: does the screen have a plastic border, or is it all glass? ",
  "[removed]",
  "Hi OP, I read a few other reddit posts regarding poor battery life on this particular screen option (2.8K) compared to alot of the youtube reviews (which seems to be based on the 1200 screen option). When you say all day do you mean \\~7 hours? Are you leaving your screen on 120Hz or reducing it to 60Hz.",
  "Hi, I’ve used a Lenovo Yoga 7 AMD from a few generations back with the Ryzen 6800U for the past 3 years and have had no issues with the hinges for what it’s worth!",
  "Thanks. Only time will tell regarding the hinges but they look and feel sturdy to me and these double hinge designs should in theory spread the force out across the 4 contact points on each hinge, reducing the stress at any one point. I'll update if I have any problems with the hinges",
  "It doesn't feel heavy but it's not feather-light like the LG gram. The LG gram can be lifted from a corner with one hand easily whereas I'd struggle to do this with the Yoga 7i. The Yoga 7i   feels more substantial, more premium. However it is still easy to carry around in a back pack.\n\nI'm happy with my purchase so far - it does everything I need and I feel it is good value for what you get compared to an equivalent from HP or Apple. As long as I keep the battery in good condition and the hinges don't break, I'm sure it'll last a good 3-5 years. \n\nIf I didn't play PC games, I would have strongly considered a macbook air 13\".",
  "The 14 inch model doesn't have this problem at all. It's mostly silent. Your 16 inch model should have even better thermal handling given the extra space. The constant fans might be due to all the updates being installed, see how it goes",
  "It came up as an option for me when I selected luna grey as the colour",
  "https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/len101y0058\n\nIt can be confusing. The UK lenovo website states which gen it is,  the i is for Intel, they usually have AMD in brackets for AMD models. X means snapdragon. I think the gen 10s are sometimes called Aura Edition too",
  "1. The HDMI port is a standard sized 1.4b\n\n2. The SSD can be upgraded via the M.2 2242 PCIe NVMe SSD slot but that's about it. The RAM is soldered on the model I got.",
  "There is a black border around the screen but the glass extends over it. The border houses the web cam",
  "I turned off the side power button and activated the open screen to switch on option which works really well. It means I never accidentally mis-press the power button and it should last a lot longer",
  " battery life has been fine for me, I've kept it at 120Hz and only charge up to 80%. Off power, I've been using it for 5 hours now, browsing/ streaming at 50% screen brightness and there's still 45% remaining, so that's just 35% battery use after 5 hours of light usage. I would expect at least 12 hours from a fully charged battery",
  "So pc games work on this one? How is the performance, which games did you try out and does it heat up?",
  "Do you still see that option? Cause I don't see it when I want to configure it",
  "Interesting... Yea the Canadian site doesn't mention generation. We have all those versions though.",
  "yea the cpu and size are all included in the full model name, but aura edition stands for the optimized intel partnerships versions that have slightly better battery life and perfs",
  "Is it possible to replace the keyboard?",
  "Awesome. Thank you ",
  "[removed]",
  "Whats the thought behind charging to 80% - does this extend overall battery life long-term?",
  "Yes, you can play PC games. Fortnite runs at 100-120FPS on the native screen resolution. Cities Skylines plays well.  I wouldn't expect to be able to run the latest AAA 3D intensive games well, but it can run most of them on low settings but I wouldn't recommend it for that as the fan noise gets quite loud if pushed too hard.",
  "Yes, it's still there as an option on the Lenovo UK website for the Lenovo Yoga 7i",
  "You would have to replace the entire assembly including touchpad",
  "I've used the laptop for a few months now and on the rare occasion that I do need to use the side power button (maybe twice so far), it's worked as it should. I think if the usage of the power button is so low, it should easily last the entire life of the laptop",
  "Yes, it's an option in the power management software to prolong battery health. It's standard practice for all lithium batteries",
  "Am I about to make a mistake? Lenovo Yoga Pro 7i \nhttps://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nWHY AM I LOOKING AT IT?\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. Presumably that'll eek more time out. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\nWHAT AM I WORRIED ABOUT?\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? \n\n\nSecond thing is overheat potential. Without reviews on this specific configuration, seems a risk the ultra 9 285H might get SPICY. I presume I can maybe manage this by reducing power in the settings...",
  "Idk about this model specifically as I'm researching a 2in1 to purchase, why are all the Lenovo 2 in 1's so much more expensive than their pro counterparts?? My local retailers won't even stock them as their price is just absurd.\n\nAlso, because these brands make multiple laptops of the same format with different specs, usually have to look at them as a whole, then the changed specs individually. Look for reviews on the yoga/yoga pro (compared to other brands, some great reviews and minimal complaints), then make sure the cpu is good.",
  "Hmmm. Interesting. What region are you in? I'm in Victoria Australia and here it seems like the 2 in 1s are pretty affordable, they just use the less heavy duty specs (Vs instead of Hs). \n\n\nBut yeh that's kind of what I've had to make do with RE reviews. Kind of gettins the vibe of similar names and judhing it off that. My exact thoughts on it. The complexity of the seemingly similar but not quite same laptop models with different nearly the same name and completely different specs has made the review space completely fucked to navigate hahaha.",
  "Im in QLD, I should have clarified for the same specs, the 2in1's are more expensive. Currently I'm trying to find specs for a version JB hifi sell but Lenovo have removed completely from their website. Of course they do that and JB don't specify.",
  "To be fair JBs laptop prices are uniformly atrocious hahaha. They charge amounts for specs that are several tiers below what that price point should provide. I think their target market is mostly people who know nothing about computers haha",
  "That's true, but jb for at least one of the models is the exact same price as Lenovo website, without the 3-5 week wait.",
  "Yeh they sometimes might be ok generally, but i notice A lot of the lenovo website prices themselves are inflated. \nLike the one I posted is apparently 40% off, as are other ones im considering which are slightly less speccy, full price of 3.2k or so. But the literal same laptop at a retailer like HN or Office Works is like 2.3k full price. \nSo lenovo website on sale is a genuine sale price but not on sale they're wildly expensive.",
  "Am I about to make a mistake? Lenovo Yoga Pro 7i https://www.lenovo.com/au/en/p/laptops/yoga/yoga-pro-series/lenovo-yoga-pro-7i-gen-10-aura-edition-14-inch-intel/83kfcto1wwau2\n\nI am thinking if buying this. Cannot for the life of me find a single review directly of this model. Or a related one with different specs. It's all Slims and 2-in-1s. \n\n\nNot for gaming, other than maybe a light cozy thing here or there. It's so I can do office type and browsing functions while I am on the move and potentially some light music production. \n\n\nThin and light would be good. Want to be able to carry it around without hassle. \n\n\nNeed a good battery life but not insane. 8 hours would be fine. Sales tech said this would get at least 10. I'd reduce the refresh rate to 60hz, I won't need 120 most of the time. \n\n\nBest I can tell CPU should be pretty future proofed. Seems basically as good as it gets for this category. \n\n\nRAM is confirmed by sales tech as dual channel. Unfortunately there doesn't seem an option to do 64gb instead which would give me future proofing comfort. \n\nBut as far as I can tell the RAM (LPDDR5X-8533MT/s) is basically top of the line for portable laptops. \n\n\n\nMain thing keeping me from pulling the trigger is glossy screen as I like bright rooms and sitting outside haha but... seems like nearly all of then have that. I assume I can maybe put a screen film over it of some kind? ",
  "It seems quite expensive for having integrated GPU. Maybe you can also check out some options with more favourable prices, such as [this HP OmniBook X Flip 2-in-1 for 1000 usd](https://www.bestbuy.com/product/hp-omnibook-x-flip-copilot-pc-16-3k-oled-touch-screen-laptop-intel-core-ultra-9-32gb-memory-2tb-ssd-eclipse-gray/JJGH2Y9TPC). It has CPU Intel Core Ultra 9 288V, integrated NPU with 48 TOPS, integrated GPU Intel Arc 140V, 32GB LPDDR5X RAM 8533MHz, 2TB SSD, 16-inch OLED 2.8K 120Hz touchscreen display (with practical 16:10 aspect ratio, 500 nits brightness), backlit keyboard, and Windows 11 Home.",
  "That's 2300 AUD not USD.\n\n\nI don't think that's available here, Australia. Price for what I can tell is equivalent here is circa 3k aud.",
  "You're right. Sorry, I didn't pay attention.",
  "Lenovo 7I I’m looking for a 2 in 1 and this seems reasonable but I’m not sure if this is worth it ",
  "Lenovo Yoga 7i 2-in-1 Review (Gen 10 | 2025) Performance gets compared with AMD equivalent. Wins Best Laptop Award. [Full Review here](https://smbtech.au/reviews/lenovo-yoga-7i-2-in-1-review-gen-10-2025/).",
  "I had an Asus laptop with an Intel 258v, it gets hot and the fan is almost always on. Went back to Apple.",
  "Which model? Those clips are in ultraportables and gaming laptops and all of them have performance modes that let you adjust cooling and heat and power.",
  "Lenovo Yoga Slim 7i Aura Edition (gen 10) or Asus Zenbook S14 OLED Need a bit of help deciding between the newest iterations of these two laptops.\n\nThe Lenovo Yoga Slim 7i Aura Edition (Gen 10, 2025) and the Asus Zenbook S14 OLED(2025).\n\nOn paper they share the same specs like:\n\n- Intel® Core™ Ultra 7 258V with Intel Arc Graphics\n\n- 32 GB LPDDR5X-8533MHz\n\n- 1 TB SSD, M.2 2242, PCIe 4.0\n\n- 14\" 2,8K (2880 x 1800), OLED, HDR 600, 500 cd/m², 120 Hz screen\n\n- Wi-Fi 7 / BT 5.4\n\n-Similar I/O\n\n \n\nThe comparisons I found, are mostly of the old version of the Yoga, the one with touchscreen and IPS panel.\n\nFrom the reviews it seems that the Asus has better batterylife and nicer materials (?)\n\n \n\nI personally like the design of the Asus better, but many people here had bad experiences with Asus and Build quality and warranty issues.\n\nFor me its important to have a laptop that I can rely on and is not gonna need first aid after a year, so the design thing is not as important.\n\n \n\nPricewise at the moment I can get the Yoga for 1290€ and the Zenbook for 1260€\n\n",
  "I faced the same decision a few days ago and decided to wait a few weeks to go with a 3rd option: preorder the yoga slim 7i (G10) 14\" that was announced at CES and will be available from the end of February. \n\nBetween your two choices from reviews I found out...\n\nZenbook:\n\n- OLED Screen\n- Better speakers \n- 14\" \n- acceptable keyboard\n- \"bad\" (non haptic) track pad\n\nYoga slim 7i (15\")\n\n- good IPS screen\n- 15\"\n- \"bad\" speakers\n- great keyboard\n- good (non haptic) track pad \n\nI was quite intrigued by the OLED screen, but the keyboard and track pad of the Zenbook made me hesitate, since they're very important factors for me when buying a laptop. What made me hesitate with the Yoga slim 7i (15\") was the size, weight (300g more) and the lack of an OLED screen.\n\nWhen I found out there's a Yoga slim 7i (14\") coming out with pretty much the same specs as the 15\" version but an OLED screen and a cheaper prize than the Zenbook it was an easy choice. The OLED screen is non touch, but that's fine for me.",
  "How are you feeling after some months? Do you recommend it?",
  "Thank you for the feedback. Matter of fact I am actually talking about the new YOga slim 7i 14\" OLED version that has been announced at CES. I can order it via german corporate benefits program and it will be shipped in approx 2 weeks. So I guess its a nobrainer at this point? :D",
  "Did you get the lenovo gen 10? do you like the screen?",
  "***> preorder the yoga slim 7i (G10) 14\" that was announced at CES***\n\nWhich one is this? Do you know the model number?  \nThere are so many different models it's confusing! 😄",
  "bad speakers? fix your ears mate",
  "How did you manage to get the Yoga 14\" Aura priced for 1087€ via CB? My price via Corporate Benefits is 1245€ :-/ (I am German too)",
  "I ordered mine today after checking out both models in person at a physical store. I went with the Yoga Slim 7i Aura Edition (Gen 9) with the Core Ultra 7 258V CPU, purchased directly from Lenovo’s website.\n\nIn Australia, I had the option to upgrade to an **OLED display**, but I intentionally chose IPS instead. While OLED is great, it comes with the risk of burn-in, and since I plan to use this laptop primarily for productivity tasks like Office apps, browsing, coding, I didn’t want to constantly worry about screen longevity. With an IPS display I am not surrendering too much for 1 less headache I have to worry about.\n\nI note that OLED has its time and place - but really depends on what you want to do with it",
  "Not yet. It will be available from the end of February. I'll get mine probably in the beginning of March.",
  "It is :D\n\nI don't know if it has a model number, but I ordered this one (from a german reseller and with a student discount): https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/len101y0053",
  "It didnt work. I thought I coule use the Cb Code für the advertised 12% off, but I only can get the Price that is already shown in the Shop althou it says I Need to use the Code",
  "[deleted]",
  "Are you okay with the OLED display. Some people mentioend its not good and it has a glare effect from lights around.",
  "Ok. When you'll have it could you write a little review? Thank you!",
  "Hi there. Have you received your laptop? I have ordered it from Lenovo’s official website on the 14th of Feb and the shipping date keeps getting pushed back. Last one is on the 7th of March",
  "Sorry to bother you, but may I ask if you have received the laptop yet?",
  "What display did you go for? How much did you pay? So you have it already? ",
  "I asked the chat agent to apply the CB- discount for my shopping cart. He didn't, but I saved a few euros nevertheless by asking him. The purchase was also tracked by Shoop.",
  "Got the postage information just earlier today, so a few more days to wait!!!\nI'll definitely give you an update!",
  "i ended up going with an IPS display and cant be happier. and no dancing around with an OLED to make it work for longer.",
  "Hey! Yes, I received it around 14 days ago trough a reseller a bit earlier than expected. Did you get yours by now and how do you like it? :)",
  "No worries :) Yes, I got it around two weeks ago. Did you order one too?",
  "Im still thinking about pulling the trigger on the yoga 7i. Pretty good price for a device that’s not even out yet. The reviews about the Lunar Lake are damn good",
  "Hey, how much did you get it for including corporate benefits? My gf (German) also gets corporate benefits but can only get it for 1245€ too",
  "There is a glare and some people complain that own image shows in the laptop scree?\n\nIs that a deal breaker ? have you experience it?",
  "Not yet, but I am planning to. Just to clarify, did you get the Yoga Slim 7i Aura Edition 14-inch version or the 15-inch version? I saw ur comments, and I agree that the 14-inch is much cheaper compared to the 15-inch version. I have only seen this laptop through 2 youtube videos, so it must be just new. I wanted to order a custom one on the lenovo website, but I fear they might not have any stock yet.",
  "Yes, I got the Yoga Slim 7i 14\" Gen 10 (258V). Yes, it's weird. There don't seem to be any reviews on this laptop (yet?).\n\nSomething that might be relevant to you: There are at least two different models being sold. The US version has a FHD OLED touch screen, while the version I have (german or EU) has a 2880x1800 non-touch OLED screen.",
  "Thank you for your replies and info! I now feel more confident in ordering it.",
  "How’s it holding up?",
  "No complaints so far :) Stunning screen (EU Model) and great keyboard. Battery life is good and so is the performance. The touchpad is certainly not the highlight of the Laptop, but does the job well enough for me. \n\nI'd buy it again :)",
  "Sorry to hijack again, I'm eyeing the same exact model. How is the performance so far for you? Does it has any noticeable slowdown during multitasking?",
  "[Help] Deciding Between Lenovo Yoga 7 (Ryzen AI 7 350 - Kraken Point) and Yoga 7i (Intel Core Ultra 7 258V - Lunar Lake) – Real-World Multitasking Hi everyone,  \nI'm currently torn between two very similar laptops and I was hoping to get some help based on *real-world multitasking experience*, especially with the Intel model.\n\nThe two devices I'm choosing between are:\n\n* **Lenovo Yoga 7 2-in-1 16\" (AMD Ryzen AI 7 350)**\n* **Lenovo Yoga 7i 2-in-1 16\" (Intel Core Ultra 7 258V)**\n\nBoth have **32GB of RAM**, identical displays, and very similar overall designs.  \nThe main differences are:\n\n* The **Intel version has 2x Thunderbolt 4 ports (40Gbps)**\n* The **AMD version has 2x USB 3.2 Gen 2 (10Gbps)**\n* The **Intel version offers better battery life** from what I’ve seen in reviews\n\nI ended up choosing between these two models because I **need a 2-in-1 with a numeric keypad**, which is important for me. Unfortunately, comparable Asus models don't include the numpad, so these two Lenovos are basically my only options at this level.\n\n# Here's the deal:\n\nI've read all the benchmarks, and I know the AMD Ryzen AI 7 350 generally beats the Intel 258V in multi-core performance. But I'm not sure how that translates to the **kind of multitasking I do**. If the Intel version can handle my workload well enough, I’d prefer it for the ports and better battery life. But if it's going to struggle, I'd be okay with going AMD.\n\n# My typical workload looks like this:\n\n* **3-4 browser windows** open (usually Chrome and Brave), each with **\\~20 tabs**\n* **Excel spreadsheets** for management control (some light, some around 1MB with decent formulas)\n* **Word**, **Discord**, **TradingView** (in browser or desktop app)\n* **NordVPN**, **Bitwarden**, **OneDrive**, **Dropbox**, **Google Drive** running in the background\n* Regular Windows background tasks\n* Occasionally, I’ll have other apps open too\n\nIn the near future, I’d like to start learning Python — partly to replace some of my Excel work (used in my job), and partly as a hobby, to run basic simulations on historical stock data (in this case I suppose I’d mostly use libraries like **pandas** and **numpy**).\n\nI need the system to stay smooth and responsive under that kind of load.\n\n# What I’ve found so far:\n\nFrom what I’ve read, I believe the **AMD AI 7 350** shouldn’t have any trouble handling this workload smoothly.\n\nI’ve read mixed things about the **Intel 258V** — some reviewers say it’s fine with heavy multitasking, others say it struggles under load. I haven’t been able to find many real-life experiences on the Yoga 7i with Intel Lunar Lake. \n\nIf anyone here has tried this system under heavy multitasking and want to share his experience I’d really appreciate it.\n\nThanks in advance!",
  "The Ryzen is quite a bit faster, I'd get that.",
  "I have expertbook P5 258v. I don't have problem having multiple excel and chrome tabs. AMD battery life sucks big time; they are last on almost every battery life benchmark and real world cases vs Intel, Qualcomm and Apple.",
  "The Intel is definitely fine for your use case.",
  "Hey guys, i just got my Yoga 7 Gen10 2 in 1 with AMD Ryzen 7 350 /32GB Ram / 1TB SSD\n\nNow my question is, was that the right coice ? \nI need it for my School with some CAD (smal solidworks things) and some 3D-Slicing\n\nIt feels good Over all, but the battery feels very weak, what are your experiences with it and expecially the battery life",
  "Thanks for your reply! I know AMD is faster, but do you think I will benefit from it in my usage? I'm considering also that Intel's version has Thunderbolt 4 (vs USB 3.2) and better battery life, so if Intel's performance is enough for me I'd take this version..",
  "Thanks! Just curious—do you know from direct experience, or is it just that you understand CPU specs better than I do? 😅",
  "Im looking into it with the same intensions, so not so happy with it? Im worried about the hinges as i dont want them to fail after warranty expires. Also how happy are you with the display, it should have 1100nits which should be insane",
  "I wouldn't care about the Thunderbolt or battery life, but those things are important to you, then maybe get the Intel. They're both good computers.",
  "It is just that none of your tasks are individually heavy (except perhaps Excel?). If anything, my experience as a tab hoarder (300 tabs+) is that most modern CPUs are fine, you just need enough RAM. For example, I used to have a i7 8750H, which is fairly weaker than the 258V, and it used to run absolutely fine even if I was doing heavy dynamical systems numerical simulations in the background (in that case you just have to set core affinities such that you have one core left for the OS otherwise everything does slow down to a crawl). \n\nMy educated guess about the Excel is that you'd know if you needed something more powerful; I doubt most cases will scale beyond needing 4 strong cores + 4 fairly strong cores (258V 4P + 4E cores).\n\nAbout you learning Python, it should also be fine. If you are going to deal with big matrices and linear algebra operations the Ryzen would probably be significantly faster (but it's not like the Intel would be awfully slow).  \n\nI asked ChatGPT to come up with some sort of benchmark related to what you said (which, to be honest, I know nothing about). It seems to be taking a price time-series, calculating some moving averages, standard deviations and correlations and then some calculations based on weighting each stock differently.\n\n\n    import time\n    import numpy as np\n    import pandas as pd\n\n\n\n    def run_simulation(n_stocks=1000, n_days=5000):\n        # Generate synthetic stock price data (log-normal to resemble stock prices)\n        prices = np.random.lognormal(mean=0, sigma=0.01, size=(n_days, n_stocks))\n        df = pd.DataFrame(prices, columns=[f'Stock_{i}' for i in range(n_stocks)])\n\n        # Simulate typical operations\n        start = time.time()\n    \n        # Daily returns\n        returns = df.pct_change().dropna()\n    \n        # 20-day moving average\n        ma_20 = df.rolling(window=20).mean().dropna()\n    \n        # Volatility estimation (std dev over 20 days)\n        volatility = df.rolling(window=20).std().dropna()\n    \n        # Correlation matrix (last 250 days)\n        corr_matrix = returns.tail(250).corr()\n    \n        # Portfolio simulation: mean-variance portfolio\n        mean_returns = returns.mean()\n        cov_matrix = returns.cov()\n        weights = np.random.random(n_stocks)\n        weights /= np.sum(weights)\n        port_return = np.dot(weights, mean_returns)\n        port_volatility = np.sqrt(np.dot(weights.T, np.dot(cov_matrix, weights)))\n    \n        duration = time.time() - start\n        return duration, port_return, port_volatility\n\n\n    run_simulation()\n\n\nThis takes about 600ms on my Ryzen 8845HS independent of the number of threads (I think Pandas is mostly single-threaded while Numpy can use more threads for its operations, but in this case it didn't make any difference). This would probably be about the same performance you'd expect from both the 258V and the 350 in this particular scenario.\n\nOutside numerical stuff, they should all be roughly equivalent, specially since Python doesn't really like multiple threads.",
  "The Display is really Great ! \nThe hinges look kinda good, but to whole screen shakes if u touch it with the pen (or finger) to write somerhing\nThe good thing is, every laptop i tested so far does this (checked with 40+ laptops/convertibles) \n\nMy Screen turned black whenever i pluged or unpluged the power cable, now after a complete reset the laptop is working just fine.\n\nI kinda miss an Ethernet connection \n\nSo far so good, i will keep you updated.\n\nAre you looking for the intel or the amd version ?",
  "Thank you very much for your answer, very comprehensive!!",
  "Sounds like a great info,\n\nThe ryzen looks a lot better, but i would miss the 40gbps thunderbolt. Which could have been there :D\n\nI can live with wifi or some dongle, so the ethernet is not the worst thing.\n\nWell sounds good so far from your standpoint, i was also looking into vivobooks but they are more expensive and have max 500nits of brightness.\n\nYeah, keep me updated if you can :)\n\nEnjoy it!",
  "I've just bought and received the Yoga 2-in-1 with the Ryzen 350, if you have any questions.",
  "Yesterday i tested the battery life \nI opened a Youtube video an let is run on 35% brightness, it lastet 7h (started with 70-\n%) \n\nI realy dont know if thats the right Notebook for my school, imagine i cant charge it ther 😬😬",
  "Thanks, but I received mine two weeks ago — I ended up choosing the version with the Intel 258v. So far, performance seems fine. Maybe we could do some comparisons :)  \nHowever, the Windows taskbar is driving me crazy: I have it set to \"automatically hide,\" but it often stays visible, covering part of the windows. The only way to hide it again is to open and close the Start menu, which is *super* annoying.  \nDo you happen to have the same issue?\n\nP.S. (Initially, when I kept the taskbar always visible, I had a different issue: sometimes the icons wouldn't respond to clicks, and I couldn't switch between open apps. Again, the only fix was opening and closing the Start menu).",
  "would be interested in knowing how you like it so far",
  "I have 10years old gaming laptop that at its prime could do 2-3hours and now the battery is so cooked that its just there for the sake of it.\n\nI can imagine 35% being a lot if the max brightness is 1100.\n\nIn my books these are good numbers, but i am really sceptical about the hinges, i cant justify spending so much money to then get fucked with hinges. Also the thunderbolt could have been there with amd :P\n\nThx for info.\n\nHows the pen, have you used it?\n\nEdit: i can imagine you buying a 100W powerbank to improve the battery life while in school. \n\nIf it would have been a 20000mAh, that could add you about 65Wh which is about 70-80% of the whole battery.",
  "Man, I don't use the laptop too often for anything other than taking notes or just bed time sleep procrastination watching something, so I haven't really noticed that. I gave it a quick test and it seems to be working \"fine\". Fine in the sense that I have this overall feeling that everything in Windows behaves a bit wonky and erratically sometimes, but it has been mostly not too annoying.\n\nMind you that I've done a clean reinstall of the system because I originally was just going to use Linux but unfortunately for now it seems that the system is not well supported by any distro I've tried.",
  "It works fine.\n\nI think the screen is really nice, OLED and all that, as well as 120hz. The keyboard is really nice to type on and performance is all right (I haven't tested too much because for heavier stuff I use my desktop). In regular use it is silent and doesn't heat too much.\n\nNotebookcheck somewhere mentioned the Moiré effect for older models screens and I haven't noticed in this model, so maybe it doesn't suffer from that or maybe I just haven't noticed or came across. In any case I love the screen.\n\nWebcamera is all right but not anything really to write home about (but it is actually usable unlike most other laptops it feels like). Mics I haven't really got a chance to test it properly.\n\nBattery I'd say is all right as well. I am a bit disappointed mainly because it is not much better than what I already had with my old 2018 XPS, but still, I'd say you can get maybe 12h of web browsing, maybe 9-10h of Youtube. Local video watching probably around 12-14h. I believe note taking only I'd be around 15h-ish. \n\nIf you plan to use Linux, I'd say for this system in particular driver support is still a bit messy, specially regarding the WiFi and Bluetooth. Older kernels seem to work better than newer, but still not great. Might be just a case of skill issue, but I couldn't be bothered trying too much. I'll give it a go again later this year. \n\nAnother thing in this case that Windows does better is handling touch and pen. Specially the onscreen keyboard, which in Linux I found that only Ubuntu had a usable experience; however the pen was not well recognized and I couldn't alter pressure settings (it did work, however).\n\nI enjoy taking notes with the pen but it is not perfect. If you orient the PC so that the hinge part is near your body and you wrest your wrist on it, it squeaks a little bit; the flipped orientation is better. Another problem is that for some reason when the pen is tilted the lines are not drawn straight anymore; like you try to draw a diagonal line and it comes out a bit wobbly. I don't know if it is a pen issue (the default one that came with it \"Lenovo® Yoga® Pen\") or with the screen. This is unnoticeable with notetaking but I guess if you are drawing it could be a deal breaker. I actually feel like this is a pen issue and maybe other models work better, because with less tilt this doesn't happen at all (or at least I don't notice).\n\nFor anyone curious, Linux says that the screen pen thingy is called \"wacom hid 5402\".\n\nAnother thing that pisses me off is no USB 4 (even the AMD predecessors have, so like wtf) and the HDMI is gimped (HDMI 2.1 TMDS 6Gbps). It doesn't matter to me but it seems like a such unnecessary cost cut, specially the USBs. Bright side is that both USB-Cs at either side support charging so that is cool.\n\nLet me know if you have further questions.",
  "Ah yes, i guess it could be ok and i just have to try it. \n\nIm not so worried about the hinges to be honest. Thunderbolt is nice to have but i dont really miss it.\n\nThe pen is pretty nice, works great for me. (But it is the first pen i am using so far) \n\nYes the idea with a powerbank was already there but i dunno, thanks for you Feedback!!",
  "thanks a lot for this extensive review, appreciate it!",
  "help deciding between lenovo yoga 7 ryzen 7, lenovo yoga slim 7i and lenovo yoga slim 7i aura edition hello! ill hopefully be going to university this september and I'm looking to buy a decently well-built, durable laptop that can last me the whole 3 years of my course and maybe some time after that. \n\nmy budget is between £850 - £950. can't really go over that..\n\n2 of my friends have the lenovo yoga 7i and they're enjoying it a lot but im not 100% sold on it because I've heard mixed reviews, especially about the hinges. They've only had them for a couple months each so I don't think they can answer my questions from a long-term perspective, if you get what I mean.\n\nanyways, i would mainly like to use this work school work along with streaming movies, watching YouTube and hopefully being able to play games. the games i would like to play on this are roblox, valorant, overwatch 2 and some story games (lis, tlou2, rdr)\n\nill copy and paste the links below so the full specs can be seen:\n\nhttps://www.currys.co.uk/products/lenovo-yoga-7-14-refurbished-2-in-1-laptop-amd-ryzen-7-1-tb-ssd-blue-very-good-condition-10269152.html\n\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOTNJgM_IosqUGJRGjYPUOxOOeO0JrO77bafqzhQ8iQtmdFR4KC1lBsaAmvtEALw_wcB ",
  "definitely the yoga slim 7i aura edition from lenovos website \n\nit would have the best battery life and igpu out of all these. the core ultra 226v and the 200v series processors are REALLY good at everything. tlou2 and rdr might be fine, if i remember correctly it should be fine at 1080 low/medium. search for some gaming benchmarks on youtube for this. roblox/valorant/ow should be fine \n\nonly problem is 16gb of ram which might struggle in gaming but for everything else itll be fine. the oled screen will be really nice for watching movies",
  "ooh okay, thank you!!\n\nin the specs of the slim 7i aura, it says 16GB (memory on package) instead of (soldered)\ndoes this mean i would be able to change the memory to 32GB? i don't actually know how to do this yet, but would that be possible?\n\nalso, is it worth getting any security software (norton) or should i just leave that",
  "That's what I just got (I'm in Italy)  Nice machine but a bit disappointed with battery life (I bought this notebook almost exclusivley for its battery life but in 3 days I have done 8 htrs at the most (with most settings to minimum included 60hz)",
  "nooo dont get norton, windows defender is perfectly fine\n\nand no sadly the ram isnt upgradeable. with the new core ultra chips, the ram is soldered (memory on package is another way of saying it), so that the ram has higher speeds=better performance especially for the igpu\n\nand clicking on the build your pc option, it seems like we cant even get 32gb which sucks\n\nthe only option with 32gb ram is the core ultra 7 258v, which seems like it is an extra 110 in total. if youre willing to spend that much, its gonna be worth it (better cpu and gpu performance+more ram).",
  "ohh okay then, i won't.\n\naw, that sucks. i don't have the money to buy anything over 1k :( so ill stick with the 16gb\n\nalso, im really stuck on something. on the website there's this other lenovo yoga 7i slim 7 aura edition gen10\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb5?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOQtLrzWLnEL9t1kRgkhS7z0s-S_GgUHqP0wj2K2ZpTkXXNkhQq7-WkaAgcdEALw_wcB\n\nthere's a £20 difference but i can't see any differences between them? im comparing them on the website but i don't see anything.. maybe im blind but is there any difference or can i just take the cheaper option?\n\nand have you ever bought from the lenovo website yourself?",
  "everything seems to be the same other than the fact that the 20 cheaper has no premium warranty?\n\n[https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html](https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html) \n\nanother option is this\n\nthe ryzen 9 365 is really good, its oled, the vivobook s15 is made of metal so it feels premium, display is also 120hz instead of 60 and importantly, its 32gb of ram!",
  "ooh okay, ill check it out! pretty expensive tho😭\n\nis there a major difference in quality between the yoga slim 7 and the aura edition? i know they can both handle basic things like writing documents, but streaming and gaming wise? im feeling anxious about spending almost 1k on a laptop so should i just go for the cheaper option..? im assuming the slim is better than the regular yoga 7i so im not asking about that (could be wrong tho ofc)",
  "you mean the yoga 7 from currys? its refurbished and the cpu is a rebadged older processor. if youre gonna use the laptop for a couple years imo it is worth spending more for the aura/vivobook",
  "i meant this slim 7i\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\ndoes the fact that it's ultra 7 mean it works faster/better than ultra 5? \nwould this not be able to last for at least 3-4 years based on how ill be using it?\ni only got this money bc of a scheme in the uk called child trust funds and i got 1k and some change so i feel anxious to spend all of it on a laptop yk?",
  "Ohhhh for 700 its good. yeah the core ultra 7 155h isnt as efficient as the newer 200 series processor but performance is on par and the igpu is actually better\n\nso yeah I would say this will still be good to go for 3-4 years",
  "ooh okay so does that mean it can handle games and streaming better?\n\ni will probably get this one instead then!",
  "Lenovo Slim 7i Aura 15.3\" vs Surface Laptop 13.8\" Hello everyone, I'm in need for a university laptop. I am in Germany and these are my two options as of now:\n\nLenovo Slim 7i Aura Edition\nLunar Lake 258V\n32GB Ram\n1TB Storage\n15.3\"\nPrice: 1199,- € \n\nMicrosoft Surface Laptop 7th Edition \nSnapdragon Plus\n16GB Ram\n256GB Storage\n13.8\"\nPrice: 999,- €\n\nI can't decide which one to go with.\n\nThe Surface Laptop has a more premium build quality and it's Microsoft, a brand I know that is reliable. It also has a haptic touchpad, which is nice. Performance and battery life is good too, only downside would be the compatibility issues, which I don't think would affect me either way. \nIt also has the \"Microsoft Tax\", which is why it's so expensive... 999,- € for those specs. \n\nThe Lenovo Yoga Slim 7i Aura Edition has a good build quality, but it's Lenovo. I never had a Lenovo device in my life. The reviews of their support for online purchases SUCK! 1,3 stars, everyone is complaining. So IF I HAPPEN to have a problem with the laptop im basically done for. Stats are all better than the Surface Laptop. Battery life isn't as good but still okay. No compatibility issues. No haptic touchpad. Higher resolution. \n\nI was about to pull the trigger on the Lenovo one, but reading through reviews of the keyboard failing (some keys just stop working) and then having an ABYSMAL support experience, made me reconsider it. That's when I looked at the Surface, which seems like the premium device for windows. Microsoft support is alright, but it wouldn't really be needed as I barely heard of problems. It's currently my preferred option. \n\nMy father has a Surface Laptop 13.8\" and he says he didn't encounter any issues. Everything works flawlessly.  \n\nI want to hear your take, which one should I go with and why? Thanks in advance! \n",
  "Touchpad horrible in Lenovo Yoga 7i 2-1 (help please) Has anyone had this problem? I tried cleaning it off with small amount of water on a napkin, alcohol based cleaner, and everything?? I have never had a touchpad this bad on any computers, I do use lotion, and occasionally toch my hair, but like not to the amount where the touch pad is ALWAYS like dragging on not senstive.\n\n  \nI turned up my sensitivty and reset my touch pad and it is SOOO frustrating because at times my laptop literally feels unusable because scrolling is hit or miss, or trying to move my mouse is horrible. Like even review this is making me upset because its glitching up and down. \n\nI am so frustrated, I just bought this computer after loads of reasearch because i have horrible luck with laptops just for this to suck too. ",
  "HP Omnibook 5 ($800) vs Lenovo - Yoga 7i (750$) Hey guys, need some help. My laptop shit the bed and I had to get a new one, I ended up grabbing the Lenovo Yoga 7i from best buy after watching a lot of reviews.\n\nI haven't had any problems with it so far, but I have been keeping my eyes open while I'm still in the return window. Today I saw this HP on sale at Costco. It seems far better, and I feel like I'm missing something. It has double the ram (32 vs 16), and a 12 core Ultra 7 255U vs the 8 core Core Ultra 7 256V with 8 cores. However, I think the Intel Arc is probably better for graphics than the generic \"Integrated Intel\" on the HP.\n\nThe HP seems almost too good to be true to be so similar but have what seem to be such a better processor vs amount of ram. Please let me know if y'all have any ideas or input!\n\n  \nEdit because I did forget my usage details: I would like to be able to do some light gaming on it. Not consistently, I do have a gaming PC, but maybe basic games while traveling or such. I've been able to play Wrath of the Righteous on the Yoga, and that's been great. I don't plan on running any crazy intensive games. That's the Arc seems like it might be the reason for the pricing confusion?",
  "I think the V series processors are better at performance right since Memory, GPU all are bundled in a single chip ? If you prefer battery longevity, you can go for the U series processors. I have been using the HP omnibook 5 but the AMD AI 7 edition, 16GB variant. It's fine for a college student like me. My opinion is the lenovo Yoga is a better option due to the processor but if you prefer more RAM or battery, omnibook can be a solid option",
  "Most Honest Review of the Lenovo Yoga 7i – Only 3 days in*  \n\nKeep in mind I’m only three days into my new purchase of the Lenovo Yoga 7i 14, but so far I’m really impressed. After returning my M2 Macbook Air Last October, I had been in the market for a new laptop for quite some time, and the Yoga was always something I was considering. The no touchscreen on the Macbook Air simply wasn’t cutting it for me, which is why I ended up returning it despite my relative investment in the Apple ecosystem (ipad pro m1, iphone 12 pro, airpods pro)\n\nMy model: i7 1255U, 16GB DDR5 Memory, 512GB SSD\n\n**Performance:** So far, the performance has been great. Not sure if it’s the marketing gimmick, but the evo certified i7 CPU is quick and extremely responsive in ways that my desktop isn’t. For quick tasks such as opening your apps from the taskbar or simply interacting with the Windows UI, it’s a very snappy chip that has yet to disappoint whatsoever. The 16GB of DDR5 memory is also impressive here, and I’m able to keep dozens of tabs open on Microsoft Edge without any hassle. Definitely think the upgrade was worth it in this sense, 8GB just never seems to cut it these days.\n\n**Display**: One of the best features of this laptop, and is Dolby Vision certified. It has a really nice looking and glossy 2K resolution that looks great from writing documents to watching Netflix–you can definitely notice the upgraded resolution in this sense. I’ve heard some complaints about the display being too glossy, but I prefer it over a matte finish because it feels nicer to navigate on when in touch mode (although it *can* become a fingerprint magnet at times). \n\n**Keyboard:** Keeping this section short and simple. The BEST laptop keyboard I’ve ever typed on. When I first tried it, I was shocked at the switches’ tactility and it was honestly a bit harsh but I’m getting more used to it. \n\n**Trackpad:** Not the best. One of the few downsides of this laptop. The material feels nice, but its touch sensitivity could be improved. \n\n**Battery Life:** Also, not the worst but could be better. I’ve been using battery savings mode on Windows 11 which has seemed to mitigate some of the battery life issues I was initially having. I believe Lenovo advertises over 10 hours and I’m just not sure that’s accurate for my workflow.\n\nOVERALL: Great laptop, 2 in 1 functionality is awesome and feels really polished with Windows 11. Stone Blue color is also awesome and would recommend it!! 4.5/5 overall.",
  "Just got a Yoga 9i myself, also came from a MacBook. \n\nHaven't even had it for more than 24 hours yet, but so far, really can echo a lot of the points you made. Amazing screen, build quality, and speakers. The stylus support is an added bonus as I markup PDFs quite frequently for work.\n\nIf I had to pick a complaint, would be around battery and efficiency. It's not bad but not great either. Expected a bit more battery life and less heat/fan noise. Its early on, so hard to put a great gauge on it. \n\nGreat 2 in 1 all around though, pretty satisfied.",
  "Really nice to hear what you had to say. I just ordered the 14\".  I customized to go 16G RAM. My first (new) Lenovo. I fell in love with a refurbished Flex 7i but it was buggy.\n\nMy brother is an Apple use (phone, pc, etc.) and this is the first time he's not talking smack about my choice.\n\nI'm over here with fingers crossed.",
  "How is it holding up now?",
  "Danke für deine Erfahrungen. Ich wünschte ich könnte auch die Erfahrungen über mein Geräte teilen aber dieses kam nie an und seitdem ärgere ich mich über den Kundendienst rum.\n\n**Meine Erfahrungen zum Lenovo-Service:**  \nIch habe vor über 8 Wochen bei Lenovo eine Bestellung aufgegeben, bestehend aus einer Laptop-Tasche und einem Tablet. Das Paket wurde zwar geliefert, jedoch war nur die Laptop-Tasche enthalten – das Tablet, das auf dem Lieferschein ebenfalls ausgewiesen war, fehlte.\n\nSeitdem habe ich mehrfach den Kundensupport kontaktiert, um das Problem zu klären, und wurde jedes Mal mit standardisierten Antworten abgespeist, die offensichtlich nicht auf meinen spezifischen Fall eingehen. Es wurde mir wiederholt geraten, bei Nachbarn nachzufragen, obwohl ich von Anfang an erklärt habe, dass das Paket bei mir angekommen ist, aber unvollständig war.\n\nNach wochenlangem Hin und Her bekam ich schließlich die Anweisung, einen Polizeibericht zu erstellen, damit eine Rückerstattung oder Ersatzlieferung erfolgen kann. Diese Forderung ist vollkommen unangemessen, da es sich hier nicht um einen Diebstahl oder Verlust handelt, sondern um ein Versäumnis seitens Lenovo.\n\nLaut geltendem Recht trägt der Verkäufer bei Verbrauchsgüterkäufen das Risiko für die Lieferung – es liegt also in der Verantwortung von Lenovo, die vollständige Lieferung der Ware sicherzustellen.\n\n**Fehlender Kundenservice:**\n\nDer Kundensupport scheint automatisierte Antworten zu geben, ohne auf den individuellen Fall einzugehen. Trotz klarer Schilderung des Problems wurde ich immer wieder mit unsinnigen Vorschlägen abgespeist.\n\n**Unangemessene Forderungen:**\n\nDie Forderung, dass ich als Kunde einen Polizeibericht erstellen soll, ist nicht nur rechtlich fragwürdig, sondern auch eine Zumutung. Es ist nicht meine Aufgabe, die Fehler von Lenovo zu korrigieren.\n\n**Verzögerungen:**\n\nSeit fast acht Wochen warte ich auf eine Lösung. Statt den Fehler umgehend zu beheben, werde ich mit bürokratischen Anforderungen hingehalten.\n\n**Mangelhafte Kommunikation:**\n\nEs gibt keinerlei proaktive Updates oder klare Lösungswege. Stattdessen muss ich als Kunde ständig nachhaken, nur um erneut enttäuscht zu werden.\n\n**Vertrauensverlust:**\n\nNach dieser Erfahrung bin ich nicht nur enttäuscht, sondern habe das Vertrauen in Lenovo als Unternehmen verloren. Ein solches Verhalten ist weder kundenorientiert noch akzeptabel für ein Unternehmen dieser Größe.\n\n**Fazit:**\n\nIch habe das Gerät vor 8 Wochen bezahlt und warte seitdem auf die Lieferung des Tablets oder eine Rückerstattung meines Geldes. Der Kundenservice gibt sein Bestes, mich immer wieder abzuwimmeln.\n\nDieser Umgang mit Kunden ist schlicht inakzeptabel.\n\nIch kann Lenovo nach dieser Erfahrung niemandem empfehlen und werde selbst in Zukunft keine Produkte mehr bei diesem Unternehmen kaufen.",
  "Any update for me? I have a question",
  "I got the 9i and love it. The sound is amazing and the graphics are good. I like how slim it is. I don't regret getting it.",
  "I think I got the same thing with 1tb SSD all for $499+tax for Black Friday. I’m hoping this thing can handle music production.",
  "I have the same laptop. I got the Ultra 7-155U 1TB 16' model. Really lovin' what Lenovo's done here.",
  "I just got my Lenovo Yoga 2 in 1 16 inch yesterday and I notice the touch screen does not always respond. Does it have anything to do with the settings? Did anyone else have this issue? Please share",
  "MacBook Air",
  "I am using the yoga 7i intel 12th gen i5 and the only downside for me is the battery life. This thing is brand new and i have it on battery saving mode at all times with the power settings set to conservative. In 2 hours the battery goes to nothing with me only doing light tasks like web browsing or YouTube. Outside of that I type and do office tasks. Had this laptop for 5 months. I'm worrying about battery bloat since I charge it so often. Its a shame that nothing can come close to the Macbook battery life.",
  "How is the bloatware? Does it have MS Edge, Bing, and a bunch of other stuff that can't be deleted?",
  "Can these computers be upgraded like more gpu, ram?",
  "Anybody with yoga 7i 8th gen (2023) facing issues with hinge ? How is it holding up ?",
  "How long does the battery usually last for you? Because I need one for school and thought of looking at this laptop.",
  "Any issues with freezing? Mine is brand new and no errors but completely freezes up. I hit the power and it restart fine. All tests etc come back good... very frustrating idk if I should return before the 2 weeks is up.",
  "Just bought one last night. I haven't taken it out of the box yet because it was kind of a last-minute purchase due to my old laptop (Toshiba Satellite A660 circa 2010) finally kicking the curb, and I wanted to make sure the specs and reviews line up with my needs. So far, so good!",
  "Thanks for sharing about the PDF markup. That's exactly why I've been considering this laptop.",
  "I’d love to hear your experience after two years. I’m starting a PhD and looking for a reliable laptop to last 4–5 years.",
  "How much battery life we talking here ? Running nothing crazy , one software program working without a charged ?",
  "How do you think it compares to the Flex 7i? Making the decision literally right now. My three options are: MacBook Air M1-226 gb, Lenovo Flex 7i- 1 TB and Lenovo Yoga 7 -512 gb. Yoga is $50 more then the other two, but if it’s a better laptop that’s no big deal. I’m hesitant on the Mac cause I’ve never used MacOS. But I’m trying to figure the difference on Yoga vs Flex",
  "I have an 82yn and when the laptop is working it has been great. HOWEVER, mine has so many problems with it. I consitently run into driver issues with the touchpad and speakers. I have to constantly reinistall drivers mutliple times a day to ge the speakers working probably and for my touchpad to work at all. It fucking sucks. Also, Lenevo support fucking sucks. I sent the laptop to them all they did is factory reset my machine and then sent it back with exterior damage to the chasis. I have a very big dent on the front left of the laptop. I spent hours on support for them to finally say they were going to fix the damage for free and I had before and after pics, then they fucking blue balled me right at the end and said they were not doing it for free and going to charge me like 530 bucks to fix the chasis and hinge, which were both damaged in tranist or during the initial repair. This laptop could have been great but I will never be buying a lenovo product again.",
  "Heyy, how's the hinge and hardware holding on?",
  "how is it going? looking into buying one",
  "Still feel this way 2 months later? Looking to get one",
  "Technically you can't delete MS Edge on any Windows machine without any command prompt workarounds - so yes, to answer your question. Regarding \"bloatware,\" the only thing that comes stock with the yoga is the Lenovo vantage which you can easily remove.",
  "yes, they all are there, but the debloat apps exists and work to some extent.. if your workflow does not require windows, stick to mac. I have my Yoga 7i with every cell of my body. Absolute garbage in terms of battery life.",
  "RAM, Hard Drive space? Yes.\n\nGPU? No. Most laptops are designed for their very specific components. While an M.2 and RAM chip are the same size, most laptop GPUs vary and one won't fit in the same physical space as another.",
  "And I'm curious about the battery, is it better?",
  "I got a 16” 2023 (2k screen 400nits, i7 1360p, 16 gb ram, 1tb ssd) because I found a great deal on it and I’ve been using it for a week. I just came back from the library after a 8 hour session (10 AM - 5:45 PM) and still had 25% battery by the end. I was running the screen around 75% of the screen brightness and had 2 desktops with 2 separate edge windows, 6-7 edge tabs open, MS word and OneNote. I run both the intelligent cooling mode on Vantage and balanced performance mode on windows but I do limit the maximum CPU in windows power plan to 50%. For my use case of note taking, browsing, writing papers it does not slow down or lags. Sorry for long review lol but I was trying to find an objective review before I bought it and I couldn’t find any, hope this helps tho. \n\nI love my 16” 2023, the pencil is a plus for me to take notes and screen is a beauty to use. I’m upgrading from a base 2020 M1 MBP, I sold it already and I also sold my 2020 iPad Pro since I can just carry around my Yoga 7i instead of both laptop and iPad. Glad to be out of the apple ecosystem!",
  "Return it, mine does not freeze at all.",
  "I have a Toshiba satellite P50-C bought around the same time as yours and I''m considering this one as a replacement (I know my Toshiba won't last good too much longer). What's your impression on the Lenovo?",
  "Funny I came here looking for things to watch out for on my new yoga I finally treated myself to after more than a decade which was a Toshiba Satellite as well haha. So far I'm really loving mine this past few days, but then again I'm coming from an ancient machine hahaha  I just got open box for 200 so I'm leary if it has issues I just have not personally found yet.  For the price, I am going to ride it our regardless as it is in warranty, and most likely extend the warranty on it just to be sure because I really like it a lot.  I accidentally left it in the bag turned on in my car in blistering heat while I was at work and it survived that I guess lol",
  "I really loved the Flex - it was just used & buggy. After looking at a ton of reviews and videos & articles, I'm hearing that the  Yoga 9i is the cream of the crop. My fingers are crossed.\n\nMy *uneducated* wager would be on the Yoga 9i. I will try to come back and let you know when I get it (estimated to be on the 25th). But go over and look at both. When looking at specs, you can go all the way to the bottom and there will be a link for \"full specs\" for whichever build number you are considering. I saw an exhaustive PDF on the Yoga I got.[ for the Yoga I got.](https://psref.lenovo.com/syspool/Sys/PDF/Yoga/Yoga_9_14IRP8/Yoga_9_14IRP8_Spec.pdf)\n\nIf it helps, see if you qualify for LifeMart (through insurance or employer or veteran, etc). I saved almost $300 because my United Healthcare Insurance offers a LifeMart membership, Never even heard of it before now!",
  "Really well! And I tend to go from tenting to notebook to full tablet mode quite often.",
  "Loving mine",
  "To my knowledge, the ram on the 7i cannot be upgraded",
  "Woahhh coming from a gaming laptop 8 hours is insane. I can barely get 2 hours just watching YouTube on my $1,400 laptop.",
  "is still good? how are the hinges holding up? do you have the link of the laptop?",
  "Hi. Is this the 2 in 1 convertible you’re talking about? If yes how is the hinge on that? Also any additional points you’d add to this review ?",
  "Hasn't been anymore not sure if it was from an update I did to bios or what",
  "I really like it!",
  "I still have never had an issue (knock on wood). Hope you enjoy yours!",
  "I ended up going with the Lenovo Yoga 7i, the rep for Lenovo told me good things about both told me they were pretty similar but I got a really good deal on the Yoga 7i. Thanks for the help tho!",
  "Yes it's the 2 in 1 convertible. Hinge has been fine and absolutely no issues, it is sturdy and doesn't wobble a lot. \n\nNothing new to report, just that battery has been consistent to about 7-8 hours each day and that is more than enough for me to go to class, take notes and then review at the library until 6 PM. It's a little heavier than my old 13\" M1 MBP and the battery does not last nearly as long that (I would need to charge it every other day - newer MacBook laptops are crazy for battery life), but the bigger screen, the USB-A ports, nicer keyboard and pen support is what makes it 100% worth it for me. And also for a fraction of the price for the Apple equivalent.",
  "Thanks! That’s so good to hear!!",
  "I'm looking at reviews of the 7i now. How do you like yours?",
  "Just echoing the person below in wanting to say thank you for responding! Really appreciate it",
  "That’s great to hear. Just found out my classes don’t even allow laptops… and i can use laptops in the school even if mine ends up dying. Not ideal but yeah.",
  "Thank you for the review and feedback of the laptop, ill be a commuter and my uni is 1hr and 30mins so i was a bit worried about the battery life and the weight of the laptop. Specially if it makes any loud sounds like fan noise ect.",
  "any update a year later lol. looming for a new laptop for uni",
  "Thank You for taking the time to answer my questions",
  "I’m loving it man, looking to get a pen soon to start really taking advantage of the touch screen but it’s been great",
  "Awesome, I just bought it! Ordered a stylus for it also. Thanks!",
  "HP Omenbook Ultraflip 14 vs Lenovo 7i 2-in1? what do you think ? Hey guys, I think I came down to two models of lightweight, polyvalent laptops, but i'm struggling in choosing one.\n\nI don't really know what to think except that there is small price gap.\n\nThe specs are quite the same, but I'm not good with everything that's related to how the laptop is built.\n\nAlso some of the lenovo reviews are excellent, and some are... meh\n\nWhat do you think? They both seem like they are quite the same specwise\n\nHere is the omnibook (1100 euros)  \n[https://www.hp.com/fr-fr/shop/product.aspx?id=b1nw7ea&opt=abf&sel=ntb](https://www.hp.com/fr-fr/shop/product.aspx?id=b1nw7ea&opt=abf&sel=ntb)  \nAnd here is the lenovo yoga 7i (925 euros)  \n[https://www.lenovo.com/fr/fr/configurator/cto/index.html?bundleId=83JQCTO1WWFR2](https://www.lenovo.com/fr/fr/configurator/cto/index.html?bundleId=83JQCTO1WWFR2)",
  "Which Laptop to Buy? (Asus Zenbook A14 vs Lenovo Yoga Slim 7i Aura Edition) I'm trying to save for a new laptop that has good battery life, good build quality, and a laptop that is best suited for coding (im a software engineering student). I would also enjoy a laptop that can handle light gaming (valorant). After doing research I have decided between these 2 devices:\n\nhttps://preview.redd.it/y03hmti4vmve1.png?width=1632&format=png&auto=webp&s=218d898cca6a2f6d0e811b828ecfbfa7bef7fd3d\n\nhttps://preview.redd.it/p7fshy09vmve1.png?width=1668&format=png&auto=webp&s=2a0e6e3dec15cdd707eb778b434d247b5bc4429c\n\nThe Lenovo Slim 7i seems more durable, while the zenbook's battery life seems to be better. I am not sure how well each laptop can perform while coding/gaming, especially the Asus laptop with the Snapdragon X chip. Any advice is appreciated!  \n",
  "The Lenovo all day long. The [Zenbook A14](https://smbtech.au/reviews/asus-zenbook-a14-snapdragon-laptop-review/) might be lighter but the Snapdragon processor seriously compromises software compatibility. Here's my [Yoga Slim 7i review](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) for comparison.",
  "Avoid snapdragon laptops not compatable with stuff. Get the intel laptop or something similar. Look for something with the new core i7 285 processor much better gpu should play some basic games. \n\n[https://www.bestbuy.com/site/acer-swift-16-ai-16-3k-oled-touch-laptop-copilot-pc-intel-core-ultra-7-series-2-16gb-memory-1tb-ssd-ice-black/6598823.p?skuId=6598823&irclickid=QdizuG00YxycRiCyPyzi2WwtUksUu8xiXXz9100&irgwc=1&ref=198&loc=Slickdeals\\_LLC&acampID=0&mpid=10451&affgroup=%22BNPL%22%2C%22Deals%22%2C%22Partners%20to%20Keep%22%2C%22Top%20Partners%20-%20Newsletter%22](https://www.bestbuy.com/site/acer-swift-16-ai-16-3k-oled-touch-laptop-copilot-pc-intel-core-ultra-7-series-2-16gb-memory-1tb-ssd-ice-black/6598823.p?skuId=6598823&irclickid=QdizuG00YxycRiCyPyzi2WwtUksUu8xiXXz9100&irgwc=1&ref=198&loc=Slickdeals_LLC&acampID=0&mpid=10451&affgroup=%22BNPL%22%2C%22Deals%22%2C%22Partners%20to%20Keep%22%2C%22Top%20Partners%20-%20Newsletter%22)",
  "Asus Zenbook S14 vs Yoga Slim 7i Aura Edition (14\", Gen 10) Hi all,\n\nI'm currently deciding between two laptops, and I could really use some advice. I'm torn between the **Asus Zenbook S14** and the **Lenovo Yoga Slim 7i Aura Edition** (14\", Gen 10). Here are some of the main specifications:\n\n**Asus Zenbook S14**:\n\n* Intel Core Ultra 7 258V (Lunar Lake)\n* 32 GB LPDDR5X RAM\n* 1 TB SSD\n* 14\" 3K OLED display\n* Wi-Fi 7\n\n**Lenovo Yoga Slim 7i Aura Edition Gen 10**:\n\n* Intel Core Ultra 7 258V (Lunar Lake)\n* 32 GB LPDDR5X RAM\n* 1 TB SSD PCIe Gen 4\n* 14\" 2.8K OLED display\n* Wi-Fi 7, 5MP webcam\n\nThe Slim 7i is a preorder at the moment which makes it hard to find a review for it. I have found them for a similar price (around 2700 aud) however the quote I got from lenovo includes headphones, a mouse, and an extra year of warranty. Honestly any help would be appreciated as I do not know which one to choose.",
  "I am having the same problem except I currently have both and need to return one. Heres my pros and cons:\n\nZenbook Pros:  \n\\-OLED screen  \n\\-Smaller and lighter  \n\\-More \"Futuristic\" build  \n\\-Great battery life and performance  \n\\-Small power brick. Whole package is very light.\n\nCons:  \n\\-Screen doesn't fold flat (Im taller and find this very convenient when standing at the kitchen island).  \n\\-Keyboard action isn't amazing. Kinda squishy.  \n\\-Gets hotter (Noticeable when on your lap) and runs the fans, albeit quietly.  \n\\-No option to \"boot when lip open\" when in hibernate or shut off completely. Will only wake up on lid open when in sleep. Otherwise you have to push the power button. Not the biggest deal but something all the others seem to have and such an easy thing.\n\nLenovo Pros:  \n\\-Nice LCD screen resolution and size. I actually prefer the screen size over the 14\".  \n\\-Amazing keyboard! and the 15\" body size helps because again, Im taller with bigger hands and the body size is actually perfect when in use. Doesnt feel cramped at all. This is one of the biggest things keeping me from not liking this laptop... Lenovo in general has great keyboards.  \n\\-USB C on both sides is great.  \n\\-Battery life is great... about same as the Zenbook.  \n\\-Runs super cool and fans hardly ever fire up.  \n\\-Lays 180 degrees flat. I love this.\n\nCons:  \n\\-The stiff lid is ridiculous.. and I mean its a 2 hander (Thats what she said). No excuse for this when Lenovo has other laptops that have a one handed lid. Ive literally had the laptop slam back down on the table because I was trying to open and it slipped.  \n\\-The LCD can show a \"glow\" around certain parts of the screen borders when booting up and in darker screens. It seems cheap.  \n\\-Although the laptop is light for it's size, it still is a half pound heavier than the Zenbook, and then has a stupid 2 part larger power brick that adds to size and weight  \n\\-Power button on the side is ridiculous as well. Every reviewer calls this out but they keep doing it on this gen design. Super easy to touch and put the laptop to sleep if you are trying to move the thing.  \n\\-Design is boring.... and says YOGA real big in the bottom right corner of the deck. Its not a yoga, and just looks dumb to me.\n\nWith that, I find myself grabbing the Lenovo when I know i need to type out something extensive, and multitask. The size of the screen and keyboard really lend itself to getting business stuff done in a more comfortable manner. On the other hand, the Zenbook is so think and light, and I would choose for that alone bc I throw in my bag a lot and its way more manageable... And you cant beat the blacks from the OLED screen. As a side note, half the time I dock my laptop so the size and keyboard dont matter... so thats a win for Zenbook. Im still torn. I need to make a decision this weekend before my return window closes. Lmk what you think!",
  "How do you find typing on Lenovo considering glossy screen? I type a lot, looked at this model at mall and keyboard seems great but I'm a bit concerned about this screen when it comes to office daily use.",
  "thanks for this review! do you have an update, which one did you keep?",
  "That’s a really nice comment. I appreciate your firsthand feedback with both laptops.",
  "I was looking for this. Real world usage. Based on your comments I’m leaning towards the zenbook. What did you end up keeping?",
  "same honestly the screen is the biggest deal breaker for me",
  "Lenovo yoga 7i 2 in 1 Core ultra 7 155H Hello, I was thinking about buying this laptop. I've been searching for a while but I couldn't find a review or someone talking about it. Does someone have this laptop or know someone who has it and tell me how it manages every day tasks?",
  "What to chose ? Lenovo Yoga Slim 7i Vs Lenovo Yoga pro 7 I don't really know what to chose between this laptops, I saw the new \"lunar lake\" processor comes with the new intel technologies and power efficiency but i didn't find any review about this pro 7 build. What is more powerfull between this builds in terms of multy tasking, gaming and what the difference's will be:\n\nYoga pro 7:  intel core ultra i9 185h\n\nIntel Arc Graphics (from the i9)\n\n32Gb RAM\n\nYoga Slim 7i: Intel core ultra 7 258v\n\nIntel Arc Graphics 140v\n\n32Gb RAM\n\n",
  "Yoga Slim 7i 14\" Gen 10 vs Yoga Slim 7i Gen 9 15\". Oled or Ips, that is the question! Hello everyone, I should buy a new laptop and I am very undecided between these 2 Lenovo models:\n\n* Yoga Slim 7i 14\" Gen 10, Oled screen\n* Yoga Slim 7i 15\" Gen 9, Ips screen\n\nboth with same cpu, ram, etc. (Ultra 7 258V cpu, 32 Gb) at the same price.\n\nHere are the pros and cons that result from my point of view and for the use that I would make of them:\n\n**Yoga Slim 7i 14\" Gen 10**  \n  \nPros: perfect size and superior quality screen (I think!).  \n  \nCons: The Oled screen scares me for the burn in (does it still exist in 2025?) and for the PWM even if I do not know if I am sensitive to this effect (is there a way to check it quickly?). No reviews of this model.\n\n**Yoga Slim 7i 15\" Gen 9**\n\nPros: Ips screen that does not have problems with either burn in or PWM and perhaps it reflects less light (but I'm not sure about this). A lot of enthusiastic review.  \n  \nCons: Slightly larger dimensions. I don't need a touch screen. Lower quality of blacks compared to OLED screen.\n\nDo you know if the 2 battery chargers are the same size for both models? My priority is to have a device that lasts a long time (the one I'm replacing lasted almost 10 years!).\n\nWhich one would you choose and why?",
  "Anche io sto messo come te, ma il 15  pollici lo escludo da subito. Ti scrivo  da uno Yoga S740 di 5 anni fa e sinceramente sono in parte deluso pperchè ho da quasi subito avuto roblemi con tastiera e touch pad. Come vedrai lalcune lettere della tastiera non funzionano e il touchad  raticamente inutilizzabile (devo usare il nouse) Lo schermo  bellissimo e er il resto va una bomba ma inasettatamente sia la tastiera che il touchad mi hanno deluso...Mi ero riromesso dal rossimo notebook di renderlo con touchad atico ma costano troppo...Il 14 7i sembra carino ma 1,489 bombe sono ancora troppe, alternative ancora ce ne sono poche",
  "My exact same dilemma as well, oled vs ips.\nHavent got time to test it myself in the store.",
  "I'm also deciding between these models, biggest concern for me if battery life on the yoga 7 gen 10 is as good as on the slim 7 because of the dedicated GPU. Also the oled screen is 60hz and 1920x1200",
  "Contemplating getting new Lenovo 7i 2 in 1 - how does this sound for me? I'm leaving work soon, so have to give back a trusty old Lenovo X1 Carbon I've been using. The last laptop I bought was a \"build it yourself / no-name\" and I was very disappointed by the build quality, cooling etc, so I've vowed to buy a known, quality brand this time.\n\nMy use cases are pretty mixed:\n\n* OpenSCAD, Fusion 360 (fairly simple models, so I don't think I need a separate GPU).\n* Adobe Lightroom, occasional Photoshop\n* MS Office (I do love a spreadsheet...)\n* Home Assistant tinkering (including small bit of Python coding)\n* General web browsing, tinkering with Home Server, Network config\n* Streaming occasional game from Geforce Now or local (Sunshine/Moonlight)\n\n \n\nMust haves:   \n\n* \\>16GB RAM\n*   \\>1200p resolution\n*   around 16\"\n*   good build quality (preferably metal chassis)\n*   at least 500GB storage\n*   decent brightness\n*   good single core performance for 3D design stuff\n*   good key travel \n\n\n\n Nice to haves:  \n\n* touch screen (this is borderline \"must have\" - love using stylus for highlighting etc)   \n* numeric pad   \n* OLED display   \n* upgradeable (preferably additional slot) storage  \n\n\n\nI've been impressed with the Lenovos we use at work (though these are mostly ThinkPads) so been perusing the Lenovo site (massive, confusing selection), and this hits all must haves and most nice to haves -  \n\n [https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb3](https://www.lenovo.com/gb/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-10-16-inch-intel/83jtcto1wwgb3)  \n\nI could live without the 2 in 1 feature I guess. Not sure how much I'd use that but intrigued to have a play. Maybe I should look to save some money by going for the same specs in a traditional laptop shell?\n\nAny thoughts? The price is at the very top end of what I was hoping to pay, but can stretch to it if I'm convinced of its longevity.\n\nNot many reviews out yet as it's quite new, but from reviews of older gens it looks like it has the build quality I've come to love from the work machines.",
  "I've ordered mine over a month ago and it should be arriving in a week (just got shipped from China). My requirements were pretty similar to yours, minus the 3D things. Also, battery and energy efficiency were a must-have for me. \n\nAlternatives were Asus and Acer. But I've got convinced by the good build of lenovo laptops (didn't try it myself yet). The downside for me is the not so common size of the SSD, but 1TB should be more than enough for my needs (cloud + NAS)",
  "Stuck between these 2 options. Please help between LG Gram and Lenovo Yoga 7i.  Need a home laptop to replace my 10 year old Lenovo Thinkpad. Would like this one to last a long time as well. Consumer reports says the LG Gram has high reliability, but I’ve had a good experience with Lenovo and it’s a good price.\nLG comes with a 2 year warranty and more memory. \nLenovo is a nice screen size and has a newer CPU but I don’t understand the steep discount.\nI feel that these two options exceed my needs and should hopefully keep up with future performance needs.",
  "My Notes:\n\n* LG:\n   * More RAM\n   * Lightweight but larger screen\n   * Consumer reports says highest expected reliability\n   * Comes with a 2 year warranty from Costco\n* Lenovo:\n   * Personally had great experience with a ThinkPad\n   * Great discount right now\n   * Like the slightly smaller 14\" screen",
  "Depends on how long you want it to last. Based on specs alone, your laptop service life could be increased by years with the 32GB of RAM.",
  "Anyone using a Lenovo Yoga Slim 7i 9th gen? I recently came across a pretty good deal on Lenovo's website for this laptop.\n\nAs I said, it's a 14\" Yoga Slim 7i with an Intel Core Ultra 7 155H, 16 GB of RAM, 512 GB SSD and integrated Arc graphics for 850 €.\n\nI've watched a few reviews, and it seems like a great option for general laptop use (browsing, basic productivity and media consumption) but also for content creation (I use Adobe apps fairly often).\n\nI was wondering if anyone her has this same laptop and can tell me their real world opinion.  \nThank you!",
  "Lenovo Yoga 7i or Hp Envy x360 https://preview.redd.it/bqbsiqnlt1xd1.png?width=1635&format=png&auto=webp&s=6ff2741c72390cfb8216629b0fa3192c2bcdc842\n\nhttps://preview.redd.it/k6xe4jamt1xd1.png?width=1589&format=png&auto=webp&s=6d0bdd722ed795bb69a27cec25c5d820501f3290\n\nI actually have the HP Envy x360 currently and bought it on a sale, but I am still able to return it and make an exchange... I just wanted to know if I should stick with the HP or go with Lenovo on this one. I am more so worried about build quality (mainly because of the hinge issue that I have constantly heard about with HP)and how long the laptop will last since all I honestly do is take notes with a stylus and browse the web. I hope you guys can help with this dillema!",
  "The Ryzen 7 is the 8840hs if anyone is wondering.",
  "Following I’m thinking of getting the HP envy but I’m confused at the reviews…",
  "Here in Australia, the Envy x360 with Ryzen is equipped with a 300-nit, sRGB 62.5% screen, which to me, looks very dim in the shop. The one with Core Ultra 125U equips with a 400-nit screen, looks so much better.\n\nI am not sure about Lenovo's though.",
  "It’s not a bad laptop so far I just decided to keep it and it hasn’t been treating me bad for the days I’ve had it. It lasts about the whole day and charges pretty quickly. I have been making sure to be gentle with it due to the hinge issues that it does apparently have.",
  "Any updates on the hinges?",
  "Lenovo Yoga Slim 7i Aura Edition Review ",
  "Lenovo Yoga 7i/9i vs. HP Spectre X360 - Recommendations, experience, reliability? I'm deciding between a 14\" Lenovo Yoga 7i or 9i (likely 9i given the better display) and an HP Spectre X360 14\". I've done a lot of research on them and they all seem well-reviewed, and the Yoga 9i and Spectre X360 in particular are always compared to each other and are very comparable in specs.\n\nI would appreciate hearing from anyone with recommendations between them, particularly people who have made the same decision or have experience with one or both of these laptops. I've seen them both in person and like them both and don't have a strong opinion as between them, so I'm really interested to know if there are less obvious reasons to go with one or the other.\n\nIn particular, I keep my laptops a long time so I'm very interested to know about the actual/observed reliability (or if not, then the expected reliability) of these two laptops compared to each other. ",
  "Eventually which one did you buy and why? I'm also considering those options. (ps. how is it performing?)",
  "Upgrade ipad/laptop or lenovo yoga So im about to enter uni this september and I was planning on getting a 9th gen or 10th gen ipad for note taking. Im planning on heavily using my ipad for notes because having it all in one ipad is better than having a bunch of notebooks. However, my current macbook air is like 6 years old so im worried that if i dont upgrade it, its gonna cause problems in the future. last time i heavily used it was probably 6 months ago and the storage is dying (can be easily fixed) + the screens lcd cracked for about a year until i could only see half of the screen so of course i got that fixed recently only to find out that it couldnt turn on so i got that fixed too. everything is working fine now, my screen is good and im having no problems. but idk how much longer its gonna last since i rarely use it now that high school is over. \n\ni also thought that instead of upgrading one of the two, id just get the lenovo yoga 7i 2 in 1 because its a 2 in 1 laptop/tablet so i can use it for both note taking and as a regular laptop. but after reading some reviews, ive heard that its only good up until the warranty is over which would be 1 or 2 years max. and then it starts having fan problems etc or the hinges break which can affect the laptop screen. considering that, id be better off trading in my 8th gen ipad 32 gb for a 10th gen 256gb ipad this year and at the end of my diploma (2.5 years) trade in my macbook air for a new one but im worried my mac wont last that long\n\nTL;DR upgrade ipad and use 6 year old mac? upgrade mac but no ipad for note taking? or lenovo yoga 7i that usually only lasts 2 years?",
  "Lenovo yoga 7i arc long term review? Can you share your review of the Yoga 7i with arc graphics and the 99whr battery? It's been like a year since it released. How's it holding up. the hinges, screen, battery life etc. Thanks.",
  "After 2 years it's pretty great. The biggest complaint i have is that the mouse pad is too far to the left. It should be more centered. I hate this about it. I can never get the click buttons right because they're not where i expect them to be with 99% of laptops. It's heavy but feels solid. It folds well and does what you want it to do. It does get a little toasty on the back end but just don't use it in bed or if you do leave the vents exposed. Great touch screen. Super fast and seamless. I wish the battery would last longer but i'm a power user so i don't expect much from batteries.",
  "We have two clients who own 82UF0015US Yoga 7i 16\" with the Intel i7-12700H and Arc A370M 4GB Graphics.\n\nAnd until you mentioned it, not one of the nine on our team knew this thing had a 99.9Wh version of a L21M4PE1 series battery. We had to look it up! It does answer a few questions.\n\nBoth clients, who don't know each other, place \"**extremely hot**\" at the top of their list (although one lady was a little more colorful than the other gentleman) as the number one complaint, followed by dismal battery performance when even mildly tasked.\n\nOne was looking for a solution to keep the performance-cores from going full volume when just opening a new browser tab.\n\nThe only other thing, complaints wise, was that it didn't come with a GX81J19850 pen for the price they paid, in which we kind of see their point (pun intended).\n\nThey found the screen astounding, as was the responsiveness. Solid build quality. Availability to use with a Thunderbolt 4 dock as a workstation (where it sets on an air pad).\n\nBut they both found the Arc A370M extremely useful!\n\nNeither one or avid gamers, and they also understand the shortcomings of Intel iGPUs. Having competent, dedicated graphics, which the ARC easily provides, has worked for them in the last 6 months or so.\n\nBut to be fair across the board, all of our clients have had complaints with Alder Lake/Raptor Lake mobile CPUs being a virtual dumpster fire when pushed the least little bit. It's a beautiful processor design, but it needed to have been released on a minimum of 7nm, if not 6nm, to reduce its voltage requirements and its thermal generation.\n\nMaxProAndU Team",
  "Thanks for your reply!",
  ">followed by dismal battery performance when even mildly tasked.\n\nO boy. That's thoroughly disappointing\n\nI heard 2 in 1 yoga hinges are a nightmare. Might wanna tell them to be careful.",
  "Actually, If it's to be believed, **ALL** manufacturers \"**hinges are a nightmare**\" 😆\n\nBeing that we assist or perform repairs on such, the actual truth is \"**(certain) people are a nightmare on hinges**\" Those individuals fulfill the ***less-than-5%*** prophecy, turning their personal issue into a manufacturing catastrophe.\n\nTechnically, 2-n-1 hinges are designed to fail to eliminate destruction of both base body and display body. It's not that some don't wear out faster than others, for our team is DEFINITELY seen that (we're looking at you Acer), or in a super small percentage you receive a defective hinge (It has happened), but it's just not there.\n\nThe best overall 2-n-1 hing design-builds are\n\nHP\n\nLenovo / ASUS : tie (and are believed to use the same suppliers)\n\nLG\n\nMSI \n\nSamsung\n\nDell\n\nAcer\n\nGateway (EVOO/Shenzhen Bmorn Technology)\n\nAnd that comes from our database going back 72 months, on the lowest percentage of complaints averaged out by quality purchased.\n\nAnd we left out manufacturers like Toshiba/Sharp as they have no true local presence, and what few are clients own? We believe the data to be somewhat \"skewed\". As in, \" It's hard to evaluate transmission problems on a Rolls-Royce, when everybody drives a (**insert popular brand here**)\n\nOn the other hand\n\nWe have a small number that have already purchased the \"technically\" blacklisted for 2022 new for 2023 83BS0001US Yoga 7 2-in-1 16\" with the newly released Ryzen 7 7735U. Who've been waiting since last year.\n\nAnd we have other clients waiting, hoping our Lenovo rep is correct in the new ThinkPad 2-n-1 with the Phoenix APU, do out at the end of the summer.\n\nSo there are opening options at Lenovo, finally.",
  ">The best overall 2-n-1 hing design-builds are\n\n>HP\n\nSo you trust the HP spectres?\n\n>We have a small number that have already purchased the \"technically\" blacklisted for 2022\n\nSorry, I don't get this. The yoga 7i was blacklisted as in...?\n\n\n\nThanks for the responses btw. You've been helpful.",
  "> 83BS0001US\n\nSuper random but has anyone had experience with 83BS0001US?  Just ordered one for my mom and was wondering about its battery life + general screen usage, it was the only \"cheap\" model I found with a touch screen and 16 inch or bigger screen",
  "The HP Spectres are workhorses. And the Envy is not far behind (see more of those). Of course, the same overall complaints, from our corporate customers especially, not having a viable CPU option.\n\nWhen last year's Yoga 7i shipped, Lenovo had equal plans for the Yoga 7 AMD Advantage Ryzen 7 6800H/Radeon RX 6700S & Ryzen 9 6900HS/Radeon RX 6800S models. Intel came in with a pricing offer, based on skipping the AMD offering, basically black listing that model so they didn't have to compete.\n\nThey gave the same offer to HP, who also took it\n\nThe only manufacturer that dodge did all together, was ASUS. Lenovo realized that they had \"shat the bed\", and offered the processor and some of the GPUs and other product lines later in the year. These, humorously, outsold projections by nearly 170%. And our rep says that's not accurate because inventory for March had sold out during Christmas, with absolutely no extended manufacturing pipeline for the products 🤦\n\nIt's part of the reason why AMD has been so cautious about launching Phoenix",
  "Late reply, but I owned a Dell 2 in1 for 8 years and never had any hinge issues. Very solid design and I just upgraded to a new one.",
  "We have a little more than three dozen clients who have purchased you so far, and the number continues to grow.\n\nSo far, not one ticket has been issued for any problems, and no complaints. \n\nThis model actually has a fairly large size battery (71Wh), and can go for approximately 12 hours standard duty, and about 6 hours gaming. This will be the first year in the 16\" format, although it's a distant relative to the 82RA0045US IdeaPad Flex 5, which was a huge client favorite.\n\nBut within the model being new and almost specific to Best Buy, it may be a short time before we get enough information to see any actual flaws.",
  "Oh shit. I guess that makes sense",
  "Got it, thank you for the information :)",
  "And can't blame an OEM for taking a deal when REAL money is on the table. Reduction in cost definitely adds to overall margins.\n\nIt's become a fraction of the problems that have really driven Intel into a poor financial status.",
  "No problem!\n\nIf you got additional questions, and it's information are clients have passed on to us, we'd be more than happy to share.",
  "Do you know if bloatware is an issue on this model of laptop or not? I've been warned about purchasing best buy products that don't exist on the Lenovo website, since they can come with more bloatware, compared to a model from Lenovo's website.",
  "It's an excellent question!\n\nAnd a **can of worms**...\n\nWhile some individuals will tell you that the additional bloatware on retail specific PCs is urban legend, depending on the model sold, there is a fair amount of truth.\n\nYou will often notice that Walmart and Best Buy seemingly have substantially lower prices, then other retailers, even Amazon. This is often because the image loaded to the drive is specifically for that retailer.\n\nAnd that includes bloatware.\n\nThe truth is, when you buy from Lenovo, HP, Dell, etc, it's got their bloatware on it too. It's just that retail models occasionally have more.\n\nFor years now, a number of our clients, including commercial, will often perform a clean install of Windows OOTB. They download the appropriate media tool\n\n[Windows 10 Media Creation Tool](http://go.microsoft.com/fwlink/p/?LinkId=616447) **/** [Windows 11 Media Creation Tool](https://www.microsoft.com/en-us/software-download/windows11)\n\n...create and boot from a flash drive, remove **ALL** partitions during installation, and fully update the installation from there.\n\nOccasionally, it may cause an issue, but in more than 72% of clean installs, it fixes issues.\n\nSome footnotes to this process.\n\nYou will immediately notice, that the clean installation is often larger. This is because, even with bloatware, the shipped image of Windows has been \"minimized\" specifically for that hardware. This is because every moved a great deal of Windows support. In the end, the OEM image will exceed the clean installation size, as updates come through.\n\nOne of the exceptions to clean installations as of late, is certain models come with proprietary software, that can't be added to a clean installation of Windows. This will be studio software in most cases, occasionally some very proprietary workstation, CAD software, etc. The paradox, these PCs generally have virtually no bloatware because it's having to support all of the specials software.\n\nAn additional footnote.\n\nA large number of gamers perform clean installs of Windows 10, even if the laptop or desktop shipped with Windows 11. There are a number of reasons they do this. On our end alone, we see less issue tickets from Windows 10 gamers than Windows 11 gamers.",
  "Okay, thank you so much for all the information, it's so hard to find anything about this model of laptop, and I really appreciate it. I think I'll probably purchase this model and clean install it when I receive it.",
  "Thank you. This was super concise!",
  "Thoughts on the Lenovo Yoga Pro 7i at INR 92,000 (~USD 1,100) Link: [https://www.lenovo.com/in/en/p/laptops/yoga/yoga-pro-series/yoga-pro-7i-gen-8-(14-inch-intel)/82y700a2in](https://www.lenovo.com/in/en/p/laptops/yoga/yoga-pro-series/yoga-pro-7i-gen-8-(14-inch-intel)/82y700a2in)\n\n&#x200B;\n\n* 13th Generation Intel® Core™ i7-13700H Processor\n* Integrated Intel® Iris® Xe Graphics\n* 16 GB LPDDR5-5200MHz (Soldered)\n* 1 TB SSD M.2 2280 PCIe Gen4 TLC\n* 36.83cms (14.5) WQXGA (2560 x 1600), IPS, Anti-Glare, Non-Touch, 100%sRGB, 350 nits, 90Hz\n\n&#x200B;\n\nI couldn't find any reviews of this variant online so wanted to know your thoughts on if this is a good deal or if it is overpriced. My priorities are build quality and portability. I am mainly going to be using the laptop for web development and casual gaming (nothing too crazy). I am a computer science undergraduate currently and looking for a laptop that can last me 4-5 years minimum.\n\nI found the 14.5\" display to be the perfect sweet spot for me. The keyboard and trackpad are not the best, but are still very good.\n\nPlease give your opinion as well as suggest any other laptop around the 1,000 USD price range. Thanks!",
  "Lenovo X1 Carbon Gen 10 vs Yoga 9i (14\" intel) Normally I answer these questions for friends and acquaintances but I am a bit stuck right now.\n\nI'm not asking which one is better. Rather, better for my use case.\n\nI need a new laptop. After reviewing many options and I'm down to the **Lenovo X1 Carbon Gen 10** vs the **Yoga 9i** and I'm on the fence. The Yoga 7i is the first runner up thanks to the  i7-1255U processor and the Dell XPS 13 was a close second runner up.\n\nBoth with similar specs are around the same price. (16 GB, Display WUXGA touch)\n\nThe main differences are that the yoga has the i7-1260P processor, 1 TB SSD and it seems that a larger battery. The X1 Carbon the i5-1240P, 256 GB SSD, and a lock slot. Any of those processors, even the  i7-1255U is suitable for what I do. SSDs are cheap so I can get a larger one if needed. Battery life is important and security is important.\n\nI use it with Linux so Linux compatibility is important. The X1 Carbon comes with Linux but it seems that the Yoga 9i has good compatibility.\n\nI am traveling a lot and like to bring the laptop along. Last 6 months we backpacked through many countries cities carrying my girlfriend's Dell Inspiron 2 in 1. I love the form factor. It has good specs but the exterior bent in one corner. Also at 1.63 Kg it felt a bit heavy as we carry max 10 Kg in total so cutting down 0.5 Kg (1 pound) seems meaningful.\n\nSo, knowing that here are my questions:\n\n* Is the Yoga sturdy enough to backpack?\n* Is the X1 Carbon as sturdy as it seems?\n* Is the battery life in the X1 Carbon with a \"P\" processor really as bad as the reviews say? Between 4 to 8 hours of real work.\n* Is the battery on the Yoga as good as the reviews say? Between 8 and 10 hours.\n\nThanks",
  "Thoughts on Lenovo Yoga 7i? Planning to buy the Lenovo Yoga 7i as watching the reviews I think it's pretty great. I am deciding whether I should get that one or the M1 MBA... I am a Multimedia student so I would be using it for editing and coding. \n\n&#x200B;\n\nTIA!",
  "Got one. Had a Flex 5i first, then I found out about the Yoga 7i, so I returned the 5i for the 7i. (battery, display color quality and thunderbolt were the main factors -- everything else is the same)\n\nIt's a great laptop, battery last a lot, screen colors are great (but brightness is nothing to write home about), the processor is great, speakers sounds alright, keyboard is sturdy and feels great, touchpad is nice too. There's two thunderbolt 4 ports on the left side and a single USB-A port on the right side (probably to either plug and forget your wireless mouse receiver, or to maintain compatibility with their Yoga pen holder, which sticks into an USB-A port). Bear in mind it has no HDMI out, so you'll need a hub with an HDMI out if you want to use it. Or displayport out.            \nI bought a well made Baseus hub and it works nice.\n\nI got the version with 8GB of RAM (unfortunately it's the only one for sale in Brazil), and 8GB is kinda lacking, when you open over 10 tabs in Edge (or Chrome, for that matter). Won't affect performance at all, but you'll notice the CPU working more and temps going slightly up.           \nIf possible, get at least the 12GB version.\n\nIts main feature is, of course, the convertible display. I got it instead of a XPS 13 just because of it. Being able to convert it to a tablet is a must for me.                 \nHowever, bear in mind that most 1-star reviews you'll find around mention the hinges breaking. All my lenovo laptops since 2011 have broken their hinges, however they were all IdeaPads, which is the shittiest of the Lenovo line. I have a friend that always had ThinkPads, still owns her original ThinkPad from early 2010's and it's still physically impeccable -- albeit with a worn down clitoris.              \nThe Yoga definitely feels premium, in comparison with all the Ideapads I had (Ideapad Y500, Ideapad Y50, Ideapad 320), however I'll happily retain my habit of slowly opening up the lid, pulling it up only from the middle of it.\n\nSo the greatest point of this laptop for me is also its greatest weakness. Bear that in mind.\n\nOther than that, it's been a solid purchase for me. I was really tempted on the XPS13, as it had a considerably better display and was thinner and lighter for the same specs, but the convertibility factor played a significant role for me.",
  "How is the brightness of the lenovo? The one i want to buy has around 300 nits and i dont know, if its too dark. I want to use it mostly as a replacement for pen and paper so idk if its too dark",
  "Hi .. do you face any issues with hinge in your 7i ? I see lot of comments on hinges going bad even with gentle use .. so wondering what’s your experience",
  "I think it has 300 nits, but seems to be good enough. Where I work at my office, I sit under direct sunlight coming from a big, wide window behind me at around 9 to 10AM.\n\nThe screen has a few tricks up its sleeve to counter it, messing a bit with contrast and stuff. I haven't used it out in the open under midday sun, but at my office, text is readable, black and grays gets pronounced, colors, shadows and etc get screwed up a little, but text and stuff are completely visible at my office during this time (if I don't close the curtains), and I can work without an issue.\n\nMy phone has it, and it works amazingly under direct sunlight.          \nIf you've never seen it, I've recorded a short demo video with a strong flashlight I have             \nhttps://imgur.com/a/mtJR78t\n\nUnder normal indoor light, I keep it at one click below full brightness. It's relatively average.",
  "mine came crooked but worked fine just that my battery went out",
  "Mine broke down after some time (a year I guess?), but I had the laptop dropped several times, and it was really dinged up, so I can't really blame them.\n\nI had accidental damage protection, so when the hinges broke, I sent it over, and they replaced it.\nThe laptop died some months later, I sent it over on warranty, had it repaired, and then sold it.\n\nThe part where the hinge broke was actually the screw anchor on the lid. Although the lid's metal, the anchors are plastic. I reckon that, as I dropped on its corners many times, the lid transferred the twist impact to the hinge anchors, weakening them, and then having them break.                   \nIf I had no other option, I'd drill through the metal and make it so it has a screw and nut to hold in place permanently. Wouldn't be pretty, probably, and would take a lot of care to not break the screen when closing the lid, and still allowing 180 degree rotation.",
  "So you do not reccomend buying the 7i?",
  "Tbh I liked it. Just get anything over the 8GB version, which was the version I unfortunately had.",
  "Advise on Yoga 7i 14\" 2 in 1 I'm looking to buy the yoga 7i for uni but I keep hearing about the hinge problems. The full metal build leads me to think that the hinges should be durable for a few years. The only reason I haven't bought it yet is that I need it to last 4 years as a student.\n\nit would be great if any long-time owners of the yoga 7i or any other Lenovo 2-in-1 could shed some light on any hinge issues.\n\nCurrently, with a student discount, the Yoga 7i 14 is going for £700  with a pen included which seems like a really good deal. I'm worried about the hinges breaking outside of the 1-year warranty.\n\n&#x200B;\n\nMy other option was the dell Inspiron 14 (7425) which looked really good but after looking at some reviews the battery life seems much worse than advertised. I need it to last a solid 7 hours of light browsing and coding.",
  "I have a yoga 7i it lasted for a year and a half before the hinge broke, and I’ve had to send it to the depot twice just this year. I wouldn’t suggest it",
  "Lenovo YOGA Slim 7i Carbon 13\" (2022) Review: Supercharged Portability! ",
  "Second opinion on laptop choice (Lenovo Yoga Slim 7i Pro vs M1 Macbook Air) I am replacing my old Macbook Air from 2015. My main uses are programming (.net & python), light gaming and streaming and I will be starting on a engineering degree within a few years, so it needs to be able to handle those kind of programs as well.    \nI also have a mediocre gaming deskop, which I previously have used for all my programming and my old macbook has basically only been used for school work and streaming.\n\n  \nBut as the old macbook has served it's time, and my life is changing to me beeing a lot more away from home, my needs have changed. I now want to be able to do a bit of hobby programming on the go as well as light gaming when  I am away.  I do have a 6 hour train journey to work, so I want the battery to allow me to use my laptop on this journey. Otherwise I have decent access to power outlets usually.  \n\n\nI am really considering the 14\" Lenovo Yoga Slim 7i Pro (with maxed specs).  I think the specs of this pc reflects sort of what I am aiming for, I love the good display, the size and the design. \n\nThe thunderbolt 4 port would allow good access to a eGPU in the future, as I consider going away from my desktop more permanently, as I no longer play a lot of heavy games and would hope that the eGPU could perhaps be a good intermediary for when I want to play something occasionally. Here the windows OS would also be of benefit, but again, my gaming is light and quite limited generally.  \n\n\nMy main concern about the Yoga Slim 7i Pro is the battery life, which according to what I can see in reviews is about 5 hours with moderate use, which would be the absolute minimum on my travels or when attending school in the future.\n\n&#x200B;\n\nThe main competitor as I see it, would be a Macbook Air M1 16Gb RAM version. As I see it, performance is in the same ball park. same nice form factor, and most importantly, the battery life is great compared to the Yoga Slim 7i pro.   \nA nice benefit going with Apple would be me using both an iPhone and Airpods as daily headphones and phone, but the cons are my fear of it not being compatible with a future program needed for school and limited gaming. But again, my gaming needs are quite limited as I have a desktop when I am at home, and at work it would usually be some very light strategy like HOI4 or something in the evenings.   \n\n\nPort wise, both are plenty. I don't mind using a dock, and at home I have a 1440p ultrawide, where the thunderbolt 4 and 3 respectively is plenty. \n\n&#x200B;\n\nSo I kindly ask for your inputs. I am leaning a bit towards the Lenovo, though I am a bit scared about the battery. In terms of OS, it's not the biggest deal as I am used to both Windows and Mac.\n\nI am also open to other pc suggestions. The price range of these two fit nicely within my budget, so other suggestions would need to be around there too. I also like the 13-14\" light formfactor, as I do need to use it on a train and in buses, and I would like it to be somewhat quiet, as I share a room with 3 other people, where some often sleep at day due to different shifts.",
  "Follow up question: What is the durabilitet and general repairability/cost of repair on the Lenovo like? Does anybody know?",
  "Anyone have a Lenovo Yoga 7i 15.6 inch? Wondering about the battery life (if you tried to stretch it to the max when doing productivity tasks) and cooling capacity. I'm between the LG Gram 16 2 in 1 and the Lenovo Yoga 7i. The only downside I see with the Gram is that the cooling solution is garbage. However, I really like the battery life and weight. There aren't many review on the 7i 15.6 inch version, so I am very curious if the performance is better, and if the battery life can exceed 8 hours. Wondering if the Yoga is capable of playing basic games at 30 fps or better.",
  "Bad experience with Yoga 7i. Are these issues common? What is your experience like? I regret buying a Lenovo Yoga 7i.\n\nMost youtube reviewers say this is one of the best laptops you can buy at this price range. So I went for that. These are the issues I've had:\n\n&#x200B;\n\n* **Sound problem**\n\nRight after I turned it on for the first time, there was a start delay of one second in the sound with headphones. I couldn´t find the solution on the same day, so I almost went back to the store to return it. But to be fair, it was a software problem with the sound drive, I eventually solved it (but only after days searching for a solution and trying lots of different methods, even resetting Windows, etc.).\n\n&#x200B;\n\n* **Pen problem**\n\nThe pen missed one letter in every sentence I wrote (video below). I didn't notice the problem straight away. One week passed and I didn't have the right to exchange the laptop anymore. After days and hours trying to solve a possible software issue, I gave up and sent it for assistance. They completely changed the LCD display. And I bought a new model of pen. Problem still persists!!!😬\n\n&#x200B;\n\n* **The frame near the hinges is a bit loose.**\n\nIf I press, it bends a bit and makes a little cracking wiggling noise. I've seen users complaining their frames popped open from turning 360 degrees for tablet mode. Honestly, it doesn't feel as much of a solid build as youtube reviewers keep saying.\n\n&#x200B;\n\n* **Heat and noisy fan**\n\nIt sometimes gets very hot and the fan often turns on just from things like using Chrome.\n\nI wish I had returned it on the first day. If only it wrote properly, I wouldn't bother much about the other issues. I will eventually return it to assistance, hopefully they'll give me a new unit (but I doubt it).\n\nWhat is your experience like? Is the handwriting experience good with yours?\n\n[https://www.youtube.com/watch?v=mtSZvM8ctw0](https://www.youtube.com/watch?v=mtSZvM8ctw0)",
  "Lenovo Yoga/Ideapad Slim 7i colours entirely distorted while on Battery power. I've been using my Lenovo Yoga slim 7i for a month now and I almost always use it plugged in. But there are times I use it on battery especially outdoors and I noticed that the colours were entire distorted. For example the top bars on MS Edge which are black were almost silver and as I use whatsapp Web, it's original dark mode theme looked almost like a bad invert colours. Hardware canucks said so in his [Review](https://youtu.be/17-qHOERXps?t=472) too.\n\nMy display panel is AUO B140HAN06.8. Any fixes for this?",
  "Lenovo vs HP for multitasking I’m starting a new job soon and am having trouble picking between these two laptops. My job (attorney) involves heavy multitasking and multiple monitors (3-4). I’m looking at these two laptops below and would appreciate some advice. I’m looking at Best Buy specifically. My firm is paying but I want to be respectful of cost. I’d also be open to any suggestions for monitors in the 100-200 range. \n\nhttps://www.bestbuy.com/product/lenovo-yoga-7i-2-in-1-16-2k-touchscreen-laptop-intel-core-ultra-7-155u-with-16gb-memory-1tb-ssd-storm-grey/JJGYCX6PWR\n\nPros: Lots of Positive Reviews, Lenovo is a trustworthy brand, good specs\n\nCons: I won’t be using the 2 in 1 feature, several reviews mention the screen having a lot of glare for when I use it without a monitor or as an additional screen.\n\nhttps://www.bestbuy.com/product/hp-17-3-full-hd-laptop-intel-core-i7-16gb-memory-1tb-ssd-natural-silver/JJGH2YK4ZP\n\nPros: Anti Glare Screen, good specs, large screen when I use without monitor. \n\nCons: HP as a brand is a bit of hit and miss in my experience. \n\nEdit: I’ve looked at the thinkpads as well but unfortunately all of the Best Buy’s near me don’t have them in stock and I’m on a bit of a time crunch. I’m going through BB because I have their premium membership which includes free geek squad repair/support. \n\nDoes anyone have any advice on Dell? I’ve used the latitude 3520 for the past three years through my old job and it’s worked well. \n\nEdit 2: Any thoughts on this Dell Laptop?\n\nhttps://www.bestbuy.com/product/dell-15-6-2k-touchscreen-laptop-intel-core-i7-1355u-2023-16gb-memory-1tb-storage-carbon-black/J3K4L6J6ST",
  "Never buy any hp essential series (no name)",
  "Get a Lenovo Thinkpad T or P series with 32gb ram  and their docking station.",
  "Ditch the consumer-grade laptop, a man of your stature should get a business-grade laptop. I'm talking about thinkpad.\n\nWhy? While consumer-grade laptop would be usable for 2-3 years, business-grade laptop are good investment for 5 years. And, on-site support.\n\nTry looking for thinkpad T14 series or X1 carbon.\n\nPerhaps P14s with a dock for monitor is a great option for you.",
  "Yoga , absolutely not , it will not last long. Look into a Lenovo Thinkpad T series , it will last your YEARS , upgrade comparability, durability,  portability if you invest in T14. I can’t stress enough how overpowered this laptop is.",
  "I also work in law and will tell you a little secret: people in the upper echelons of this field only use Lenovo",
  "If you aren’t gonna use the 2-in-1 feature, why not just get a Lenovo Thinkpad? Not sure that Best Buy’s deals on them are that great atm but they’re great for work and very durable. Between these two you listed I’d get the lenovo 100% especially at that price, but you can get a thinkpad for like $900 with 32gb ram",
  "Get the X1 carbon  gen 13 aura edition \n\nOr the t14s gen 6 Intel \n\n\nGood battery life, light, good build",
  "Of those two, its the Lenovo. [A fuller choice here. ](https://smbtech.au/features/best-laptop/)",
  "So I went on to take a look at the BB site for offerings and it is...abysmal. \n\nNothing decent at that price point besides 2-in-1s that are *meh* at best. \n\nPersonally I'd suggest getting whatever is inside of your price point and has a good warranty. Both Lenovo and HP in the \"lower\" tiers will have some issues/ failures so brand loyalty won't get you far.\n\nIf you can, consider springing for an ARM laptop (unless some software doesn't allow for it) as they're usually far more superior battery wise. Otherwise; choose for specs/ ports and price/ dimensions (carrying around a 17 inch is not as easy if you'll be out and about)\n\nDon't go below 16GB RAM, pick any modern CPU and...good luck.",
  "Never buy a HP laptop is my experience",
  "I'm also a lawyer, but when I think of 3-4 monitor set ups, I think of financial applications and bloomberg terminals. If your employer is restricting you to a single PC (as opposed to a desktop and a companion tablet/laptop), I recommend you get *any* Lenovo Thinkpad L or T series or literally any HP Elitebook. (HP's Elite line has the same reliability and long term support as the Thinkpads). 16 gb RAM will be enough. Unless you expect to be dealing with video files (I regularly get 100's of gbs of body camera footage to analyze each month), 512gb storage should be enough. \n\nYou will want an external blu-ray burner so you can archive/back-up your files and for sharing discovery with outside counsel. As far as monitors, I suggest you get a single 32\" or larger display. If you somehow need more screen real estate, you can leave the screen open on the PC when it's docked.\n\nAs far as a dock, get a Thunderbolt dock, so you have a single cable going into your laptop that includes power.\n\nSince you're buying this for firm work, have the firm just spec and order it from HP or Lenovo. That way you can also get it configured with a 5 year extended support contract that includes on-site support by an HP or Lenovo technician and *accidental* damage protection.",
  "3-4 monitors... I would get a Dynabook. HDMI + 2 type C ports, neither of which are the charger. You can connect 3 monitors while charging it.\n\nIf not that, the Lenovo for sure. Connect a docking station and/or chainlink DP for the monitors.",
  "check this out, lovely laptop - \n\n[https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C](https://www.bestbuy.com/product/asus-vivobook-16-16-fhd-laptop-copilot-pc-amd-ryzen-ai-7-350-with-16gb-memory-1tb-ssd-quiet-blue/JJGGLQKF5C)\n\nAnother pick - \n\n[https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z](https://www.bestbuy.com/product/dell-pro-16-plus-pb16255-laptop-16-0-wuxga-amd-ryzen-ai-5-340-16gb-lpddr5x-1tb-pcie-ssd-win-11-pro-w-usb-hub-silver/JJGHT4T86Z)",
  "For Monitors - \n\nFHD 24 inch - [https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252](https://www.bestbuy.com/product/benq-gw2490t-23-8-ips-led-1080p-fhd-100hz-eyecare-monitor-with-height-adjust-hdmi-dp-black/J39QZT53QV/sku/11123252)\n\nQHD 27 inch - [https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW](https://www.bestbuy.com/product/viewsonic-vg2752-2k-27-ipd-qhd-ergonomic-monitor-usb-hub-hdmi-displayport-black/J37H8G77ZW)",
  "For multitasking and connecting to multiple monitors, I would be looking into a higher spec machine. Lenovo is a good brand. Make sure you budget another $200 - $300 for a good quality docking station.\n\nBut for your profession and your needs, you should be looking at $1,000+ machines that are geared towards business use.",
  "You're better off buying I used Lenovo T-Series off Craigslist or Facebook or local computer shop. Should be able to find a decent one in the $200 range. You're not really going to need any support on the thing unless someone throws it down the mountain.  I may even have one of those left at home to sell, but I won't be back from my business trip until next week.\n\nFor using three to four monitors with the laptop, you're going to need a thunderbolt docking station. And I would also suggest getting monitors that have DisplayPort Daisy chaining capability.",
  "Dell latitude, Lenovo thinkpad and HP elite book",
  "Are they imposing a price limit?\n\nYou don't need to go crazy but you shouldn't be getting cheap junk for something you're going to rely on every day for work.\n\nI'll leave aside any commentary on how insane it is that a law firm would be okay with client materials being on random PCs (well, I guess I won't, but that's nuts).",
  "this is the only answer",
  "Which one's better?",
  "I second this, also Thinkpads last way more than 5 years",
  "think pads are in there own category.",
  "Which T14 though my issue is that each laptop line has so many variants??",
  "What do you think the chances are that their offerings improve for Black Friday?",
  "Another Option in FHD - [https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G](https://www.bestbuy.com/product/viewsonic-colorpro-vp2456a-24-ips-fhd-ergonomic-monitor-usb-hdmi-dp-usb-c-black/J37H8G774G)",
  "P=Performance. Workstation class. \n\nT is their traditional, main line.",
  "i say that depends on budget , i have a refurbished $200 one that i’m very happy with. \n\nI was planning on getting another $300 G2 version for Linux conversion.",
  "Sorry I haven't got the slightest clue since I am far from the US, was just offering some tidbits in general",
  "Thank you",
  "If I prefer something that's more lightweight, should I go for the X1 instead? I don't care to need to upgrade any of the specs because I'd rather buy a new one in a few years.",
  "I am legit confused what to buy. Please help me out I am college going student so a portable laptop helps me but is it okay to compromise over proccesor for a smaller laptop? And obviously I would get an oled if I don't compromise over proccesor. What would be my potential regrets ??",
  "Getting a worse processor would mean that some programs will likely not run that well or at all and if you have to use apps like blender you should get a laptop with a dedicated graphics card so you can run it better but between the 2 the first one is better",
  "My laptop is small and I love it, the size is ideal, it doesn't weigh much and when you use it you realize that the screen is really good.",
  "Both the Ryzen 7 7000 or 8800 series or Intel ultra core 7 have nice speed and a good iGPU.\n\nScreen is up to. However FHD or 2k is fine if not an art or film major. The cheaper FHD laptops often use less power.\n\nI subscribe to consumer reports. The liked the Yoga 7i as well as Thinkbook or Thinkpad E 16.",
  "This is solid as a comparison item.\n\nhttps://www.bestbuy.com/product/lenovo-thinkpad-e16-gen-2-16-laptop-amd-ryzen-7-with-16gb-memory-512gb-ssd-black/JJGYCC5KVL/sku/6589815?sb_share_source=PDP",
  "No yoga\n\nFrom a yoga730-15 user",
  "Are both of these ship & sold by BB?",
  "Core ultra 7 one better anyday",
  "Just picked up an HP Omni book flip x 14. 24 gigs of ram is quite nice. 32 preferred but for the price it was $700",
  "In this case you don't really \"compromise\", because 14-inch laptop is also 100 usd cheaper than 16-inch laptop. You simply pay less for getting a bit worse CPU and less storage. But for 650 usd, you still get a very good CPU Intel Core Ultra 5 226V (which has similar performance to e.g. Intel Core Ultra 7 255U) and 14-inch OLED display. So for these prices, both laptops seem pretty good deals.",
  "if you do not game, microsoft surface laptop snapdragon cpu will give you best battery life.",
  "I don't have first hand experience with these chips, but from what I understand, the difference between the Ultra 7 (256v) and Ultra 5 (226v) are quite marginal.\n\n\nHowever, once you go OLED, it's hard to go back. The 14\" has the nicer screen; much more color accurate, higher pixel density, and it's more portable for students. In theory, the 226v is meant to have better battery efficiency too, but again, what I've seen online has shown that these are marginal differences. + you can save $100 on it? I pick the 14\" here",
  "go for a 14 inch ideapad pro 5i.",
  "Whyyy? Could you gimme the reasons??",
  "hmm Yeah",
  "I thought to take it 😂.But many have told that it has lots of hinge issues so I am seeing other options. \n\nit has an amd chip right?",
  "Yeah Exactly. I mean ultra 5 is still better than i7 so its better deal. I will buy either of em for sure",
  "hmm, But its arm based and might have some compatibility issues with the softwares I'm gonna use",
  "How much does it cost?? And could you gimme a link?",
  "Yoga was the laptop I used when I was studying at university. I was an AI major student who loved drawing at that time.\n\nIf you want a thin and light laptop, the Yoga is very expensive and its value for money is not good.\n\nIf you are studying a university major that requires the use of engineering software and want a laptop with good performance, the Yoga's performance is not ideal.\n\nIf you want a touch screen for drawing, etc., I would recommend a drawing tablet. But if you are a professional artist, then you can consider buying a yoga, but it still won't be your first need.",
  "Just asked because BB has 3rd party sellers too, and I won't trust them. Ultra core 7 looks great. For $100 more 512GB more storage and core 7 over core 5, worth it. Which gen of core 7 and 5 btw?",
  "Yeah I heard ppl mention it but not specifically about the Omni book, did you?  I had a Lenovo IdeaPad flex and it also has hinge issues but mines been great after 4 years.\n\nYeah and ai 7 350",
  "What software",
  "The Cost may vary. I have a Pro 5i (it cost me about 1k bucks us). \n\nbut here's what u are looking for  \n[https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-14-inch-intel/83krcto1wwus1](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-2-in-1-series/lenovo-ideapad-5i-2-in-1-gen-10-14-inch-intel/83krcto1wwus1)",
  "yesh but portability is the issue. like 16 inch and 4lbs is not ideal. I mean I could still take it but I am not sure if that's the correct decision",
  "idk yet. But I did hear that there'd be compatibility issues so I can't afford to do a gamble here",
  "Thanks for the advice. But it's out of my budget for the specs I need",
  "16\" is crazy",
  "Unless you are Engineering, or Stem, you won’t have a issue, \n\nBut get Intel ultra copilot pc.",
  "https://ebay.us/m/avuSgP\n\nBuy this and upgrade memory to 32 or max it support",
  "haha ikr 😂",
  "I am doing engineering actually 😅",
  "Windows laptop.  Intel Based. for you.",
  "Which one should I buy? Can someone tell me if any of these are good?\n\nTo preface, I’m needing to replace my MacBook Pro that died out of no where (officially done with Apple laptops after this one) and not looking to spend over $700 right now, unfortunately. I’m new to anything other than MacBooks so I’m at a loss at what is considered “good” with the budget I have. I’ve tried to do my own research, but it’s honestly all gibberish to me.\n\nI’m not needing anything crazy high-tech, just something I can use for daily tasks and schoolwork. ",
  "I actually have the first laptop, but the Core Ultra 7 variant. Both are functionally practically identical.\n\nI don’t know the specs of the others, but I opted for the Yoga ‘cause it’s a 14” 2-in-1 with an OLED display at a budget price. After daily driving gaming laptops for general use and school, I was basically fed up with the 15.6\" and 16\" sizes and the weight being >5lbs not including the charger. Most other 14” 2-in-1 laptops at this price with similar CPU's have IPS displays (which is fine) with poor color gamut (which is not fine), or perhaps the display is fine but they're running older CPU's which tend to be less power efficient, so I’d say the value is compelling. It’s not the lightest, but it’s still fairly light at 3.1lbs, so slightly heavier than a MacBook Air which is usually <3lbs. I’m coming from gaming laptops for school where the proprietary chargers are about as heavy as a MacBook Air, so this feels transformative.\n\nMore importantly, the trackpad feels smooth and accurate though it’s not haptic like the MacBook, and the keyboard is among the best of the midrange laptops. It’s certainly my favorite keyboard out of the midrange 14\" laptops so far and in my opinion better than the MacBook. It’s also dead silent under light use and I haven’t felt any distracting heat. The only time I ever felt it heat up was when I played a game, like a proper Unreal Engine 4 title, and even then the heat was more comfortable than my previous gaming laptop. The build quality is also solid. I test drove an M1 MBA while using the Yoga (mainly 'cause it would arrive sooner during shipping), and I can safely say the chassis rigidity is similar between the two, though the Yoga is a bit thicker and has fans for cooling. The added thickness doesn't feel wasted, though; you get HDMI and USB-A, the latter of which I need for nursing school, so I'm glad I don't need dongles.\n\nBattery life is the main reason I got the Yoga and it doesn’t disappoint. I went for the $800 Core Ultra 7 for the better iGPU and that it came with 1TB SSD (self-upgradeable btw), but that’s basically the only main difference. The battery life is basically MacBook level. Overall, I’m impressed with Intel’s current CPU’s. They feel like the closest thing to a consumer MacBook for light and medium use, but with the flexibility of Windows. If you do need to charge the laptop, charging is made easy thanks to the USB-C ports on both sides providing power delivery, something most other laptops of this price range don't provide.\n\nMy main nitpick is the touchscreen when in tablet mode. I did purchase the Precision Pen 2 separately so I can use it for drawing and notetaking. The tablet function fine for swiping and pointing with my finger, but I’m also moving away from a portable drawing tablet for illustration. I have some anxiety about pushing the stylus hard (I’ve been drawing very soft with the laptop display, so I’ve had to adjust my paint thickness in Krita to make up for that), but the real issue is that the display has poor palm rejection, like I’ll get incorrect input from my palms or the pinch feature stops working until I recalibrate with my stylus. I’m purchasing an artist glove in the hopes of remedying this.\n\nMy other nitpick is the speakers. Besides pixel count (this is a 1200p display), this is the one area where they clearly cut corners. They don’t sound anywhere close to a MacBook. They’re only downward facing, even though the laptop appears to have upward speakers, so don’t be fooled. They’ll sound worse under a soft surface. You do at least get an audio jack. I’d say 1200p is still fine for 14” to my eyes, but it’s noticeably less dense than my previous 16\" gaming laptop's 1600p display and especially the 13\" M1 MBA's 1600p display. That said, text still looks fine for the display size, and I’ll happily take the 1200p if it means better battery life.\n\nI haven't yet tested mic and webcam for their sound and picture quality.",
  "Samsung for the screen. 3k 120fps is crispy.",
  "What is your purpose or usage??",
  "Frame.work if you dont want any laptop dying anymore and it being unfixable (at least without a hefty fee)",
  "The vivobook also allows you to play... for what you need to do, I would opt for the one that costs less",
  "I bought the first one but it’s a 2K monitor 16 inch I 5 ultra series 2 with 512 GB of storage and 16 GB ram for $599 smoking deal",
  "Of the lot, the Yoga is the best option. The rest are lacking in either build quality or performance - or both.",
  "First one is most promising.",
  "I have the Lenovo yoga 7i and it's actually a pretty decent laptop. I came from more industry laptops like the Lenovo toughbook I like the all metal body and the screen's really good \nIt only has 4 IO ports two USB C one for charging and 2 USB A",
  "Honestly I would suggest building a PC. I bought a Laptop for the convineince of “not needing to be plugged in,” and maybe I just bought a shitty laptop for 2 grand, but the performance drops horrendously when unplugged and the battery life only lasts 2 hours anyways.",
  "Avoid 15.6\" laptops, they're always plasticy cheap builds for some reason. \n\nThe Lenovo Yoga option is by far the best here.",
  "Get the Yoga 7i. It's not even a contest.\n\n  \nAlso is that the ~~Inspiron~~ Dell Laptop with the horrible plastic chassis?",
  "Io mi trovo benissimo con Lg Gram",
  "You will want to find a laptop with 32GB ram and 1TB SSD",
  "If you can, buy from Amazon and take the Asurion extended warranty.  Best Buy offers good buys but then destroys you on warranty.  You can get this --\n\n[https://www.amazon.com/ASUS-Vivobook-Thunderbolt-Win11Home-Expander/dp/B0DPB6YWTS](https://www.amazon.com/ASUS-Vivobook-Thunderbolt-Win11Home-Expander/dp/B0DPB6YWTS)\n\n\\-- for $775ish including 4 years of warranty.",
  "Don't go for Lenovo Yoga series. I had one that didn't last very long. It's not very durable compare with the other laptop",
  "hey!!! where did you find yours for $800? because for me the cheapest price for your laptop only comes up on best buy at $899 and I've been looking at it for a while, but $899 is too much for me. I'm currently looking at this same laptop but instead of ultra 7 its ultra 5.",
  "It is not the model he chose",
  "daily tasks like web browsing, paying bills, etc. & school work",
  "You should go with vivobook",
  "The price probably got bumped up. This was one of the few laptops during early- and mid-July that got sold out quickly with basically no returns (there were simply no open box options). Evidently, people love this laptop.\n\nEither that, or it was a typo. At least on the MSRP, the difference between a Core Ultra 5 and 7 is ~$200, which is in line with the current sales pricing. I find this less likely, though. I’ve seen laptops go up in price due to sheer popularity, like the $500 HP Victus with RTX 4050 from Walmart right before Black Friday last year (it had to be bumped up to $650 ‘cause it sold out super quickly).",
  "Oh I didn't even know they made one with a lower resolution. Get the 4 pro or 360 instead.",
  "Depends on Ryzen 7 model. Ultra 5 has to be the 226V (that's the only ultra 5 that's copilot plus) so the Vivobook would need a Ryzen 7 7735HS or something like that to be better. If it was a 5700U, it's worse.",
  "do you think its more worth it going for the ultra 5 or the AMD ryzen 7 ai version for 100 USD more? because I'm not sure ill be able to go for a 899 laptop.",
  "I’d settle for the Core Ultra 5 for most regular consumers. Both are great in single core performance and battery life, but the Intel model is a bit better in both of those, and I think that’s what most people will value.\n\nThe Ryzen 7 makes a bit less sense to me, and I’d opt for it if it were a bit cheaper. It has better multi core performance, but it has a worse iGPU than the Core Ultra 5, so I’m not sure if it’s any better for hobbyist productivity, like photo and video editing, compared to the Intel (it could still be better, but it’s certainly worse in terms of gaming). The Ryzen 5 makes more sense to purchase ‘cause of the lower price while still performing similarly enough. The only other differences are the lack of Thunderbolt support on the AMD model, but AMD does have HDMI 2.1, which the Intel model lacks (it has 1.4). The AMD variant comes in a more aesthetically appealing light color, but it’s not ideal for the white keyboard LED backlight compared to the darker chassis of the Intel model.\n\nI did test chassis rigidity on the AMD model at a Best Buy, and it feels identical to the Intel model I own.",
  "Looking for a Laptop under $600 anyone have recommendations? I haven’t bought a PC in several years so I know nothing about the market\n\nBest Buy is running some great deals and I included those in the pictures (but I’m open to suggestions to look on other sites)\n\nWhat are some brands you’d recommend and what are some brands I should avoid?\n\nI know I want at least 16 gigs of RAM\n\nStorage doesn’t matter to me\n\nWhat about processers? Intel Core 5 series 2, AMD Ryzen 7 7000, Intel Core 7 series 1, AMD Ryzen 5 7000?\n\nI’m leaning towards the Lenovo or the Samsung\n\nAny other tips, advice, or suggestions would be greatly appreciated!\n\nThanks!",
  "Samsung laptops are generally hard to find parts for when they break. When it comes to memory make sure to check to see if it is upgradable down the road. Many modern laptops solder the memory to the board and don't have any slots for expansion.",
  "Are you looking to game on it?\n\nThis one has a 4050 dedicated GPU and 16GB of ram:\n\n[https://www.walmart.com/ip/HP-Victus-15-6-inch-FHD-144Hz-IPS-Windows-Laptop-Intel-Core-i5-13420H-16GB-RAM-512GB-SSD-Mica-Silver/13987763030?nrtv\\_cid=c9ggkf97thbwg](https://www.walmart.com/ip/HP-Victus-15-6-inch-FHD-144Hz-IPS-Windows-Laptop-Intel-Core-i5-13420H-16GB-RAM-512GB-SSD-Mica-Silver/13987763030?nrtv_cid=c9ggkf97thbwg)\n\n  \nThis one has a better/newer CPU, but no GPU so it'll likely have better battery life: [https://www.walmart.com/ip/HP-Omnibook-5-16-inch-Windows-Laptop-AMD-Ryzen-7-AI-PC-16GB-RAM-512GB-SSD-Glacier-Silver/13943258180?filters=%5B%7B%22intent%22%3A%22retailer%22%2C%22values%22%3A%5B%22Walmart%22%5D%7D%5D&classType=REGULAR&athbdg=L1300&from=/search](https://www.walmart.com/ip/HP-Omnibook-5-16-inch-Windows-Laptop-AMD-Ryzen-7-AI-PC-16GB-RAM-512GB-SSD-Glacier-Silver/13943258180?filters=%5B%7B%22intent%22%3A%22retailer%22%2C%22values%22%3A%5B%22Walmart%22%5D%7D%5D&classType=REGULAR&athbdg=L1300&from=/search)",
  "hp victus",
  "None of them, they're barely repairable, and have terrible quality.",
  "The Lenovo Yoga is a good laptop. If you want good battery life, go with the Amd ryzen 7",
  "MacBook Pro M1",
  "hp victim",
  "I should’ve included that in the post 🤦🏻‍♂️",
  "Thank you for your recommendation, I don’t want to seem ungrateful (I really do appreciate the advice), but no Apple products. I know they’re a superior brand but I’m so comfortable with Window Operating System I’d rather not switch horses midstream so to speak",
  "The only victims are the hinges",
  "Choosing laptop Hi, I am a uni student needs coding and playing games, probably esports game but sometimes AAA. I have searched for some laptops with large screen (>=15\"), portable (probably less than 2.2kg) and wifi 7, including the new processors and a discrete gpu. \n\nThen I have found several laptops with the price I found, all are new and converted to US dollar, price vary by the processor 7 or 9\n\n\\- dell xps 16 9640 core ultra 9 4060: $1300\n\n\\- asus proart p16 4060 ryzen AI 9 $1700\n\n\\- lenovo yoga pro 9i aura edition 5060: $1650\n\n\\- lenovo thinkbook p16 gen 6 core ultra 5060: $1350-1650\n\n\\- lenovo legion 5i gen 10  core ultra 5060: $1300-1400\n\n\\- lenovo legion 7i gen 10 core ultra 5060: $1550- 1650\n\n\\- msi creator a16 AI+ 4060 ryzen AI: \n\n\\- msi stealth 16 AI studio 4060 core ultra 9: $1370\n\n\\- msi summit e16 core ultra 4060: $1650\n\n\\- msi summit A16 AI+ core ultra 4060: $1700\n\n\\- msi prestige 16AI studio core ultra 4060: $1700-1850\n\n\\- dell inspiron 16 plus 7640 core ultra 4060: I have not found one with wifi 7\n\nIf you have used one of these please give me some review about it like the battery the fan noise, GPU (some like the summit e16 has only 55w which may not fully use the 4060),... \n\nAlso, based on the price, with my budget about 1300-1400, which one should I buy, if the laptop worth the price, I would probably raise my budget to $1700-1800\n\nThank you",
  "The thin laptops are going to run hot while playing AAA games due to lack of room for good cooling.\n\nThey will all do well with everything besides the AAA gaming, unless you run lower settings to control the heat and they are all solid laptops.\n\nI have seen a lot of posts about MSI build quality not being great, maybe the business ones are better.",
  "yeah but am looking for a portable laptop as well, I sometimes play AAA games so not that important for cooling",
  "Getting a new laptop through my work at a discounted price, looking for stylus note taking, modelling, gaming and office use. Help me choose \nI'm able to get one of these laptops through my workplace for a somewhat discounted price with a 3 year warranty. My main use case is going to be writing some notes on the device as a tablet with a stylus, lightish gaming, CAD and video editing. Then some general office and Uni work. So Clair Obscur is a game I want to play, some light modelling in blender maybe or autocad, and editing 1080p footage and possibly short 4k video in Da vinci. Any thoughts? May be able to get others a slightly lower cost than standard but curious to see what people think. Thanks.\n\nMSI Summit E16 AI Studio A1VETG-002, 32GB RAM, 1TB, RTX 4050 – price £792\nSKU # 9S7-159621-002\nMSI Summit E16 AI Studio A1VETG-002UK Intel Core Ultra 7 155H Hybrid (2-in-1) 40.6 cm (16\") Touchscreen Quad HD+ 32 GB LPDDR5-SDRAM 1 TB SSD NVIDIA GeForce RTX 4050 Wi-Fi 7 (802.11be) Windows 11 Pro Black\n \nAsus Proart PX13 32GB RAM, 2TB RTX 4070 – price £1604.40\nModel: HN7306WI\nASUS ProArt PX13 OLED HN7306WI 2-in-1 Laptop | 13.3 Inch 3K OLED Touchscreen | AMD Ryzen AI 9 HX 370 | NVIDIA GeForce RTX 4070 | 32GB RAM | 2TB PCIe SSD | Backlit Keyboard | Windows 11 | Stylus Pen : Amazon.co.uk: Computers & Accessories\n \nLenovo Yoga Slim 7i Gen 9 Aura Edition (15\" Intel) – price £943.20 \nPart Number: 83HMCTO1WW\nLenovo Yoga Slim 7i Gen 9 Aura Edition (15″ Intel) | AI-Fueled Creativity | 83HMCTO1WWGB4 | Lenovo UK\n \nLenovo Thinkpad E14 Gen 7 – price £764.40\nPart Number: 21U2CTO1WW\nThinkPad E14 Gen 7 (14 inch Intel) | Next-Gen AI PC for Business | 21U2CTO1WWGB2 | Lenovo UK \n\nAny particular standout? Very tempted by the Proart but not sure if the £800 extra over the MSI is justified for better specs. The Lenovo are more hoping the IGPU will be enough for me, instead being lighter for portability and better battery. Unfortunately can't find many reviews on the MSI, I know the 4050 isn't great but wondering it it'll do for me. Thanks.",
  "Laptop comparison Looking to (finally) upgrade from what some would call an ancient laptop that I got back in 2017 while I was in college. An HP ENVY 2:1 with Intel Core i7-6560U - it worked great back then, but I’ve already had to replace the battery once and the newer one just flopped on me a month or two ago. \n\nSo - there are three I’ve found that I think I would like and need opinions mainly on the first two - all have the same storage and RAM. The available ports are the same except for the Legion which offers a SD card reader while the others just have MicroSD card readers. And yes, I’m aware a RTX 4060 is insanely better than an integrated GPU, but I’m contemplating if the extra $250 up from the Intel Yoga is worth it from a performance standpoint. Otherwise… Intel Yoga or AMD Yoga?\n\nMy needs would be general everyday use, web browsing, light gaming (Valve games FTW), and maybe the occasional PC exclusives that you can’t get for Xbox.\n",
  "If you want to game, the Legion by a mile.",
  "the ryzen 7 isnt bad for light gaming tbh, but it really depends on you budget.",
  "Either get the AMD Yoga or the Legion. AMD will have a better iGPU than Intel, but a 4060 will definitely be better than the iGPU. If you want to play newer games and it’s in your budget, get the Legion.",
  "Between the first 2, go for the amd version. Its a better processor than the base ultra 7\"u\". I also prefer amd processors better than the ultra series 1 processors. Just make sure if they both come with the pen, cause I know 1 amd model doesnt come with it. For the legion, I would personally get that one, its the perfect graphics card for value in a laptop imo and it comes with 32gb. Youre not going to need 32gb but its nice to have especially since the yogas cant be upgraded. Just keep in mind that it is significantly heavier than the yogas and will take more space as well. \n\nEdit: the legion is a i7 14th gen hx processor, way better than any of the yogas. It would be an overkill for basic use but it can run pretty much any program, software and 99% games on high settings.",
  "I just got the yoga 7i with that same Ryzen but instead it was the 14inch and it's amazing. No problems so far and plenty powerful enough. I have even done so light gaming on it just to see",
  "Following the consensus, I would go with the AMD Yoga.\n\nBy Valve Games, I assume DOTA and CS (with possibly some Half Life thrown into the mix). The iGPU would be more than capable of handling those titles. \n\nAlso to consider: does battery life matter to you? The Legion would have significantly less battery life than either of the Yogas. I think Intel would have batter battery life than the AMD model. \n\nBased on your post, it looks like Xbox is your preferred gaming medium, so while the Legion would be more powerful but the extra cost might not be worth it to you.",
  "Tossup additional question, just because I’m curious:\n\nMy work laptop is a Dell Latitude 5520, with an Intel Core i5-1145G7 processor. I’ve used it extensively for CAD software (OpenRoads Designer) and multitasked with typical Microsoft office products and it can support up to 3 additional monitors (2 comfortably). How would these 3 computers match up?",
  "Bro, better wait for new legion laptop's with RTX 50s series.",
  "Brother you can get a hp envy with rtx 4060 for 1200 dollars and that was when 4060 was lastest gen",
  "For gaming the Lenovo legion, for 3d modeling, rendering, etc the first one",
  "There are better choices for your use case. You should look at an Intel Core Ultra (1 Series) H CPU (not the U chips you found), or even better Ultra 2 Series CPU. These come with Intel Arc 8/140V iGPU that have better performance than the AMD Radeon 780M/880M graphics. They also last longer on battery than the Ryzen 8000 Series. If you need multi-core performance go with Ultra 1 H (Meteor Lake). If you want longer battery times go with Ultra 2 (Lunar Lake). Intel also just announced the multi-core successor to Meteor Lake H CPUs called Arrow Lake H CPUs that should become available in a few months.",
  "Update: went with the AMD yoga! Thank you everyone for your help and advice!",
  "hi",
  "I enjoy gaming but my primary use for this next laptop would be standard home office use, like working on my income tax returns. (I’m def getting old lol)\n\nAs far as budget goes, I could afford the Legion but that’s also extra money that could go towards over 70K in student loans. Likewise, the AMD Yoga would be $350 cheaper than the Intel Yoga but I don’t want to buy solely based on price.\n\nMy biggest question is just between the Intel and AMD processors. I know Intel has more cores but I’ve been told AMD handles multitasking a little better (voice chat + gaming) as far as frame rate and what not. But the most gaming I would do is like Minecraft, TF2, maybe D:BH or Phasmophobia. Not trying to play CoD, that’s what I have my Series X for lmao\n\nEDIT: just found out Phasmophobia is available on Series X for $20. Shoot, I’d rather do that than get a laptop specifically for those types of games that won’t be playing ALL the time like I would my Xbox. (Of course, I find myself with even less time to play video games these days but more Xbox than pc for sure.)",
  "i am not forcing you to buy the amd one, just saying.",
  "The Legion I’m looking at is 16GB, which is $1,300. The 32GB Legion is $2,000 and definitely not trying to spend that much.",
  "How long do you have this? The hinges are okay? ",
  "Battery life would be nice. And yes, all of those games plus TF2 / L4D2 lmao, I know I’m old. \n\nAs far as the intel battery goes, that’s what I’ve heard is those are slightly better but not too noticeable. If the AMD & Intel Yogas are comparable in most which ways aside from GPU, then maybe I should go with the AMD. But will think about it for a couple more days. Thank you for the feedback!",
  "I would love to wait, but April 15th is coming up soon and my HP Envy is currently toast and only runs on adapter power. At times it’s pretty sluggish to even boot up Excel or Microsoft edge.",
  "For this laptop life cycle, I think I’m just gonna steer away from HP… the hinges are kinda sus. \n\nAnd I think I also like having a numeric keypad, not sure if it has that.",
  "What’s the difference between H and U for Intel? I did notice that there was 100 series and 200 series but mostly have only seen the 100 series in retail stores. Trying to not go over $1,000 unless the laptop is worth it for at least a few years no problem.",
  "Phasmophobia will need a good dedicated graphics card. I have had both AMD and Intel systems and could not tell a difference in the voice chat + Gaming. But the GPU will significantly improve the gaming.",
  "the ryzen 7 isnt bad for light gaming tbh, but it really depends on you budget.",
  "The Radeon 780M in the Ryzen based laptop is roughly equivalent to a desktop GTX 1650 in gaming. I'm not sure about Phasmo but it will run the other games with no issue. Intel has made some noticeable improvements in the Igpu space ever since ARC, but they aren't on AMD's level yet.",
  "OP I would suggest the Lenovo Ideapad Pro 5i at B & H for 1099$ as it has a core ultra 9 2K 120hz oled touchscreen, 32 gigs of ram, windows 11 pro and rtx 4050 graphics card as it can play most games well and is also thin and light\n\n [Lenovo 16\" IdeaPad Pro 5i Multi-Touch Laptop](https://search.app/AiggPrUELESjXDxaA)",
  "My bad, just noticed that but even then the legion is upgradeable so if u plan on keeping it 5+ years u can always upgrade the ram if u need to.",
  "I've had it a few weeks now, and the hinges are fine I do wish they were smoother and the main place where it sits didnt wobble as much. With that said I owned a previous generation with similar hinges and they still work fine",
  "Nope this hp envy has a singular long hinge at its actually pretty well built but it doesn't have num pad",
  "The main and most significant improvements from Intel over the last few years are their new (integrated) Arc graphics, followed by greater power/battery efficiency. On the 100 Series (Meteor Lake, Ultra 1 Series, e.g. Ultra 7 155H), the new Arc graphics is only available on the H chips. (U chips still use their old, not so good iGPU.) H chips can draw more power and has more multi-core performance compared to U Series. The newer, late 2024, 200 Series (Lunar Lake, Ultra 2 V chips, e.g. Ultra 7 258V) have an even newer, and even more improved generation Arc 140V GPU (suitable for more demanding (AAA) games on 1080p low settings). They are also more battery efficient, faster in single-core and memory operations, but slower in multi-core (simply has fewer cores). For most people this is a great trade-off because they don't do multi-core compute intensive calculations (e.g. 3D model rendering, heavy code compilation).",
  "Makes sense. CPU / GPU is really the only hangup for me atp. Like I don’t have to have 1 TB of storage but if it means getting a decent processor and graphics card that will last for a long time, I’d rather do that than just settling for a $400-500 “value” laptop",
  "You’re good! I appreciate the feedback!",
  "Ohh, good to know. Thanks :))",
  "Gotcha. Which in my case I don’t really anticipate any heavy 3D modeling or doing coding. At most, I might load up some games or run discord with Fortnite or another web-based gaming platform. So in my situation, the AMD and Intel yogas pictured above are pretty much similar but AMD has theirs on sale right now for $350 less than the Intel 155U, whereas it would otherwise only be $150 less if AMD wasn’t on sale.\n\nI suppose my last main question is just performance - how do the cores work? Does AMD fire all at once and Intel has a couple cores that run constantly with other ones available if need be? I’m not too well versed in computer engineering but I understand basic things like how long it would take for a processor to process tasks or what a graphics card can render at a given moment.",
  "The legion will have the highest build quality, so if you value longevity, then I would recommend that.",
  "If you want to save some money, try this. [https://www.amazon.com/Lenovo-Legion-i7-13650HX-GeForce-83DG00EEUS/dp/B0DPM91Z6B/ref=sr\\_1\\_5?crid=1CXJCRKY65QXB&dib=eyJ2IjoiMSJ9.sp77n58yvB9e4fK\\_-mRmN0mxjQjitfDEKTF6L12bOEBMkN2v1hRzJz3PBQgqzW\\_Gw4zAIMvCDr4AuXBEE\\_6i6FyuPENgwi\\_SgtwRfXjThGmSCkd3iIew9ZM8bT1zaaEy1VGcysDD7ju\\_TLMAYkcEomHWfPKD3\\_\\_m4do-wWYExhpjwe5H0QQc4pVqH96H3SqdffdqSoNpJ4\\_3EsgeWEMiEXsHJCxyym0Klm31TTkYjcs.zD4kt4VGKAxGSP-aHGDmH6mkbRwkG6mMK0WOGUAP4mc&dib\\_tag=se&keywords=i7+4060+laptop&qid=1737649608&sprefix=i7+4060+laptop%2Caps%2C135&sr=8-5](https://www.amazon.com/Lenovo-Legion-i7-13650HX-GeForce-83DG00EEUS/dp/B0DPM91Z6B/ref=sr_1_5?crid=1CXJCRKY65QXB&dib=eyJ2IjoiMSJ9.sp77n58yvB9e4fK_-mRmN0mxjQjitfDEKTF6L12bOEBMkN2v1hRzJz3PBQgqzW_Gw4zAIMvCDr4AuXBEE_6i6FyuPENgwi_SgtwRfXjThGmSCkd3iIew9ZM8bT1zaaEy1VGcysDD7ju_TLMAYkcEomHWfPKD3__m4do-wWYExhpjwe5H0QQc4pVqH96H3SqdffdqSoNpJ4_3EsgeWEMiEXsHJCxyym0Klm31TTkYjcs.zD4kt4VGKAxGSP-aHGDmH6mkbRwkG6mMK0WOGUAP4mc&dib_tag=se&keywords=i7+4060+laptop&qid=1737649608&sprefix=i7+4060+laptop%2Caps%2C135&sr=8-5)",
  "Yeah, if it's just between those choices you quoted then the AMD Yoga at $350 less is really a no-brainer and the best choice.",
  "Definitely a thought to consider. I appreciate the feedback!",
  "When since are plastic bombers better than full alu shells",
  "Is this a good laptop I’m wanting a Lenovo laptop that’s good for games and I can use for school would this be a good choice? ",
  "Nope 👎 \nNo gpu (nvidia) \nIt a big L for me so don’t buy it \nTry finding a good pc like alien or OMEN or Lenovo",
  "If you want gaming performance, there are better ways to spend $750 that will accomplish that:",
  "I dont know if I'd consider any computer named \"Yoga\" to be good",
  "really good for the price. ram might not be enough tho(for a long time)",
  "Is it this year's ultra 7 (258v I think) or last year's 155H.. I'm trying to buy a similar laptop at the moment and that ones with deals all seem to use the last gen processors.. really not sure how big a deal that is.. I'm finding the whole thing a right PITA",
  "What kind of Lenovo? I know I want one of those",
  "Yeah I have no clue what I’m doing when it comes to pc or laptop gaming I e always been on a ps5 do you have any recommendation?",
  "All the numbers in your comment added up to 420. Congrats!\n\n      7\n    + 258\n    + 155\n    = 420\n\n^([Click here](https://www.reddit.com/message/compose?to=LuckyNumber-Bot&subject=Stalk%20Me%20Pls&message=%2Fstalkme) to have me scan all your future comments.) \\\n^(Summon me on specific comments with u/LuckyNumber-Bot.)",
  "If you want a good pc try OMEN 5",
  "Look for spending with an RTX 5050 or 5060 graphics card. A 4060 is also good if you can find it. \n\nI would also recommend actually going to your local Best Buy and seeing if there’s a floor units or an open box unit that you can get on a good discount. Best Buy will usually take 20-30% off a floor model. I was looking at laptops last week at best buy and they had a $2200 model marked down to $1400 because it was the last floor unit.",
  "which laptop is best for college, social sciences? i was looking at getting a lenovo yoga 7i as i’ve seen really good reviews on it but would it be good for studying social sciences? ",
  "do u want a drop resistant laptop?",
  "MacBook Air",
  "Dell xps",
  "i’ve never owned a laptop before so yes, i’d say so!",
  "are they good for studying social sciences? i’ve heard a lot of horror stories from mac owners saying that their macbooks weren’t compatible with some websites they had to use in their courses.",
  "used Thinkpad",
  "Just use google then",
  "Which one should I buy? \n\nDoing management with accounting\n\nBudget around $ 650-700 and won't be going for open box ( heard horror stories abt them)\n\nGonna start my internship so upgrading my old laptop.\nThe old thing is from 2015 and still works really well but its heavy, overheats and battery problems \n\nDon't want ios as it doesn't support lots of softwares.\n\nGonna do some casual gaming too\n \nAnd I really would be using the hinge but heard about problems in them\nSo suggestions please guyss",
  "the Lenovo is a drastically better deal, not even considering the bigger sale amount. processor is newer, better, power efficient. iGPU on the Arc CPUs are much better than the trash Iris Xe that I believe is on the “Core” processors. double the storage which for me personally is a plus, but idk if you really need that much storage. \n\nonly thing that I prefer for student use is a 14” over a 16”, but between these two that 16” lenovo is much better.",
  "Go with the lenovo with closed eyes and rested heart.\nIt's the ultimate device for you.\nSpeak of business grade material , support and repairability.\nS0wak of premium quality and perfect screen",
  "Whats the main differnece between these 2? Located in Canada  Cant seem to find the difference even after googling it. Whatever the difference is, is it worth the extra money for the $1000 one? \n\nhttps://preview.redd.it/4klar1oujujf1.png?width=1920&format=png&auto=webp&s=bc0948292d7ff2b0293aa31adeea8320a1c51fa1\n\n",
  "Left one has a better CPU",
  "thats literally it i would assume?",
  "the igpu is also better. and its basically a 1 generation newer model so it might have other differences",
  "thx!",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "Which one between these two? ",
  "Intel laptop (x64/amd64) has a better compatibility with all the apps, you may have a app compatibility issue with snapdragon (it's ARM based), that said the snapdragon will have a better battery life.\n\nrest depends on what you want to do with it",
  "First one is a very good deal. Ram is soldered tho but 650$ for a Core Ultra 5 gen 2 is really good. Also snapdragon is not really recommendable except in some cases.",
  "are there more choices\nfirst of \n\nthe yoga \ni wouldn’t recommend lenovo to anyone \nif its not a thinkpad \n\nand the asus zenbook snapdragon is ARM based (most apps dont run on it….yet)\ndepends on what you want to do though (you should actually check what apps you would be using and see if they could run on that)\nbut you would get exceptional battery life\n\nso yeah choose your poison \nif not choose something else",
  "None",
  "I'd go with the laptop with a higher screen resolution; those are much better for your eyes",
  "Depends on your use case. Both are priced the same. It will depend on how much you value software compatibility and portability.\n\nBoth are suitably lightweight, quiet, have good battery life, and have upgradeable storage.\n\nThe Zenbook is exceptionally lightweight even among similarly built 13-14” laptops (that’s its biggest selling point), while still being durable by modern standards. The Yoga is larger at 16” and weighs more, which is fine for less frequent travel and if you want more screen.\n\nThe Yoga has an x86 processor, which basically eliminates software incompatibility that the Zenbook’s ARM processor will inevitably run into if you plan to do more than just browser and office tasks. Game compatibility is the biggest advantage in favor of x86 for consumers, and other specialized tasks like video editing and 3D modeling work better on x86 due to the lack of native ARM versions.\n\nDue to the relative infancy and uncertainty of Windows ARM support, and Snapdragon X growing pains alongside that, I have to give the overall nod to the Yoga if you want a primary laptop, but I would certainly shop for the 14” model first if that’s within your budget (it’s pricier and limited to 2242 m.2 SSD upgrades, but it’s smaller and has an OLED option). The limited software compatibility kind of makes the Zenbook an otherwise solid companion device or school laptop for if you already have another computer and you know what Snapdragon X can and cannot do.\n\nOther notes:\n- The Zenbook has a color correct OLED display, while the Yoga has poor color reproduction (62-67% sRGB), though the Yoga has a touchscreen and 360 degree hinge while the Zenbook lacks touch support. Only the 14” Yoga gets an OLED option, which is also color correct.\n- The Zenbook has HDMI 2.1 while the Yoga has HDMI 1.4. The AMD variant of the Yoga gets 2.1.\n- The Yoga’s battery can be charged on either the left or right side, while the Zenbook’s battery can only be charged on the left side.\n- The Yoga’s hinge is extra tight so the laptop cannot be opened with one hand, but that’s actually a benefit ‘cause of the tablet feature so the display remains stable for notetaking and illustration.",
  "Copilot PCs are hot garbage and is riddled with AI.... ew.\nx86_64 is prolly compatible with everything and is better",
  "What happened with snapdragon? 3 months ago everybody on this sub swore they were the best thing since sliced bread.",
  "It’s been a year or so now, only good thing is battery life, otherwise there’s a lot that isn’t supported and performance isn’t that crazy due to emulating most stuff.",
  "Looking for a New Laptop Hi everyone,  \nafter six great years, it’s finally time for me to get a new laptop. I’ve been using the ASUS ZenBook UX370U, but unfortunately the battery is in really bad shape now, and the flat cable stopped working — so the touchscreen is completely unusable.\n\nI’m looking for a **new everyday laptop** — nothing too fancy. I mostly use it for browsing the web, working on documents, attending the occasional Zoom call, and watching some YouTube now and then.\n\nWhat I’d love:\n\n* A **convertible (2-in-1)** laptop\n* **Lightweight** (preferably around or under 1.4kg)\n* **Good battery life**\n* A **decent webcam** (my current one is awful 🙃)\n* Budget: **around €800–1000**\n* **No MacBooks**, please\n\nI was considering the Lenovo Yoga 7i, but I’ve read mixed reviews about its battery life. Then I looked into some HP options, but many of them seem a bit on the heavier side. So now I’m a bit stuck and would really appreciate some guidance. I’m not very tech-savvy — I just want a solid, reliable laptop that gets the job done! 😅\n\n**TL;DR:** Looking for a lightweight, convertible laptop with good battery and webcam (not a MacBook), for basic daily tasks. Budget around €800–1000.\n\nThanks a lot in advance for any recommendations! 🙏",
  "I would rather say raise the budget to 1.1k and go for the 258v Yoga 7i for 32gb RAM and 15-20+ hours of battery life. Or try finding a 2x8v laptop (228v, 258v, 288v) in your budget.",
  "For that price almost any laptop is good, if it's not for gaming ",
  "The Yoga 7 with Ryzen 7 7730u or 7 8800 series should have good battery life.\n\nSome of these new Snapdragon laptops seem really nice especially with productivity programs by MS or Adobe. I saw an Acer Swift Ai 14 inch that looked good . They seem to easily last 15 hours.",
  "Thank you guys for all the suggestions!! <3"
]