[
  "My fully charged Lenovo Thinkbook 14S Yoga laptop completely shut down and won’t turn back on. The charging indicator light also does not flash. What’s wrong with her? She’s only a year old. ",
  "[HELP] Should I buy the Lenovo Yoga 9i or the Lenovo Thinkbook 14s Yoga 14? Hi, I´m between buying any of these two laptops. Both with Intel i7 11th Gen. The 9i has the 1185G7 and the Thinkbook has 1165G7 model. Both with 16GB RAM DDR4, 512 M.2 PCIe NVMe SSD and 14 inch display.\n\nThinkbook 14s has more ports (MicroSD + HDMI) while 9i no.\n\nDoes anyone has one of them and could advise me if it is a good purchase?",
  "Lenovo Thinkbook 14s  \n\nHello, i live in argentina and I am a computer engineering student. I will use my laptop mainly for coding and i plan to install ubuntu in a virtualbox vm.\n\nI came across the lenovo thinkbook 14s with 16 ram and 512gb storage at an excellent price. I was wondering if anyone here has tried it and knows if it is good.\n\nMy top pick was a thinkpad x1 carbon but due to importation problems in my country they only have the 8gb ram version and the price is almost twice as the thinkbook 14s'.\n\nI saw on some reviews that the display is a bit dim so I want to know your comments on that.\n\nWhat about the battery? How long does it last?\n\nThanks :)",
  "I've had my 13S for about a week now and battery has been ridiculous. Very happy with it. I could imagine that the 14S has similar or bigger battery. Check to see what CPU you have, if it's the i7 10th gen - it should have even better battery life than what I have (i7 8th gen)",
  "Thanks for your answer friend. orderer the 14s a week ago so im looking forward to trying it :)",
  "I bought it yesterday and somehow exploded! What a pity!",
  "OP, how has your initial experience been with the laptop?",
  "Amazing. First day of use and everything is awesome. If you have any questions just ask!",
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Lenovo ThinkBook 14s reviews Does anyone have any experience with the Lenovo ThinkBook 14s? I'd appreciate a small overall review of what the keyboard is like, it's strengths/ weaknesses, etc.",
  "I know this is entirely missing the point of your question, but in case you haven't seen this, it might answer some questions (it's for the smaller 13s)\n\n&#x200B;\n\n[https://www.notebookcheck.net/Lenovo-ThinkBook-13s-Laptop-Review-A-Business-Laptop-but-no-TrackPoint.428235.0.html](https://www.notebookcheck.net/Lenovo-ThinkBook-13s-Laptop-Review-A-Business-Laptop-but-no-TrackPoint.428235.0.html)",
  "Thinking of Upgrading to HP OmniBook X (Snapdragon X Plus) – Advice Needed! Hi laptop community,\n\nThis is my first post in this community and I could really use your advice!\n\nI’m considering an upgrade and need some advice, especially from those who’ve used the new HP OmniBook X with the Snapdragon X Plus. There’s a deal going on at [Officeworks ](https://www.officeworks.com.au/shop/officeworks/p/hp-14-omnibook-x-snapdragon-x-plus-16-512gb-copilot-pc-hpfe1000qu)in Australia right now for this laptop.\n\n**Current situation:**  \nMy Lenovo Yoga 7 Slim Carbon 13\" (Intel i5-1135G7, 8GB RAM, 257GB SSD) is showing its age. Here are my main problems:\n\n* *Small SSD:* I regularly download and watch movies, but 257GB fills up fast.\n* *Slow performance:* The i5-11th gen feels outdated and sluggish.\n* *Low RAM:* 8GB isn’t enough for my workflow—I keep many job application tabs open and learn coding.\n* *Poor battery life* and unreliable keyboard (some keys need to be pressed VERY hard).\n* *Noise:* The single fan runs constantly and isn’t quiet.\n* After this experience, I’m pretty much done with Lenovo.\n\n**Why I’m considering the HP OmniBook X** Snapdragon X Plus\\*\\*:\\*\\*\n\n* It’s got a Snapdragon X Plus chip, which from what I’ve read should be super snappy and efficient (ARM chips = long battery life).\n* 16GB RAM and 512GB SSD solve my speed and storage issues.\n* Slick design and solid build quality—I’ve only heard good things about HP from friends and Officeworks reviews seem positive.\n* Hoping for much better battery life and a quieter, cooler experience.\n\n**My usage:**\n\n* Watching YouTube/movies\n* Learning coding and applying for jobs\n* Lots of browser tabs (mainly job portals)\n* Want a laptop that’s quiet, with solid battery, good keyboard, and enough power for everyday multitasking.\n\n**Questions:**\n\n* How’s real-world performance on ARM Windows laptops? Any compatibility issues for daily use?\n* Is battery life genuinely as good as advertised?\n* What’s your experience with HP build quality and support?\n* Should I consider anything else before making the switch?\n\nAll thoughts, insights, and experiences are very welcome. Thanks in advance for the help!\n\n\\-------------------------  \nUsed perplexity to organize, gather my thoughts and create this post\n\n[HP OmniBook X Qualcomm Snapdragon X Plus](https://preview.redd.it/jqkb1usvyzhf1.jpg?width=1000&format=pjpg&auto=webp&s=bd6d40bd0a6a248242d1a0fc11db0186f4ba031c)\n\n",
  "These ARM chips are indeed super snappy - as you described. However, if you plan on gaming, I would steer clear as many games are simply not available yet.\n\nIf you don’t game, or know your games work, I would highly recommend. But check everything is compatible, or at the very least, will work via Prism.\n\nI personally have been daily driving a Snapdragon X Elite (but MS Surface) since November and absolutely love it. About 90 - 95% of apps I’ve come across have worked (I’ve tested hundreds for my job). The only ones that have problems are driver related (such as printers). But even then, many print vendors are supporting ARM now. \n\nIn terms of battery life and thermals - they’re sublime. It never gets hot and I’ve never heard the fan spin up (even while working in bed!). Battery lasts 8-10 hours I’m and I have to charge it roughly one every day and a half.\n\nSummary: for a work daily driver, I wouldn’t go back to x64-x86. Hopefully Microsoft can keep up the momentum.",
  "Personally ARM on microsoft is still not where it needs to be. Be prepared to get random compiling errors when coding if the VSC plugin even works to begin with.\n\nFun fact, when these snapdragon chips launched, the windows arm version of chrome just didnt work for two weeks. It was broken and you were relying on a third party vendor (google) to fix their shit.\n\nIf you want an arm device, mac is where it is. If you want x86 linux is where it is. If you want to game, windows is where it is.\n\nWindows on ARM is you running beta testing for software, firmware and hardware while paying for the privilege.\n\nAs for your current device, honestly the big hold back would be the ram. It likely is not enough so you are having to use the page file on your ssd which is slower and if you are running out of space on your ssd it would be even slower. Additionally it is likely not dual channel memory so it is kneecapping the processor's performance. In terms of the fan you could redo the thermal paste yeah that likely is not really fixable.",
  "Did you get omnibook x? Planning to get this one too",
  "Thanks so much for the detailed insight!   \nYour real world experience with snap is helpful, I’m not a gamer, so that side effect isn’t a big issue for me, but I’ll definitely double-check the specific software I need (i use vs code and someone mentioned not all plugins are compatible), and look into Prism compatibility.  \n\n\nI went to Officeworks the other day to try out the laptop, and I was impressed with its sleek aluminium build. The keyboard felt a bit odd to the touch, but that’s fine since I’ll be using an external keyboard anyway. I opened around 30 tabs—YouTube, Reddit, news sites, job portals—and there was a slight lag (which I expected), but it didn’t heat up and the fans never kicked in, which was nice!\n\nThe only letdown was the touchpad. It felt premium, but it didn’t always register my single-tap clicks, which got a bit frustrating. Still, I’ll be using an external mouse most of the time, so it’s not a dealbreaker for me.",
  "hey do u mind if i get ur opinion on a few laptops?",
  "Of course you can go for it",
  "If you had to pick one which would it be\n\n-ASUS ZenBook 14 – Intel I7 12th Gen | 16GB RAM | 512GB SSD | Intel Iris Xe Graphics \nspecs: Model: ASUS ZenBook 14\nProcessor: Intel Core i7-1260P (12th Gen, 12 cores, up to 4.7 GHz)\nGraphics: Integrated Intel Iris Xe Graphics\nRAM: 16GB LPDDR5 (soldered)\nStorage: 512GB PCIe NVMe SSD\nDisplay: 14\" Full HD (1920 x 1080) IPS, Anti-glare, 400 nits\nOperating System: Windows 11 Home\nAudio: Harman/Kardon-certified speakers\nKeyboard: Backlit keyboard with precision touchpad\nPorts:\n2 x Thunderbolt 4 (USB-C)\n1 x USB 3.2 Gen 2 Type-A\n1 x HDMI 2.1\n1 x 3.5mm Combo Audio Jack\nMicroSD card reader\nConnectivity: Wi-Fi 6E, Bluetooth 5.2\nBattery: 75Wh, up to 16 hours of battery life\nWeight: Approx. 1.3 kg (2.87 lbs)\n\nORRRR\n-Lenovo ThinkBook 14 G8 - 21SJS00300 - 14\" - Core Ultra 5 225U - 16GB RAM - 512GB SSD - Intel Graphics\nspecs: Processor: Intel Core Ultra 5 225U, 12C (2P + 8E + 2LPE) / 14T, Max Turbo up to 4.8GHz, 12MB\nMemory: 1x 16GB SO-DIMM DDR5-5600.  \nStorage: 512GB SSD M.2 2242 PCIe® 4.0x4 NVMe. \nDisplay: 14\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC, 60Hz. \nGraphics: Intel Graphics.  \nPorts:\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1)\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On\n1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.0 and DisplayPort™ 1.4\n1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n1x HDMI® 2.1, up to 4K/60Hz\n1x Headphone / microphone combo jack (3.5mm)\n1x Ethernet (RJ-45)\n1x SD card reader",
  "Id personally lean towards the Asus",
  "Suggest a good business laptop I'm Looking for a good business laptop, for my work, my budget is 1 Lakh (~1100 dollars)\n\nApple is a no, so macbooks are out of the question\n\nMy Requirements\n\nI'll be travelling a lot, so I need a laptop which is light weight but has long battery life.\n\nMy major use cases are, teams and office, editing signing documents, browsing and a lot of research\n\nFor my personal use case Ill use it for media, so Ill prefer an oled screen\n\nAnd more importantly it has to be extremely durable, because of my travelling, people at airports do not handle laptops properly.\n\nSome Non Negotiable requirements\n\n16gb Ram\n512gb SSD\nWindows 11\nWeight under 1.5 kg\nScreen size 14inch (15 is okay, if weigh is under 1.5kg)\nIntel/AMD processor (No Snapdragon)\n\nSome requirements that would be good to have\nTouch screen\n120hz\nFingerprint sensor\nType C charging.\n\n\nIve looked at Zenbook 14 oled, lenovo thinkbook 2 in 1, lenovo yoga slim 7,\nGalaxy book 4 360 and the Surface Pro 13\"\n\n\nPlease give me a suggestion and people who have any of these your review would be great!",
  "Yoga Slim 7i Aura (matte screen protector) https://preview.redd.it/b8mtcn5982gf1.jpg?width=6048&format=pjpg&auto=webp&s=e845f5cb83ca25e4302adc0239dc73bc321964ca\n\nI’m honestly so happy with how the screen turned out after putting on a matte screen protector. Finding a laptop that checked all my boxes was tough—IPS screen, good color accuracy, a solid keyboard, portable, and still powerful enough. I’m coming from a MacBook Pro 16-inch (amazing machine, not gonna lie), but I needed to run an app that’s Windows-only.\n\nAfter watching what felt like a million laptop reviews, my final contenders were the Yoga Slim 7i Aura and the ThinkPad X9 15. I ended up going with the Yoga Slim because of the IPS screen, and once I slapped on that matte protector, it became the perfect setup for me. Now I can work in direct sunlight without worrying about glare or reflections.\n\nThe installation, though? Absolute nightmare. I had to do it twice because the first time was full of bubbles. I even tried the classic “steamed bathroom” trick, lol. Thankfully, second time’s the charm, and now it’s flawless.\n\nImgur link for those who want to see more pictures:  [https://imgur.com/gallery/yoga-slim-7i-aura-matte-screen-protector-bnxUEsR](https://imgur.com/gallery/yoga-slim-7i-aura-matte-screen-protector-bnxUEsR)",
  "Hi! Could you please tell me the brand of your matte screen protector and where you bought it?  \nI'm about to buy the same model with very reflective glossy OLED screen, and I'd like to make it matte as much as possible. Your post makes me understand that this is possible. Thank you!",
  "why did u need a matte? im hesitant between oled zenbook s14 and Lenovo Yoga Slim 7i Aura Edition cuz of the screen. i dont want glossy",
  "I shared the link with another redditor earlier. I got it from Photodon, they have two great matte screen protectors MXH (25%) and MXT (50%). I got the MXT which is great. Now I can use it outside directly in the sunlight.",
  "Same as you. Didn’t want glossy screen that’s too reflective. Matte helped with that tremendously",
  "but its a deal breaker for me if they both glossy i rather just get the zenbook",
  "Yep, both are glossy. You can’t go wrong with either one.",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "High performance, long lasting laptop requirement. Budget €2500 Hello all.\n\nI'm looking for a Windows laptop which will do me a number of years. As longevity is important, I believe performance is an important criteria. My current setup is an 8th gen Intel i5 Asus laptop (8/256) and a M4 Mac Mini (24/512) on the desk. I want to replace both of these items with a single Windows laptop and I'll sell the Mac. I find Windows is more natural to me so I'm going that route.\n\nThe laptop will be 80% on the desk, open and the screen being used in addition to my on desk monitors. Although it'll be on the desk, I don't want something that weighs a ton and is practically not portable. Also quieter fans always helps.\n\nMy work is quite varied from Affinity photo, VS Coding/Cursor, Docker, VM's, MS Office, 20-30 browser tabs open etc. Apart from the additional RAM needed for VM's/Docker etc, I probably don't need a very high performing processor but since my last laptop gave me 6 years and the one before that was a 2012 MacBook Air, I expect longevity. While I love the form factor of 16\", I can't stand the numpad on these laptops but I guess it's something I'll have to live with. Budget in or around €2500 but I'd very happily not spend that much.\n\nCurrent machines I'm looking at:\n\n\\- Lenovo Legion 5i (2024) - i9-14900HX, 16GB RAM (SODIMM so I can add more). 1TB SSD, 16\" 240Hz screen, RTX 4070. €2000  \n\\- Lenovo IdeaPad Pro 5 (2025) - Ultra 9 285H, 32GB RAM, 512 SSD, 16\" 120Hz 2.8k screen. €1400  \n\\- Lenovo Yoga Pro 7i Aura Edition (2025) - Ultra 9 285H, 32GB RAM, 512 SSD, 14\" 120Hz 3k screen. €1700  \n\\- Asus ProArt P16 (2024) - AI 370 HX, 32GB RAM, 1TB SSD, 16\" 4K 60Hz screen, RTX 4070. €2700  \n\\- Asus Zenbook S16 (2024) - AI 370 HX, 32GB RAM, 1TB SSD, 16\" 3K 120Hz screen. €1700  \n\\- Lenovo ThinkPad P14s Gen 5 (2024) - Ultra 9 185 vPro, 16GB RAM (SODIMM so I can add more), No OS, 1TB SSD,  3K 120Hz screen. €2200.  \n\\- Asus Zenbook Duo (2025) - Ultra 9 285H, 32GB RAM, 2TB SSD, 2 x 14\" 120Hz 3k screens. €2500\n\nI'm finding it very difficult to see past the value proposition of the Lenovo IdeaPad Pro 5 (2025) right now considering it's half the price of the ProArt P16 for practically the same (my) real world performance/usage. Any reviews for the IdeaPad I can find are quite positive. Second is the Yoga and I'm half thinking to just buy it and be done. I also realise that it's very early for many laptops to be available with the 200 series Ultra chips but I'm probably not interested in waiting for this or waiting for that. I'll probably buy in the next 2 weeks. I know the Yoga 9i is available in June but I suspect that would be outside my price range.\n\n* **Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:** €2500 (euro)\n* **Are you open to refurbs/used?** Yes\n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?** I'd say 80% desk based. Looking for something to last 5 years\n* **How important is weight and thinness to you?** Not overly important\n* **Do you have a preferred screen size? If indifferent, put N/A.** 14-16\" with preference for 16\"\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** Mostly web development so not heavy\n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?** N/A\n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** No requirement for a touch screen. Would like a very good screen to look at.\n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.** Longevity is important. Do not want a Mac (already have a Mac Mini that I'm moving away from). I don't need a dedicated GPU. With the 200 series of Intel chips out, I'm not overly interested in 100 series. Not overly excited by 14th gen Intel either due to issues. That said, I have included some options.",
  "Have you ruled out Asus Zephyrus G16 (2024 or 2025)? It is a cheaper Asus ProArt with the same of internals.  These Asus model carry the best speakers of all Windows laptops which is nice to have if you have kids or others to share a screen.",
  "Update: Added the ThinkPad P14s Gen 5 to the list",
  "Thinkpads amazing for build quality and longevity. The Ideapad 5 you're considering has significant issues with the hinge and will not last years if you use it like a laptop at all. I bought two Ideapad 5's and both failed at exactly 6 months, right after warranty expired. This is a widespread issue with the Ideapads though it's impossible to know with the brand new 2025's. \n\nFor your price range I'd probably say get the Thinkpad P1 gen 7 with OLED 4k. The Intel Ultra processors it comes with are generally efficient and quiet, and if you pick a lower TDP option GPU and something like the Ultra 7 155H it'll be very quiet when plugged in. Also, it has no numpad and a centered keyboard. As for price, there's brand new ones on Ebay with specs above that for about $1800-1900, from Lenovo with no sale it's over $3.5k lol",
  "Question: why are you listing high refresh rate laptops? Is that something you want?\n\nBecause I doubt you’ll max out that refresh rate in games unless you play older games or competitive online games.\n\nEdit: nvm just saw you don’t care about games.",
  "Have you considered a HP ZBook?",
  "T14 Thinkpads",
  "Update: Added the Asus Zenbook Duo (2025) to the list",
  "I did but seems a little difficult to find them not overly priced in Ireland.",
  "I'm doing some research on the P14s this morning.\n\nDirect from Lenovo I can get the Ultra 9 185H, no operating system, 16GB RAM, 256GB SSD, 3K IPS display for €2370.\n\nA local retailer has the Ultra 9 185H, Win 11 Pro, 32GB RAM, 1TB performance SSD, 2560x1600 @ 90Hz display for €1790.\n\nI don't think the better display is worth €600.",
  "Also, unlike the ProArt you don't need to pay for a 4070 you said you wouldn't be using much. The 16:10 screen is also good for web development with it's bit of extra height. P1's are also pretty much the top of the Thinkpad scale, being workstation laptops and thus very solid. P1 gen 7 is also 17mm thick and 2kg so pretty portable.",
  "You're right, I never game but do appreciate a nice smooth screen. High refresh rate is not a must have but more a nice to have.",
  "I will take a look, thanks",
  "Thanks. A lot of praise online for Thinkpads",
  "Can someone help me figure out which of these is best? Looking for help from those more knowledgeable about laptop features.  Looking for a laptop for my daughter to use in college.  Any clear winners or losers in this short list?\n\nhttps://preview.redd.it/hf7wq4qg83pe1.png?width=425&format=png&auto=webp&s=3b07ff7fcc6554d9414598a923a5f978d9810922\n\n",
  "I have created a comprehensive guide to help people figure out what specs to look for when buying a modern laptop. It's a 10-20 minute read. GL M8.\n\nhttps://www.reddit.com/r/TOOsTechTactics/s/O9SdjwqA2A",
  "The one with the 8845HS is, as far as specs, FAR AND AWAY the best one.",
  "Thank you, I’ll read thru that",
  "Why is that?  Because of the chip?",
  "I am back at my search now as I lost out due to tariff wars and just hit pause.  What do you think about these specs for a Lenovo Thinkpad\n\nProcessor:AMD Ryzen™ 7 7735U Processor (2.70 GHz up to 4.75 GHz)\n\nOperating System:Windows 11 Pro 64\n\nGraphic Card:Integrated AMD Radeon™ 680M\n\nMemory:16 GB DDR5-4800MT/s (SODIMM)\n\nStorage:1 TB SSD M.2 2242 PCIe Gen4 TLC Opal\n\nDisplay:14\" WUXGA (1920 x 1200), IPS, Anti-Glare, Touch, 45%NTSC, 300 nits, 60Hz",
  "NP M8. GL.",
  "Yes.  CPU massively more powerful than the other choices, iGP massively superior to the other choices.  Battery life (if all else were the same) wouldn't be good on any except possibly the 1185G7, but the 8845HS will still probably be better than the Alder Lake U's (which is sad that Alder Lake really is that poor with battery life).",
  "Sounds an awful lot like my E14 Gen6 that I bought a few months ago.",
  "What is your opinion on this one?  I saw you mentioned in your post that you aren't as familiar with AMD, but still curious on your opinion.\n\nLenovo IdeaPad 5 2-in-1 (14\" AMD)  \nProcessor:AMD Ryzen™ 7 8845HS Processor (3.80 GHz up to 5.10 GHz)\n\nOperating System:Windows 11 Home 64\n\nGraphic Card:Integrated AMD Radeon™ 780M\n\nMemory:16 GB LPDDR5X-6400MHz (Soldered)\n\nStorage:1 TB SSD M.2 2242 PCIe Gen4 TLC  \nDisplay:14\" WUXGA (1920 x 1200), IPS, Glare, Touch, 45%NTSC, 300 nits, 60Hz, Glass\n\nCamera:1080P FHD with Dual Microphone and Privacy Shutter\n\nWIFI:Wi-Fi 6 2x2 AX & Bluetooth® 5.3",
  "That’s what they’re calling it. ThinkPad E14 Gen 6 AMD 14”. The only thing I’m concerned with is the 16 MB ram, but I believe it’s expandable. \n\nHow is yours performing for you?",
  "I don't have an intuitive understanding of AMD, yes.\n\nI think that this laptop looks great except for one major issue: 16GB of RAM. I would look and see if it is either upgradable or if there is an option for at least 24GB of RAM.",
  "Mines great.  It is indeed expandable, I upgraded mine to 64GB ram.  Dual SSD slots (1x2280, 1x2242), socketed wifi.  Screen is pretty awful, but is easily (and RELATIVELY inexpensive to) replaced with a 400-nit low power screen (did on mine) which isn't even an option.\n\n7735U is the older Zen3+ based Rembrandt cores, but is still quite sufficient.  It's still more powerful than the Meteor Lake 155U, with a better iGP as well, and very similar efficiency despite being several generations older.  Get the 57wh battery upgrade and it should be easily capable of 7+ hours on battery with a reasonable load, and if also upgraded to the low power screen, will be nearing 9 hours possible on battery real world.",
  "Lenovo bad. HP better? IdeaPad Pro 5 (8845HS) and Yoga Pro 7 (155H) vs Omnibook Ultra 14 (AI 365) Hi everyone!  \nSorry for the click-bait topic. I want to ask about buying HP over Lenovo. In order to make this post more valuable, I'll write down a short review of the Lenovo laptops because I found many people are looking for similar things in a laptop as me. Also including the OLED vs IPS opinion. I'll add 8845HS vs 155H review later.\n\nOriginally, I wrote a long post, but I didn't save it and it got lost. I'll try to make it short this time.\n\n**What am I looking for?**  \nI want a small work laptop that I could also use for my personal things. It should have good CPU, 32GB of RAM and 100% sRGB because I intend to use it for editing photos while traveling. I also wanted iGPU because it's good enough for the tasks I intend to use it for.\n\n**Why I don't want OLED**  \nOLED screen is dominant in the class of laptops I am looking at. And generally it's a selling point of many laptops. I understand why, but it's no good for my use-case.  \nI use a lot of static content Programming/Lightroom/Web and when I am working, I want to use my laptop as a second screen, which means opened browser or a VS Code for extended periods of time. Of course, this is exactly the use-case that's not great for OLEDs. I also went to a local shop and I saw that the OLED screens have a burn in. I understand that the laptops might be there for a long time, but still.. I don't want to limit my productivity to mitigate something that's going to happen sooner or later. Also the eye strain is real. So it's an IPS for me.\n\n**IdeaPad Pro 5 14AHP9**  \nThis was a big step up from ThinkPad E590 I had before. The performance is great. It's even better than 5600X I have in my PC. But I was being worried about the OLED burn in too much in the long run. Otherwise it was a perfect choice for me. \n\nPros:  \n\\- Very good specs  \n\\- Full metal case  \n\\- Good keyboard  \n\\- Good connectivity with 2 USB-C (USB-4), 2 USB-A and a SD card reader  \n\\- 85Wh battery  \n\\- **Quiet**\n\nCons:  \n\\- Very limited customizations  \n  ThrottleStop doesn't support 8845HS, you can't do much in the BIOS, you can't adjust fan curve  \n\\- OLED burn in  \n\\- 240Hz PWM\n\n**Lenovo Yoga Pro 7 14IMH9**  \nI was hesitant to choose Intel because I believe AMD is better, but it has a nice IPS display and it fit my requirements perfectly.  \nI don't know if it's because of the Intel processor, but it's **loud.** Every time it get's above 60C, the fans just start spinning for some time. The CPU reaches 38C in the mean time. WHY?. And it happens even while browsing. The fans are also very high-pitched and annoying. The fan curve from Lenovo is terrible and I couldn't change it. It behaves like that in all power modes. Lenovo restricts any customization for some reason. It's very annoying and that's basically the only reason why I am looking for some other options.\n\nPros:  \n\\- IPS with 100% sRGB  \n\\- Very good specs  \n\\- Full metal case  \n\\- Good keyboard  \n\\- Thunderbolt 4  \n\\- 14.5\" display with minimal overall size change  \n\\- Good light use efficiency thanks to E-cores\n\nCons:  \n\\- Terrible fan curve (loud)  \n\\- Power button located on the side means accidental shut downs  \n\\- Only one USB-A  \n\\- Very limited customizations  \n  ThrottleStop doesn't support 8845HS, you can't do much in the BIOS, you can't adjust fan curve\n\n  \n**IdeaPad Pro 5 14AHP9 vs Lenovo Yoga Pro 7 14IMH9**  \nBoth look very much the same and I really like the design. Yoga is a bit larger thanks to the 14.5\" display which is better for productivity and you can't really tell when carrying it.  \nThe build quality is better on the Yoga. It has a more premium feeling, but it's really not noticeable. The only noticeable things are the bezel around the screen is glass vs plastic on the IdeaPad. Another thing is keyboard, which is meant to feel more premium on the Yoga. It has a great travel but it's harder to press than on IdeaPad that's why I prefer the IdeaPad keyboard.\n\n**Ryzen 9 8845HS vs Intel 155H**  \nAMD is definitely more power efficient during moderate tasks. I think it's also part of the reason why IdeaPad is more quiet. \n\n**HP OmniBook Ultra 14 (AI 365)**  \nThis is an option I am looking into and I want your opinion on it. It's about 150$ more expensive, but it has a newer ZEN 5.  \nI'll share my cons and pros about this laptop. What I would really appreciate is your experience with the noise. Also if you can do more customizations like a fan curve using FanControl.\n\nPros:  \n\\- ZEN 5 (quiet?)  \n\\- IPS with 100% sRGB  \n\\- More customizability?\n\nCons:  \n\\- Worse design  \n\\- Large bezel (the laptop is the size of Yoga which has 14.5\" vs 14\")  \n\\- USB-C in the corner  \n\\- More expensive  \n\nWhat I ultimately want to achieve (and what is achievable with the IdeaPad) is that I want my laptop dead silent during some light work.\n\nI hope somebody will be able to share their experience and help me decide. I also hope I could help somebody else decide!\n\nThanks!",
  "Did you end up picking up the omnibook ultra 14? I’m debating getting it but I’m hesitating because of the build quality and keyboard .. any feedback? :)",
  "First impressions of the 2023 Lenovo Slim (Yoga) Pro 9i I just bought on clearance I finally pulled the trigger on a new laptop. I was waiting for the new 16 inch Yoga Pro 9i to go on sale at Best Buy when I found last year's 16 inch Slim Pro 9i on clearance for $1,099 at a Costco about an hour from my house. Even though it lacks some of the refinements of the newer model, I couldn't pass up that price. It is the mini-LED touch screen version with intel i9 processor, GeForce RTX 4050 GPU, 32GB RAM, and 1TB SSD. I will mostly be using it for productivity, music production, some video editing, and watching stuff on YouTube.\n\nI set it up last night and did all the system updates. Here are my first impressions\n\n**Looks/build/feel/ports:**\n\n* Build quality feels insanely good to me - the Storm Gray aluminum body is super sleek. \n* The keyboard is incredible (one of the things I liked about the new model when I tried it at Best Buy) \n* The glass trackpad also feels amazing and has a fairly satisfying click (I prefer this to haptic personally).\n* A little heavy, but also seems slimmer and more compact than I was expecting.\n\n**Screen:**\n\nI wasn't sure how I'd feel about the screen, as I've never owned a glossy one before, but wow. It is spacious and bright and very impressive. Unfortunately, the HDR mode in Windows seems to do something wacky with the colors, but in SDR, it still seems to have plenty of contrast to me. I put it side by side with my partners MacBook Pro and it was definitely brighter, although the overall colors on the Mac are still better IMO. I haven't really noticed any of the blooming people complain about. Ghosting has also not been an issue.\n\n**Speakers:**\n\nAs good as everyone says. Comparable to Mac.\n\n**Performance:**\n\nThis computer is fast and fluid, even at 60hz refresh. It is very quiet and cool when not in performance mode. I haven't really put it to the test yet, but I'm thinking it should be able to handle whatever I throw at it.\n\n**Battery:**\n\nThis is the main thing reviewers complain about with this model (and to a lesser extent the newer model). I was expecting the worst, but so far I'm pretty impressed. I've been using it off and on today for the last 6 hours for some work and web browsing, and I'm now sitting at about 25%. This is with battery saver on, so I'd expect worse in intelligent cooling mode, and much worse in performance mode.\n\n**Conclusion:**\n\nSo far, I'm pretty much loving this thing. Most of the issues I've had have been related to OneDrive syncing things I didn't ask it to and other Windows-related complaints. The other issue is ports - it has a decent selection, but I'm hoping I can find a USBC charger that will work with it (this has been another complaint in previous reviews).\n\nOf course, the newer model just went on sale at Best Buy for $1,499. That has the \"Ultra\" i9 processor and a slightly bigger battery, as well as fixing some of the port issues. But at that price it comes with the IPS, albeit a very nice one, and it's still $400 more than what I paid.  They have the mini-LED variant with RTX 4060 on sale for $1649 as well.\n\nPart of my plan was that if I wanted, I could just return this one to Costco and go grab the newer model, but I really like getting a good bang for my buck and I think I've achieved that with the older model. However, I'd say if you are considering the new Yoga Pro 9i, both options are a great value at the current sale price.\n\nSidenote: the other great value option I was considering was the IdeaPad Pro 5i at Costco for $1,499 with similar specs, but with an OLED. However, I wasn't impressed with the low-resolution of the screen in person and the build just didn't seem as good to me. ",
  "Paid 1599 for it a year ago same specs mini led ",
  "If you haven't yet you need to download the hdr calibration tool from the windows store and manually calibrate the screen. I thought I was watching things in hdr but realized it wasn't calibrated at all and was basically the same as sdr. If you don't see any blooming, you're probably not really using the hdr capabilities. It's night and day once you do.",
  "I bought this laptop too around half a year ago, also mostly because of the pretty decent discount. I was deciding between it and a Legion Slim 7 for around $200 less although I regret picking it despite still liking it overall.\n\n**Pros**\n\n* keyboard feels great to type on and is a step above other Lenovo laptop keyboards\n* very bright 3200x2000 165Hz mini-LED screen\n* loud, booming speakers\n* relatively quiet fan noise in a variety of use cases\n* capable of light gaming in a pinch - mobile 4050 is roughly equivalent to a desktop RX6600/RTX3060\n* solid build quality outside the base cover\n* fairly thin at around 0.7\"\n* high quality webcam and microphone\n\n\n**Subjective Pros/Cons**\n\n* extremely large Macbook-sized touchpad\n* bland aesthetics fit for an office\n* lack of RGB keyboard backlighting\n* high resolution of 3200x2000 potentially wasted in a 16\" form factor and makes games more difficult to run\n* uses Torx screws to access the internals\n* beveled and rounded corners on the panel\n\n**Cons** \n\n* woeful battery life of around 2-3 hours with casual use\n* only one USB-C port\n* no Advanced Optimus\n* creaky base cover\n* mediocre SD read/write speeds\n* relatively heavy for a thin non-gaming laptop\n* noticeably higher black levels in SDR mode\n* soldered unupgradable RAM\n* no ethernet port\n* outdated HDMI 2.0 (some report 1.4, but I can output 4K60 on mine) standard\n* tiny up/down arrow keys\n* mini-LED local dimming only activates in HDR mode",
  "Do you still have it? How are you liking it?",
  "Yeah that sounds about right. The legion slim 7 is supposed to be a great machine.",
  "Is this list regarding the Lenovo Slim Pro 9 14IRP8?",
  "Yep I still have it. The screen is the best part every time I open it. The performance is still great and I have no issues. I hate to say but the battery life is terrible. Barely 3 hours with medium usage.",
  "I used it for a while and also really liked it. Longer battery life, more gaming-capable, lighter, more ports and better located, per-key RGB backlighting, etc. \n\nBut the screen (while still very good) didn't pop as much with the colors, the keyboard was mushier, the speakers/webcam/microphone weren't as high quality, and the build quality was a slight step down as I could feel some creaks holding it one-handed. With the Slim Pro 9 I really only feel the creaks if I apply pressure on the bottom cover. And I grew to really like the size of the Slim Pro 9's touchpad.",
  "No, it's for the 16\" variant.",
  "Sounds like I made the right call then (for me), assuming I can find a more portable charger. I'm really liking the feel of it so far.",
  "Man, I have seen such minimal coverage for the 14\" version!",
  "Oh yeah, the charger on the Legion was also noticeably larger, which makes sense as it was trying to drive a 4060 instead of a 4050.",
  "Have you found an additional charger yet? I'm struggling to figure out what wattage I need!.",
  "Yeah, I've actually heard good things about it, but I can't say how many of these pros/cons apply.",
  "I haven't bought one yet, but I'm still planning on getting the portable 100w ugreen charger before I do any traveling. Supposedly anything 65w or above will work.",
  "I have it myself and it basically fits all of your pros and lacks most of the cons. Maybe I'm missing something, but I'm surprised it isn't more popular. \n\nIt almost seems like a unicorn device that Lenovo's had to cover up to stop it from cannibalizing sales\n\nI'm trying to buy a backup charger and can't find any reference of what power specs it needs",
  "That's my goal too!\n\nI've tried other power sources (Samsung s24u 45W@9v) hoping for even the ability to trickle charge, but they were simply too weak to even be recognized by the computer.\n\nI'm curious if there is also an upper limit to the wattage. Or even what voltage it charges at. Or where to find such information!",
  "New HP OminBook Ultra Flip base model for $945. Worth it? I am thinking of buying a new laptop for my work and light gaming purpose.\n\nI have been searching for many laptops for the past weeks and I am leaning towards to laptop with the new Lunar Lake CPU.\n\nHP is having a good deal for the new OmniBook Ultra flip base model for $945 after promotions.\n\nDo you guys think this is solid choice or any other recommendation for better choice?\n\nI am looking for laptop between $1,000 - $1,300.\n\nMy other options are listed below.\n\nLenovo Yoga Slim 7i Aura Edition : $1,299.\n\nNew Asus Zenbook S14 : $1,145\n\nHP Omen 14 Transcend $1,099",
  "I was looking at this deal myself. Kind of a crazy price for something released so recently but I can't see a major downside to it (except maybe that you have to purchase the pen separately, if you want it for drawing/notes?)\n\nIt seems like a well built machine and even has oled. I would definitely consider getting it and it's a good price right now (it might be lower a year from now but this is probably a sweet spot with how recently it was released).",
  "The only reason im holding off on it is 2 things.\n\n1: possible hinge issues later down the road\n2: heating issues. I heard this model is power limited compared to the zenbook S14 and other similar lunar lake laptops",
  "Would you say the zen book is better? I’m in the same boat as you, if HP wasn’t known for their hinge problems I’d get the omnibook but I haven’t seen enough reviews yet.",
  "Go for the zenbook S14 16GB model if youre on a budget or go with the 32GB model if youre trying to future proof. \n\nI went ahead with a zenbook pro 16X since it was on sale. But otherwise i would have gone with the S14\n\nThis is my second zenbook and they’re pretty durable and quality",
  "16 GB is sufficient for me but I am on a budget of 1k or less, with zen books I hear about malfunctioning issues too usually outside of warranty and the screen is prone to fingerprints + display isn’t too good did you have any issues at all? How long has it been?",
  "Almost 2 years for my first one which was a zenbook 14X. No issues at all. The screen only gets fingerprints if you touch it “duh” but they all have touch OLED screens with gorilla glass. Best screens you can get for a laptop. No burn in issues at all, mind you I use it for programming and writing documents.",
  "Just watched THAT one video about hinge issues thats been floating around here.  \nThe laptop with the broken hinge next to the HP one was a Zenbook.  \nNot the S14 but same chassis. Broken hinge.\n\n  \nThey are all the same.",
  "We can’t have anything.. I understand hinges can get loose after a while but for what we’re paying only to experience and incur possibly more issues down the road unexpectedly, I can’t say is worth it I don’t want to end up with a thinkpad but that seems to be the more reliable choice here",
  "Working with text on OLED screen Hello. \nI'm choosing a laptop. Mainly for working with text: ide, Ms office, browser. There are several models that fit my budget (Up to $1500). But they all have OLED screen.\n\nThis:\n-Asus vivobook s16 M5606WA (Ryzen HX370)\n-Asus vivobook pro 15 N6506MV (core ultra 7, 4060)\n-Lenovo yoga pro 7 14ASP9 (Ryzen 365)\n-Asus ZenBook S16 (HX370)\n\nAfter reading reviews of these laptops, I found that they have low PWM frequency when brightness is reduced. (Less than 50%). For example Lenovo has a PWM frequency of 240Hz, with brightness below 56%. ZenBook has 480Hz with brightness below 30%.\n\nI often work on an old laptop (ips) with a desk lamp on. The light in the room is off. The main question for me: if I continue to work in such lighting on a new laptop with OLED and reduced brightness. Will my eyes get tired?\n\nIt's just that in the country where I live, there are no laptops with IPS display and new Ryzen. There is only the possibility to order Lenovo Thinkbook 14+ 2025 (it has IPS and Ryzen 365) from AliExpress. But with the duty it comes out more expensive than buying in local stores.",
  "If PWM is <90%, it is completely fine to work with it. Just turn on a blue light filter, and your eyes will thank you.",
  "Which laptop did you go for? Is it an issue?",
  "Looking for durable, long lasting, quiet, bright laptop. Doesn't have to be really performant. Good day!\n\n**===== Mandatory requirements =====**\n\n**\\* A good battery life**. So CPU+GPU isn't needed, APU should be enough. For communication, light programming, light 3D design, light music production in Ableton with not many VSTs, and similar tasks. Kind of \"a machine for a student\", I guess?\n\n**\\* A good build quality**. Probably full metal then, right? I don't want to deal with broken hinges and similar problems. I'd like to be able to throw it into my backpack and don't worry too much about breaking it (to an adequate limit, of course).\n\n**\\* A silent cooling solution**. I shouldn't hear fans at all in any tasks except heavy ones: VS+VSC in debug + browser with many tabs opened + etc.; Ableton in high quality with many VSTs. If APU is relatively weak, so it's not able to deliver high performance, but it never makes the laptop noisy too -- alright, that's fine too. It doesn't have to be the latest tech.\n\n**\\* A bright, colorful screen**. I have a bad experience with other laptops (some were older models, some were newer) loosing maximum brightness relatively rapidly. So, as for a typical no-brain consumer, my first though is to battle this with the higher maximum brightness, say 500+ nits. What, in most, but not all, cases, automatically means an OLED screen. What lies along the \"colorful\" requirement. I don't have a huge fear of burn-in, I'm using a Steam Deck OLED since launch and an OLED smartphone for a few years; but feel free to warn me if you see a need, you're welcome. IPS is fine too, but OLED is preferable. But overall, if you think that the idea of battling the problem of \"loosing maximum brightness\" with higher maximum brightness is dumb -- I'm all ears.\n\n**===== Optional requirements =====**\n\n\\* Small pleasant touches that everyone wouldn't be against having in their own laptops. Like a **comfortable keyboard** (I type a lot, like really a lot, well, you see yourself), **precise touchpad** (this would be great, to be able to finally efficiently use laptop without mouse), **nice sounding speakers**, **many ports** (especially USB-C), **fingerprint reader**, **low weight**, **fast and stable Wi-Fi/Bluetooth**, etc. Would be nice to be able to charge it with USB-C port, not DC, but probably that's already included in modern laptops, and I'm just not aware. Okayish webcam (if it doesn't have a shutter -- no problem, I'll glue it with a tape myself 😄).\n\n\\* **I have nothing against ARM** APUs (M1, M1 Pro or Snapdragon; I don't see a need in M2 and newer, but we'll see), but I don't want to be a beta-tester and especially pay for it with my own money. I don't want to have VS/NPM/VST/.NET (not .NET Core) and other more common-usage (old software) compatibility problems. May this even cost me a small(!) downgrade in price, performance, or battery life -- reliability is more valuable to me. So **x64 is preferable**. But if you have pleasant personal experience with ARM -- I'll gladly listen to your arguments, why not.\n\n\\* If the laptop doesn't suck air from the bottom (or does, but not only from there), so I **can calmly throw it on any surface including a sofa or a pillow** \\-- that'd be nice.\n\n\\* **A touchscreen, or even a transformer**. Just a nice feature in some apps, say in Internet browsing, but I can live without it. By the way, I just caught myself thinking that, on practice, transformers may actually be even more durable because of those 360-degree-rotating hinges. I wonder if that's true 🤔\n\n\\* Size? Hm... 14\" is probably alright, but I lean more towards **15\", and even 16\"**. Less portable, sure, but it's worth it. I have a moderately performant device with a small screen already -- my smartphone.\n\n\\* I think **16 GB of RAM** should be enough for a device of such performance. As for the **SSD capacity -- the more -- the better**, depending on the price. To the point of also having a quiet but big (few TBs) HDD inside as well (but that may be too old-fashined and so rarely present nowadays, I assume 😄). **I have no problem with opening a laptop** and replacing the SSD, if I feel satisfied, and I'm going to keep it. Same about adding more RAM in the future (if it's not soldered, of course).\n\n\\* **Antiglare screen coating**. Not a matte, but a slightly matte -- antiglare. After using a Steam Deck OLED 1 TB with such a screen coating I've started loving it and would like to have it here too. If can be purchased separately -- no big deal, I can purchase and apply it myself. But, probably, then better the screen be glossy, right? To not end up being too matte, after applying the external antiglare coating.\n\n\\* **If x64 then AMD APU**. I have trust issues towards Intel. But if you see them pointless -- alrighty, I can try Intel too.\n\n\\* **60+ Hz screen, preferably 120 Hz**. Yes, even OS UI animations become more pleasant to look at.\n\n**===== What about examples I've found already in this subreddit and not only =====**\n\n\\* **Macbook Pro 16\" M1 Pro 16/512 or 16/1024**. Yes, ARM, compatibility problems (potential and confirmed). But if x64 alternatives are much worse and/or much pricier -- seems like I'll have to deal with those problems then, spend personal time on relearning a lot of things (never used Mac before).\n\n\\* **Macbook Air 15\" M2 16/512 or 16/1024**. Older 13\" is way too small. And this is at the same price as a Mac Pro higher, so I don't see a point in this one.\n\n\\* **Asus Zenbook 14 OLED UM3402YA**. A lot of complaints on the noise, but an interesting variant.\n\n\\* **Lenovo Yoga 6/7, Yoga Slim 6, Yoga Pro 7, Yoga Slim 7 Pro**. Brightness looks very low (300-400 nits), but except that -- this is the closest I've found. There are complaints about noise too, but, in comparison, there seem to be not as many of them (of complaints).\n\nThank you in advance and take care of yourself 👋 Ready to answer more aiming questions if needed. Will look for it in Europe. Budget: \\~€1000 for something interesting just not performant, \\~€2000 for something both interesting and performant (Mac Pro).\n\n**===== Updates =====**\n\n1. [Asus Zenbook 14 UM3402Y](https://www.notebookcheck.net/Asus-Zenbook-14-UM3402Y-laptop-review-New-Ryzen-7-7730U-name-old-Zen-3-performance.724864.0.html)\n\n*\"Asus advertises a peak brightness of 550 nits which we can confirm only when displaying HDR content. When running* [*this HDR test*](https://www.youtube.com/watch?v=NlAsAuBtmps)*, for example, we're able to record a maximum brightness of 542 nits on our test unit. Otherwise, maximum brightness is limited to just \\~340 nits when displaying SDR content which is still in line with most IPS-based subnotebooks.\"*\n\nWTF Asus? I've been relying on this characteristic so much. Welp, at least taking this into account will now add quite a bunch of other models into the pool of \"interesting\" ones. A lot of IPS screens, for sure.\n\n2. Apple MacBook Pro 16\"\n\nThe same, 1000+ brightness is awailable only in HDR, in SDR its \\~500. WTH?",
  "laptop for grad school (i’m stressing) (i can’t make decisions) Hello guys! \n\n(TLDR at the bottom)\n\nI need help on deciding which laptop I should buy. I have had an HP Spectre x360 14 since the beginning of 2020, and it has finally given up on me… well I’ve given up on it. I have had so many issues with this laptop since I first received it, but I was loyal to it since it was a gift. But recently, the battery has completely given out and I don’t want to send it in for repair when I think it is just time for me to buy a new one. \n\nAnyways, I have been researching laptops to buy before the next semester begins as I really need a laptop for grad school. However, I am stressing! Every time I think I have found a laptop that would work, reviews are extremely mixed or just outright bad (was 2024 a bad year for laptops??). My criteria for a laptop isn’t extremely demanding, I don’t think. But here are my criteria: \n\n1. Applications - I need to run applications and GIS software that are pretty powerful. \n\n2. Battery life - um… I just don’t want it to die within 4 to 5 hours of standard use. \n\n3. Life Span - I need a laptop that will last me for another 4 to 5 years, one that could take me to the end of my doctorate degree. \n\n4. Price - No real budget. As long as the price is well justified. If I could get a cheaper laptop that does the exact same thing and has the exact same specs as a more expensive one, I’ll go with the cheaper one (duh). \n\n5. Gaming - I like to game. And by gaming, I mean Minecraft and Sims. As long as I can run these two games (not simultaneously obviously) without my laptop crashing and over heating, I am happy.\n\n6. Fan Noise - I just don’t want to hear an entire fucking airplane taking off every time I have more than 5 tabs open on Chrome. (it’s embarrassing and annoying as shit)\n\n7. Not an HP. \n\n8. All the other good stuff - Good RAM, storage, screen resolution. I spend A LOT of time on my laptop. I want to enjoy it. \n\nOkay maybe, it is a little demanding. But please help. I need it. \n\nTLDR: I need a new laptop. I spend a lot of time on my laptop. I need it to last for at least 4 years. No real budget. It should be able to run heavy GIS software and some programming apps. I need it to have a good battery life, low fan noise, light gaming capabilities, and for the love of God, not an HP. \n\nMy choices so far have been between (but not limited to) the Lenovo Yoga 7i Aura, MacBook Pro 14, and Asus Zephyrus G14. ",
  "I have written a guide to help dispel any confusion with numbers and specs and stuff. It's a 10-20 minute read.\n\nhttps://www.reddit.com/r/TOOsTechTactics/s/N8BaHjuZKy\n\nGL m8.",
  "HP and Lenovo are King of the budget, if you paid over $900 for their flagship you are 100% at fault. I have faith in my $600 HP Spectre x360 14 this year.\n\nNow\n\n1. Budget not an issue, you had enough crap\n2. MacOS can run your software\n\nMacBookPro. End of discussion.",
  "thank you!!",
  "saying that it \\*can\\* run your software is not right. You do not know what software he uses",
  "ThinkBook as a Home/Family Laptop I recently came across Tech Beau's excellent and glowing review of Thinkbook 14+ with new Core Ultra Processors. And since I am in the market for a new home system which everyone in the family can use(read abuse), I wanted your opinion on how good it would serve the family. \n\n  \nInitially I was thinking of getting the Yoga, if possible please draw comparisons between the product and which one would suit my usecase.\n\n  \n",
  "Help me choose a laptop for university please (Ideapad Slim 5 vs Yoga Slim 7 vs Zenbook 14 OLED Meteor Lake) Hello everyone! I'd like some advice on which laptop to choose between the following (prices are converted from vietnamese dong because I live in Vietnam):\n\n* Lenovo Ideapad Slim 5 14AHP9\n   * R7 8845HS/AI/16GB/512GB/14\" WUXGA/AMD Radeon 780M/Win 11\n   * **873.89 USD**\n* Lenovo Yoga Slim 7 14IMH9\n   * Ultra 7 155H/AI/32GB/512GB/14\" WUXGA/Win11\n   * **1208.30 USD**\n* Asus Zenbook 14 OLED (UX3405MA)\n   * Ultra 5 125H/AI/16GB/512GB/14' 2.8K/Intel Arc/Win11\n   * **1047.14 USD**\n\n(edit1)\n\n* Thinkbook 14 G6+ (2024):\n   * Ryzen 7-8845H/Ram 32GB/SSD 1TB/AMD Radeon graphics/14.5inch/2K+/120Hz\n   * **966.65 USD**\n\nI'm buying a new laptop because at the moment I am bringing my laptop to school (Dell G3 3500) and it doesn't even last 2 hours, so I'm looking for a laptop that will last at the very least 6 hours without having to charge in between, but I'm having a really hard time choosing in between the three, slightly leaning towards the zenbook because of the price and display), I have about two months to decide (waiting on black friday deals unless if one of you think that they won't bring anything good). I am not looking at the newly released laptops because the new zenbook is overpriced here (Vietnam) at the moment (about 1850USD) and the Lenovo Yoga Slim 7i Aura Edition is not even available here.  Priorities are simply a good display with decent-good battery life.\n\nWould greatly appreciate anyone giving advice on which one to buy from the three listed above!",
  "asus zenbook 14 oled is good but i think you can find R7 8845HS at a similiar price. just try to check",
  "Thanks for the reply! I've actually found a very well specced Thinkbook from lenovo just now and wanted to know your thoughts on it? Seems fairly priced as well.",
  "yeah quite good. see this review [Lenovo Thinkbook 14+](https://www.youtube.com/watch?v=BhKRNkt63RY). he refers it to be best at the price",
  "Alright, thanks a lot! I think I will be buying that one then.",
  "Thinkbook Gen 7 - Worth buying or should I hold off \\[India\\] I am in the market for a laptop for personal use, and some data transfer and video editing from my action cam.\n\nI have configured the laptop as such. \n\nhttps://preview.redd.it/092c9k947d5e1.png?width=2466&format=png&auto=webp&s=1e24f7c06b3372017baf31534f45d9c29758aafb\n\nhttps://preview.redd.it/wh35oxa97d5e1.png?width=2478&format=png&auto=webp&s=37eac453e496d52c7efff54e660cd7958ffded02\n\nhttps://preview.redd.it/t8j5f4zb7d5e1.png?width=2304&format=png&auto=webp&s=53b846ef511fa703b73c82adc8836dddd24436bd\n\nhttps://preview.redd.it/6kukn4qf7d5e1.png?width=2566&format=png&auto=webp&s=b6a1d8c1205dcff7ec2e2b0ad187689a5dbdf6d4\n\nhttps://preview.redd.it/t1rs0l8i7d5e1.png?width=2522&format=png&auto=webp&s=2b1c076e106754151f5451a15c71c270d6a81ede\n\nWhat I liked about this \n\n*  Great upgradeability options\n* Good screen options \n* Decently big battery, atleast a day's worth of use. \n\n  \nIs it worth it for the price I am paying ? Also I have seen reviewers rave about the Core Ultra 2s performance and battery efficiency. I can wait if need be, should I wait for the 2nd gen of core ultra for the gains the 125H is almost as good.   \n\n\nAlso how's the build quality compared to say a Thinkpad or Ideapad or Yoga ?I wanted to try out in a store near me but no one seems to carry it.   \n",
  "Yoga 9i 2-in-1 gen 9 (2024) vs. HP Spectre 14 (2024) - Quick Comparison / Personal Impressions Hi all,\n\ndecided to post a quick review / comparison because I see a lot of people are facing similar buying decision.\n\nI own an Intel 11th generation Yoga 7 Slim 14 inch laptop and am looking for something new. The Yoga 7 is really creaky, has really bad speakers and - main reason I want to switch - only has 60hz. My main monitor and smartphone have 120hz and for me its the biggest innovation in years. I only have a laptop paired with an eGPU (RTX 3060) for desk setup, which works pretty well. I also thought it would be nice to have a 2-in-1 laptop for travelling, long haul flights etc.\n\nTo cut a long story short, after some research I decided on the HP Spectre 14 and the Yoga 9i 2-in-1, both with the latest Intel CPU. I pre-ordered both, so I received each of them with almost no reviews (and therefore no BIAS) out there.\n\nBoth versions had new Intel CPU 155H, 120hz (glossy) OLED screen. The Spectre came with 32GB, the Yoga 2-in-1 with 16GB. I wont talk much about performance because it doesnt really matter for me. There are now benchmarks out to compare.\n\nthe sad news first: I returned both laptop\n\n||HP Spectre 14|Yoga 9i 2-in-1 gen 9|\n|:-|:-|:-|\n|Design|+/- Personally, I didnt really like the design. Its way better / professional predecessor, but I still dont like the bulkiness and the cut corners of the spectre. Looks somehow awkward for me.|No great design as well. Its somehow looks like an unproportional burger. The top of the laptop is smaller then the bottom, in combination with its rounded and glossy edges it looks very akward. I chose colour \"cosmic blue\" which is okay, but a fingerprint magnet|\n|Build Quality|+ Very nice build quality, solid materials - not creaky at all. Very good hinge.|+ Very good, cant complain. Not creaky at all.|\n|Speakers|+ Very good speakers. Quality reduces drastically if you use in tablet mode, since the speakers actually play in the opposite direction|+ I think the best speakers I ever heard on a laptop, since its basically a huge rotating soundbar. This is great in tablet and tent mode as well, because the sound is still going in your direction|\n|Trackpad|+ Very nice haptic trackpad, definitely the best trackpad I ever used (on track with Macbook Pro)|-/+ Trackpad is only ok. Its not haptic, which is a dissapointment in their flagship|\n|Keyboard|+/- Keyboard was ok, but I don't understand the hype about it. I might be biased because I use Lenovo notebooks at work and home for years.|+ Keyboard is nice. But as said, Im biased / used to use Lenovo keyboards. I didnt like the additional row right to the \"return\" button|\n|Display|- Overall, a very nice OLED screen. But no matter.  The screen was absolutely terrible in terms of the 'screen door effect', I couldnt stand the graininess. I had read before that this could be a problem, but I was sure I could get used to it, but in reality it was an absolute nightmare.                   - Another annoying issue with the screen is that it is barely dimmable. I often use the laptop in bed/dark surroundings to stream something before going to sleep. The lowest dim level is still super bright. You have to use extra software to dim it.|- Nice OLED as well. Drastically less Screen door effect to a level I could live with. Also, its dimmable to very low brightnesss out of the box. Unfortunately the screen is super glossy. I mean, so glossy that in dark enviroment even the backlight of the keyboard is reflected.|\n|Other|- The \"Power On\" button is illuminated constantly, which is very annoying|-|\n\nAs I said, I have returned both laptops. I paid around €1700 for each and each had major faults that did not justify the price for me. The main reasons were the displays, I think glossy is just not for me. While I could live with the Yoga's display, I really missed the haptic touchpad and hated that it only came with 16GB.\n\nThe search continues. I think im done with looking for 2-in-1 and will get a tablet instead. Basically all I need is \"good/very good speakers, haptic t rackpad, non glossy and minimum 90hz screen\".  I have now pre-ordered the Thinkbook 13x Gen 4, which has a matte display and a haptic touchpad, unfortunately it is only 13.5\".  I also assume that the speakers will be bad. Will keep you posted :)\n\nHope it helped!",
  "I'm deciding between these 2. The 2-1 format would be useful for document reading etc, but the glossy screen issue is a deal breaker.   \n  \nCan anyone attest to the effectiveness of a matt screen protector to counter act the reflection?",
  "THANK YOU. Finally, someone who actually addresses the screen door effect in both flagship models. I work in the professional visual industry and need crystal clear displays, or at least with less graininess like e.g. Surfaces. I got both the Yoga 7i and Spectre for comparison and it drove me insane. I'm returning both and ordered the 9i now after reading your review - I found a model with 32GB RAM.\n\nOut of curiosity (and to better justify my money spent...) - Would you surmise you would've kept the Yoga 9i if only it had 32 Gigs of RAM?",
  "Do you know if either laptop supports legacy S3 sleep?",
  "lmfaooo please give an update fast. I was looking to buy either of these and now I don't want to.",
  "I am looking for a similar laptop. Thinkbook 13x is really tempting but 14“ would be even better. A bit outside of the box but the new DELL precision 5490 is on the game for me. 14“ Matte bright IPS touchscreen, nice CPUs, etc. You can choose it without dGPU.\nOr maybe upcoming new HP elitebook x360 if it comes with a H CPU.\nMaybe Huawei Matebook X 2024 is an option, no release date on Europe yet.",
  "u/peyta30 FYI, the 2-in-1 Gen 9 is now available with a Sensel haptic touchpad upgrade in the \"Build Your PC\" tool. Right now it's showing as a $60 upgrade, but once the 2-in-1 goes on sale, that discount will also apply to the haptic touchpad.\n\nFYI, the haptic touchpad in the Thinkbook 13x Gen 4 is not from Sensel.",
  "Hey so I've also been tied between the Lenova Yoga 9i pro and HP Spectre 360 16 inch. Both in 32 GB. The main difference is HP uses a OLED screen but 2800X1800 Res while Lenova Uses LED 3200X2000 Res. The lenovoa looked brighter. The other difference is the HP is 2 in 1 where as the Lenova has the Ultra 9 core processor and HP has the Ultra 7 core processor. So one is newer processor and higher resolution. The other is 2 in 1 and OLED screen oh and the HP has much better speakers. My issue now is that there is another Lenova yoga 9i option which is only $200 more which comes with a Mini LED screen, a higher graphics card 4060X, and 1200 Nit brightNess which is exponentially higher then HP and most other Laptops. The ONLY problem I've seen with that higher Lenova 9i option is that the battery is listed at 5 hours but people have claimed it barely lasts 3 hours. Sigh* If it didn't have the battery issue, I'd get the fully loaded yoga 9i in a heart beat so now I'm still tied between the original 9i or HP Spectre both in 16 inch 32 GB with same graphic card.",
  "Sorry I don't know that!",
  "I'm trying out new Asus g14 and skipping touch screen for now.",
  "Hi! That sounds interesting. On which configurator are you referring? I can't find the option on German or US configurator. Anyways, does that mean that you now provide a 80x135 haptic trackpad? \n\nThanks",
  "fsfs lmk. Touchscreen isnt a dealbreaker for me. Just on the fence rn bec he sale for the Hp spectre ends tmr.",
  "Oops! My mistake. Sorry about that u/peyta30, I read \"2-in-1 Gen 9\" and my brain automatically went to the [ThinkPad X1 2-in-1 Gen 9](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/lenovo-thinkpad-x1-2-in-1-gen-9-(14-inch-intel)/len101t0085). We're not in the Yoga9i.\n\nRegarding your second question, our largest haptic trackpad is going to be in the ThinkPad P1 Gen 7, which will be 135x85. [Here's Lenovo's Global ThinkPad Segment Lead, Rijul Razdan, talking about it](https://www.linkedin.com/posts/rijul-razdan_thinkpad-p1-gen-7-lenovos-first-ai-ready-activity-7188645140880650240-AwGh/).",
  "Which Snapdragon X Elite laptop? I am very interested in the new Snapdragon X Elite laptops, I know they have their issues but for my basic use case of mostly media consumption and light gaming, I think they strike a perfect balance of performance/battery. I would like a laptop bigger than 14\" but I'm torn between which of these is the best?\n\n* Galaxy Book 4 Edge 16\", 16GB RAM, 1TB - £1400\n* ASUS Vivobook S15 15\", 16GB RAM, 1TB - £1170\n* Microsoft Surface Laptop 15\" 16GB RAM, 1TB - £1575\n\nThe Galaxy book is appealing because it has the most powerful Snapdragon variant, the Surface laptop seems to have the best build and thermals from the reviews I have seen, while the Vivobook is just cheaper but still seems to have decent specs. \n\nI was also considering just getting the Surface laptop with a 256gb SSD for £1250 and then swapping out the SSD as that would end up cheaper.",
  "[removed]",
  "Did u consider checking Lenovo Yoga laptop ?",
  "I wouldn't buy an ARM laptop for gaming. And you won't have that super-long battery life when emulating x86 apps either. I would just stay with x86 for now, especially when gaming is a factor.",
  "Thanks for the advice. I didn't realise you couldn't download the ARM Windows image yet! Guess in leaning towards the Galaxy then.",
  "I did, but I want a laptop bigger than 14\" and all of Lenovos lineup seems to be 14\" sizes.",
  "Hi, you can, just wanted to let you know.",
  "Looking for middle-class convertible notebook Hi,\n\nI'm currently looking for a new laptop and I'd like to hear some opinions on my thoughts before I actually buy a new one. As a little disclaimer - I have some but definitely limited knowledge about computer hardware, in particular, once it comes to graphics cards.\n\nMy main use-case is school and research-related work, i.e., doing calculations, taking notes, coding and mathematical calculations (C++, Python, Matlab, Mathematica), having zoom calls, doing stuff with word and power point. Occasionally, I play computer games (mainly city-building, build&conquer type games). I'm not a graphics fetishist, so I'm fine with running the game on mid to low quality if necessary, as long as the game still runs fluently without delays.Besides that, I already have a USB-C docking station from Dell in my office that I'd like to proceed using (as far as I know it's not proprietary, so it should work with most laptops smoothly).\n\nThus, I'm looking for a convertible notebook that allows me to turn the screen for writing on it with a stylus. I'm not a Mac-guy, so I'd like to go with Windows.\n\nI think for my research-related work, 16GB of RAM and  512GB - 1TB of SSD should be enough. I'm aiming for a screen-size of 14'' to 16'', regarding weight, I'd hope for 1.5-2kg but if it's a little more I'd be willing to compromise. Having a decent battery would be nice and since I'm typing a lot I'd appreciate a good keyboard. Also, it would be a nice add-on if the stylus is already included (but again, here I'm willing to compromise, if necessary).\n\nCurrently, for the little gaming I do, I'm using my 7 year old laptop (Asus UX3410U). I started realizing that it really reached it's limits, so I'd say the power of the graphics card built in there is definitely a lower limit to what the graphics card of my new laptop should be capable of.\n\nI know some would say \"buy a separate gaming computer\" but this is currently out of my budget and I think also not necessary for an occasional just-for-fun gamer like I am. Additionally, I am regularly commuting between two places and do not want to carry around two computers.\n\nMy budgetary limit is roughly 1500€ (so \\~1600-1650$).\n\n&#x200B;\n\nDo you have any suggestions for notebooks that meet my needs?\n\n&#x200B;\n\nOf course, I have already done some research on my own. Seems like that my primary choice the Microsoft Surface Laptop Studio 2 (cheapest configuration) is still quite far out of my budget and also a couple of HP (Elite, Spectre) are still a bit above my upper limit, so probably\n\n* Lenovo Yoga 7 14IAL or  Lenovo Yoga 7 16IAP\n* LG Gram 16\n* ASUS Zenbook 14 Flip OLED\n* Samsung Galaxy Book 3 Pro 360\n\nare more realistic alternatives. What are your opinions on those? From what I get from reviews, all three of them easily meet my \"office\" requirements (writing on screen, running code,...). However, for all of them the reviews say they are not really suitable for gaming. Do you think that's only a relevant verdict for \"real\" gamers and, given that up to now I was totally happy with my middle-class 2017 notebook, for what I play they will be easily sufficient for a couple of years again, or do you think they might do equall to or even worse to my current computer?\n\n&#x200B;\n\nThanks in advance for your help!",
  "X13 Flow. or X16 Flow.",
  "exact same situation as you :( the craziest game I'll probably play is genshin lol but I need my laptop to handle at least that - plus I'm not sure how overall performance/hardware would be affected in a convertible",
  "Thanks for your reply!  \nAs far as I can see both are quite a bit out of my budget, unfortunately :(",
  "Please help me decide between two laptops Hello guys,\n\nI have options to buy Dell Latitude 7420 L7420-8051, and Lenovo Thinkbook 14s yoga itl - type 20we.\n\nFrom what I’ve seen so far, they’re quite similar in their specs: both 16 GB RAM, core i7, SSD 512 GB, Graphics Card Intel Iris Xe. They’re both also 14’’.\n\nA difference I’ve noticed is the Thinkbook can turn into a tablet with a pen. But that is not so critical to me.\n\nI’d like your opinion please, what is the better option between the two. I will use it mainly for office work, programming, maybe VMs etc., maybe some light gaming.\n\nThanks in advance.",
  "I have a lenovo yoga and it is pretty nice. I really like the tablet functionality with the integrated pen, great for notes.\n\nCan't say much about dell.\n\nSpecs wise, check the generation the intel cpu's are as newer gen tend to run faster. Also make sure the material of the case is metal, I've had laptops in the past use silicon mix and crack easily.",
  "^^ Gaming wise though, anything 3d is likely going to struggle as that iris xe graphics card is very weak. 2d games like stardew valley, terraria, etc should be fine though.",
  "Thanks for the answer.\n\nAbout the gen of the Intel CPUs, isn’t it supposed to be a standard on this model, like all models will have the same CPU and thus also gen?\n\nAnd maybe it goes for the metal/silicon as well?\n\nEdit: just saw the CPU can be “up to gen 11”, so probably you can have different variations of i7",
  "Looking for a new laptop Hello all epic gamerz and non epic gamerz,\n\nI am needing a new laptop for study and work and am looking for some recomendations.\n\nI have looked at the Thinkbook 14s yoga gen 2's and they look like a goood option but im sure there is more options out there.\n\nWhat im looking for is,\n\n* max 2.5k AUD (1.6k USD, cheaper is always better) \n* 14-14.9'\n* good feeling backlit keyboard\n* touch screen\n* min 16gb of memory\n* min 500gb of storage (SSD but everything comes with SSD's now)\n* i5-i7 intel CPU (I can't do AMD due to compatability with software)\n* Good battery life (On power saver mode is fine as i need the life for classes e.g 8+ hours. but more is better!)\n* 2 in one is a bonus\n\nThank you for your advice in advanced!",
  "Huh rlly AMD won't work? That's honestly kinda strange, but k\n\nIdk how inflated Australian prices are, but smething in the 1-1.2k USD range could more than suffice your needs it seems like. Just go for smthing with an Intel 12th gen or better processor and you'll be happy (Thinkbook 14s yoga gen 2 looks like a great choice) edit: Asus Zenbook Flip or HP Envy x360 also seems like cool options tho",
  "I work on cars and as my hobbie and i have been told some software can be a bit picky. so intel to play it safe",
  "Laptop with pen comparison and buying advice Hey,\n\nI currently have a Sony Vaio Laptop (i7- 3632QM, AMD Radeon HD 7500M/7600M, 8 GB RAM, 230GB SSD(upgraded from 750 GB HDD) 15\" 1366x768 Display, estimated 30 minutes of batterylife) which is currently slowly dying (after 7 years I guess thats to be expected).\n\nI want to buy a 2in1 device with an integrated pen to take notes for university and to do some CAD and Matlab work plus office stuff (engineering student). Occasionally I play some games like Counterstrike, Lol and CIV 6. Since CIV and LoL are running smootly on my old Laptop I dont think this will be an issue. I think 16 GB RAM and >=500 GB SSD are minimum requirements additionally to the fact thats is possible to store/charge the pen directly in the laptop. When I am at home, I usually use a secondary display while working.\n\nI already looked up some laptops, but since I dont really know much about Laptops/PCs I wanted to ask for advice. Can you tell me, which one would be the best? Or something I dont have on my list?\n\n&#x200B;\n\n1. [Lenovo Thinkbook 14s](https://www.lenovo.com/de/de/laptops/thinkbook/thinkbook-series/ThinkBook-14s-Yoga/p/XXTBXYGI400)\n2. [Dell Inspirion 13](https://www.dell.com/de-de/shop/2-in-1-laptops/inspiron-13-2-in-1-black-edition/spd/inspiron-13-7306-2-in-1-laptop/cn70608sc)\n3. [Acer Spin Pro SP513-55N](https://www.acer.com/ac/de/DE/content/model/NX.A5PEG.007)\n\n&#x200B;\n\nDoes anyone have experience with these models or the manufaturers? Are they equally good for using a pen and in other aspects?\n\nThanks in advance :)",
  "Hey so I also have a laptop (The Lenovo Ideapad Flex 5) it doesn’t come with a pen but it has good features and it’s a 2-in-1 and has stuff like a fingerprint sensor and many more, there are many models but I got the Ryzen 7 4000 Series One… Here’s A Link BTW https://www.costco.ca/lenovo-ideapad-flex-5-81x20067cf-2-in-1-laptop%2C-amd-ryzen-7-4700u.product.100658044.html Hope this helps… So i hope you post about it if you get this laptop because I would love to see your review of the laptop and anyways, Good Luck!",
  "Lenovo has a reputation manufacturing two-in-ones with crappy hinges, so, just don't buy it.\n\nInspiron is overall pretty solid laptop, but I don't recommend getting an i7 version (same goes for Lenovo and Acer).\n\nI can't say anything about Acer, check some reviews, make a decision.\n\n*Inspiron 7306 2-in-1 owner.*",
  "That looks like a good laptop, but I want something that has a built in pen so I don’t have to take it with me separately and the probability of loosing it is smaller :P\nI will tell you what I ended up with, when I buy it :)",
  "I think I will go for the Inspiron 15 2in1 Black Edition (https://www.dell.com/de-de/shop/2-in-1-laptops/inspiron-15-2-in-1-black-edition/spd/inspiron-15-7506-2-in-1-laptop/cn75606sc)\n\nI think this is the same you have with 15“ instead of 13“.\n\nI really like the blue color of the Lenovo, but I think the Dell is the better choice all in all",
  "Sorry,but why not the i7? About to buy the 7306 hehe",
  "I haven’t seen a laptop with a pen TBH In a long time but yeah anyways good luck",
  "If its size suits you, go for it. Btw, Dell has hands down the best active pen among these.",
  "Because of temperatures.",
  "The 3 devices I have linked in my post are all with a pen, my problem is I don’t know which one ist the best or if there is an even better laptop with integrated pen that I didn’t find :)",
  "That’s great to hear, I just ordered the Dell laptop because I guessed from the pictures that the pen would be the best :)\n\nMy old laptop was 15“ as as well and I really like having the numpad so 15“ was the obvious choice to take it instead of the 13“",
  "Is it that bad? Do you have issues with it? Thinking about buying one tbh.",
  "After checking out your links all of them are pretty similar but The Dell Inspiron Has An i7 which is a pretty good CPU so maybe you should get that one",
  "I have an i5 version.",
  "Which laptop is better? Hi! I am looking into buying a new laptop, and I am not sure which one to get. I'd primarily use the laptop for work (Excel, etc. Nothing too computationally expensive) and leisure (movies, series). It would be great if the laptop could handle low-end games, but that is not a priority.   \n\n\nI'd like at least an i5 core and 16GB RAM, and I have been recommended to choose either Lenovo or Asus due to reliability, so these are the options I'm looking at: \n\n1. Asus X415 i7/16/1024 14\" laptop - €699 (on sale. Ord. price €1,299)\n2. Lenovo Yoga Slim 7 Pro i7-12/16/512 14\" laptop - €1,099 (on sale. Ord. price €1,299)\n3. Asus ZenBook 14X OLED UX5401 i7/16/512 14\" laptop - €1,399 (on sale. Ord. price €1,599)\n4. Lenovo Yoga Slim 7 Pro i5-12/16/512 14\" laptop - €999 (on sale. Ord. price €1,099)\n\nI was thinking option 1 due to the price and its specs based on my preferences, but I've read some bad reviews about. What do you think? TIA!",
  "The 2020 King of Portable 2 in 1s: LG Gram 2 in 1 14 inch **EDIT 4 5 MONTHS LATER:** [New Lenovo Carbon Yoga leaked on it's way, might be just enough to compete with the Spin 5](https://www.reddit.com/r/Lenovo/comments/hh0xzf/in_the_blink_of_an_eye_it_seems_the_almost/)\n\nEDIT 3: Found the mystery, it's the [Acer Spin 5 13.5](https://www.notebookcheck.net/Acer-Spin-3-and-Spin-5-are-now-slimmer-and-get-a-much-needed-upgrade-to-Intel-Ice-Lake.449311.0.html) inch which comes with 3:2 aspect ratio, not the LG Gram. It's not as a wide as the 14 Gram/c940, but it's about as equal in dimensions as the Surface Book 2 (taller than 16:9 14 inch laptops). For this reason + the almost exact same specs as the Gram, it would make it as a solid contender for the real king of 2020 2 in 1 portables.\n\nSmall note: Lenovo's c940 14 inch recieved a BIOS update which now gives about full 10 hour battery life(4K version, UHD probably gets a lot more), ALSO NOW coming close for that 2020 crown. At this point, it's all up to your tastes to which really deserves it.\n\nOriginal post:EDIT 2: So it seems that the aspect ratio of 3:2 in the Gram 2 in 1 was misinformation from a video, as it's apparently a 16:9 ratio instead. I'd still say this 2 in 1 is one of the best since it actually provides a bigger battery with a lot less weight than normal 14 inch models\n\nOriginal post:\n\nAfter a few companies have tried to make the perfect portable 2 in 1 convertible, LG actually went and finally pulled it off among it's competition with it's new Gram 2 in 1 14 inch announced at CES 2020.\n\nMain strong points:\n\nBigger and better battery life, which promises the highest battery life up to date for a 14 inch (not sure how much it was exactly, but I think it was about \\~70,000 mWh sized)\n\nOnly 2 in 1 to weight around 2.5 lb with that big of a battery and screen, making it's tablet mode really easy to use with maximum weight portability in mind\n\nGreat port selection up to HDMI and \\*Thunderbolt 3 (need confirmation there tho since previous Gram 2 in 1 did not have it, reviewer at CES said it might have it)\n\nAnd lastly, Intel's 10th gen chip with 11th gen Iris Plus Graphics for light gaming\n\nAs of now, only the Lenovo c940 could compete against this in the 14 inch category, but with relatively poor battery life and 0.5 pounds extra, the Gram seems to take the cake here. Honorable mentions I'd put the HP Spectre 13 inch late 2019 refresh (16:9 aspect ratio on a 13.3 inch screen tho, horrible design imo) and the new Samsung Galaxy Book Flex (which is like the XPS 13 2 in 1 but arguably better with some extra features with a 16:10 aspect ratio on 13.3 inch).\n\nMy only worries for the LG Gram 2 in 1 2020 so far: chassis hopefully is as sturdy as the c940 (or close to it since c940 has an excellent chassis durability), speaker system will probably not be as good obviously (c940 has Dolby Atmos 360 hinge, hopefully LG's sound will be not completely bad) and Thunderbolt 3's inclusion. Other than those worries, seems to be on it's way to being the 2020 king of portable 2 in 1's.\n\nNote: Did not consider any 2 in 1 15 inches and above since all have weights more than 4 lb and big form factor (while I would say the new HP Spectre x360 15 2020 is the best new coming relatively portable 15 inch 2 in 1, but weighing at 4 lb with a big chassis not many bags can fit, it would basically come at 2nd best portable 2 in 1 for 2020, in case you're looking in the 15 category. If gaming is your thing in the 2 in 1 category then this new HP will probably best fit your needs).\n\n&#x200B;\n\nEDIT: Small but important note: also worried the Gram might not have Windows Hello IR facial recognition, as that I believe is fundamental for any 2 in 1 to have while utilizing in tablet or tent mode. Hopefully it comes with IR additionally to it's finger print Windows Hello scanner to get the real title of (at least almost) perfect 2 in 1 ultraportable.",
  "I'm worried that the thermals will disappoint. The older LG grams were all a little too hot for comfort, an obvious compromise with the design.",
  "[deleted]",
  "2020 and you can't charge via USB-C. It's so usefull when you can charge laptop, for example in train via simple powerbank with PD.",
  "Valid point, but I'm lead to believe all 2 in 1's suffer from this. As an owner of a Lenovo Yoga c940 UHD 14' and past owner of a 2017 HP Spectre x360 13', can confirm both units had/have issues with thermals and sometimes fans spun up while even being at idle. Thankfully I discovered undervolting which quickly fixed that issue pretty fast, as fans (which were always an issue on c940's) barely turn on anymore with idle temps of 39-44 degrees. Before it would almost be at 54-60 on idle occasionally with Windows doing background processes, but undervolting did the trick just right.",
  "Oh well rip, I guess you're right. I saw a top CES laptops for 2020 video and it had mentioned a 3:2 for the 2 in 1. Can't find the original but now that I see your video up close yeah, that's definitely 16:9. I ain't mad tho since I decided to stick with my 14 inch c940 with 16:9 too so now I know I'm not missing much haha.\nThanks for clarifying!",
  "Late comment but, figured which was had the 3:2 aspect ratio: turns out it's the [Acer Spin 5 13.5 inch 2020](https://www.notebookcheck.net/Acer-Spin-3-and-Spin-5-are-now-slimmer-and-get-a-much-needed-upgrade-to-Intel-Ice-Lake.449311.0.html). If you're interested in buying a 2 in 1, that one is definitely now in the competition thanks to that ratio. Edited main post comment.",
  "I'm pretty sure that you can? Just cuz a laptop comes with a proprietary power brick doesn't mean you can't use USB-C to charge it. I've seen even 15 inch which has proprietary and can still charge with USB-C.",
  "Depends on the laptop OFC. Most 2 in 1s pack really small single fan dual heatpipe coolers which are totally inadequate for anything hotter than a dual core and low end GPU. I think a few 15 inch 2 in 1s with dual fan coolers can be relatively cool under loads, but yea, most do get too hot",
  "[deleted]",
  "I have the 2019 version and charge via USB-C all the time so I'm sure you can do it.",
  "For the case of 15 inch, most of them do provide at least minimum adecuate cooling since they use actual dedicated GPUs for gaming/graphic design. Only reason why I excluded them from my analysis is due to body weight (4lb is honestly a bit too much for a 2 in 1) and screen size makes chassis far too big to carry around conventionally in backpacks for most people.",
  "Haha wow. Any reason specifically you didn't like all the ones you returned? What feature do you find them missing so much to not upgrade your c920?",
  "Hi u/teamblades44, what kind of USB-C charger do you use for something with such a big battery (I mean, can any USB-C charger charge as fast as the proprietary power brick?)",
  "Why do you think 4 pounds is too much? My 14 inch laptop is 4 pounds and I wouldn't say it's heavy",
  "You can use any 65 or 90 W USB-c charger.  I think it charges a tiny bit slower but even when I'm using it it still is charging it rather than discharging.",
  "I classify 4 pounds to be a bit on the heavy side for 2 main reasons (one mostly personal other a bit more objective)\n\n1. I carry my laptop in an over the shoulder backpack with a bit of cables and charging equipment. I used to always carry with me a 1.3 pound battery in that bag alongside my old Surface Pro 5, which gave it a bit of weight to the bag but manageable. With the 3 pounds from my c940 and 1.3 from the battery, I do feel shoulder pain when getting home most of the time, so I opted for carrying it my main backpack separately.\n2. My c940 14 inch at 3 pounds is juuust the borderline of what I would consider ideal weight for a 2 in 1. Using it in tablet mode is roughly hard due to weight + sharp edges which stab a bit into the hands, tho I do find 3 pounds to be good enough that the laptop can be held with one hand a bit relatively easy. But at 4 pounds, I wouldn't see myself ever using it in tablet mode and one hand usage would be on the bare minimum there. This is where the new Gram stands out with a killer 3:2 aspect ratio perfect for tablet mode plus an ideal 2.5 weight\n\nWhile I get this might be more personal since it's 1 pound difference from the c940, I know people like to carry light when on the go, and a 15 inch laptop for me is a bit too much for super portability too. Mostly this is just personal tastes, but a 3:2 aspect ratio with 14 inch wideness honestly would be more than good of a display for any needs I would say imo. It all comes down to personal tastes.",
  "If you use it in tablet mode, the weight doesn't matter...\n\nLike it could weight 10 pounds but that won't really affect how you use it as a tablet\n\nBut for day to day carry, I could totally understand wanting something lighter",
  "It actually does matter quite a bit haha, try holding the tablet in the air as you would an iPad to read and your arms will get tired pretty darn quick. Most reviewers always mention this for 2 in 1's since weight is what normally restricts tablet mode for most of them, except this here Gram which finally fixed the issue in a lot of senses.",
  "You don't hold it in your hands. You place it flat on a table like a tablet or drafting table",
  "As someone who suffers from constant neck pains from looking down too much while studying, holding the tablet in the air both in desk and in bed is a godsend feature for me. Really the only think I'll miss from my Surface Pro 5 tbh, since that only weighs a mere 1.7 pounds. I know other people in my school do this hence why I decided to mention it.",
  "Lenovo ThinkPad X13 Gen 2 or HP EliteBook 845 G8  ThinkPad could either be a Yoga with a Intel Core i7-1165G7 processor or a regular X13 with a Ryzen 7 5850U processor. Both have 16GBs of RAM.\n\nThe EliteBook has a Ryzen 7 5850U processor and 32GBs of RAM.\n\nEvidently, the EliteBook has better specs, though I'm concerned largely here with build quality, emissions, and battery life. Information on the EliteBook is sparse and data related to the ThinkPads seem to be inconsistent (i.e. reviews claiming it has between 3 and 14 hours of battery life while streaming), so I'm wondering if anybody here might have some insight on either.\n\nPrice is not a consideration.",
  "Zen 3 mobile (5000 series) is decently well optimized in laptops on average in terms of performance and efficiency (especially thermals as well), so in my personal opinion (and from experience with using them at my workplace, a computer repair store), I trust the battery life of laptops with Ryzen CPUs inside more than those with 11th or 12th gen Intel CPUs.\n\nMost manufacturers set the default power limits too high for an otherwise modern ultrabook class of computer, just to eke out as much performance as they can in exchange for momentary bursts in temperature and power draw, compared to computers in the past.\n\ntl;dr: Elitebook 845 G8 is better because of the CPU it uses which offers both better performance and power efficiency over \"equivalent\" Intel offerings.\n\nHP also uses a mostly metal chassis as well, which are built fairly sturdily/solid from experience of using them, while recent ThinkPads tend to default more towards hard plastic for a good portion of laptops, if not, then a hybrid between hard plastic and magnesium/aluminium, (mixed experiences, some models have varying levels of chassis flex while others are fine).",
  "Can this Lenovo Thinkbook handle video editing? This is mainly for general mobile business use but I'd like to be able to do some photo/video editing with Adobe and maybe even some light gaming.  Will this disappoint?  \n\n\n**Lenovo 20WE0018US**\n\n**Lenovo ThinkBook 14s Yoga ITL 20WE0018US 14\" Touchscreen 2 in 1 Notebook - Full HD - 1920 x 1080 - Intel Core i7 i7-1165G7 Quad-core (4 Core) 2.80 GHz - 16 GB RAM - 512 GB SSD - Mineral Gray - Windows 10 Pro - Intel Iris Xe Graphics - In-plane Switching**",
  "This would be the other option same $ range  \n\n\nLenovo IdeaPad 5 Pro R7 5800H Radeon8 16GB/512GB W10P64 16\\\\\" SG 82L5000XUS",
  "this one is...more than twice as powerful than the other one",
  "Thank you. Yeah found this afterward at a good price so plenty power for editing ?",
  "Should be pretty good",
  "HP vs Lenovo I don't care about the size or the weight. Both have same processors and nearly identical specs.\n\n&#x200B;\n\nDifference is the HP 14s has backlit but small keyboard. Lenovo 15 has no backlit but bigger keyboard.\n\n&#x200B;\n\nWhat really matters is Battery. 41whr(HP) vs 45whr(Lenovo)\n\n[https://www.amazon.in/Lenovo-ThinkBook-39-62cm-Antiglare-21A4A09SIH/dp/B0B1DJS5PN/ref=sr\\_1\\_5?crid=2NMHRTWO4CKWX&keywords=ryzen%2B5300u&qid=1659795249&s=computers&sprefix=ryzen%2B5300%2Ccomputers%2C225&sr=1-5&th=1](https://www.amazon.in/Lenovo-ThinkBook-39-62cm-Antiglare-21A4A09SIH/dp/B0B1DJS5PN/ref=sr_1_5?crid=2NMHRTWO4CKWX&keywords=ryzen%2B5300u&qid=1659795249&s=computers&sprefix=ryzen%2B5300%2Ccomputers%2C225&sr=1-5&th=1)\n\n&#x200B;\n\n[https://www.amazon.in/HP-15-6inch-Micro-Edge-Anti-Glare-15s-Eq2143au/dp/B09Q3JZ4YX/ref=sr\\_1\\_3?keywords=ryzen%2B5300u&qid=1659799589&s=computers&sr=1-3&th=1](https://www.amazon.in/HP-15-6inch-Micro-Edge-Anti-Glare-15s-Eq2143au/dp/B09Q3JZ4YX/ref=sr_1_3?keywords=ryzen%2B5300u&qid=1659799589&s=computers&sr=1-3&th=1)\n\n&#x200B;\n\nWhat would you suggest?",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Lenovo ThinkBook 15 AMD Ryzen 3 5300U 15.6\" (39.62cm) FHD 220 Nits Antiglare Thin and Light Laptop (8GB/512GB SSD/Windows 11/MS Office/Mineral Grey/1.7 Kg), 21A4A09TIH \n\n>**Company**: Visit the Lenovo Store\n\n>**Amazon Product Rating**: 4.0 \n\n>**Fakespot Reviews Grade**: C\n\n>**Adjusted Fakespot Rating**: 2.3\n\n>**Analysis Performed at**: 08-06-2022 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/lenovo-thinkbook-15-amd-ryzen-3-5300u-15-6-39-62cm-fhd-220-nits-antiglare-thin-and-light-laptop-8gb-512gb-ssd-windows-11-ms-office-mineral-grey-1-7-kg-21a4a09tih) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "Which one is better? Dell Inspirion vs Lenovo Thinkbook Hi, I'm looking for a new laptop for university. I want a powerful and durable 2in1 and have nailed it down to these two devices:\n\n[DELL Inspiron 14 7420 2in1](https://www.dell.com/de-de/shop/dell-notebooks/inspiron-14-2-in-1/spd/inspiron-14-7420-2-in-1-laptop/cn74208sc)\n\n[Lenovo ThinkBook 14s Yoga Gen 2](https://www.lenovo.com/de/de/laptops/thinkbook/thinkbook-series/Lenovo-ThinkBook-14s-Yoga-Gen-2-14-inch-Intel/p/LEN101B0009?orgRef=https%253A%252F%252Fwww.google.com%252F)\n\nWhich one do you think is best? Any help would be appreciated.",
  "Why is it so hard to choose a laptop if you need Windows? I am a long time user of both Mac and Windows. \n\nCurrently, my main laptop is a Macbook pro with the dreaded butterfly keyboard. \n\nIt didn't really worry me that much, as I mainly use a desktop at work and at home and the laptop was mainly for reading. However, I am finding myself using the laptop for more and more typing and now wish it was a Thinkpad, or a new Macbook. \n\nI used to buy Macbook airs and then install Windows - it was great !\n\n**However, now I need to use some Windows software** a bit more. I could just buy a new Macbook air M2 and remote into my desktop at work, or buy a Windows laptop.  It doesn't need to be all that powerful, just nice to use. \n\n&#x200B;\n\n**So, let's try to buy a good Windows laptop...**\n\nIt was going to be a Thinkpad X1 Carbon - but I want a 2.2k screen, that's not glossy and looks as good as a Macbook screen. \n\nhas anyone seen how many different options Lenovo has? What's with that? Crazy!\n\nThen I thought the XPS Plus - but why should I go for a 4k screen, when I don't need it and all it will do is drain my battery? \n\n&#x200B;\n\nI think Linus Tech Tips summed it up in a video about a year ago - Windows laptop makers did a race to the bottom - they all focused on $500 volume laptops and ignored the premium end of the market. \n\nThe XPS Plus only has UHD+ or FHD - no 2.2k option, that's similar to the MacBook. \n\nX1 carbon, only FHD+ or 4k\n\nYoga 9i at UHD is the closest...",
  "[deleted]",
  "Thanks, \n\nI ended up going for a Yoga Slim 7 Carbon Gen 6 14\" AMD.\n\nIt's probably the closest to a MacBook air, I could find :) However, I don't expect the build quality to be quite as good...\n\nNot sure about the battery on OLED either, but it was the only option on the new chassis.\n\nHere's a review: https://youtu.be/w2UyNVeI\\_hQ",
  "What you guys think about this thinkbook? anybody have this unit? I am looking at $1260 model\n\n14\" (anti-glare touch?), i7 1255U Processor, 1TB SSD, 16GBRAM\n\nI am not planning to use it for gamming.\n\nPlease share your thought about it. \n\n[https://www.lenovo.com/us/en/p/laptops/thinkbook/thinkbook-series/thinkbook-14s-yoga-gen-2-14-intel/len101b0009](https://www.lenovo.com/us/en/p/laptops/thinkbook/thinkbook-series/thinkbook-14s-yoga-gen-2-14-intel/len101b0009)",
  "This is a good notebook\n\ni tried the gen 1 and it was dope but i want to have the gen 2 because of the 12 Generation intel core processor (its more efficient)\n\n&#x200B;\n\nUnfortunately its not availiable in my country, yet",
  "2in1 laptop comparison and suggestion I've been looking for a 2in1 laptop that can be used for taking notes in school/programming. I've seen 2 different models and I'm not sure which one is the best one. Here I'll leave the specs of both of them and the highlights. Any suggestion is appreciated.\n\n**ThinkBook 14s Yoga**\n\n* i7-1165G7\n* 16 Gb RAM, 3200 MHz\n* 512 Gb M.2 NVMe\n* FHD 1920x1080, 14\", IPS, 300nit, sRGB 100%\n* Included pen without batteries (rechargeable)\n* WiFi 6, Bluetooth >= 5.0\n* Battery 4 cell lithium polymers, 60 Wh\n* ***950€***\n* 1.5 Kgs\n* Ports:\n   * 2 USB-A 3.0\n   * 1 Thunderbolt 4\n   * 1 USB-C 3.1 (Power Delivery)\n   * Slot MicroSD\n   * HDMI 1.4b\n   * Combined Jack\n\nHP Envy x360 15\n\n* Ryzen 7 4700U\n* 16 Gb RAM, 3200 MHz\n* 512 Gb M.2 NVMe\n* FHD 1920x1080, 15.6\", IPS, 250nit, 45% NTSC\n* External Tilt Pen MPP 2.0\n* WiFi 5, Bluetooth 5\n* Battery 3 cell lithium polymers, 51 Wh\n* ***900€***\n* 2 Kgs\n* Ports\n   * 1 USB-C (Power Delivery, DP and Sleep and Charge)\n   * 2 USB-A\n   * 1 HDMI 2.0\n   * 1 Combined Jack\n   * 1 Smart Pin CA\n   * 1 SD Reader\n\nSo, to sum up, the biggest differences (other than 50€ in price) are in the weight, in the display brightness and in the pen. Also the battery.  \n\n\nWhich one do you think is the best one?  \nThanks in advance.",
  "[removed]",
  "definitely the Lenovo. much better display, wifi6, built in rechargeable pen, bigger battery, faster SSD. the 250 nits 45% NTSC is totally unacceptable for €900.",
  "Thanks, I've seen different reviews where they said that for taking notes a 14\" display is a better option. What do you think?",
  "Thanks",
  "Accounting Student Laptop Suggestions Hi everyone! Kinda a beginner when it comes to laptop specs so I’m trying to get a good idea what the best laptop for me would be. Currently have a MacBook Pro, unfortunately as an accounting student a lot of the programs I need to use don’t run on macs (Microsoft Access, Alteryx, UiPath) I’m thinking of the Lenovo either C940 or Thinkbook 14s yoga. I want a 2 in 1 with a garaged pen bc I plan on taking notes. Not sure if I should go for i5 or i7 and unsure about memory and storage capacity. Need to have decent battery while multitasking with browser tabs, PowerPoint, excel, Tableau, etc. Any suggestions or insight would be much appreciated!",
  "Go with hp spectre x360 2021 with i7 processor and the colour black and gold. Its the best windows laptop in my eyes,",
  "Depending on how well you are getting on with numbers, I would recommend a number pad, so this would mean a 15.6\" laptop. While an i7 is the best possible thing, I think an i5 would be more than enough for your workload. 16GB of RAM should be a minimum for you. What is your budget? If you want something premium, go with a Dell XPS 15, if you want to safe some cash, I can recommend the ThinkPad E15 Gen 3, this is a less flashy machine but will serve you well.",
  "I don’t want the spending too much but I think my school does give student discounts on Lenovo",
  "I get that. I think my friend got a ThinkPad E15 Gen 3 for around 800 GBP. That included a Ryzen 5 5500U, 16GB of Memory and 1TB of storage as well as a backlit keyboard and the nicer screen and bigger battery. IMO a good deal. I think Lenovos student store gets you 10% off or something? And if you wait some, they have plenty of discounts on all the time. \n\nIf you want something slightly cheaper but also nice, you should look for the Ideapad 5 Pro (16\") or the IdeaPad 5 15 (15.6\") The first one is a bit more premium but has an outstanding display, high resolution display (could be really good for excel and such) but is also a bit larger. The IdeaPad 5 15 is what I would call the de facto basic good laptop. With these last 2, make sure you buy the RAM you need, since it is soldered, so I would go with 16GB.",
  "BREAKDOWN: $800-$1,100 14/15 inch laptops I've been doing a lot of research on laptops in the $800-$1,100 range. I decided to limit myself to 14 or 15 inch models, since I don't have a desktop and need to be able to work from home every once in a while.\n\nBased on the criteria which I describe below, these are the 18 laptops that were available in the $800-$1100 price range from each of the major brands.\n\n* **Lenovo** (8 laptops): ThinkBook 14s Yoga, Yoga 7i 14 inch, Yoga 7i 15 inch, IdeaPad 5, IdeaPad Slim 7 14 inch, IdeaPad Slim 7 15 inch, ThinkPad L14 Gen 2 AMD, ThinkPad E14 Gen 2 Intel\n* **HP** (2 laptops): Envy x360 15t, Envy 14t\n* **Dell** (3 laptops): Inspiron 15 7506, Inspiron 14 7415, Inspiron 14 7405\n* **Acer** (1 laptop): Swift 3\n* **ASUS** (2 laptops): Zenbook 14 UX425, Zenbook Duo 14 UX482\n* **Samsung** (1 laptop): Galaxy Book Pro\n* **LG** (1 laptop): Gram 15\n\nI only looked at models with 512gb storage, although I'm open to 256gb if it's upgradable (even though I don't know how to mess with my computer's internals). My other requirements are: Windows OS, at least Core i5 11th gen or Ryzen 5 4000 series, at least 8gb RAM, SSD storage, USB-C with power delivery, at least full HD and 300 nits max brightness, and the keyboard can't be detachable.\n\nI also have some preferences that are not requirements:\n* 16gb RAM\n* 2-in-1 convertible\n* Black or a similar dark color\n* If it's AMD, it should be Zen 3\n* I strongly prefer having a touchscreen\n* (I'd prefer if it's FHD+ or 16:10, but all the models are just FHD and 16:9)\n\nHere are the prices for each laptop and some notes about their specs.\n\n**Lenovo** (8 models, all 300 nits)\n\n* [ThinkBook 14s Yoga](https://www.lenovo.com/us/en/p/laptops/thinkbook/thinkbook-series/thinkbook-14s-yoga/xxtbxygi400) (2-in-1): $895 for 8gb RAM, $940 for 16gb. The 8gb version is dark blue, 16gb version is gray.\n* [Yoga 7i 14 inch](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/yoga-7-14itl5/88ygc701456) (2-in-1): Sale right now is $780 for 12gb and dark green color. Regular price is $945 for 8gb, and it also comes in dark gray. You can pay another $45 for a pen, $55 for 16gb RAM, and $90 for 1 TB storage.\n* [Yoga 7i 15 inch](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/yoga-7i-15/88ygc701457) (2-in-1): $850 for 8gb and Core i7 package. More expensive if you're building your own package. Same colors as the 14 inch.\n* [IdeaPad 5](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-500/ideapad-5-15-intel-laptop/len101i0009) (not a 2-in-1):  $690 sale for the  8gb gray version. Other configurations are more expensive.\n* [IdeaPad Slim 7](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-700-series/yoga-slim-7-14-inch,-intel-/len101y0007) (not a 2-in-1): $855 for the 14 inch, $870 for the [15 inch](https://www.lenovo.com/us/en/p/laptops/ideapad/ideapad-700-series/yoga-slim-7-15-inch-intel/len101y0008), both 16gb and black. No touchscreen.\n* [ThinkPad E14 Gen 2](https://www.lenovo.com/us/en/configurator/cto/index.html?bundleId=20TACTO1WWUS1) Intel ($940) and [ThinkPad L14 Gen 2 AMD](https://www.lenovo.com/us/en/configurator/cto/index.html?bundleId=20X5CTO1WWUS1) ($1,015) are not 2-in-1s. They are both typically sold to businesses. The L series is supposed to be better than the E series. The L14 AMD is Zen 3. Both are black.\n\n**HP** (2 models)\n\n* [Envy x360 15t](https://www.hp.com/us-en/shop/ConfigureView?urlLangId=&catalogId=10051&langId=-1&storeId=10151&catEntryId=3074457345619931318&quantity=1) or 15z. (2-in-1): $890 for 16gb. 400 nits. Silver. The 15z version is AMD Zen 2, black, and costs $870.\n* [Envy 14t](https://www.hp.com/us-en/shop/ConfigureView?langId=-1&storeId=10151&catalogId=10051&catEntryId=3074457345619871318&urlLangId=&quantity=1) (not a 2-in-1): $1,050 for 16gb. Not sure why it's more expensive than the 2-in-1.\n\n**Dell** (3 models, all 2-in-1s)\n\n* [Inspiron 15 7506](https://www.bestbuy.com/site/dell-inspiron-7000-2-in-1-15-6-fhd-touchscreen-laptop-11th-gen-intel-core-i5-12gb-ram-512gb-ssd-32gb-optane-silver/6432553.p?skuId=6432553&ref=212&loc=1): $1,000 for 12gb. 300 nits. Silver.\n* [Inspiron 14 7415](https://www.dell.com/en-us/shop/laptops/amd/spd/inspiron-14-7415-2-in-1-laptop/n27415esjbs) and [7405](https://www.bestbuy.com/site/dell-inspiron-7000-2-in-1-14-touch-screen-laptop-amd-ryzen-5-8gb-memory-256gb-ssd-sandstorm/6409061.p?skuId=6409061): 7415 is $1000, 7405 is $900. Both are Zen 2 Ryzen 7 AMD laptops, 5700U and 4700U respectively, with 16gb RAM. 250-300 nits. Colors are blue and gold.\n\n**Acer** (1 model)\n\n* [Swift 3](https://store.acer.com/en-us/swift-3-laptop-sf314-59-73up): $800-$1,000 depending on the processor (i5 or i7) and RAM (8gb or 16gb). Not a 2-in-1 and does not have a touchscreen. 400 nits. Silver.\n\n**ASUS** (2 models)\n\n* [Zenbook 14 UX425](https://www.bestbuy.com/site/asus-zenbook-14-laptop-intel-core-i5-8gb-memory-512gb-ssd-pine-gray/6472030.p?skuId=6472030): $830 for 8gb. No touchscreen and not a 2-in-1. 400 nits. Dark bluish gray.\n* [Zenbook Duo 14 UX482](https://www.bestbuy.com/site/asus-zenbook-duo-14-touch-screen-laptop-intel-core-i5-8gb-memory-512gb-ssd-celestial-blue/6451632.p?skuId=6451632). $1,000 for 8gb. This is a unique laptop - it has a regular 14 inch screen, then a 12.6 inch slanted display above the keyboard. Not sure how I feel about this setup.\n\n**Samsung** (1 model)\n\n* [Galaxy Book Pro](https://www.bhphotovideo.com/c/product/1635533-REG/samsung_np950xdb_kb2us_15_6_galaxy_book_pro.html/overview): $1,100 for 8gb. Not a 2-in-1. What distinguishes this computer from the others is that it has an AMOLED display, which means the colors are much better. But it isn't the brightest at 370 nits and doesn't have a touchscreen. Definitely the best design of all the laptops.\n\n**LG** (1 model)\n\n* [Gram 15](https://www.lg.com/us/laptops/lg-15z90p-k.arb6u1-ultra-slim-laptop): $1,100 for 8gb. Black and not a 2-in-1.\n\nThere are a few laptops that are out of my price range, but I may be able to wait until Black Friday and find a deal that will bring them into my price range. They are the Lenovo ThinkPad T14 Gen 2 ($1,125), LG Gram 14 2-in-1 ($1,200), Yoga 9i 14 ($1,355), Dell XPS 15 9510 ($1,270 for 256gb, $1,370 for 512gb), the Microsoft Surface Laptop 4 (currently $1,300 for 256gb), and the Lenovo ThinkPad X1 Carbon Gen 9 ($1,110 for 256gb, $1,375 for 512gb). The last four are more premium in design and build and have better displays (either FHD+ or 16:10).\n\nI'm leaning towards buying the Lenovo Yoga 7i, Lenovo ThinkBook 14s, HP Envy x360 15t/15z, Dell Inspiron 7506, or Galaxy Book Pro. Do any of you have any insights to share that would help me in my search? Do any of you own one of these models and want to share your recommendations?",
  " I got the Lenovo Yoga 7i  i5 evo edition w/12gb of ram and 512gb nvme for $649 at bestbuy. back in August. It's a really nice laptop weighs 3lbs though but is made out of anodized aluminium. Screen is really nice with nice color gamut. Overall I feel like this was a great deal.",
  "[deleted]",
  "Thanks, I'll check it out in the store! If it was $649, that's a great deal - right now it's going for $949.",
  "That makes sense! I don't really do much gaming, so I didn't consider graphics or look at gaming laptops, but the Legion 5 looks like a pretty good option for a gaming laptop in this price range.",
  "yeah I ended up getting the newer Lenovo active 2 pen and the pen support is really great. I highly recommend going on lenovo's site and downloading the latest drivers and bios and do a clean install of Windows.",
  "Asus expert book B9450 vs Microsoft Surface laptop vs else? for best battery life. I am a medical student that just started in the hospital, I have bad carpal tunnel syndrome in my right hand so I dictate almost everything I do.  Outlets are scarce so I need a laptop with good battery life that I can use for dictation and looking up patient charts etc. Plug ins are at a premium so battery is the #1 concern.\n\nI have been researching this for a few days now and I always find it hard to correlate the exact model I read a review of with what I'm able to find for purchase online (I'm in the frozen north of Canada so maybe this is harder here).\n\nI do not really want to spend over $1500 on this, which I feel is doable.  I currently have a think pad X1 Yoga generation 3, which is a great laptop but I only get 4 to 5 hours out of it at best, which just isn't enough. The 2 in 1 functionality isn't really necessary\n\nI am currently leaning toward to the Microsoft surface laptop 4 or the ASUS expert book B9450, but this is the only one I can find: https://www.amazon.ca/Expertbook-B9450FA-C53VP-CA-Intel-CoreTM-i5-10310U/dp/B08K1RKC5Q/ref=sr_1_3?crid=2I3W3DEH9CYKJ&keywords=ASUS+expertbook+b9450&qid=1641774082&sprefix=asus+expertbook+b9450%2Caps%2C80&sr=8-3  \n\nIt only has a Intel Core i5-10310U, and the review switching the model with the i7 can still be a bit on the slow side so I am concerned about that.  I am also not sure that this is actually the same one that I read reviews about the impressive battery on\n\nThese are also being considered https://deals.dell.com/en-ca/productdetail/cicz\n\n\nhttps://www.hp.com/ca-en/shop/produ...ekly-deals&bid=DYN_BUNDLE_0007012_12B92UA_ABL\n\nAny thoughts?  I am also very open to suggestions.",
  "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: ASUS Expertbook Notebook B9450 Intel Core™ i5-10310U vPro® - 16GB RAM - 512GB PCIe SSD - 14\" FHD Anti-Glare - 2.1lbs - Win10 pro B9450FA-C53VP-CA \n\n>**Company**: Visit the Asus Store\n\n>**Amazon Product Rating**: 5.0 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 5.0\n\n>**Analysis Performed at**: 01-10-2022 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/asus-expertbook-notebook-b9450-intel-core-i5-10310u-vpro-16gb-ram-512gb-pcie-ssd-14-fhd-anti-glare-2-1lbs-win10-pro-b9450fa-c53vp-ca) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
  "Hey man. I have Asus expert book my work gave me. Battery does not last 10 hours. Impossible.",
  "I've tried out (almost) every flagship windows laptop and here are my thoughts Hi! For some context, I'm a 20-year-old university student who's been looking for a new laptop for the past YEAR (we'll get to that). I'm coming from an [8-year-old Asus laptop](https://www.asus.com/Laptops/S56CM/) that's pretty much on its last legs, so I thought it was time for an upgrade. I wanted something pretty lightweight and portable (so a 13\" or 14\" screen) so I could bring it to school to take notes and do work on. I wanted something powerful enough for some regular multitasking and web browsing, and for some light gaming (like League of Legends). \n\n\nI wanted to make this post to share my experiences with each of the laptops that I used. I possessed each one for between 1 week to 1 full month, and tried to use them as thoroughly as possible.\n\n\nFor some more context, I am pretty detail-oriented. I wasn't in too big of a hurry for the computer, since my old one still works and is not awfully slow thanks to an SSD upgrade I got a couple years back. So I was open to doing some buying and returning because I wanted to make sure I got the most value out of my money (which I think is a pretty common thought for students without a big stream of income). \n\n\n[**Laptop 1: Asus Zenbook UX331FA-DB71** - *I- 'm lo-..sing co-nn..-ect- ion...\"](https://www.asus.com/ca-en/Laptops/ASUS-ZenBook-13-UX331FA/wheretobuy/)\n\n\nI got a pretty good deal on this one ($1000 CAD), and it's a very premium-feeling computer, very reminiscent of a MacBook. Some specific pros:\n\n* You can open the lid with 1 finger\n* Solid build quality \n\nHowever, the glaring weakness of this laptop was the bad Wifi. It had similar problems to my 8-year old pile of trash Asus, where the laptop would frequently disconnect from the internet, even if the connection itself was stable (by frequently, I mean like 1-2 times per day). This is a particularly bad thing considering that many students are now transitioning to online learning, and it would be pretty unfortunate to disconnect in the middle of a Zoom lecture or online exam... In addition, there was a noticeable amount of coil whine, which was audibly annoying in a quiet room.\n\n\n[**Laptop 2: Microsoft Surface Laptop 3** - *yo dawg, i heard you wanted some problems with your problems...*](https://www.microsoft.com/en-ca/p/surface-laptop-3/8vfggh1r94tm?activetab=overview)\n\nThis one's another very premium-feeling and attractive laptop. It has a very nice glossy touchscreen (which I didn't find myself using that much since it isn't a convertible). I got the model with the i5 and 256gb of internal storage.\n\nThe first unit I received performed without any issues until around a week in, where I noticed that the laptop played a static sound in my headphones every time the computer was being charged. This sucked for me because I have my headphones on at almost all times. So I exchanged it for a replacement unit, except the second unit came with a different problem- the fan noise was uncontrollably loud when it was charging (even without anything running). I also noticed some coil whine on this laptop too. As for a smaller issue, it's difficult to open since there is no notch to hold to open the computer. You have to hold it by the side with one hand and pull it open with the other. \n\nAnyway, I thought that maybe this computer wasn't for me considering the issues I was having, so I returned it.\n\n\n[**Laptop 3: Dell XPS 13 7390** - *what the reviews don't tell you!*](https://www.dell.com/en-us/shop/cty/pdp/spd/xps-13-7390-laptop)\n\nI thought I'd go for a Dell this time, since every reviewer online and their mother has been ranting about the Dell XPS for years. I purchased the i5 model with 8gb of ram and 256gb of storage. I'm aware this isn't the most up-to-date XPS model, but some of this may still apply. The main pros of this laptop are:\n\n* It's incredibly small and lightweight (it fits into the laptop sleeve of my mom's 11-inch laptop)\n* It has a non-glossy screen which is good for reading in sunlight\n\nThat's pretty much where the pros ended for me... \n\n* The first thing I noticed was the really loud fan noise even when no demanding programs were being run. This was particularly irritating, however it seemed to be reduced after switching a setting in the BIOS. So not bad.\n\n* The battery life isn't as good as you think. I brought the laptop at close to 100 percent charge to a 75-minute lecture. I kept it on battery-saving mode and I had it at the absolute lowest brightness setting the whole time. I was typing in a google doc and I had a couple of pdf's open- basically, nothing intense. By the end of the lecture, I had a little under 80% left. Considering it drains quite a bit of battery on idle, you might want to bring a charger if you have more than 3 to 4 lectures in a day...\n\n* The laptop itself doesn't sit flat on a table (if you tap the bottom left side of the laptop, it rocks back and forth). I only noticed this later on and it's not the most noticeable, but you do notice it when you take off and put your palm on the computer.\n\n* The keyboard has good key travel, but I noticed some of the keys are \"sticky\" and don't press all the way down. \n\n* It takes around 10 seconds for the computer to wake up from sleep. Sometimes it doesn't even wake up and I have to restart the computer fully.\n\n* After one Windows update, the fingerprint scanner fully STOPPED working. Even when it was working, I found it only identified my finger 75% of the time. Not bad, not great.\n\nI thought that I was facing these problems because I had received a \"bad apple\", so I exchanged it for a new one. On the newer model, the keyboard felt a bit better but the other issues were all still apparent. So I decided this one wasn't for me and returned it.\n\n\n[**Laptop 4: HP Spectre X360 13\"** - *Sure View is the worst thing since not sliced bread*](https://store.hp.com/CanadaStore/Merch/Product.aspx?id=7YZ55UA&opt=ABL&sel=NTB&lang=en-CA)\n\nI decided to up my budget a bit and went all-out on specs, getting the i7 with 16gb of ram. It's a very lightweight and compact computer. The keyboard is really nice and clicky, but...\n\nThe Sure View display is... really bad. The viewing angles are absolutely atrocious. The screen only looks normal from one specific angle (looking exactly head-on), if you move your head even a bit, you get this ugly dark-to-light gradient appear on the screen. When you lay it flat to use in tablet mode, the laptop dims almost entirely and you can barely see anything (even when the computer is on full brightness). Unfortunately, the vast majority of x360 models available in Canada come with this technology, so I have very limited options. The screen gets very bright, but I found it didn't get *dim* enough (it really strains your eyes when using it in a semi dark room at the lowest brightness setting). Also, the trackpad is not good. The trackpad is loose/wobbly at the bottom, where a light click doesn't register, so you really have to press down for it to recognize. It's not a great trackpad in general. The laptop also crashed twice while I was playing League of Legends, and I had heard in a review the performance is inconsistent so my experience may be a reflection of that. Also, you need the strength of 100 actual men to plug in and unplug cables from the USB ports (they stick in a suspicious amount...). \n\nI was pretty disappointed with my experience with this one. Besides those flaws, it is pretty usable, so I thought I could fall back on this one if I really found nothing. So I decided to return this one and get the one I've been looking at for a long time:\n\n\n[**Laptop 5: Lenovo Yoga C940 14\"** - *a volcano...?*](https://www.lenovo.com/ca/en/laptops/yoga/yoga-900-series/Lenovo-Yoga-C940-14IIL/p/88YGC901221)\n\nI had high hopes for this one. I saw no glaring weaknesses in all the reviews I read about it. When I first received it, I was instantly sold. The display was big and vibrant, the battery life is great, the speakers are awesome, it works great in tablet mode with the pen, and it has a good keyboard and trackpad. I only noticed an issue once I plugged it into an outlet to charge and it got... HOT! Even with only a couple of tabs open, the computer got hot to the touch, to the point where it was a bit uncomfortable to type on or having it on my lap. I hadn't noticed anything like this in any of the other computers. This is even more pronounced when I was playing League of Legends, and that's when the keyboard got even hotter, to the point where it was actually uncomfortable to rest my fingers on it, and the portion above the keyboard got even more hot (I couldn't keep my finger on it for more than a few seconds before it burning up). I tried undervolting my device using ThrottleStop, but I noticed almost no difference.\n\nI find that the computer warms up as soon as you do something any more intense than some web-browsing, video watching, etc. It's not too bad when the computer is running on battery mode, but when it's charging, the CPU gets up to 50-60 degrees celsius on idle, and I reckon in the 90's while playing games. \n\nI'm currently typing this on the Lenovo. I feel pretty lost and defeated at this point. In my experience, when looking for a Windows laptop, it was less about which one had the specific features I wanted, but was more about which one had the least significant cons. Which one is the lesser evil. I haven't really hesitated to return because I can survive university with pen-and-paper, but it feels a lot better with a laptop. I may be being a bit extreme, but 1500$ to 2000$ is a LOT of money for a student to dish out on a computer, especially with many students being unemployed now, and concerned with paying tuition. \n\nI think the biggest thing I noticed was that a lot of the problems I faced are pretty easy for even the typical, non technologically inclined person to notice. I wonder how these brands are letting devices through with issues this apparent. I am really questioning these brands and their quality control processes...\n\nSo that's where I'm at. Not sure where to go from here. I'm definitely considering switching to Apple just so that I don't have to worry about these things. That's all!",
  "Hello. I’m a Mac, and I’m a PC...",
  "Don't think Apple will free you from all these problems.\n\nApple laptops themselves have problems of there own. Try gaming on them for instance.",
  "If you want to game, pick a laptop with a dedicated graphics card, like your old laptop.",
  "That asus has to be one of the best looking laptops. Not the one in the picture. Shame they stopped that design, would be perfect with a ryzen apu.",
  "I'm thinking about buying a C940 with an NVIDIA gfx card and 16gb without the 4k options, do you think any of those will lower the issues ?",
  "maybe try the latest xps?",
  "Or try razer blade stealth/asus zephyrus g14?",
  "Hmm... Would playing games really be bad if it had the specs to run games in theory? Like handling games that aren't too intensive like LoL.",
  "HP Dragonfly Review (16GB, 4k, 1TB version)  \n\nI’ve been looking to shift to a hybrid/2 in 1 for some time now. I was hoping that would be with Apple but we'll all know where that has gone. Maybe it will change with Apple's switch to ARM, but with Apple's attitude to what customer want, I probably had more chance of falling pregnant through wind pollination.\n\nI generally write in a light hearted manner, so if you're easy insulted, please stop here. Chances are if I've written something to offend you, it's probably my weak attempt at humour.\n\nFor those looking at the context of my switch, I'll give you my background including my experience with my first attempt at a windows switch. It's long, and probably somewhat boring so if you want to skip it, go to the end of the next section and save yourself the time. If you're bored with nothing better to do, feel free to plod on.\n\nI was too lazy to clean it or spend too much time on photos so I apologise in advance for the lack of ultrabook hardware porn\n\n&#x200B;\n\nhttps://preview.redd.it/x7vt2n26yy951.jpg?width=1600&format=pjpg&auto=webp&s=51f11bce035a7cb651323db6ddb90bfae5f67e55\n\n# My History with Apple and Microsoft (Skip this if you're easily bored)\n\nA long, long time ago, in a galaxy far, far away (Australia), I decided to give Microsoft a go after more than 10 years on Mac, just to see what hybrids were like. I purchased a Surface Pro 3.\n\nLet's just say it was a huge mistake, or it was for me. Windows 8 was terrible as a tablet and desktop operation system, and when I upgraded to Windows 10, I regretted the decision further.\n\nThe first versions of windows 10 were unstable resulting in a terrible user experience. It was sluggish, search didn't work properly. It had promise but my biggest concern was that if Microsoft would release a half baked product like this, what were future releases going to be like. Basic problems existed like having to change my display scaling or resolution when I moved from using an external display to the surface display.\n\nI think the final nail in the coffin was when Microsoft decided to switch on automatic updates where it used your machine to update other machines globally and failed to tell users about what they were doing.\n\nI lost $300 of mobile data the first day and another $200 on the second before I found the problem. Yes, data in Australia was that expensive those days. I complained to Microsoft Australia, they couldn't even be bothered to respond.\n\nIt took 6 months of follows up to even get them to email back to my complaint, and believe it or not, their actual response was \"what do you expect us to do?\". How about a #(\\*\\^&$ apology for one? By that stage, I'd sold my Surface Pro 3, and purchased a quad core MacBook Pro 15.\n\nFrom there, I extended my Mac acquisition with Macbook Pro 13 as a lightweight machine for business travel and an iPad Pro which I used for note taking, mark ups, with the Apple pencil which I loved. For a period I was happy, like most marriages, it knew there were compromises. I still lived in hope that Apple would produce a hybrid so I didn't have to lug around two devices.\n\nThe cracks in my relationship started to appear progressively when Apple progressively removed all upgrade capability and when it got to a point of making iMac drives non-user replaceable, I was starting to beat my chest like an angry 5 year old. It's a desktop, why the hell would you make the drives non-replaceable, other than ripping off the consumer by facing them to upgrade? I was planning on the new Mac Pro when Apple released a $7,000 screen with a $1000 stand alongside a stupidly overpriced $7,000 Mac Pro that came with a 256 GB drive. What the? They produced a screen for the 12\n\nI knew there had always been an Apple tax, but now it had shifted to an idiot tax. With the sad realisation that the Apple execs had taken one too many million dollar paychecks and were clearly spending more time snorting cocaine off hookers than working on a realistic to go market strategy for customers like me, I decided to depart MacLand and move to the potentially greener pastures of Windowland.\n\nThe first step in my departure was a desktop to replace my 5 year old quad core Mac. I built a stupidly powerful desktop for about $5,000, RAID, Gen 4 S5D's, Ryzen 9 etc. I won't bore you more than that, suffice to say I could probably hack Pornhub with it (why do people always want to hack the Pentagon?), if I knew how to hack.\n\nPart two was the replacement of my 2018 Macbook Pro 13 and my iPad Pro which weren't necessarily due for replacement. I didn't have to replace them but I we're in lock down and I don't feel like having multiple operating systems.\n\n&#x200B;\n\nhttps://preview.redd.it/7cu530sayy951.jpg?width=1600&format=pjpg&auto=webp&s=c43e7666f6b447db4b1d976b72e873783248bd49\n\n&#x200B;\n\n# My evaluation criteria\n\nI wanted an exec level compact laptop that still had enough power to handle some of my creative requirements.\n\nThe devices I evaluated at the time were:\n\n* Lenovo Yoga X1 Gen 4\n* Lenovo Yoga X1 Gen 5\n* HP spectre X360\n* Dell XPS 13 2 in 1\n* HP Dragonfly\n* MS Surface Book 3\n\nI ruled out the Surface Book 3 (no 4k, no LTE, no USB-C) and the Yoga X1 Gen 5 (no 4K in Australia) as I had some timeline constraints. Timeline constraints are the same reason I didn't wait for the 5G Dragonfly.\n\nI ruled out the Spectre which isn't available in the LTE model if you want a 4k Screen. While LTE wasn't mandatory, I figured I already had the Dragonfly from HP with it. The performance differences between the 8th and 10th gen weren't huge.\n\nI could technically have ruled out the XPS but I decided to try all 3. The Dragonfly was a little harder to find in a store but a friend had been issued one by his company.\n\nUltimately, my evaluation looked something like this:\n\n* Construction - Pretty good for all 3 but the Dragonfly just took it.\n* Keyboard - Lenovo (Dragonfly wasn't as far off as I expected)\n* Screen - Dragonfly\n* Weight - Dragonfly\n* Battery - Dragonfly\n\nThe Dell, surprisingly enough didn't stand out in any categories. I know this will probably piss off some Dell but its just my perspective\n\n&#x200B;\n\nhttps://preview.redd.it/behnaprdyy951.jpg?width=1600&format=pjpg&auto=webp&s=45220cba5c8b53f2810b0148390be26c1dce01e4\n\n# Design & construction\n\nIn the box you get:\n\n* Dragonfly\n* Charger\n* Pen and pen charger\n* Usual paper crap, warranties, the kid of stuff you never read unless there is a problem\n\nComing from Apple gear, I'm used to aesthetically pleasing designs (and carrying 400 adapters). Like it or not, Apple has been good at it. It's also an area where many Windows laptops traditionally suffered.\n\nThe Dragonfly is targeted more at executive levels. Yeah, you know those hypocrites at the top who skimp on your toilet paper quality to save $100 for the whole building, but spend a fortune on a top of the range laptop despite only using it for email.\n\nAs a result, looks are somewhere between a Margot Robbie and Chris Hemsworth, depending on your sexual preference. Absolutely beautiful. The blue is hard to describe, almost iridescent, amazing. Combined with the silver logo, it has looks to die for (so you're getting the bad ass version of Margot Robbie in Suicide Squad). I think this has to be one of best looking laptops on the market. The photos don't do it justice.\n\nI liked the blue so much that I couldn't put a grey mouse with it so I hunted down a teal blue version of my Logitech MX 2S. I don't match mice, but this laptop has driven me to match mice. What has happened to me?\n\nOverall, it's hard not to give it 10 out 10 for the looks except, in a moment (or two) of insanity, HP did something so idiotic you have to question what they were thinking.\n\nIn somewhat of a \"what the #$%& \" that you utter when a celebrity says something really stupid that makes you shake your head and question the depth of the IQ pool, HP spoilt it by putting a nice big \"Intel inside\" sticker right next to the fingerprint reader. To make matters worse, they couldn't even be bother to put mine on straight.\n\nAs if the kinds of users using this laptop are going to give a shit whether Intel is inside. They either bought it themselves (in which case they know) or they had an IT department do it and then they aren't the kind of users who care. Either way, care factor is somewhere between zero and none.\n\nYeah, I know you can remove the sticker, but you shouldn't have to. Given the sticker is removable, it drops it to a 9.75 instead of a 10.\n\nConstruction is what I would expect for the price range. Absolutely impeccable. It's rigid, well constructed. Drop proof, Milspec something or other, most likely to deal with exec tantrums or those frustrated with that Intel sticker.\n\nI could almost stop there and say its a near perfect laptop from a construction perspective, but sadly I can't. HP, again did something that needs a facepalm. They provided an amazing tiny 65W charger. It's compact, with a nice wrap around cable...and then they spoil the entire experience by attaching a thick 10m power cable to the tiny brick.\n\nOkay, it's not 10m, that's an exaggeration, but the cable between the wall socket and brick would rival the brick for size and weight when folded up. And the thickest conceivable cable. It's like this cable ate another 5 cables while no one was watching. A stand alone adapter would have been nice (like Apple provide). I. e. Without the cable. I also think they could have provided a shorter cable. The Dell comes with a half a meter cable which seems to be more practical (and smaller).\n\nI order a small 0.5m (20\") cable and an adapter which I will use to replace this. An unnecessary annoyance.\n\n&#x200B;\n\nhttps://preview.redd.it/2zmjs95gyy951.jpg?width=1600&format=pjpg&auto=webp&s=cfa6bc3f183e71bfd86dd8a991aacd118a796e4f\n\n# Weight\n\nThe weight on my version (which has the bigger battery) is 1.13kg's/2.5 pounds. The lighter version in 2.2 but not available with the 4k screen.\n\nThat's astounding. My 2018 12.9 iPad Pro with smart keyboard runs at 1070 grams with a smaller lower resolution screen. It's also lighter than the new iPad Pro 12.9 and Magic keyboard (3 Pounds/1.36 kg's) and the new Macbook Air (1.27kg's).\n\nIf Apple wants a lesson in construction, unlike the equally expensive and heavier Macbook Pro and Air, HP put a bigger battery, 4K display, fingerprint reader and LTE in the Dragonfly and both the battery and M2 are user replaceable. Some would try argue that Apple focus on aesthetics first, but even that HP got right. What they managed to produce a good looking light weight laptop without screwing the consumer by making it non-user replaceable?\n\nJohnny Ives would be shaking his head demanding to know what saucery was used on this laptop.\n\nWith the shift to the Dragonfly, I'm more than halving my carry weight from 2.4kg's to 1.13kg's, although the cable from the charger might weigh as much as a Macbook Pro.\n\n# The pen/stylus experience.\n\nThis is an area I was a little worried about. The Apple Pencil experience is really amazing. The latency is almost non-existent and the ink feels like it's coming out of the front of your pencil.\n\nThe HP Dragonfly matches this experience, and whilst I wouldn't class it as better, I also wouldn't class it as worse. It's just different. Latency isn't quite as good, but the Dragonfly has a softer feel, like the difference between writing with a pen and a marker.\n\nOverall, I think both are acceptable and choosing one would be hard. There are things I like and don't like with either.\n\nThe pen isn't dockable which is an annoyance, but I'm not sure where you would fit a pen this size on the Dragonfly. It would be nice if they offered some form of attachment to keep it on the side. Even a magnetic attachment point would be a step up to not having one.\n\nI like Apple's design of having a chargeable magnetic holder and so maybe that's something for them to think about in the next edition. Having a cable charger for the pencil isn't ideal.\n\n# Screen\n\nComing from the Macbook Pro 13\", the Dragonfly is amazing. I don't think the Macbook Pro is necessarily bad, but the difference in resolution between the two is noticeable. It's one of the best screens I've seen on a laptop.\n\nWould love it if HP included the privacy screen on the 4K version. It was frustrating having to pick between the privacy and 4K edition, but very little of what I do is confidential enough to worry about it.\n\nColour accuracy is good but not close to my desktop which has more expensive colour calibrated panel. I won't be using it for colour accurate work.\n\n# Keyboard & Mousepad\n\nApple used to have amazing keyboards. Then they went to this stupid butterfly design that makes it sound like you're a tap dancer while you are typing. I've tried some of the new Lenovo keyboards and I would put them as class leading. Miles ahead ahead of Apple.\n\nSo how does the Dragonfly fare? Surprisingly well, I’d say it’s pretty close to the Lenovo. Overall, about an 8.5/10 and fairly close to what I would class as a desktop quality experience.\n\nI’ve heard people say the keyboard on the Dragonfly feels cramped but I actually find it pretty good. Maybe I’m used to the small iPad keyboard but this is decent.\n\nThe mousepad is good. Multitouch features are pretty much expected on todays devices and it doesn't disappoint.\n\n# Ergonomics and handling\n\nIt's a pretty well designed device from a size and features perspective but it suffers a little in the ergonomics area, maybe as a result of the small size.\n\nThe location of the USB-C is somewhat confusing. On the same side as the mouse? Seems like an oversight along with the HDMI port. I would have put the HDMI and USB-C ports on the other side.\n\nOpening the lid isn't one of it's design features. There is a little ledge but it's not what I would qualify as simple, or as simple as it should be for a repetitive task.\n\n# Conclusion\n\nI'm now bored with this review and running out of crap to write. Having covered pretty much everything I can think of, if I missed anything, let me know.\n\nWhat are my final thoughts? I'm damn impressed. This is without a doubt one of the best laptops I have purchased.\n\nI'm still getting used to Windows, but from a hardware perspective. HP gets a WOW from me and in a good way.",
  "This is very well written haha, and I personally enjoyed your humour!",
  "Here's [a review of the latest HP Firefly G4 ](https://highperformancelaptops.com.au/reviews/hp-elite-dragonfly-g4-review) FYI.",
  "Need reliable laptop with good build/quality for college [US] * **Total budget and country of purchase:** \nFlexible but preferably under 1500USD with student discount\n\n* **Do you prefer a 2 in 1 form factor, good battery life or best specifications for the money? Pick or include any that apply.** \nI'm looking for a model with premium build, few known quality and hardware issues. It has to be usable and I'll need it to last.\nNext down my list of priorities would be battery life (>5 hours normal usage is enough), a decent display (high resolution, colour doesn't bother me) decent enough specs I guess.\n2 in 1 would be cool to have but not at all necessary\n\n* **How important is weight and thinness to you?**\nPortable but doesn't need to be a piece of paper. Had a late 2011 MacBook till earlier this year and anything that beats that is fine\n\n* **Which OS do you require? Windows, Mac, Chrome OS, Linux.**\nI actually have no idea, I've read some very conflicting things about what's best for data science\n\n* **Do you have a preferred screen size? If indifferent, put N/A.** \n13 inch\n\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** \nI do some art and editing for a hobby, stuff like Photoshop, but it's not too important\nI'll be majoring in sciences and I might end up using stuff like MATLAB, run python or something, kind of clueless as of now but I don't want to limit what I can do. Though I don't think it'd be all that intensive for undergrad\n\n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** \nBuild build build and durable/reliable hardware. The old MacBook lasted 6 years and 2500++ cycles without once needing repair and I'm expecting no less from newer machines.\nWant a good keyboard and trackpad, I really liked the feel of my old MacBook\n\n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**\nReading laptop reviews stresses me out so much. They all seem to have so many problems and honestly I'm not tech savvy and I wouldn't know what to do and what's covered by warranty and all that.\nMacbook pro: faulty keyboard, touchbar freezing, wifi issues, also supposedly very overpriced\nSurface book 2: quality and hardware problems in general, poor charging/battery, wifi (this one has everything I'm looking for but its issues are pretty alarming)\nXPS: heats up, have read that its trackpad isn't very good and a friend that has it hates it\nMatebook: noisy fans, quality issues?\n\nWould appreciate it so much if anyone could give me some advice as well as if you know if the issues for the devices I'm considering are all that common/serious. Can't really afford to send my laptop for repair later, it's an all out investment for me. Thanks!",
  "No worries! Or if you like something cheaper with a more powerful GPU, have a look at the [HP Envy x360 13](https://store.hp.com/us/en/pdp/hp-envy-x360-13z-touch-laptop-3ec92av-1). There’s no huge difference with this laptop compared with the Yoga 920 or the higher end [Spectre x360](https://store.hp.com/us/en/ConfigureView?catalogId=10051&langId=-1&storeId=10151&urlLangId=&catEntryId=3074457345618598818&quantity=1&color=Natural+Silver) which comes in Rose Gold, Dark Ash Gold and Natural Silver. I’ve used the Spectre x360 for about a month, but there was an ongoing whistling fan issue whenever the fan was on. So I replaced the laptop with the Envy x360 mentioned above, though the battery life is shorter at around 6-7 hours with basic usage, I don’t know why this laptop is so cheap though, even if it’s configured to the highest specifications, it comes around at $900.",
  "Hard question to answer, plenty of possibilities\n\nWindows Hello, fingerprinting, or neither\n\nSSD, Hard drive, both?\n\nStorage size needs?\n\nGaming?\n\ndegree?",
  "Just an fyi, many things such as laptops and keyboards are not built as well as they used to and may not last as long as you hope.",
  "xps 13 from dell refurb",
  "In that price range, I’d get the Lenovo Yoga 920 or the Huawei Matebook X Pro.\n\nhttps://www.lenovo.com/us/en/laptops/yoga/yoga-900-series/Yoga-920-13/p/88YG9000859",
  "That'd save me so much money, I'll be sure to check it out as well and it does look good! Really appreciate the help!",
  "1. Don't need windows hello or fingerprinting but wouldn't mind\n2. Don't really think it matters for me, what would you recommend\n3. Not sure but I don't need anything huge\n4. I don't game\n5. My major? It's biochemistry as of now but could change. I'm interested in research and might need to pick up some coding\nBut my priorities mostly lie in getting something practical and which wouldn't give me problems. Thanks again!",
  "Coil whine",
  "Thanks for the rec! I love that I'd be able to draw on it without an external tablet, I'll try it out at the store",
  "Data analytics for the degree mean i5/r5 or better. SSD/HDD combos are a must. Windows hello is hard to come by, fingerprinting is fairly common, are you comfortable opening up your machine?",
  "I see, I'll take note of that. And uh, not that confident of my abilities... ",
  "Laptop for Research Work with Specs Close to Surface Book 3 but with 11th Gen i7 or Similar? Current laptop: Lenovo Yoga 910 i7 7500U/16GB RAM/1 TB SSD/4k display \n\nFeatures I'm trying to improve: lack of pen support, webcam placement, processing power, high-pitched fan\n\nI'm a researcher and this would be my main device. I move a lot and so do not want an external monitor nor to switch to a desktop. I heavily use Office Suite, many Chrome tabs, video conferencing, Youtube, Adobe Photoshop + Illustrator, 4k photo editing, moderate video editing, and Python. I do not game at all.\n\nFeatures I am looking for in a laptop: \n\n11ith gen i7 CPU + \\*\\*\n\n32GB RAM + \\*\n\n4k or near resolution screen (not AMOLED) \\*\\*\n\n2-in-1 convertible with pen support \\*\\*\n\nUSB-A port built-in \\*\\*\\*\n\n15\" screen \\*\\*\n\n1080p webcam \\*\n\nBattery life \\~7 hours non-intensive use (web browsing/Youtube) \\*\\*\n\nHDMI port or Thunderbolt cherries on top, but not a requirement \\*\n\nThe closest laptop I have found seems to be the Microsoft Surface Book 3 minus the CPU. I'm rather dongle-averse outside of a USB-C to HDMI converter (so the idea of an external webcam is not the most exciting), so I've nixed the XPS 15 2-in-1. \n\nPrice isn't a consideration really, but sub-$4000 would be nice and I would be willing to go above that if there was a device that had everything above.\n\nAre there any laptops that fit this bill on the market? The closest I can see outside of the Surface Book 3 are the HP Dragonfly Elite G2/Max (but there you have to choose between 4k screen and 1080p webcam) which is \\~13\", Surface Pro 7+ (smaller profile, 1080p screen), and the Elitebook 1040 G8 (720p webcam, estimated delivery date of late July so would be waiting half a year in which time something else could release). I thought there were 2-in-1 Zbooks, but they seem to not be on the HP website anymore/not part of the latest generation and these anyway wouldn't have a better webcam.\n\nI find it kind of ironic that mostly smaller laptops have the specs I'm looking for, so it makes me think that larger convertibles might come to market with upgraded RAM and webcams, the latter especially, in the next cycle. Would that release be in the fall or is there a summer expo? \n\nAm I judging the CPU on the Surface Book 3 unfairly? The reviews online rail about how much worse 10th generation is than 11th and the test graphs seem to support that. I'm coming from 7th gen, but I also want this device to last 3-4 years minimum and don't want to commit to last generation's CPU if something is going to come out with all the specs within a year and I doubt there will be a surprise Surface Book 3 CPU refresh since it just came out. I would also not take advantage of the detachable tablet feature of the Surface Book 3 outside of flipping the screen to cover the keyboard in tablet mode, which is its main feature, so feels like a bit of a waste there? \n\nThanks for any help!",
  "I'm in the same market and haven't really seen anything beyond what you've mentioned. I'll probably just wait around until the SB3 gets a processor refresh.\n\nThe processor refresh on the SB2 occurred \\~1.5 years after the initial release, but hopefully this one would be sooner as there was quite a bit of negativity around the SB3 processors so MS should be quite clear on what they need to do.\n\nAs usual though, if you're always looking to buy the tech just over the horizon, you'll always be waiting.",
  "Which of these computers is a better deal? I’ve been looking for a laptop that’s sturdy, will last, and can handle some pretty light gaming (The Sims 4 on medium settings). I think I’ve found two that certainly meet my needs and my price point. Both have dedicated graphics cards and are under $800. \n\n[The Lenovo Thinkbook 14S](https://www.amazon.com/gp/aw/d/B0831P63GN/ref=psdcmw_13896615011_t1_B0831NZY5V) is the one I like a little more because it’s supposedly a “business” spec laptop, so I expect a little more longevity than the Asus. Although it costs a little more, it has more RAM and a bigger SSD, which is a huge plus - and I believe the RAM is upgradeable. However, my bullshit sensors are kinda going off because I can’t find another Thinkbook 14S with these same specs - all the other 14S with 512 GB SSDs and 16 GB Ram have i7 processors, not i5 ones. Is this laptop legit? If not, I’m still looking at the Thinkbook 14S with 8 GB ram and 256 SSD as a potential laptop.\n\n\n[The Asus Zenbook](https://www.bestbuy.com/site/asus-zenbook-14-laptop-amd-ryzen-5-8gb-memory-nvidia-geforce-mx350-256gb-ssd-light-gray/6403819.p?skuId=6403819) is also really nice for the price and I feel confident in Asus’ reputation. However, I’m having trouble finding reviews for this specific zenbook because it seems that there are 410372 different versions - from a review I read that might’ve been about this same laptop said that cooling issues may be a cause for concern. I do worry that since the Zenbook isn’t really a business-ish laptop that I’ll have more issues with it, but oh well.",
  "The Asus is the obvious choice here. Even if the memory can't be upgraded (which it very well might be able to) the 4500U and MX350 stomp all over the ThinkBook. If there is a similar model to the Asus with the same cpu/gpu but with more ram/storage for ~$900, I would take that over the $750-800 ThinkBook.",
  "Thanks! \n\nDo you have any opinions on this $759 [Dell Vostro](https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/vostro-14-3490-small-business-laptop/spd/vostro-14-3490-laptop#configurations_section)?",
  "The 4500U still handily beats out the 10th gen i5, and I doubt the Radeon 610 GPU is at all worth it over the Vega 5. And given the fact that it still has 8gb/256gb I don't think it's worth.",
  "What are the best laptops for a college student with long battery life? I know that MacBooks are popular and have long better life’s but i think it is too expensive and the bigger the screen the more expensive it is and the intel core is kinda bad for the price. \n\nI want to get a hp laptop but a lot of the hp laptops have a low battery life. Which hp laptop has the best battery life that can last for several hours?",
  "4k panels just for Youtube and web browsing? Hey there. I'm currently using an old Lenovo which has a FHD panel for the past 5 or so years. I'm planning on getting a new laptop and wanted to get one with a 4k panel on it but everywhere I look, it costs a pretty penny to upgrade from a FHD display. I'll be buying from Canada.\n\nI understand that getting a 4k display probably isn't that smart for battery life and probably won't give me that much oomph in terms of general use. I might play games but I understand that I need to lower my res to FHD to play games.\n\nOne of the main reasons I'm even considering a 4k display is because my brother has a MacBook and watching videos on his laptop is a treat. They just look more pleasant and crisper and this is why I wanted to get one for myself as well.\n\nI'm not entirely too sure on which laptop I should get yet. If I were to game, then I would need to get something stronger with a GTX 1070 or 1060 but might have to ditch the 4k panel. I'll be starting uni this year as well so I probably need something portable. In that case, I was thinking about the Surface Laptop 2 as it's cheaper and has good reviews but it's not customizable but I think that's fine. I probably won't need to change anything anyways and it has a nice display as well.\n\nI initially started this post asking about if  4k panels would be worth it for me and now I'm asking for suggestions as well. I won't use it for any heavy editing or programming or anything either. My budget is around 1500 CAD but I'm willing to go upto 2k if there's anything else truly worth it out there.",
  "Not sure on Canadian pricing, but the HP X360 15 has a 4k option that seems reasonable. T580, Yoga 900/910/920 refurbed.\n\nLenovo Yoga 720 15\" and the previous gen XPS 15 have quad core processors, nvidia 1050 and a 4k screen, again, if you can find them in your pricerange.\n\nSurface book 2 looks good as well.",
  "Stay away from HP, their laptops don't last. I'd go for something like the XPS 15 or Surfacebook. Surfacebook isn't true 4k last I checked though, it's slightly below, but you can't really tell on such a small screen. ",
  "Lenovo seems to have great laptops with good features at reasonable prices. I should look into them more. Also refurbished models, I'm worried about them being good in the long run. What if I face issues with them? I'll be buying the laptop and going out of Canada. So I'm worried about that as well. ",
  "I guess that's the best isn't it? Not true 4k which kills the battery....but crisp enough to be better than FHD. I've seen my brothers xps and while it's a great laptop, I've noticed that it has heat throttling while gaming which puts me off. How are Lenovo laptops? I've used one for the past 5 years and I like them. Any recommendations from them? ",
  "I've bought a couple of lenovo refurbs from third parties. Had an issue with one of them (screen ribbon cable), but sent it back to the original seller and they replaced it with no hassles. Both of them were ebay purchases.\n\nIf you're going in and out of the country, maybe ask the seller what the story is with an international warranty. Chances are that if it has issues it'll be when you first get it, and you can deal with it then and there. That's general advice I'd give for any refurbished laptop.\n\nDon't worry about the brand at all, I've had 6 lenovo laptops in my household for a little while, and while their track record hasn't been as good as Dell's sample size of two in my experience, they're a heck of a lot better than Acer and Apple :)",
  "I don't like Lenovo at all. Can't recommend them or HP. Acer is good though. Don't know if they have a 4k laptop though",
  "xps is not made for gaming, it does throttle. the same will happen with the yoga 720.\nif you want a 4k screen in a gaming capable laptop you will have to raise your budget. Or get a surfacebook which handles heat pretty well but drains power from the battery on high loads because the  brick can't deliver enough amps. I'm not sure if microsoft fixed this.\n",
  "Dell XPS, HP Spectre x360, or Razer options, ultraportables vs 15 inch models, trying to decide Sorry for the pseudo double-post since I also posted on Suggest-a-Laptop, but in this case I have three laptops that I've researched fairly extensively and want opinions regarding them specifically more so than a person sending me a link of laptops meeting my \"form\" specification.\n\n\\* \\*\\*Total budget and country of purchase:\\*\\*\n\nUSA. Ideally sub-$2k budget, but I could be convinced to spend more for a machine that will last longer, or combined with an eGPU or separate desktop later on.\n\n&#x200B;\n\n\\* \\*\\*Do you prefer a 2 in 1 form factor, good battery life or best specifications for the money? Pick or include any that apply.\\*\\*\n\nI don't care about 2 in 1, but my most recent computers have been a Surface Pro and then the late 2016 Razer Blade Stealth with touch. I absolutely cannot get another laptop/hybrid without a touch screen. I use it more than the trackpad. Before that, I used a Thinkpad joystick/nipple, so I've never felt comfortable with trackpads. I currently use my RBS with a mouse/monitor setup, or on my lap with a mix of trackpad and touch screen. Mostly touch.\n\n&#x200B;\n\n\\* \\*\\*How important is weight and thinness to you?\\*\\*\n\nPrior to the Surface Pro, I had an IBM and then a Lenovo Thinkpad. They started to feel too clunky when I started carrying my computer with me everywhere. I do value something slimmer, something in the ultrabook or lighter weight 15\". (E.G. XPS15, Razer Blade, but not a 17\", and not a fat ugly gaming rig).\n\n&#x200B;\n\n\\* \\*\\*Which OS do you require? Windows, Mac, Chrome OS, Linux.\\*\\*\n\nWindows\n\n&#x200B;\n\n\\* \\*\\*Do you have a preferred screen size? If indifferent, put N/A.\\*\\*\n\n13-15\"\n\n&#x200B;\n\n\\* \\*\\*Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.\\*\\*\n\nMostly general use, but also would like to be able to play some games, some AI use.\n\n&#x200B;\n\n\\* \\*\\*If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?\\*\\*\n\nWould be nice to hit at least 60fps for recent games at low-medium settings. Not required for the ultrabook, say, if I got another thin-and-light computer with Thunderbolt connectivity for an eGPU.\n\n&#x200B;\n\n\\* \\*\\*Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?\\*\\*\n\n\\-Portability: Ideally portable. Razer Blade 15 is about as heavy as I'm interested in.\n\n\\-Touch: Absolutely need touch-screen. As stated above.\n\n\\-Build quality: I've had some problems with recent computers, so I'm not sold on the idea that one company or another is or isn't great. My IBM Thinkpad after about 5 years of life had issues with overheating despite new thermal paste application (but probably lasted the longest). The Lenovo was never reliable. I switched to the Surface Pro... which was pretty great except for the charging adapter being absolutely terrible and not registering (which I noted with other users as well), and after getting a replacement that worked for some time... it also stopped working very well, and by then I'd run out of memory and wanted something with more I/O... so the Razer Blade Stealth had the expected issue of not registering the battery appropriately, and on day one I had to download a BIOS update (known issue I had seen in one of the reviews when I purchased the computer). I needed to send it in for an RMA due to constant freeze/buzzing issues (they told me they eventually replaced the motherboard). Recently it's been acting up making a loud crackling/buzzing noise (no freezing, not coil whine) that's probably related to the fan, but can go weeks at a time without issue... that's made me reticent to bring my poor computer out in public... Basically I've had a bad experience with Razer, but then again, I've not had the best experience with Microsoft or Lenovo either. Hopefully just bad luck, and the next computer will be a bit luckier...\n\n\\-Ports: I need Thunderbolt since I want the option for an eGPU or a Thunderbolt dock. In the past I've tried a regular USB dock with past computers, and there was too much lag to make it useful. I also want more ports than what Microsoft is offering with any of their new offerings. If they had come up with a Surface Book 3 with updated hardware, I would have been interested. At minimum, I don't want to lose ports (currently USB-C + 2x USB-A and HDMI). XPS 2 in 1 feels ridiculous. One charging USB-C, and one to plug things into. XPS 13 laptop is essentially a step backwards with one USB-C used for charging, one to replace HDMI, would then leave me with one fewer USB port available. Probably fine to get a dock, giving me two USB ports. Spectre 13 similarly loses me a USB port if I didn't have a dock. The new RBS keeps ports, but has other drawbacks. The alternative is getting a 15\" model but losing portability in favor of power and ports.\n\n\\-Memory: I need at least 512GB, preferably NVMe SSD. Would like 16GB+ for RAM, especially for the 13\" models as RAM is usually not upgradeable.\n\n\\-Display: My perfect laptop doesn't exist. If I get a 13\", I don't need to sacrifice battery for 4k since I can't tell the difference anyway, but the only touch options at this size seem to be 4k displays. Meh.\n\n&#x200B;\n\n\\* \\*\\*Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.\\*\\*\n\nI THINK I've narrowed my list down to two categories, and three options within each (Razer, HP Spectre x360, or Dell XPS):\n\n1. Ultra-portable with plan for a secondary Thunderbolt dock or eGPU\n2. 15\" that still maintains some portability.\n\nUltra-portable:\n\n1. Razer Blade Stealth late 2019:\n   1. Don't lose any ports, maintain a light form factor with improvement in bezels, and actually increased power that would still allow \"light\" gaming.\n   2. The GTX1650 is fine... but comes at the cost of 15w for the CPU, basically throttling the CPU in favor of having a decent GPU. I'm not sure the extra price is worth what really isn't a gaming machine. (Comes in at $1900)\n   3. Honestly would be happy to get an Iris Plus Graphics model, would LOVE Mercury White... but those options are either NOT touch-screen or not 512GB for the SSD. Cheapest touch option (if I am understanding the Razer site) is an MX150 with 8th gen CPU and 4k panel for $1700, and it just doesn't seem to make sense to pay so much for an \"older\" model with a weaker GPU, though true it is an actual dedicated GPU.\n   4. Doesn't have microSD (though I haven't felt like I \"needed\" it as long as I have enough local memory and cloud options).\n2. Dell XPS 13 or XPS 13 2-in-1\n   1. Minimal ports. Boo. But could dock it.\n   2. XPS 13 has the \"other\" Intel 10th gen CPU, so maybe not as optimized for minor graphics/AI? However, it is 6-core, so maybe more powerful. The 2-in-1 uses Iris Plus but is even MORE limited in ports. I am fine with a touch laptop, but if equally viable, I'd go for one that can do full double duty as a hybrid. Again, supposing I use a dock, the port issue is fine? This all assumes that Thunderbolt docks work reasonably well without the lag I've experienced with \"regular\" USB docks.\n   3. XPS 2-in-1 seems to have a non-4k option, which might save some battery life and price.\n   4. Quality control issues?\n3. HP Spectre x360 13, late 2019\n   1. This is what I'm leaning toward. Also lose a port (like the XPS 13), but better than the XPS 2-in-1 and in a similar form factor, with a sleek almost bezel-less design. Would have to dock. Coming in at $1500, so pretty much the cheapest option (or about tied with the XPS13).\n   2. Comes with a pen! lol\n   3. I am having trouble determining if the CPU has 15w or 25w (Iris Plus version of 10th gen). Also not sure if the SSD is NVMe?\n   4. Like the others, only 4k options, though people seem to like the screen, and if the non-touch can reach 22hours (company testing conditions), then the OLED should probably still have reasonable battery life.\n   5. Quality control issues?\n\n15\"\n\n1. Razer Blade 15\n   1. As much as I want one of these, I can't really justify paying $3100 for the cheapest touch option. Unless there's some non-4k, or non-GTX2080 configuration I can get, anything reasonably priced is non-touch. I don't need a fantastic video card, but in the 15\" model, I do want a usable GPU. The reasonably priced ($1700-1800 options) have GTX1060Ti or 2060, but sadly no touch screen. Even with older models.\n   2. Anyone see a perfect Blade out there?\n2. HP Spectre x360 15\n   1. As much as I like the 13 inch model, I haven't really seen any reviews online for the new 15 inch model.\n   2. This is the only 2-in-1 15\" option I'm currently looking at.\n   3. $1700 (or possibly $1530 with discounts), this is the cheapest 15\" model I see among those I'm looking at most closely. However, the GPU seems to be sacrificed, with MX250 as the option.\n3. Dell XPS 15\n   1. This is probably the one I would lean toward. For $2k I could get 32GB RAM and 1TB SSD, lots of ports, GTX1650, touch, on a 6-core 9th gen CPU.\n\nSo basically looking at any experiences people have had with any of the above options. Would love to hear how the new Spectre is working out, if you found a better Razer configuration, if you've had QC issues with Dell or HP or Razer, what you might lean toward. I'm also open to other ideas (I haven't looked too deeply at the Lenovo Yoga models, for instance). I love the Surface lineup in general, but I feel like I'm probably getting more for my money with these options... though it would be nice to have an actual brick-and-mortar option for when any problems arise. Thanks in advance to anyone who reads this!",
  "Thats an essay😂\n\nWhich one did you end up choosing",
  "So far none. Still using my RBS late 2016 lol.",
  "Oh wow. It lasted u long. Thought razer products do t last",
  "Is the Lenovo 330s a good replacement for my old MacBook pro? I had a MacBook pro 13\" 2018 no touch bar since last August which I was pretty happy with but, a series of unfortunate events ended in me having to sell it for parts due to an accident that couldn't be fixed. I am still in quite a lot of debt for this laptop and have been looking for a cheaper replacement that can fulfill my needs. I am a recent design graduate and require a laptop that will be able to run photoshop and indesign smoothly (light/medium use) for my illustration work.\n\nYesterday I bought a Lenovo 330s from John Lewis after having spent hours looking at other laptops and considering more expensive options (like the Lenovo Yoga), I settled on the 330 because the screen resolution looked good, the build felt decent and the specs seemed promising. It has an intel core i5 processor, 8gb RAM and 128GB SSD (here is a link to the product: [https://www.johnlewis.com/lenovo-ideapad-330s-81f400e9uk-laptop-intel-core-i5-8gb-128gb-ssd-14-inch-full-hd-grey/p3655313#product-detail--reviews](https://www.johnlewis.com/lenovo-ideapad-330s-81f400e9uk-laptop-intel-core-i5-8gb-128gb-ssd-14-inch-full-hd-grey/p3655313#product-detail--reviews))\n\nOn many websites this laptop has been categorised as an 'everyday' laptop, for surfing the web, writing e-mails and streaming videos, however I have noticed that some of the laptops that are more expensive and considered 'premium' have the same or similar specs, only more bells and whistles which I don't need (finger touch log-in, touch screen, backlit keyboard, etc). Shall I stick with the Lenovo 330s or do you think my photoshop tasks will be asking too much from this humble device? Or should I return it and spend a few more hundred on a premium laptop like the Asus Zenbook?\n\n&#x200B;\n\nThanks\n\n&#x200B;",
  "There's a slight issue with the 330s if you're planning on doing graphic design - it has a very mediocre screen [sRGB coverage](https://www.notebookcheck.net/Lenovo-IdeaPad-330S-15IKB-i5-8250U-UHD620-Laptop-Review.332226.0.html#toc-display-ideapad-330s-with-a-full-hd-panel), i.e. the amount of colours that can be reproduced by the screen. sRGB is considered the \"consumer\" standard, and AdobeRGB is the \"professional\" standard, of which it only covers 38%. This means anything you do involving colours will not be possible, since a lot of them simply won't look any different from one another on that screen. Unless you have (or buy) a desktop monitor that has the proper colour space coverage, I'd go with a more premium laptop. Things like screen or speaker quality are why a lot of premium laptops are more expensive than regular laptops, even if they share internals.\n\nEdit: A good example of a laptop with excellent screen colour space is the [ThinkPad X1 Carbon](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-2018-WQHD-HDR-i7-Laptop-Review.284682.0.html#toc-display-wqhd-with-dolby-vision-hdr), although it is very expensive. I recommend using notebookcheck.net to find out about display values, their tests are usually quite accurate.",
  "No should be fine ",
  "Thanks for the advice, do you own or have first hand experience with the thinkpad x1 carbon yourself? ",
  "No, none at all, although I've had issues with low colour-space coverage screens before.",
  "Any Reviews for ASUS M580VD-EB76 VivoBook 15.6\" FHD, i7-7700HQ, 16GB, GTX 1050? Other than being a bit heavier and probably shorter battery life, this Asus Vivobook seems to have similar specs to the XPS 15 and Yoga 720:\n\nhttps://www.amazon.com/M580VD-EB76-VivoBook-Gaming-Multimedia-GeForce/dp/B071ZL3996/\n\nI'm thinking about getting an Aero 15 or XPS 15 for my next laptop as a developer and slightly more than occasional gamer who still wants the more professional aesthetic. Lighter is definitely better, but for half the price and maybe an extra half pound this might get the job done.\n\nAny reviews out there for this model? What would I be sacrificing here?",
  "There are no reviews for it yet. Based on the description and specs, it looks like a really good deal for the price. It would be competing with the Dell Inspiron 7567 and other budget GTX 1050 laptops, but with the premium styling and materials of the Zenbook line. \n\nSeveral previews and product listings show it with a TN panel, with the IPS display available for an optional charge. I would make sure wherever you buy it that you get the IPS version. \n\nIt also has a small-ish battery at 47Wh according to previews, so it's not going to have the battery life of the XPS 15 or Aero. \n\nIt also doesn't have TB3 for external graphics, but it does have USB 3.1 Type C for monitors and high speed transfers. \n\nSo overall, vs the XPS 15 and Aero:\n\n* Much smaller battery, definitely lower battery life\n\n* No TB3\n\n* No RGB keyboard like the Aero\n\n* Screen is not color accurate like the Dell XPS 15 and the Aero\n\n* Base model offers TN display instead of IPS display\n\n* Unknown if the keyboard/chassis has a lot of flex like some of the other recent ASUS models - seems likely given the price point and components - the XPS does not have this issue. \n\nOverall, for the price, it seems very compelling if you can get the IPS display option and deal with, say 5-7 hours of battery life instead of 8-13 hours, and you don't mind the lack of TB3. ",
  "$800 model: 15.6\" Full HD, anti-glare display\n$1000 model: 15.6\" Full HD color rich, anti-glare display\nI would speculate that the first one has a 45%NTSC IPS or TN panel, and the second one has a 72%NTSC IPS panel.\n\nThe second config is a better deal overall. Some companies charge $200 for the i7 upgrade alone.",
  "Thanks for the in-depth comparisons! Since this is my laptop for the next 4-5 years I'll probably go for the Aero or XPS, just seemed strange I hadn't seen this more given the hardware specs for the price.",
  "You sure the 2nd one with gtx 1050 4gb vram and i7 has IPS? because it doesn't say so",
  "You're basically paying $200 for i7, 8GB Ram, 1Tb HDD and potentially IPS.",
  "On the Asus webpage lists four types of panels, the only TN one is 45% NTSC. Plus it's really rare to find a 72% NTSC TN nowadays.",
  "And 2GB VRAM",
  "14\" IPS Matte Display, 8 GB RAM, 256 SSD, No PWM - under $1k Cdn? Looking for a 14\" laptop in Canada under $1k (I do have student discounts) that has 8 GB RAM, a 256 SSD, and most likely an i5 in this price range. Having a maete (non-glossy) IPS screen is important to me. I know the Acer Swift 3 has PWM so I'm not considering that because I have a problem with headaches anyways.\n\nBest one with those specs looks to be the Lenovo ThinkBOOK 14S so far for around $800ish after discounts but it has no proper reviews and is the first edition from that line so I'm wary of getting that.",
  "Honestly i'd hit up the used market on kijiji. its easy to find a 1 year old or less laptop that has 2 years warranty left and you'l save a good 200 dollars or more. 1000 dollars for a 14 inch laptop with no dedicated graphics card is kind of a rip off in my opinion.",
  "Surface Book with performance Base OR HP Spectre x360 (15\" Inch) oR Lenovo yoga 720 (15\")? * **Total budget and country of purchase:** \nBudget is around $2000 US, maybe just under. The Surface Book is significantly more expensive than the other two but it is not completely out of the question. I live in Dubai, but I could get things shipped from the US so the country of purchase doesn't matter too much.\n\n* **Do you prefer a 2 in 1 form factor, good battery life or best specifications to your requirements for the money? Pick or include any that apply.** \nAll of the above. A 2 in 1 form factor is necessary. \n* **How important is weight to you?**\nNot too much, I'll be drawing in tablet mode, so as long as it's not unusually heavy I don't mind.\n\n* **Which OS do you require? Windows, Linux, Mac.**\nWindows.\n\n* **Do you have a preferred screen size? If indifferent, put N/A.** \nN/A\n\n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run. If you have no requirements, put N/A.** \nYes, I'll be doing video and photo editing as well as casual gaming. I'd run things such as Photoshop, Illustrator, Premiere Pro - etc. And as for gaming, it wouldn't be anything too heavy, likely things such as Sims, City Skylines and Overwatch. \n\n* **If you're gaming (leave blank if you put N/A above...), do you have certain games you want to play? At what settings and FPS do you want?** \nGames as stated above, medium-(fairly)high settings for gaming.\n\n* **Any specific requirements such as good keyboard, reliable business grade build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** \nTouch screen and good build quality.\n\n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**\nI'm 17 years old, and my current laptop (2013 Macbook Pro 13\" with minimal specs) is screwed. The screen is really damaged and it's best for me to get a new laptop rather than dish out money to fix this screen. From using this laptop, I realised that I need something with much better memory, RAM and a better graphics card. Also, I want to get into film-making, as well as improve my illustration (this is why I want something that converts into a tablet and is touch screen) and graphic design work, as well as something that works well for casual gaming, so I need something that is able to do these thing smoothly. I think a Surface Book is ideal for my requirements, but it's expensive. I like the detachable screen and the design, and I think specs are enough for what I want to do with it - the price is an issue however due to the fact that I want to get something preferably by July, and I might not be able to get enough money for it by then. The HP Spectre x360 also looks really appealing and it's well within my budget, but my worry is that the graphics card may not be that great for editing and casual gaming, and HP has a bad rep when it comes to hardware issues and thermal throttling, so that's what's holding me back. But the display for the Spectre is great and while the size doesn't matter too much to me, it's nice to have a bigger screen; I can get a lot more for my money if I get the Spectre. Both of these come with a pen and are also sexy as hell. There's also the Lenovo Yoga 720, and while i haven't looked too much into it, it also seems pretty good (although it's not as sexy but that's superficial) but I haven't seen too many reviews on it so I can't make a good judgement. All of these laptops I would buy with 16GB/512GB. What do you guys think?\n\nEDIT: I'd like to apologise for the weird-ass title.",
  "[deleted]",
  "How do you know it's that bad? There aren't really any reviews around yet, except from some reddit users who already have the 720 and are doing AMAs. ",
  "Didn't know that about the 720 screen, I was about to buy a 15 inch in 1080p with the GPU. Is it gamebreakingly bad? Or just not as bright?",
  "[deleted]",
  "Well, people's opinions seem to vary - some love it, some say it's average or bad. It's not been released in the UK so can't see it for myself yet and there are no reviews on the big sites. I'll wait until a few reviews have been released, then I'll make up my mind\n\nEdit: the people who like the screen might be the ones with the 4k version"
]