[
  "Lenovo Slim 7i Aura Edition review. Too many flaws. Recently received my new Lenovo Slim 7i Aura Edition and have been putting it through it's paces. I ordered a custom 258V 1tb spec from Lenovo. Shipping was fast, packaging is about as barebones as it gets with the charger just flailing around in there, but it arrived in one piece so yay I guess.\n\nSome context: Currently use an X1 Carbon G6 because every new laptop I buy is generally flawed or has issues, prompting me to keep my trusty ThinkPad. Recent attempts at upgrading are as follows:\n\n* Surface laptop 4: Pretty good, but had issues with WiFi and Bluetooth constantly dropping, and random restarts. Sold it after a bit.\n* Lenovo Slim 7 pro X: Great machine but had two major issues: System would occasionally lock up when the 3050 was enabled in the bios, disabling it fixed the lockups. Also, there seemed to be an issue with nvram causing the laptop to fail to boot numerous times.\n* Lenovo Slim pro 7 - Excellent machine, literally zero issues. Truly a unicorn. The build quality was terrible, and thus I returned it. Decent aluminum enclosure, but cheap plastic interior with plastic hinges. Honestly wish I kept it after this.\n* Surface Laptop 7 - Excellent laptop. ARM64 turned out to be a larger issue for me than I thought. Sold it and stuck with X86. A few pretty minor issues but otherwise the best windows laptop available right now imo.\n\nLets get into the Aura.\n\n**Build quality** - It's alright. Typical thin relatively cheap aluminum exterior with an internal frame to keep everything together. Luckily the frame is made of magnesium alloy this time instead of plastic like the slim pro 7. Durability concerns are no more. Port cutouts are somewhat sharp, and you can see inside the laptop from the cutouts. Some ports are slightly misaligned, but everything fits. Certainly not as premium as a surface or a mac, but it'll do. Hinge feels fine, trackpad is installed firm with no rattle. I hate the \"YOGA\" text on the palmrest. It's clearly shiny plastic inserts stuck into a cutout, and not very well mind you, with the text slightly misaligned. It just looks a bit cheap. Overall, it's well built enough for most people to be happy, but it's nowhere near some of it's competitors.\n\n**Display -** Mostly very good. Very bright, very colorful, great pixel density, 120hz, good touch implementation, and completely free of defects. It's not all great though. I generally prefer IPS panels, but the contrast on this one doesn't cut it. All IPS panels have IPS glow, but this one has the worst case of glow I've ever seen. It's even noticeable looking at it straight on, making the panel look almost TN at times. This paired with the relatively poor AR coating create a sub bar display for darker content. It's not terrible, but quite noticeably worse than any typical IPS. Note there is likely a display lottery here, so you're mileage may vary.\n\n**Trackpad / keyboard -** The touchpad is unfortunately not haptic, but it's a very good traditional unit. Smooth surface with a tactile and satisfying click. Feels responsive (when it's working, more on that later), gestures work great, at least as good as they can in W11. Keyboard is excellent, ThinkPad level. Wonderful tactility and travel. The keys also have a soft touch finish to them which feels great. Backlighting is uniform and consistent, if not a little too bright on it's dimmest setting.\n\n**Speakers -** Completely blown away by these. Most windows machines have pretty bad speakers in my experience, but these are excellent. Definitely a bit bass heavy, but no distortion at normal volume levels. They sound full and mostly clear, could do with a bit more midrange. Head and shoulders above any windows machine I've ever used, period.\n\n**Performance / noise -** A little disappointed in the noise output. No complaints with performance, Lunar Lake delivers on what I expected, but the fans are just too noticeable for my taste. Don't get me wrong, huge improvement from my mini jet engine X1C G6 with 8650u when docked, but it's not nearly as quiet as I was hoping for. When docked to my desktop setup via Thunderbolt at 4k 120hz, the fans are frequently noticeable, especially with heavy multitasking. Even unplugged opening a few chrome tabs or an application or two will get the fans to spin up. The system is not hot or even warm really, it's just overly aggressive fan tuning by Lenovo it seems.\n\n**Miscellaneous / software -** WiFi seems to work flawlessly thus far. No dropping of connections, connects upon waking, etc. Bluetooth on the other hand is a little flaky. Occasionally I will hear Bluetooth artifacts and glitches upon moving apart from the laptop. Windows came with some bloat including McAfee, but all was easy to get rid of. Windows hello has been mostly reliable, minus when the system fails to activate the camera and I have to resort to a passcode.\n\nI had a lot of trouble getting reliable video output from this thing with my external monitor being the only and primary display. New display drivers and fiddling around with color settings in Intel control panel seemingly at random allowed me to get reliable 4k 120hz YCbCr 444. No specific setting did the trick, it seems to be a bit broken at the moment. Adding on to the state of Intel software, every time I reboot this thing, Intel graphics control panel decides it wants to set custom colors for me that dramatically darken the display, prompting me to go in and reset all color settings. Tried different drivers among other things to no avail. Very strange issue.\n\n**Phantom touches -** Frequently the touchscreen will activate phantom touches in the bottom right corner, possibly because my primary interaction with the screen is with the quick settings for brightness control. This seems to be especially frequent upon waking from sleep, often making the laptop unusable for up to a minute. Sometimes quick settings or hidden icons tray will pop up randomly as I'm working. Extremely annoying.\n\n**The dealbreakers -** I don't know about you, but I prefer my touchpad to work properly. I mean that cant be too much to ask right? Well, either Lenovo has implemented some sort of braindead power saving feature, or there is some sort of driver / hardware issue. After a period of inactivity, like say 1-3 minutes, the trackpad will frequently enter a \"sleep\" state, and not respond to inputs until it has had a second or two to wake up. Sometimes it takes up to around 10 seconds to wake up, which is extremely annoying. I've tried a few fixes for this, including disabling the touch screen to avoid phantom touches, but the issue persists.\n\nNever experienced anything like this. Leads me to believe there may be something wrong with my touchpad hardware. Even if it is a hardware issue, I'd honestly rather not give Lenovo's QC lottery another shot. Besides, we already have issues with the touchscreen, windows hello, and flaky Intel software, while the Slim Pro 7 I tried was literally flawless. Lenovo can make a good computer, but this isn't one of them, at least mine isn't.\n\n**Conclusion -** I really wanted this to be good. It has massive potential to be the best X86 Windows machine with an LCD. But the buggy touchpad alone is a dealbreaker, not to mention the other quirks. Regardless, I'm not keen on trying a replacement. Will update the post if I manage to fix the trackpad or touchscreen before returning it.\n\n**Edit:** I clean installed Windows 11 today in hopes of fixing the trackpad issues. Only bare essential drivers installed. The system feels much faster now, and no random spinning blue wheel by the cursor, but the trackpad issue persists. Looks like it's going back.\n\n**Edit #2:** For those PWM or dithering sensitive, this section is for you. It seems the Aura causes pretty bad eye strain when used for over 20 to 30 minutes at time for me. The feeling is very similar to any modern MacBook, pressure in sinuses, headache, etc. It's likely temporal dithering, as the IPS panel is PWM free. It affects external monitors too, which points to the iGPU being the issue. 8 bit color depth from the default 10 in Intel control panel does not help. I tried using \"Ditherig\" software to disable dithering, and while it does have an effect on dithering / color banding, the strain remains.",
  "Wanted to come back to the thread and say I actually really like the Yoga Aura. No phantom touch for me. Trackpad works great. And no blue wheel issue. I also never turn on any \"send data analytics update\". So that might be what's causing the blue wheel. I daily drive with a MacBook Pro, and this is probably one of the best Mac equivalent in the windows world so far. Surface laptop 7 is great too, but I enjoy the higher resolution on the Aura and the worry free for compatibility issue.",
  "\\-- Update 03.08.25: The display started doing weird things, half of it goes dark and then comes back. Getting worse by the day. Also the hinge is starting to show worrying wear and tear. I don't do anything out of the ordinary with the laptop, quite the opposite, I take good care of it and goes into a backpack that is well padded. So not as sturdy as I initially thought. Another thing to note is that the warranty is not international, so I'll have to fix it out of my pocket and void the warranty, or make do with half the screen :/ --\n\n\n\nI'll leave my experience with it after a few days of use, coming from an xps 9500 btw.  \nI agree with there are too many things that separate this laptop from a great laptop. All in all it works well but I feel there is a con for every pro.\n\n\\- Build quality is good, it's super thin but sturdy, my only complain is the bleeding keyboard light. It's pretty anoying and looks dated. From a certain angle it shines straight to your eyes, and at night when you are watching something in bed it's really annoying. Also I thought I wouldn't mind that it can't be open with one finger but it takes away from the experience.\n\n\\- Display is really reflective. with a dark background it becomes a problem. I tried the g16 2024 and is way less reflective than this. The resolution and colors are really nice though and it reads well, also there is 0 light bleed. But oled is just miles better (again the g16). The contrast is good for an ips but the viewing angles could be better. When watching movie you want to be looking at it completely straight or the blacks become clearly grays.If it werent for the reflexions I would say it's a 8 out of 10, but it gets a 7.\n\n\\- keyboard: It's good (not thinkpad level). Other than the annoying lighting, I am more than satisfied.\n\n\\- Trackpad is ok. It works, but it freezes for a fraction of a second when you click, which is really annoying. It is also pretty loud, and a bit small for the times we live in. Serviceable but you miss the mouse.\n\n\\- Speakes: Meh. I recently tried the yoga pro 9i and those are awesome. The g16's are even better, they blow you away with their quality. These are ok unless except when you hear them side by side with some other good laptop speakers. even my old xps sounds better. They seem to sound good at first because of the base and the volume, but there is something in the sound that makes you want to stop the music or lower the volume after listening for 10 min. Sound signature is terrible, too much base, lacking mids, and ok highs. Also poor stereo separation. The music option in the dolby app produces the most pleasing sounds.\n\n\\- Performance: nice so far, pretty snappy. I didn't ask much of it yet though. Scrolling on the browser results in frequent stutters though. This is suprising because It was completely smooth on the G16 with the core ultra 9, which packs a weaker igpu.\n\n\\- Battery: I think is an old day no prob laptop, it's great.\n\n\\- Fan noise: It's being good so far, for simple tasks, even coding with copilot, I can't hear the fans. When you push it a bit they quickly come in, but they are not loud and they quickly stop again. For my use case is mostly silent.\n\nupdate: While the fans are not loud they have a pulsating very high pitch that drills into your ear when the laptop is raised.\n\n\\- Wifi: weak reception. In the same spot the g16 get's 400mb, this only gets 250mb. It's pretty dissapointing.\n\nI think it's a good laptop, just over 400€ overpriced (in Europe is 1700€ after taxes).",
  "Can someone who owns the laptop do me a massive favour (e.g. u/richb0y or u/Mammoth-Material3161, or u/AetherSprite970 if you still have the laptop) and see if the screen is visible while wearing polarized sunglasses? When viewing the screen with sunglasses on, it might be completely black, completely fine, or more dim (in this latter case, it'll probably be completely black if you tilt your head 45 degrees).\n\n  \nThe TL;DR of this is that the light emitted by LCD screens is polarized apparently, and if it's polarized horizontally it will be completely blocked by polarized sunglasses. If it's polarized vertically the screen will appear at full brightness with sunglasses on. \n\n  \nThanks so much!!",
  "Best review on this model out there. Those youtube reviewers should take notes.\n\nI returned mine as well for similar reasons. Here are my observations:\n\n1. Fans are very aggressive and run even if you open two chrome tabs and watch a youtube video. This applies even in battery saver mode. Fans are not quiet either.\n2. This is one of the first laptops that actually stays cool in lap and at worst gets warm but never hot to touch. So that single sided PCB and cooling is working. Battery life is easily 11 hours for Wifi youtube streaming.\n3. There is a blue spinning wheel next to mouse cursor that appears 75% of the time you are using laptop. I don't know if it is Lenovo's \"AI Core\" learning usage patterns or some other software/firmware bug but it makes you feel there is a malware or background windows updates at all times. And whenever there is something loading like a tab/video, you wonder if it is because of this or just the low power LNL chip.\n4. IPS Screen has 100% perfect colors but the overly reflective screen makes the blacks look brown and induces a \"glow\" at all times. Slightest change of angle and you get cloudy appearance in any dark part of the video/scene you are watching. For comparison, I have an X1 extreme from several years back and it has a matte IPS which has better blacks than this Aura! Also have an OLED laptop so a little spoiled when it comes to contrast/blacks.\n5. Build quality is good, not as good as XPS or Thinkpad, but very acceptable. The only Flex you get is towards the back on the bottom cover. Someone above mentioned the backlight gap being too big on function keys and I agree. Speakers are really good too but make sure Dolby Atmos is enabled for the best sound.\n6. Most tasks are snappy and you get quick responses when you open a file explorer window or a Chrome tab. However, if you have multiple windows open for streaming video I noticed that it is unable to keep streams active in all windows. You have to refresh the window/tab to reinitiate a stream. I am on 300Mbps connection and each stream is only 3Mbps max. I did not have this issue on my Proart but that uses a Mediatek WLAN card but both are Wifi 7.\n7. I have read several people had trackpad/touchpad becoming unresponsive issue (after a few mins of idling) but I didn't have this issue. I did do a clean Win11 install and was surprised that the trackpad or touchscreen did not work throughout the install!! I had to install the drivers for these to work which was a bit of a surprise. Another surprise was that the Blue spinning wheel issue came back on a fresh Windows install that had all Windows updates and drivers !! Not a fan of this spinning wheel and think it must be some Lenovo AI core thing in the background as there is a chip with this name inside the laptop!\n8. Full size 2280 M.2 single sided SSD barely fits in the laptop and even though I could close the bottom cover, I wouldn't recommend doing so as the 2242 SSD screw holder sits halfway and is very very close to the SSD surface and may even be touching slightly. Also, you DO feel very small bulge on the bottom cover after doing so. Probably that's why Lenovo didn't ship it with a 2280. I would rather get a TLC 2230 and extender.\n\nSo yes, very good slim/light laptop overall, 15.3\" screen size is perfect too, though I hope these spinning wheel, fan noise, trackpad issues are all software related and get a quick fix from Lenovo. But I returned mine and using the Proart P16 now instead.",
  "This is why I'm planning to upgrade my X1 carbon g5 to g13. It will be expensive, but it will be worth it I hope.",
  "i have one, i love it and find it enjoyable but im not a lappy connoisseur like you ive only had desktops for last decade, i will monitor this touchpad thing and touchscreen issue, but i use a bt mouse mostly, and i dont have this glow on the screen, or not that i notice, everything else seems manageable\n\ntry one more replacement, what other options are there right now? i dont think it looks or feels cheap. i like same things as you, the usb c on both sides, i like the weight and solid feel, the shiny bright screen, speakers, fast solid bt and wifi, keyboard, low bloatware, amazing battery and playing gta v\n\nmy bt 5.3/4 can let me use my earphones all the way in the shower room which i couldnt do with my previous 5.1 or whatever, thats big life immprovement for me\n\ni feel the top function row of keys the backlight bleeds through the bottom of the row a bit much depending on angle but not a big deal",
  "This is a very interesting review. Currently not many reviews for this model. Have you got chance to try other Lunar Lake models?",
  "Nice review! Would you mind sharing how the Aura's screen compares to the SL7 you previously had? And how the fan noise in the SL7 was for you in the same setup you mentioned with external monitor?",
  "Thanks for this insightful review.\nRegarding the fan noise, is it possible to use tpfancontrol (or more recent) to customise it ? On both T15 (Gen 1) and L14 they work well to start the fan sooner than the firmware does, but I do not know whether it is possible to delay the fan startup...\nThanks,\nP.S. : additional question : what is the lowest rpm that tpfancontrol can achieve ?",
  "I noticed a big difference in performance after uninstalling the bloatware. Battery is great, response is snappy, touchpad is fine, not great, screen is lovely. Does everything I need it to do but couldn’t handle Spotify for some reason. Took up all the cpu and memory and crashed the computer. Got rid of it and everything has been great since. Best non Mac I’ve ever owned, and I think the x1 carbon will be better in terms of build quality but couldn’t see myself doubling the cost for materials and same specs. \n\nAll in all, a very solid, reliable piece of equipment.",
  "Mcafee first and foremost; I just went to the “apps” section on settings under uninstall and just went through and took out pretty much everything that wasn’t a basic windows app, office, or adobe.",
  "This video at 13:46 shows a comparison of the samsung to the lenovo.    \n  \n[https://youtu.be/QEqUApgKORE?si=Ws\\_bv7gcFVM9QKzm&t=826](https://youtu.be/QEqUApgKORE?si=Ws_bv7gcFVM9QKzm&t=826)\n\nThat lenovo really has a highly reflective screen.   Not sure how it is in actual practice.",
  "[removed]",
  "MacBook Air 15 vs surface pro",
  "[deleted]",
  "I using the slim 7i Aura since 3 weeks and didnt had any phantom touches and problems with the touchpad. also no blue wheel.  \nBut I had a couple of problems since then:\n\n\\- my right usb c port didnt work for a week or two. no charging, data transfer and video transfer. But since a week its working again and I didnt do any update or windows reinstalling\n\n\\- it happened 3-4 times that in standby mode the laptop didnt wake up again. even on pressing on the power button. So I had to force shutting it down. Also the laptop self shut down in standby mode e.g. overnight or for a couple of hours not of use\n\nCasual gaming like Valorant is working good and the 15'' IPS panel so far is great! also the thin and lightweight build.\n\nBut Im not 100% sure if I want to keep it. Im considering a laptop with grafic card for casual gaming.\n\nMaybe someone has a recommendation?\n\nAlso is there a good solution with a anti flare screen protector and still possible using the touchscreen well?",
  "I just bought this a week ago and I was having issues with the laptop just locking up and freezing at random times. So I tried a clean Windows install using the drivers for my specific unit from Lenovo's support pages. Still, it continues to randomly lock up completely to the point that I can't do anything besides move the mouse around. I really like this laptop but this is not going to work for me.  I even thought maybe it was an Intel GPU driver issue so I grabbed the latest drivers form their site and still, it locks up.  I can return it until January 2025 so I might hold off in hopes that they release some better drivers.  \n\nOh and I do like the build quality except for the bottom panel that flexes way to much. They could have made it a bit thicker and it would have been much better. Every time I lift it up I can feel the bottom panel squeeze in.\n\nThanks for your review.",
  "As a recent buyer, who has been using the laptop for 3 weeks, I must say I disagree. The screen is great, vibrant and with great blacks, despite being a IPS screen. Yes it is glossy, but I haven't had any issues viewing content on this laptop.\n\nAudio is loud and audio quality is great.\n\nFor my moderate use of office meetings on Google Meet, Slack, Google workspace + 2 hours of average video streaming + Browsing, it usually lasts 8 hours when charged up to 80%. So, I only charge once a day. I am not a gamer or content editor.\n\nThe keyboard is great and the touchpad, although not haptic, is sensitive enough.\n\nThe performance is general is snappy. I do occasional programming, and I usually have 10 tabs open on browser + Slack. I see no lags in most cases. However, on a couple of occasions, I have found the browser got hung up. I am not sure if this was due to the laptop or the page that I was browsing. \n\nI have not encountered the blue mouse wheel either. \n\nLooks wise, this laptop is aesthetically great. Screen size and weight have a great balance in my opinion. Portability should not be a problem with this one.\n\nWindows Hello + some basic Lenovo AI stuff like detecting whether I have moved away from the laptop, are great features too.\n\nIf I had to criticise, I would say that the camera is just average.\n\nIn the UK, the price has dropped sub £1200...give a few months more...it will drop to £1100.",
  "For me, the biggest issues so far:\n\n1. Occasional phantom touches - similar to the OP\n\n2. eGPU compatibility (GPD G1) - it used to work with meteor lake laptop which I had (YogaBook 9i). Now I am not able to make it work stably with the aura. It will work for a minute or 2, then it will start to get disconnected, sadly.",
  "  \nI have had this laptop for a week. I have updated everything that needed updating (Windows and all relevant drivers). Everything is fine except for the Wi-Fi, which is very slow. I usually connect it to my phone’s hotspot (an S23 Ultra), and when I tested it with Ookla Speedtest, the download speed never exceeded 180 kb/s (0.18 Mb/s), while the upload speed reached up to 4 Mb/s. It’s been so bad that I couldn’t download files from OneDrive, nor have I been able to install Quick Share due to the slow speeds.\n\nI have downloaded and installed the latest drivers from the Lenovo website and followed various troubleshooting steps (including disabling IPv6, resetting the Wi-Fi driver, restarting, etc.). The connection was so poor that I couldn’t even complete the online Lenovo hardware self-diagnosis.\n\nWhat can I do? I bought this from BestBuy in the U.S., but I’m currently not in the United States. While returning it is not impossible, it would be very difficult, and I would prefer to resolve the issue without having to return it.",
  "It's not uncommon for Lenovo to list the same models next to each other with one being massively discounted!",
  "@[AetherSprite970](https://www.reddit.com/user/AetherSprite970/) Thank you for your excellent and thorough review. \n\nBased on your review, I contacted Lenovo and have confirmation that this laptop uses PWM, but does not use dithering. I will not be buying this laptop!\n\nThe Lenovo Yoga 9i 2-in-1 14in (2024) does not use either PWM or dithering.",
  "The PWM or dithering issue scares me from buying this laptop. Does anyone know if it's really an issue? I've read some other reviews of this laptop where this is not mentioned at all. Also does anyone know if the Asus Zenbook s 14 has a PWM or dithering issue? Thanks!",
  "I also am experiencing ghost touches too. Is it worth returning it over.",
  "u/AetherSprite970 Your reviews are excellent and so helpful. Thank you! As a person constantly suffering from eye strain, you've made me aware of the importance of looking beyond just the basic screen specs. In this case, this laptop is an absolute no-go for me based on your experience. I am wondering if iPads suffer from the same problem. I always thought my iPad Pro M1 should give me the most pleasant viewing experience of all my devices, but after just 10 minutes, my eyes hurt like crazy. Is it possible that modern iPads can cause eye strain too?",
  "regarding the Surface Laptop 7, why do you say that arm64 was a too big obstacle? because of some specific application?",
  "I bought this laptop couple of weeks ago. While i'm generally happy with the performance, there are a few annoying things:\n\nI've never had a 3+ hour battery life on a windows laptop with near 0 overheating/fan noise. But with this laptop, I'm consistently getting 10+ hours of battery life with power saver on doing daily dev work + youtube running in the background, everything is snappy and responsive. I can also do some mild gaming- the only time the fan revs up.\n\nNo complaints with the speaker. they're very good- loud and clear even if a little bass heavy.\n\nThe screen is very good but it's too reflective. If you have a bright work space with a lot of windows, you'll be very quickly annoyed by how reflective the screen is. But if you're indoors and in low light, this is an excellent screen.\n\nbiggest issues:\n\nI have the ghost touch issue- mine appear when battery is low- around 20%. There seems to  be a constant touch action on the bottom right where the windows time/date thingie is. I've disabled the touch screen since I really don't use it that much.\n\nAnd I also have the trackpad/touchpad issue- It's almost like if I don't use it for a couple of minutes, it gets disabled and I have to try and wake it up by pressing the left mouse button and moving the cursor around. sometimes the cursor moves but tapping on it doesn't click anything. I have to press the physical button to force a click. then it works as long as I use it continuously. gets annoying real quick.\n\nThis could've been a perfect laptop except for the above issues. And if anyone has solved the above issues i'd like to know how to fix it. (I tried bloat removal and even windows reinstall but the issue still persists)",
  "I ended up on a similar journey and settled for a Zenbook S14 on sale. Lenovo's support and broken shipping killed the company after the 7i Slim had system stability issues and would freeze up. ",
  "It has been over 5 months now --- is anyone able to provide an update ?\n\nAre these issues still a problem, or have software updates fixed the problems ?",
  "re the touch pad - i usually use a wireless mouse so not worried about that.\n\nGood report, i'm seriously looking at one, now using a HP Specter 360. its been good for 7 years but falling apart now, This Lenevo is getting good reviews.",
  "I just got the Lenovo Slim 7i 15.3\" Aura Edition.\n\nThe Bluetooth is abysmal.  I can pair all devices, but they will NOT STAY CONNECTED.\n\nThey will pair, then connect, then DISCONNECT.\n\nALL of them.\n\nI tried everything to no avail.\n\nI even installed the Intel Driver Update utility, and installed the official Intel drivers for the Display, Wifi, and Bluetooth.\n\nNope - the Bluetooth will simply NOT (stay) connected.\n\nIs this a Windows 11 issue, a Lenovo Hardware issue, or an Intel Software issue ????\n\nTons of people out there with this problem - and nobody has found the solution.\n\n(and by the way, yes, I went into the wifi and bluetooth devices and UN-selected the option to allow the computer to power down the devices to save power.)\n\nOther than that, the laptop works fine.",
  "Ya I think final thoughts are if you don’t primarily require windows that an apple MacBook Air is unassailable at this point by any competition. The hardware is on a different planet",
  "Thanks for the eyestrain section! Not a lot of people talk about this but I think more people than we think are affected by this.",
  "Any body used Samsung book5 Pro 360? any comprative review.",
  "man, it's not like trackpads are a new technology. Why is it so hit and miss with laptops?",
  "I've been thinking about getting this laptop, but I'm curious just what that ARC graphics chipset is capable of.  Has anyone by any chance tried any PCVR games for Twitch streaming on it?    \n  \nI know it obviously isn't meant for that.  I have a gaming PC for this purpose.  But I'd like to do some PCVR on this laptop while away even if it were a marginally painful and degraded experience.  Can it do it even at low settings?",
  "Gave up on windows. Mac won the game. Unless you are absolutely required to run windows in a way that cannot be done with an ARM chip, buy a Mac. Threw up my hands and got a MacBook Pro. Always works. Day three and battery is at 60%. What are we even talking about here",
  "Looking for a laptop and was considering this. What are some brands/models that are better than this? Would appreciate some recommendations.",
  "It’s bright, definitely glare but turned all the way up it is usable",
  "I own the yoga slim 7i aura and it is honestly the worst computer I have ever owned by far. It is super buggy. It crashes and randomly restarts regularly (about every other day). It has graphical glitches (I have seen screen tearing when doing simple things like scrolling a word document). Tons of audio glitches with headphones frequently disconnecting. It is honestly just a terrible computer overall. Worst computer purchase I have ever made by far. I would highly recommend against buying it based on my experience.",
  "I had it for 1 week now and i will return it. The touchpad issue is so bad and i havent seen this conversations before. First the fans are always on, even on energy saver, just chrome some tabs and they are on. Not crazy loud but they are on. I had Premium care and a technician support. the problem with the touchpad is in the bios \" intelligent cooling\", set it to \"perforamce\" and the touchpad wont sleep,  and works. negative is that the fans then are even more loud. at the end i sent it back and bought the sl7 arm, love it so far.",
  "I had the Yoga Slim 7i aura edition for 1 week and gonna return this crap.   \nLove the screen, performance and battery but slightly pressing on the middle of the keyboard deck shuts the laptop down as if it shorts itself. \n\n\\- Fan sounds like a 1.9tdi   \n\\- Screen flickers when volume up/down  \n\\- shorts itself when slightly pressing on middle of keyboard  \n\n\nVery good laptop for only $1200 CAD but too many flaws.",
  "What is the battery life like?",
  "It could match a MacBook Pro though, and still be a horrible laptop. For example, unless it's one of the newest MacBook pros, you might be used to an incredibly glossy screen that leads to a busted user experience if there are windows or uncontrolled lights nearby.\n\nMy M1 Max MacBook Pro was also incredibly laggy for things like window snapping and some other things where I couldn't get rid of the animation and you just have to wait for part of a second from time to time before you can do things.\n\nPretty amazing that it compares to a multi-thousand dollar laptop, but also multi-thousand dollar laptops these days can be pretty disgusting, or at least that has been my experience with the M1 Max, and some Windows laptops from Dell, Asus, and Framework being laggy with windows 11.\n\nMaybe it's just a software problem though and I shouldn't be comparing wildly inefficient operating systems like Mac OS and Windows 11 to things like debloated Windows 10 or Linux on a 12-year-old Thinkpad originally rated for 24 hours of battery life.",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "How do the speakers compare to the MBP?  Thx",
  "I currently have the G16 and the aura and when it comes to speaker quality, these two are pretty close. the G16 has a slightly fuller bass and slightly wider sound stage. In my opinion if the G16 are a 10, the Aura speakers are a 9.5. I also feel the browsing experience to be much better on the Aura. I experience more lag on the G16 and the fans kick on, the SOC can get too hot for the G16 to sit on the lap, even with light browsing. That being said the track pad on the G16 is better. while the keyboard on the Aura is much better",
  "I was thinking of buying this but it has way too much bass, since I listen to music a lot that's a dealbreaker for me. Also, the bass resonates across the laptop body which creates a weird sensation if you're typing while listening to music. I tried adjusting equalizer in dolby software but still couldn't get the sound right. Did you find a solution to eliminate bass (so chassis doesn't resonate) and music becomes clear?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "I just did, looks good from any angle.",
  "Thanks for your review. I finally decided not to buy this model (it's in my cart for a few days).",
  "Thanks for the insight. Where did you see others complaining about the touchpad issue? If it's not isolated to my machine I'm afraid it may be drivers / firmware.",
  "sounds like an issue with Intel ultra series 2 to be honest.  \n  \ncan anyone who has tested other series 2 intel laptops confirm?",
  "I wud return it for the annoying spinning wheel alone",
  "I wish the X1 carbon line still had good IPS panels. OLED isn't for me. P14s gen 5 has a nice 120hz 3k IPS, I might consider that one.",
  "Hey, I'm thinking of picking up this machine, but I'm curious to know how much battery life you're getting?",
  "Haven't tried any other Lunar Lake laptops as of yet. There will allegedly be a SL7 for business with Lunar Lake next year, thinking about waiting for that. Though knowing Microsoft they'll charge an arm and a leg for 32Gb.",
  "I also posted a review of SL7 a few months ago if you wanted to have a look. The SL7's display is pretty comparable to the Aura's. It had worse PPI (201 vs 222), and worse subjective calibration making it bit washed out, but didn't have the IPS glow issues of the Aura. The AR coating was also better. I'd take either display, both good IPS panels.\n\nThe Surface was pretty much silent at all times, largely due to an overly conservative fan curve. The chassis would get way too warm in heavier tasks and the fan would hardly do anything. But still, I prefer the SL7's acoustics. No noise in a docked setup.",
  "Cant seem to get it working on the Aura.",
  "What did you uninstall? ",
  "Which bloatware did you remove?",
  "is the IPS display good for an external use? I work from home and sometimes i'd like to work from outside in the garden (emails, office Suite)",
  "Thanks for the recommendation on uninstalling the bloatware.  Any update on the laptop?",
  "It's annoyingly reflective. And it's a pitty because under the perfect conditions it's really nice to look at. But it's a laptop so conditions change and are rarely perfect",
  "Is it a problem specific to touchscreen version or all version affected?",
  "The low RPM noise isn’t too bad, it’s just the fact it’s there at all that irks me. It’s completely unnecessary to have such an aggressive fan curve with a Lunar lake chip inside, but I wouldn’t say it’s a dealbreaker. \n\nThe eye strain comes from the GPU, not the glossy display surface. Same strain when docked. Seems to be recent intel GPU’s from what I’ve read, causing issues for those sensitive to dither, or whatever rendering technique it is that causes the pain.",
  "The Aura screen dimensions are compatible with the MacBook Air 15. Get a MBA 15 compatible matte screen protector, and it'll greatly reduce glare and reflections on the Aura.",
  "was this 16 or 32gb of ram?",
  "BTW, as an update to my experience, I have my touchscreen replaced as it seems to be touchscreen issue instead of touchpad. For a week, touchwood, no such touchpad issues anymore.\n\nThe only remaining gripe I have would be the lack of compatibility with my GPD G1.",
  "Have you uninstalled McAfee already? It will greatly improve system performance. The Microsoft antivirus software built in Windows is better. That's probably the first thing to do after unpacking a new Lenovo laptop.",
  "It's really subjective. Do you have any issues with other modern devices? In laptops I find Intel Xe iGPU's to be bad for eye strain, Nvidia perfectly fine, AMD tolerable but not ideal.",
  "For my ghost touches issue, turns out I went to Lenovo repair centre to have screen replaced, then as of these weeks the ghost touch issue is gone for me.",
  "how did it go? did you send it in and is it still working?",
  "Hello \n\nI am going to buy this laptop soon.\n\nIs there display glare problem a deal breaker?  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nThanks",
  "Its not easy to buy a laptop nowadays. many models and there are issues on each model. No windows laptop is perfect it seems, unless you pay big amount to Thinkpad series highend one.",
  "Luckily the 15.3\" screen is the same size as the Macbook Air 15, so you could pick up a matte screen protector.",
  "[I just reviewed it](https://smbtech.au/features/lenovo-yoga-slim-7i-aura-edition-laptop-review/) and got 26.5 hours. That's a new record on my site.",
  "After using for some time, I think it’s similar to surface laptop screen. It’s reflective but with decent resolution. Colors are vibrant. I mostly work inside so it’s been fine. Working outside might be slightly tough because the screen is pretty reflective (not as good coating as MacBook). If you turn up the brightness to 100% that might make it better for outside work.",
  "I think the same, if not even better.   So loud and clear and good bass too.   I've tested both the 14\" and the 15.3 and had zero issues.  I think the one this person is talking about was just a lemon",
  "Not really, I just got used to it.",
  "Barely but yes. You can be outside (in the shade of course) and make do while in light mode. It's a mirror though, so you gotta find the right angle.",
  "Thank you so much - I really appreciate it. This makes it a buy for me. ",
  "Glad I could help make that tough decision! Not many choices right now that are similar to Yoga 7i Aura Edition but hoping we get some new releases soon...",
  "I read about a couple folks mentioning unresponsive touchpad in some YouTube comments and in r/lenovo comments as well",
  "You probably don't need this anymore but its around 8 hours minimum for demanding stuff, WAY higher with regular use. Much more than one needs. If you plan on using it for several days in a row, just bring the charger.",
  "As I sit here looking at my non-upgradeable to Windows 11 Surface Book 2.  You felt and looked premium, I paid a lot for your middle tier processor, I learned what heat throttling was, sometimes you think the screen is disconnected when it isn't, we had a good run. No more MS laptops for me thanks.",
  "Just read it, some great detailed insights there. Definitely swaying me towards getting the SL7, especially given the low/no noise from the fans which is very important to me. Thanks for replying!",
  "How would you compare the screen reflectivity between the SL7 and the Aura? Still waiting for my Aura to arrive",
  "OK, thanks for trying, it is good to know that it is not compatible... by the way, there are several variants, depending on the model (eg 1 or 2 fans) : \nhttps://www.reddit.com/r/thinkpad/comments/qjlal2/tpfan_control_on_newer_thinkpads_share_your/\n\nOn the Aura, there is also a built-in BIOS configured power management, accessible through Fn+Q command : \nhttps://www.reddit.com/r/laptops/comments/1fufeoa/lenovo_yoga_slim_7i_aura_edition_ama/lqcjek5/",
  "What if you set the performance/fan mode to quiet? Does that make it quiet enough? I'm thinking of getting this too and have heard mixed reviews about fan noise",
  "Ya, it’s been hit or miss on battery life. Touchpad gets finicky w longer use, appears to be pretty sensitive to the oils on the skin and any grime so I try to use the mouse. I really do like the yoga mouse you can get for around $20. Ergonomic and accurate. Screen is my favorite part along with the keyboard. If the trackpad were the same as MacBook this would be a pretty near perfect machine. If you have the money and the time to wait I’d get the x1carbon w custom haptic pad not currently available for preorder. To save about 2k I live with the faults of the laptop as it does what I need. Portability is also really nice and feels slick in the hands. I do understand at night the irritation w the backlit keyboard and reflection on the screen due to the space in between the keys so I try to keep it on the low setting. No major issues thus far. Runs BlackOps 6 w no problem \n\nI do get random issues w headphones and Bluetooth but not sure if it’s the computer or the headphones. No problems at all when plugged in.",
  "Its actually not too bad in person (at best buy) when viewed side by side to the book 4 screen.   I think the book 5 screen has more anti-reflective coating and they did not have that model for testing.",
  "Is the reflection problem specific to touchscreen version or all version affected?",
  "Does anyone tried this?",
  "It had been on sales for £1100 for the Aura 258V 32GB RAM model in the UK (e.g. Lenovo Store, Currys).",
  "Yes the 32 GB version with Intel 258V. Seems like some of the discounts are now gone.",
  "I have the same ghost touch issue, sending it in for repair under warranty in 2 days.  \nhow was you experience with the repair and is it still working?  \nAsking since i have heard many bad things about Lenovo's repair service.",
  "May i ask if you’ve found a solution for connecting to the gpd g1? I am looking to buy a compact egpu to use with the slim 7i aura on the go. 🙏",
  "That was one of the first things I did",
  "I'm looking to replace an old Dell XPS 9360 laptop with the following specs: Processor: Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz 2.00 GHz. If I had no eye strain issues with this, do you think I should be ok with the Slim 7i Aura?",
  "Tell me how the type of graphics card can affect eye strain. Eye strain and other discomforts are caused by PWM and temporal dithering. These are defects or characteristics of displays, and intervening components are unlikely to be the cause, but I could be wrong. Please comment.",
  "I exchanged it",
  "I mostly use my laptop indoor with low light so my brightness is usually around ~30%. so I can't tell you how long it lasts on full blast. The screen is very glossy though. if you work in a very bright room with bright background/light behind you, then yeah it can be very annoying to clearly see your reflection on the screen even at 80% brightness. it's depends see if you can find a sample in the nearest store.",
  "I like your little candy cane for scale",
  "Can you share me the settings that you have used while testing this and was there any major tweaks done to this? I got the same laptop but seems like my idle drain is little bit higher, although I did clean install of windows.",
  "Is it good?",
  "HP's new OmniBook Flip looks good, but its battery is a bit small. Maybe I'll wait for the ThinkPad X1 Carbon Aura edition. It'll be very expensive at the release time though.",
  "A few alternatives appeared in recent months:\n\n[**MSI Prestige 14 AI Evo C1MG**](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) – MSI’s, matte-screened 14-inch, business-oriented rival is larger, but more powerful. It’s also crazy cheap in the current sales, if you’re on a budget.\n\n[**Asus Zenbook S 14**](https://smbtech.au/features/asus-zenbook-s-14-review-lunar-lake-2024/) – It’s smaller, lighter and more portable, but just as powerful and a bit pricier. A stunning laptop.\n\n[**Asus ExpertBook P5**](https://smbtech.au/features/asus-expertbook-p5-laptop-review/) – Asus’ business-class 14-inch, Lunar Lake ultraportable laptop has a matte screen, has been torture-tested and has some great business features, especially related to web-conferencing.\n\n[**HP OmniBook Ultra Flip 14**](https://smbtech.au/features/hp-omnibook-ultra-flip-14-laptop-review/) – HP’s Lunar-Lake ultraportable is a *bona fide* convertible tablet with amazing ergonomics.\n\n[**HP Omen Transcend 14**](https://smbtech.au/features/hp-omen-14-inch-transcend-laptop-review-2024/) – Want some gaming chops? HP’s 14-inch Omen has powerful, discreet graphics and yet remains portable.\n\n[**Asus Zenbook S 16**](https://smbtech.au/features/asus-zenbook-s-16-laptop-review/) – This AMD-powered, 16-inch ultraportable is solid, powerful and good value.",
  "Ah, interesting. Looks like a universal issue then.",
  "Both are glossy glass surfaces, but I remember the SL7 looked less reflective. The aura can look a bit mirror-like at times.",
  "My bluetooth is awful.  I can pair all devices, but they will NOT stay connected.  My earbuds connected, and I was able to use them for about 1 minute or so, but I could only get the Right side to receive sound.  There's something very very broken about the bluetooth on this machine.  It has been out since 2024, and it is shocking that it is still not fixed !!!  The internet is full of people with the same bluetooth issue.",
  "Yes, a few people on reddit shared their experience of this already. They said the outcome is comparable to the new M4 nano texture screen coating. Less reflection but more grainy, as you would expect.",
  "I am going to buy this laptop soon. \n\nIs there display glare problem a deal breaker?\n\n  \nSome people mentioned : glossy displays leading to poor battery life because you have to crank up brightness to max to combat glare.\n\nI am a software developer, i opened many tabs, run heavy tools like docker, visual studio and local database servers.",
  "You could try to check if the problem is related to your Windows install, or a hardware issue (e.g. WiFi chip, antenna connection). \n\nOne relatively easy way would be to create a Linux bootable USB stick (e.g. Ubuntu). Boot up from the Linux USB stick and check the WiFi speeds. \n\nIf the speeds in Linux are normal, you could then try a \"clean install\" of Windows (download Windows USB install media from Microsoft website).\n\nIf the WiFi speed in Linux is also very low, then it might be worth opening up the laptop and checking the WiFi chip and antennas (does not void warranty). Ask a friend if you don't know how to check this, or follow a YouTube tutorial.",
  "I have a ThinkPad with the same CPU (8650u). I find it pretty similar to modern AMD laptops, moderate strain after 1-2 hours. Much better than modern Intel Xe, which the Aura has.\n\nI would give it a shot, you can always return.",
  "Did you exchange with the same model? Or what else did you get instead?",
  "Understand it looks like a deal breaker to me, however spec is really good on this pc.",
  "this comment is making me crack up ideky",
  "Disable all start-up apps, put it in flight mode, ensure all drivers and apps are up to date, drop the screen to the lowest visible setting, ensure it's cooled down before running the test.",
  "ThinkPads have great build quality, the 14 inch a bit too small for me tho. HP removed top firing speakers form Omnibook and no more USB-A port either.",
  "That's a nice list, thanks.",
  "I can see you currently have ranked the [MSI Prestige 14 AI Evo C1MG](https://smbtech.au/features/msi-prestige-14-ai-evo-c1mg-laptop-review-2024/) at #10 due to the price of your printing of **$1,899** (was formally your #1) with an Intel Core Ultra 5 (125H).  \nIm seeing priced at $1399 across multiple webshops sporting an Intel Core Ultra 7 (155H) - to me that represents even greater value, do you think its battery would be as efficient battery wise as the (U5-125H) that you reviewed?",
  "Yeah, for some reason it worked fine for me or maybe I just didn't notice it. I think a few BIOS updates can fix some of these pesky annoying issues in otherwise an ideal laptop.",
  "Now I'm thinking to just get the Yoga Pro 9i with the IPS. Should check all the boxes. Just not the battery life",
  "It is a glossy screen, so some glare is there, but not anything significant to be a deal breaker. Battery life has been excellent so far, usually lasts 5 to 8 hours on a single charge of 80%.",
  "Thank you for these suggestions, and I think I will try it. Can you please provide me with a link to such a Linux Bootable Stick download? I know I can search for it, but I feel you can provide me with a tested (and safe) solution.\n\nmeanwhile I found an acceptable solution using a tp-link wifi dongle",
  "Oh you got it wrong buddy I mean what's the best optimal settings that's not compromising performance and battery life",
  "You're welcome. I made it as part of my Aura review, [here](https://smbtech.au/news/datadog-showcases-expanded-ai-ml-and-aws-monitoring-features-at-reinvent/).",
  "If it's dropped like that again it will be Number 1, or very near it. Prices are a rollercoaster at this time of year and there's not much in it. There's a whisker between these and choosing what suits you best will leave you with a great laptop either way.",
  "The 9i looks like a nice machine especially with mini-LED, but the chassis is quite cheaply made, like the Pro 7. All plastic interior, including the hinge assembly. [https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249\\_B.jpg](https://download.lenovo.com/Images/Parts/5CB1N62249/5CB1N62249_B.jpg)\n\nPersonally, for the price of the 9i I think that level of build quality is unacceptable, especially when it can be configured over $2k. Compare that to a full CNC MacBook Pro chassis, or even SL7, XPS, etc. Even the Aura is built better.\n\nI've heard good things about the 9i, but I would be careful with the hinge. I suppose if it breaks you can buy a replacement chassis from Lenovo, they are pretty good at stocking parts. But you shouldn't have to for $2k.",
  "Follow this tutorial on the Ubuntu website: \n\nhttps://ubuntu.com/tutorials/create-a-usb-stick-on-windows\n\nOr\n\nhttps://ubuntu.com/tutorials/install-ubuntu-desktop\n\nNote that the Ubuntu web servers seem to be not very responsive right now (perhaps under maintenance). So you may have to try the links a few times. \n\nIf you have good WiFi speeds with an external USB WiFi dongle then this is also indicative of a hardware issue. I suggest you find a friend who can help you check out the WiFi inside your laptop.",
  "For the benchmarks, i go for the max possible score. I'll have Windows Set to Best Power efficiency and the Vendor's app set to maximum efficiency (no overclocking, USB charging turned off, silent mode if not low power, disable diacreet GPU if relevant etc). At the end of the day, though, every task will affect an individual laptop differently (as you know). I just do what I can to get the maximum score as it doesnt take much to screw a long test up.",
  "hi I am someone using this laptop for a month. Idk if it's too late by the time you read this but here's my experience.\n\nThe battery life for me is excellent - provided you don't have power-hungry startup apps like Discord, Logitech software or Steam. Spotify counts too but tbh I don't find it that much of a drain.\n\nMy use case has been browsing online, excel/word, watching videos / spotify - the battery easily lasts for 12 hours.  Usually with the aforementioned use case of doing all that at the same time (video essay / spotify on background and then the other apps) I can hit like 50% mark after 5-6 hours.\n\nI didn't really go too crazy, I just set the lenovo vantage profile to the intelligent mode (the neutral one, not performance or batt saving) and it's been working wonderfully. Vantage is actually my fav tool now - after getting burnt by Asus' MyAsus app that didn't do shit to help with batt life.\n\nAdditional:\n\n\\- screen at 50% (the new 14 inch version is now OLED as opposed to IPS so if you wanna go for the smaller version do take note the batt life may be diff even though spec-for-spec it's very similar to this 15 inch ver)\n\n\\- no backlight keys (lowkey sucks there's not much levels of adjustment - just low or high)\n\n\\- reduce screen refresh to 60hz (honestly 120hz is overrated for something like a laptop imo. I have a desktop that goes 165hz and that's more for gaming. sure it's smooth and all but eh not worth the batt life tradeoff).\n\nif you realllly wanna stretch the life, use MS edge as ur browser cuz that's the least battery draining browser out there. I couldn't be bothered so I just stick to brave",
  "Cool site! Glad to hear you didn't experience the issues I did. Maybe Lenovo fixed these in latest update.",
  "Do you know what the difference is between the one on the Lenovo main website vs the one in the Lenovo Outlet store? - both claims to be new and specs look identical but significant price differences - model numbers vary - that's it?\n\n# $2,879 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)\n\n# $1,789 - Yoga Slim 7i Aura Edition (15'', Gen 9)\n\n[https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051](https://www.lenovo.com/au/outlet/en/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051)",
  "A friend bought the MSI Prestige 14 AI Evo Ultra 7 155H with 16 GB RAM and 512 GB SSD on my recommendation during the recent sales for her university studies. Unfortunately, she decided return the laptop after just one week as the case kept splitting open at the front under the touchpad. This indicates some poor built quality. I tried it out myself for a bit and also found the feeling and aesthetics rather on the cheap and plasticky side. The system also felt very sluggish and performed poorly in everyday web browsing and office tasks.\n\nAfter the MSI Prestige, I recommended my friend to get a full aluminium Lenovo Yoga 7i 14\" instead. She's very happy with the Yoga laptop's sturdy built quality, and it feels a lot snappier to her, too.",
  "Hello, how did you find the photo of the inside of the laptop? I'm looking for a new laptop and if I end up choosing a Lenovo I want to first check that the hinges are not attached to plastic. Thank you.",
  "Thank you so much  \nmerry Xmas",
  "Thanks for that in-depth review and yeah am also using same device now. It's really worth noting that how good it works in every scenario and yeah i do play some heavy games over it and gets nearly 60 fps in forza horizon 5 at  max resolution with high-ultra settings. I'm not happy with it's glossy screen. Only flaw for me :(",
  "i think you can try find some matte finish screen protector \n\nthough I also notice matte screen reduces the contrast and colours.",
  "Couldn't find anything compatible to this :(",
  "Lenovo Yoga Slim 7i Aura Edition (gen 10) or Asus Zenbook S14 OLED Need a bit of help deciding between the newest iterations of these two laptops.\n\nThe Lenovo Yoga Slim 7i Aura Edition (Gen 10, 2025) and the Asus Zenbook S14 OLED(2025).\n\nOn paper they share the same specs like:\n\n- Intel® Core™ Ultra 7 258V with Intel Arc Graphics\n\n- 32 GB LPDDR5X-8533MHz\n\n- 1 TB SSD, M.2 2242, PCIe 4.0\n\n- 14\" 2,8K (2880 x 1800), OLED, HDR 600, 500 cd/m², 120 Hz screen\n\n- Wi-Fi 7 / BT 5.4\n\n-Similar I/O\n\n \n\nThe comparisons I found, are mostly of the old version of the Yoga, the one with touchscreen and IPS panel.\n\nFrom the reviews it seems that the Asus has better batterylife and nicer materials (?)\n\n \n\nI personally like the design of the Asus better, but many people here had bad experiences with Asus and Build quality and warranty issues.\n\nFor me its important to have a laptop that I can rely on and is not gonna need first aid after a year, so the design thing is not as important.\n\n \n\nPricewise at the moment I can get the Yoga for 1290€ and the Zenbook for 1260€\n\n",
  "I faced the same decision a few days ago and decided to wait a few weeks to go with a 3rd option: preorder the yoga slim 7i (G10) 14\" that was announced at CES and will be available from the end of February. \n\nBetween your two choices from reviews I found out...\n\nZenbook:\n\n- OLED Screen\n- Better speakers \n- 14\" \n- acceptable keyboard\n- \"bad\" (non haptic) track pad\n\nYoga slim 7i (15\")\n\n- good IPS screen\n- 15\"\n- \"bad\" speakers\n- great keyboard\n- good (non haptic) track pad \n\nI was quite intrigued by the OLED screen, but the keyboard and track pad of the Zenbook made me hesitate, since they're very important factors for me when buying a laptop. What made me hesitate with the Yoga slim 7i (15\") was the size, weight (300g more) and the lack of an OLED screen.\n\nWhen I found out there's a Yoga slim 7i (14\") coming out with pretty much the same specs as the 15\" version but an OLED screen and a cheaper prize than the Zenbook it was an easy choice. The OLED screen is non touch, but that's fine for me.",
  "How are you feeling after some months? Do you recommend it?",
  "Thank you for the feedback. Matter of fact I am actually talking about the new YOga slim 7i 14\" OLED version that has been announced at CES. I can order it via german corporate benefits program and it will be shipped in approx 2 weeks. So I guess its a nobrainer at this point? :D",
  "Did you get the lenovo gen 10? do you like the screen?",
  "***> preorder the yoga slim 7i (G10) 14\" that was announced at CES***\n\nWhich one is this? Do you know the model number?  \nThere are so many different models it's confusing! 😄",
  "bad speakers? fix your ears mate",
  "How did you manage to get the Yoga 14\" Aura priced for 1087€ via CB? My price via Corporate Benefits is 1245€ :-/ (I am German too)",
  "I ordered mine today after checking out both models in person at a physical store. I went with the Yoga Slim 7i Aura Edition (Gen 9) with the Core Ultra 7 258V CPU, purchased directly from Lenovo’s website.\n\nIn Australia, I had the option to upgrade to an **OLED display**, but I intentionally chose IPS instead. While OLED is great, it comes with the risk of burn-in, and since I plan to use this laptop primarily for productivity tasks like Office apps, browsing, coding, I didn’t want to constantly worry about screen longevity. With an IPS display I am not surrendering too much for 1 less headache I have to worry about.\n\nI note that OLED has its time and place - but really depends on what you want to do with it",
  "Not yet. It will be available from the end of February. I'll get mine probably in the beginning of March.",
  "It is :D\n\nI don't know if it has a model number, but I ordered this one (from a german reseller and with a student discount): https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/len101y0053",
  "It didnt work. I thought I coule use the Cb Code für the advertised 12% off, but I only can get the Price that is already shown in the Shop althou it says I Need to use the Code",
  "[deleted]",
  "Are you okay with the OLED display. Some people mentioend its not good and it has a glare effect from lights around.",
  "Ok. When you'll have it could you write a little review? Thank you!",
  "Hi there. Have you received your laptop? I have ordered it from Lenovo’s official website on the 14th of Feb and the shipping date keeps getting pushed back. Last one is on the 7th of March",
  "Sorry to bother you, but may I ask if you have received the laptop yet?",
  "What display did you go for? How much did you pay? So you have it already? ",
  "I asked the chat agent to apply the CB- discount for my shopping cart. He didn't, but I saved a few euros nevertheless by asking him. The purchase was also tracked by Shoop.",
  "Got the postage information just earlier today, so a few more days to wait!!!\nI'll definitely give you an update!",
  "i ended up going with an IPS display and cant be happier. and no dancing around with an OLED to make it work for longer.",
  "Hey! Yes, I received it around 14 days ago trough a reseller a bit earlier than expected. Did you get yours by now and how do you like it? :)",
  "No worries :) Yes, I got it around two weeks ago. Did you order one too?",
  "Im still thinking about pulling the trigger on the yoga 7i. Pretty good price for a device that’s not even out yet. The reviews about the Lunar Lake are damn good",
  "Hey, how much did you get it for including corporate benefits? My gf (German) also gets corporate benefits but can only get it for 1245€ too",
  "There is a glare and some people complain that own image shows in the laptop scree?\n\nIs that a deal breaker ? have you experience it?",
  "Not yet, but I am planning to. Just to clarify, did you get the Yoga Slim 7i Aura Edition 14-inch version or the 15-inch version? I saw ur comments, and I agree that the 14-inch is much cheaper compared to the 15-inch version. I have only seen this laptop through 2 youtube videos, so it must be just new. I wanted to order a custom one on the lenovo website, but I fear they might not have any stock yet.",
  "Yes, I got the Yoga Slim 7i 14\" Gen 10 (258V). Yes, it's weird. There don't seem to be any reviews on this laptop (yet?).\n\nSomething that might be relevant to you: There are at least two different models being sold. The US version has a FHD OLED touch screen, while the version I have (german or EU) has a 2880x1800 non-touch OLED screen.",
  "Thank you for your replies and info! I now feel more confident in ordering it.",
  "How’s it holding up?",
  "No complaints so far :) Stunning screen (EU Model) and great keyboard. Battery life is good and so is the performance. The touchpad is certainly not the highlight of the Laptop, but does the job well enough for me. \n\nI'd buy it again :)",
  "Sorry to hijack again, I'm eyeing the same exact model. How is the performance so far for you? Does it has any noticeable slowdown during multitasking?",
  "Any reviews/experience for the ThinkPad E14 G7 with Intel Ultra 7 258v CPU? I could only find reviews for the version with the 255U, because that version launched first.\nI'm mainly interested in it's battery life, because I'm looking for a laptop with decent performance and long battery life. \nNeeds to be x86 (want to dual boot Linux), so I've been looking at the Lunar Lake chips. Because Ram is soldered I'm going for 32 GB.\nThe other laptops I'm considering (Asus Zenbook, Vivobook 14, Lenovo Yoga slim 7, Acer Swift ai 14) all have glossy screens, the E14 G7 seems to be the only one in my price range (<1500€) with a matte screen. ",
  "its just gonna be maybe an hour less i dont think battery life is that deep of an issue",
  "I have a 268v cpu in my laptop and it is pretty slow compared to my desktop cpu. You would be better of getting an AMD HX 370 or 395.",
  "Yeah, I'm almost certain it will be fine, I just don't like the idea of buying a laptop without seeing at least one review of the specific model. Will probably buy it because spec wise it fits my needs the best",
  "Cool",
  "Impression + AMA - Core Ultra 7 258v VS Ryzen 7 AI 350 for a casual user (feat. Lenovo Yoga Slim 7 Gen 10) Hello there! Just a quick introduction to explain why I'm making this post: I'm currently in the market for a new laptop (coming from a Blade 14 2021 w/ RTX 3070). Here are my requirements:\n\n* Thin and light\n* Decent battery life (doesn't need to exceed 10 hours)\n* Most importantly, good unplugged performance\n* Casual gaming (mostly indies)\n* Quiet and at least not hot to the touch\n\nMy Typical Usage:\n\n**Two Browsers** – about 20–30 tabs each\n\n* **Browser 1** – TradingView, multiple crypto trading exchanges\n* **Browser 2** – Messenger, WhatsApp, X, Telegram, Discord, Databricks, Reddit, YouTube, Chatgpt etc.\n\n**Other apps (background + foreground)** – Spotify, Outlook, Teams, ShareX, OneDrive, Steam, Excel spreadsheets (2–3 at least)\n\nSo, I narrowed my choice down to the Lenovo Yoga Slim 7, but I have a big dilemma due to the CPU choice—Intel 258v vs. AMD AI 350. Naturally, being an AMD fanboy, I would have picked the AI 350 without question, especially since AMD has usually been the battery champ in Windows laptops over the past few years. After doing further research into Lunar Lake, I'm very intrigued by its efficiency but wary about the lack of multithreading.\n\nThe problem is that there isn't a review out there that really focuses on actual unplugged user experience in terms of performance and multitasking. Most reviewers dish out raw numbers like everyone is a content creator or something. Sure, user experience is rather hard to quantify, but I need a laptop that feels smooth in daily use.\n\nTherefore, I decided to take matters into my own hands. I went to my local retailer and ordered both models. They just arrived today, so now I have the AMD model with a touchscreen in Tidal Teal and the Intel model without a touchscreen in Lunar Grey. After setting them up and playing around for a few hours, here are my early impressions (mind you, these are not scientific results).\n\n**Performance (Unplugged) – Nitpick Alert**\n\nNo, I don't run benchmark scores—you can find those online easily. I care more about actual system responsiveness: how the laptop feels in day-to-day use and under light loads.\n\n**Intel 258v** – To my surprise, the 258v delivers much better responsiveness. I'm talking about switching windows, animations, moving things around the screen, having multiple windows open, and running background apps during my typical workload. Additionally, it’s able to handle everything I need without a single lag—I even had a 4K YouTube video playing in a floating window while working. Even in 'Best Power Efficiency' mode, the scrolling animations remain smooth, which is a nice touch. Sure, my workload isn’t the heaviest, but this is an ace in my book. One thing to note: I started noticing slight sluggishness in animations when the battery falls below 15%.\n\n**AMD AI 350** – While the AI 350 can also do everything without slowing down, the general animations aren't as smooth as the 258v’s when unplugged. Things like minimizing/maximizing windows and bringing up the quick menu feel less fluid. This is particularly noticeable in 'Best Power Efficiency' mode, where I lose the smooth scrolling animation while charting on TradingView. It’s not bad or slow per se—it works fine—it’s just that the 258v keeps things consistently smooth across all settings.\n\nI'll run some games during the weekend and see how it goes. However, gaming performance is not my main requirement—nice to have, but not a must-have. You can find plenty of benchmarks online anyway.\n\n**Noise & Heat**\n\nAnother win here for the 258v. Aside from the initial setup, the fan rarely ramps up. While running my typical workload, it gets just a little warm at the top left corner of the keyboard—not bothersome at all. Otherwise, it remains cool and quiet. \n\nThe AMD AI 350 also fares pretty well—it gets *slightly* warmer than the 258v, but I'd say it's negligible. The fan kicks in more often than the Intel 258v’s, though. However, I'd say both can achieve silent performance.\n\n**Battery Life**\n\nToo early to tell, as I haven't gone through a full battery cycle on either laptop yet. First impressions suggest both are neck and neck. I'll update the post once I have more results.\n\n**Build Quality**\n\nNormally, they should be the same, but I noticed a few differences worth reporting. The AI 350 has some backplate creaks—it makes a slight noise when picking the laptop up or moving the lid. Meanwhile, the 258v feels more solid, but it has a rattly touchpad, which kind of drives me nuts at times. Lenovo's QC seems poor here.\n\nI find this surprising since I usually hear Lenovo has the fewest RMA cases—or maybe I just have the worst luck.\n\nAs of now, the Intel 258v is more likely to stay with me. I'll update this post once I have more testing results. **AMA!**",
  "Well, the Intel Is Better in every category except multi core performance, battery Life Will be mutch Better(around 15% more), if you want tò go amd with some reason tò not go with Intel you should get a ryzen 9 365, or if you do not care using Intel the ultra 7 258v or if you want also multicolore performance (loosing the bonus battery Life ) the 255h",
  "I'm having the same experience as you with a new AMD AI 350 Laptop (HP OmniBook X) that for some reason doesn't feel as smooth for casual use which is surprising coming from a Ryzen 5 5600H as reference.  I'm not sure if it's the HP bloatware and I should try a fresh windows install before returning. \n\n\nI'm getting in the meantime a Lenovo Yoga Slim 7i with the Core Ultra 7 258v so I will be able to compare between those.",
  "I'm thinking about whether it's worth paying $200 more for the 258V?",
  "I'm planning to upgrade from my Lenovo with a 5500U because it's starting to feel a bit slow in everyday use nothing heavy, mostly just browsing. I was leaning towards AMD for the performance, but your comparison really got me thinking, and now I'm considering the 258v. Did you end up keeping it? How’s it been after using it for a while?",
  "Hey mate, what did you notice with the battery life?",
  "Any updates on the battery life?^^",
  "How did it go?",
  "I guess this really depends if you need that 32GB. As far as I know, there isnt too much CPU performance different wbeen 256v vs 258v but yeah the price different is rather steep.  \nPersonally, I only upgrade my laptop like after 5 years or when it dies, so 32GB could futureproof'' things down the road for me.",
  "Ended up getting a HP Omnibook Ultra with the Intel 258V. So far way smoother experience than the Omnibook X with the AI 350 for some reason even though the specs of the AMD sounded better. The Yoga Slim 7i was equally smooth experience when I tried but found a great deal on the HP.",
  "Sorry, I meant that I'm also looking at the Lenovo Yoga 7i and the Intel version with the 258V is $200 more than the Ryzen 7 AI 350.",
  "And how is the battery in comparison?",
  "sorry i misunderstood your question.  \npersonally I would, considering Im only mostly doing light but moderate multitasking, I dont need that extra horsepower considering the 258v has plenty for me.\n\nMoreover, the extra battery life, silence and lower temp gives a nice feeling.\n\nBut anyway, I've returned both of the laptop due to build quality issue.\n\nI've just picked a 2024 Omnibook Ultra Flip 14 on sales, 10% less than what I paid for the yoga 7 258v, which has way better build quality. However, the Yoga has better screen quality though as the screendoor effect on the HP is crazy.",
  "Hye, any update on the battery life comparison? Did you test it out completely before returning them?",
  "yes please any battery life updates? what are your thoughts",
  "help deciding between lenovo yoga 7 ryzen 7, lenovo yoga slim 7i and lenovo yoga slim 7i aura edition hello! ill hopefully be going to university this september and I'm looking to buy a decently well-built, durable laptop that can last me the whole 3 years of my course and maybe some time after that. \n\nmy budget is between £850 - £950. can't really go over that..\n\n2 of my friends have the lenovo yoga 7i and they're enjoying it a lot but im not 100% sold on it because I've heard mixed reviews, especially about the hinges. They've only had them for a couple months each so I don't think they can answer my questions from a long-term perspective, if you get what I mean.\n\nanyways, i would mainly like to use this work school work along with streaming movies, watching YouTube and hopefully being able to play games. the games i would like to play on this are roblox, valorant, overwatch 2 and some story games (lis, tlou2, rdr)\n\nill copy and paste the links below so the full specs can be seen:\n\nhttps://www.currys.co.uk/products/lenovo-yoga-7-14-refurbished-2-in-1-laptop-amd-ryzen-7-1-tb-ssd-blue-very-good-condition-10269152.html\n\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb1?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOTNJgM_IosqUGJRGjYPUOxOOeO0JrO77bafqzhQ8iQtmdFR4KC1lBsaAmvtEALw_wcB ",
  "definitely the yoga slim 7i aura edition from lenovos website \n\nit would have the best battery life and igpu out of all these. the core ultra 226v and the 200v series processors are REALLY good at everything. tlou2 and rdr might be fine, if i remember correctly it should be fine at 1080 low/medium. search for some gaming benchmarks on youtube for this. roblox/valorant/ow should be fine \n\nonly problem is 16gb of ram which might struggle in gaming but for everything else itll be fine. the oled screen will be really nice for watching movies",
  "ooh okay, thank you!!\n\nin the specs of the slim 7i aura, it says 16GB (memory on package) instead of (soldered)\ndoes this mean i would be able to change the memory to 32GB? i don't actually know how to do this yet, but would that be possible?\n\nalso, is it worth getting any security software (norton) or should i just leave that",
  "That's what I just got (I'm in Italy)  Nice machine but a bit disappointed with battery life (I bought this notebook almost exclusivley for its battery life but in 3 days I have done 8 htrs at the most (with most settings to minimum included 60hz)",
  "nooo dont get norton, windows defender is perfectly fine\n\nand no sadly the ram isnt upgradeable. with the new core ultra chips, the ram is soldered (memory on package is another way of saying it), so that the ram has higher speeds=better performance especially for the igpu\n\nand clicking on the build your pc option, it seems like we cant even get 32gb which sucks\n\nthe only option with 32gb ram is the core ultra 7 258v, which seems like it is an extra 110 in total. if youre willing to spend that much, its gonna be worth it (better cpu and gpu performance+more ram).",
  "ohh okay then, i won't.\n\naw, that sucks. i don't have the money to buy anything over 1k :( so ill stick with the 16gb\n\nalso, im really stuck on something. on the website there's this other lenovo yoga 7i slim 7 aura edition gen10\nhttps://www.lenovo.com/gb/en/p/laptops/yoga/yoga-slim-series/lenovo-yoga-slim-7i-aura-edition-gen-10-14-inch-intel/83jxcto1wwgb5?orgRef=https%253A%252F%252Fwww.google.com%252F&cid=uk:sem:tkrzor&gclsrc=aw.ds&gad_source=1&gad_campaignid=12612851967&gclid=Cj0KCQjwlrvBBhDnARIsAHEQgOQtLrzWLnEL9t1kRgkhS7z0s-S_GgUHqP0wj2K2ZpTkXXNkhQq7-WkaAgcdEALw_wcB\n\nthere's a £20 difference but i can't see any differences between them? im comparing them on the website but i don't see anything.. maybe im blind but is there any difference or can i just take the cheaper option?\n\nand have you ever bought from the lenovo website yourself?",
  "everything seems to be the same other than the fact that the 20 cheaper has no premium warranty?\n\n[https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html](https://uk.store.asus.com/asus-vivobook-s-15-oled-m5506-239991685-90nb14d2-m001k0-1.html) \n\nanother option is this\n\nthe ryzen 9 365 is really good, its oled, the vivobook s15 is made of metal so it feels premium, display is also 120hz instead of 60 and importantly, its 32gb of ram!",
  "ooh okay, ill check it out! pretty expensive tho😭\n\nis there a major difference in quality between the yoga slim 7 and the aura edition? i know they can both handle basic things like writing documents, but streaming and gaming wise? im feeling anxious about spending almost 1k on a laptop so should i just go for the cheaper option..? im assuming the slim is better than the regular yoga 7i so im not asking about that (could be wrong tho ofc)",
  "you mean the yoga 7 from currys? its refurbished and the cpu is a rebadged older processor. if youre gonna use the laptop for a couple years imo it is worth spending more for the aura/vivobook",
  "i meant this slim 7i\nhttps://www.currys.co.uk/products/lenovo-yoga-slim-7-14-refurbished-laptop-intel-core-ultra-7-1-tb-ssd-grey-very-good-condition-10268745.html\n\ndoes the fact that it's ultra 7 mean it works faster/better than ultra 5? \nwould this not be able to last for at least 3-4 years based on how ill be using it?\ni only got this money bc of a scheme in the uk called child trust funds and i got 1k and some change so i feel anxious to spend all of it on a laptop yk?",
  "Ohhhh for 700 its good. yeah the core ultra 7 155h isnt as efficient as the newer 200 series processor but performance is on par and the igpu is actually better\n\nso yeah I would say this will still be good to go for 3-4 years",
  "ooh okay so does that mean it can handle games and streaming better?\n\ni will probably get this one instead then!",
  "Any reviews for Lenovo Yoga Slim 7 Aura Edition Ultra 5 variant? Does anybody have any reviews for the Lenovo Yoga Slim 7 Aura Edition Intel Core Ultra 5 226V with OLED (83JX005FIN). There are a lot of reviews for the Ultra 7 258V variant on YouTube but none for this variant. Any help would be appreciated\n\n",
  "Any reviews for Lenovo Yoga Slim 7 Aura Edition Ultra 5 variant? Does anybody have any reviews for the Lenovo Yoga Slim 7 Aura Edition Intel Core Ultra 5 226V with OLED (83JX005FIN). There are a lot of reviews for the Ultra 7 258V variant on YouTube but none for this variant. Any help would be appreciated",
  "Acer Swift 14 AI (S14-15-768H) Ultra Core 7 vs Lenovo Yoga Slim 7 (83CV008 NPH) Ultra Core 5 Im planning to buy a personal laptop since my 10 year old Asus laptop obviously should be put down. \n\nNow im having a dilemma which should I get. I have read reviews and watched a ton of videos so now Im now very confused. Im not a techy person so this is overwhelming for me. \n\nMy first choice is really the Lenovo line. This is a bias one since I have a company owned Thinkpad T series laptop. So it's a pretty high standard for me. \n\nOn the other hand, the Acer Swift has higher specs than the Yoga Slim 7 in general. However, given the Acer's reputation on overheating and its  build, Im thinking twice if I should take a risk on Acer Swift 14 AI, given this is one of their latest premium models (released 2024). Acer also has a bigger discount and freebies so it feels a bit of too good to be true deal.\n\nShould i go for the well regarded Lenovo or take a risk on the newer Acer Swift?",
  "Anyone with Yoga Pro 7 (10th gen)? Hello everyone,  \nI'm looking for a new Windows/Linux machine of my own and after few days of examining the market I've narrowed down my choices into Yoga family (and peeking also at IdeaPad Pro), particularly the Yoga Pro 7 10th gen.\n\nHowever, it kinda bugs me that the 10th gen model comes with 90Hz screen compared to 120Hz screen in previous generation. I know that the new panel is generally brighter and supports HDR, yet I still don't understand why they capped it to 90Hz while other Yoga laptops come with 1100 nits peak brightness 120Hz panels.\n\nSo I wanted to know if there's anyone here that has the last-gen Yoga Pro 7 and could give me some honest review of it (and ideally compare with previous gen, but I'm asking too much).\n\nLittle context - I'm looking for laptop for software development and CAD designing. I'm keen on good display (I was also peeking the Yoga Slim 9, but I don't like the glass lid - I have small kids and that thing could get shattered in seconds :D). I've kind of ruled out the Lunar Lake laptops in favour of Ryzen 9 365 as I'm rather looking for little more performance rather than little more battery life. For that reason I'm also considering IdeaPad Pro 10th gen with Core Ultra 9 285H, but that might be a bit overkill (I also want cool and quiet system).\n\nI really need (either gentle or hard) nudge to finally decide which way to go in a budget close to 1500 EUR. Thanks in advance for any comments!",
  "Lenovo Yoga Slim 7 Ultra 7 I’m looking into buying the Yoga Slim 7 with specs:\n\nCore ultra 7 155H 32gb ram 1TB\n\nI couldn’t find many reviews of it online, It would be great if the users could give a review of it in terms of performance, battery life, sound, etc.. For more info, I’m a cs major rn, so would the laptop suit my needs in the long run?",
  "Asus Zenbook S14 vs Yoga Slim 7i Aura Edition (14\", Gen 10) Hi all,\n\nI'm currently deciding between two laptops, and I could really use some advice. I'm torn between the **Asus Zenbook S14** and the **Lenovo Yoga Slim 7i Aura Edition** (14\", Gen 10). Here are some of the main specifications:\n\n**Asus Zenbook S14**:\n\n* Intel Core Ultra 7 258V (Lunar Lake)\n* 32 GB LPDDR5X RAM\n* 1 TB SSD\n* 14\" 3K OLED display\n* Wi-Fi 7\n\n**Lenovo Yoga Slim 7i Aura Edition Gen 10**:\n\n* Intel Core Ultra 7 258V (Lunar Lake)\n* 32 GB LPDDR5X RAM\n* 1 TB SSD PCIe Gen 4\n* 14\" 2.8K OLED display\n* Wi-Fi 7, 5MP webcam\n\nThe Slim 7i is a preorder at the moment which makes it hard to find a review for it. I have found them for a similar price (around 2700 aud) however the quote I got from lenovo includes headphones, a mouse, and an extra year of warranty. Honestly any help would be appreciated as I do not know which one to choose.",
  "I am having the same problem except I currently have both and need to return one. Heres my pros and cons:\n\nZenbook Pros:  \n\\-OLED screen  \n\\-Smaller and lighter  \n\\-More \"Futuristic\" build  \n\\-Great battery life and performance  \n\\-Small power brick. Whole package is very light.\n\nCons:  \n\\-Screen doesn't fold flat (Im taller and find this very convenient when standing at the kitchen island).  \n\\-Keyboard action isn't amazing. Kinda squishy.  \n\\-Gets hotter (Noticeable when on your lap) and runs the fans, albeit quietly.  \n\\-No option to \"boot when lip open\" when in hibernate or shut off completely. Will only wake up on lid open when in sleep. Otherwise you have to push the power button. Not the biggest deal but something all the others seem to have and such an easy thing.\n\nLenovo Pros:  \n\\-Nice LCD screen resolution and size. I actually prefer the screen size over the 14\".  \n\\-Amazing keyboard! and the 15\" body size helps because again, Im taller with bigger hands and the body size is actually perfect when in use. Doesnt feel cramped at all. This is one of the biggest things keeping me from not liking this laptop... Lenovo in general has great keyboards.  \n\\-USB C on both sides is great.  \n\\-Battery life is great... about same as the Zenbook.  \n\\-Runs super cool and fans hardly ever fire up.  \n\\-Lays 180 degrees flat. I love this.\n\nCons:  \n\\-The stiff lid is ridiculous.. and I mean its a 2 hander (Thats what she said). No excuse for this when Lenovo has other laptops that have a one handed lid. Ive literally had the laptop slam back down on the table because I was trying to open and it slipped.  \n\\-The LCD can show a \"glow\" around certain parts of the screen borders when booting up and in darker screens. It seems cheap.  \n\\-Although the laptop is light for it's size, it still is a half pound heavier than the Zenbook, and then has a stupid 2 part larger power brick that adds to size and weight  \n\\-Power button on the side is ridiculous as well. Every reviewer calls this out but they keep doing it on this gen design. Super easy to touch and put the laptop to sleep if you are trying to move the thing.  \n\\-Design is boring.... and says YOGA real big in the bottom right corner of the deck. Its not a yoga, and just looks dumb to me.\n\nWith that, I find myself grabbing the Lenovo when I know i need to type out something extensive, and multitask. The size of the screen and keyboard really lend itself to getting business stuff done in a more comfortable manner. On the other hand, the Zenbook is so think and light, and I would choose for that alone bc I throw in my bag a lot and its way more manageable... And you cant beat the blacks from the OLED screen. As a side note, half the time I dock my laptop so the size and keyboard dont matter... so thats a win for Zenbook. Im still torn. I need to make a decision this weekend before my return window closes. Lmk what you think!",
  "How do you find typing on Lenovo considering glossy screen? I type a lot, looked at this model at mall and keyboard seems great but I'm a bit concerned about this screen when it comes to office daily use.",
  "thanks for this review! do you have an update, which one did you keep?",
  "That’s a really nice comment. I appreciate your firsthand feedback with both laptops.",
  "I was looking for this. Real world usage. Based on your comments I’m leaning towards the zenbook. What did you end up keeping?",
  "same honestly the screen is the biggest deal breaker for me",
  "What to chose ? Lenovo Yoga Slim 7i Vs Lenovo Yoga pro 7 I don't really know what to chose between this laptops, I saw the new \"lunar lake\" processor comes with the new intel technologies and power efficiency but i didn't find any review about this pro 7 build. What is more powerfull between this builds in terms of multy tasking, gaming and what the difference's will be:\n\nYoga pro 7:  intel core ultra i9 185h\n\nIntel Arc Graphics (from the i9)\n\n32Gb RAM\n\nYoga Slim 7i: Intel core ultra 7 258v\n\nIntel Arc Graphics 140v\n\n32Gb RAM\n\n",
  "Yoga Slim 7i 14\" Gen 10 vs Yoga Slim 7i Gen 9 15\". Oled or Ips, that is the question! Hello everyone, I should buy a new laptop and I am very undecided between these 2 Lenovo models:\n\n* Yoga Slim 7i 14\" Gen 10, Oled screen\n* Yoga Slim 7i 15\" Gen 9, Ips screen\n\nboth with same cpu, ram, etc. (Ultra 7 258V cpu, 32 Gb) at the same price.\n\nHere are the pros and cons that result from my point of view and for the use that I would make of them:\n\n**Yoga Slim 7i 14\" Gen 10**  \n  \nPros: perfect size and superior quality screen (I think!).  \n  \nCons: The Oled screen scares me for the burn in (does it still exist in 2025?) and for the PWM even if I do not know if I am sensitive to this effect (is there a way to check it quickly?). No reviews of this model.\n\n**Yoga Slim 7i 15\" Gen 9**\n\nPros: Ips screen that does not have problems with either burn in or PWM and perhaps it reflects less light (but I'm not sure about this). A lot of enthusiastic review.  \n  \nCons: Slightly larger dimensions. I don't need a touch screen. Lower quality of blacks compared to OLED screen.\n\nDo you know if the 2 battery chargers are the same size for both models? My priority is to have a device that lasts a long time (the one I'm replacing lasted almost 10 years!).\n\nWhich one would you choose and why?",
  "Anche io sto messo come te, ma il 15  pollici lo escludo da subito. Ti scrivo  da uno Yoga S740 di 5 anni fa e sinceramente sono in parte deluso pperchè ho da quasi subito avuto roblemi con tastiera e touch pad. Come vedrai lalcune lettere della tastiera non funzionano e il touchad  raticamente inutilizzabile (devo usare il nouse) Lo schermo  bellissimo e er il resto va una bomba ma inasettatamente sia la tastiera che il touchad mi hanno deluso...Mi ero riromesso dal rossimo notebook di renderlo con touchad atico ma costano troppo...Il 14 7i sembra carino ma 1,489 bombe sono ancora troppe, alternative ancora ce ne sono poche",
  "My exact same dilemma as well, oled vs ips.\nHavent got time to test it myself in the store.",
  "I'm also deciding between these models, biggest concern for me if battery life on the yoga 7 gen 10 is as good as on the slim 7 because of the dedicated GPU. Also the oled screen is 60hz and 1920x1200",
  "Lenovo IdeaPad Slim 5i VS Lenovo Yoga Slim 7 I got 2 laptops from Lenovo on sale to compare them before deciding which to get.\n\nIdeaPad Slim 5i: 646$ after tax\n\n* AMD Ryzen 7 8845HS w/ Radeon 780M Graphics 3.8 GHz\n\nYoga Slim 7: 1046$ after tax\n\n* Intel Core Ultra 7 256V 2.20GHz w/ Intel Arc 140V GPU (8GB)\n\n  \nFrom all the reviews of the Yoga Slim 7, I've seen that the iGPU for the Ultra 7 256V (Intel Arc 140V) should be a great one and a much better improvement on previous iGPUs. They also run games on it and it works pretty well (but they usually use the 258V which has the same GPU).\n\nFrom testing however, I found that the AMD one is performing much better. I'm using Fortnite as a comparison/reference: AMD was able to run smoothly with Medium preset settings while the Intel one quite literally blue screened me and crashed the laptop twice. Eventually I got it to work, but at less than 30fps while the AMD one held \\~60fps or more. After benchmarking the two with Heaven Benchmark 4.0 these are the results:\n\nIdeaPad Slim 5i (Radeon 780M)\n\nhttps://preview.redd.it/k5jv6spcpb5e1.png?width=756&format=png&auto=webp&s=6fd5e9e069a998a2255d61c93f4aae0ac5b34cb5\n\nYoga Slim 7 (Arc 140V)\n\nhttps://preview.redd.it/au7bmplmpb5e1.png?width=690&format=png&auto=webp&s=f29549343eb22e47790a344adabaf8b0245deeec\n\nHere's my question: How could a 500$ cheaper laptop perform better? Is this something with the settings or drivers (I updated all drivers)? I made sure both screens had the same refresh rate and resolution for a fair comparison too. Both laptops' battery lives are equivalent and the only difference between the two is that the Yoga has a really good display. I'm kinda lost here. I'm considering returning the Yoga but I'm worried I might just not be using it right.",
  "obviously one cpu is better. Price doesn’t always = best.",
  "I'm worried that it's actually better but there's some setting or driver I need. The youtube reviews online say it can easily run Fortnite at medium preset with 60+ fps",
  "The ryzen cpu is faster",
  "Anyone using a Lenovo Yoga Slim 7i 9th gen? I recently came across a pretty good deal on Lenovo's website for this laptop.\n\nAs I said, it's a 14\" Yoga Slim 7i with an Intel Core Ultra 7 155H, 16 GB of RAM, 512 GB SSD and integrated Arc graphics for 850 €.\n\nI've watched a few reviews, and it seems like a great option for general laptop use (browsing, basic productivity and media consumption) but also for content creation (I use Adobe apps fairly often).\n\nI was wondering if anyone her has this same laptop and can tell me their real world opinion.  \nThank you!",
  "Vivabook s14 vs Yoga Slim 7i Total budget (in local currency) and country of purchase. Please do not use USD unless purchasing in the US:**\n \n 1500$ Canadian dollars \n \n* **Are you open to refurbs/used?**\nNot really\n \n* **How would you prioritize form factor (ultrabook, 2-in-1, etc.), build quality, performance, and battery life?**\n \n Good performance\n \n* **How important is weight and thinness to you?**\n \n Not important \n \n* **Do you have a preferred screen size? If indifferent, put N/A.** \n \n Between 14 and 16, not really important \n \n* **Are you doing any CAD/video editing/photo editing/gaming? List which programs/games you desire to run.** \n \n FL studio to make music \n \n* **If you're gaming, do you have certain games you want to play? At what settings and FPS do you want?**\n \n -\n \n* **Any specific requirements such as good keyboard, reliable build quality, touch-screen, finger-print reader, optical drive or good input devices (keyboard/touchpad)?** \n \n reliable build quality \n \n* **Leave any finishing thoughts here that you may feel are necessary and beneficial to the discussion.**\n \n I bought a Asus vivabook s14 with a Intel Core ulta 9 at costco ( I tough it was a good processor, strong enough for my needs) but I've read some bad reviews and I'm not sure about my choice no more\n\n\nThere's a sale at best buy and I hesitated to get the Yoga Slim 7i Aura Edition 15.3\" Touchscreen Laptop (Intel Core Ultra 7) \n\nDo you have any suggestions ? Or is the vivabook s14 a good laptop ? \n\nThank you \n\n\n \n",
  "HP zbook firefly or Lenovo yoga slim 7.. or something else? I need to buy a new laptop because I finally had to update to windows 10  my old HP zbook (Intel i7 4600U - 8Gb ram AMD FirePro M4100) and now it is too slow and I can't use the dedicated gpu anymore because of the drivers. \nI need a laptop for data analysis, heavy multitasking, some CAD and 3d graphing of data.\nI would like a lightweight laptop, with backlit keyboard, preferably 15\" but 14\" is also ok, not glossy... \nSince I liked my old zbook I looked for HP laptops and found this one:\nHP firefly with ryzen 7 PRO 8840HS processor and 16Gb ram (upgradable). \nBut I couldn't find a lot of reviews online. \n\nIn a shop I saw the Lenovo Yoga slim 7. I liked it because it felt quite sturdy compared to the other displayed laptops, and very compact and lightweight.\nI have seen that there is a ryzen version 14\" , and also a 15\" version but only with Intel processors. Unfortunately the ram is soldered, so I don't know if I should go for 32Gb or 16 Gb are enough. \nThey cost approximately the same.  Which one is better? \nOr could I find something less expensive, in the 900-1200 range for example?\nProbably I need more the ram than a fast processor...? \nI think the modern integrated GPUs are better than the old dedicated ones so I don't think I need a dedicated gpu anymore..\n\nThanks\n",
  "For the Firefly, you can also look at reviews for HP Elitebook 845 G11.  Exactly the same machine, the ONLY difference is the BIOS.  Physically identical machines.\n\nI have a Firefly G10 A (7940HS) and an Elitebook 845 G11 (8840U) and I'm impressed with them.  I have the 2.5K 500-nit screen for both, and they're very powerful, INSANELY nice displays, with better than I would have expected battery life given the lcd.",
  "Thank you! This is very good to know.",
  "LENOVO YOGA SLIM 7 VS SURFACE LAPTOP 7  [the firs option - lenovo yoga ](https://preview.redd.it/ua5elp6xa6sd1.png?width=1005&format=png&auto=webp&s=a1d4421500874f27ca51be2450690bbcf4d04fc4)\n\n[the second option - surface laptop 7 ](https://preview.redd.it/3fso3190b6sd1.png?width=929&format=png&auto=webp&s=b26b7766b086546346ae2846e9a6d0ae1f2b88fc)\n\nHi guys i need your help in choosing my next laptop, i had been hunting for a good laptop for my current and future needs and these two are the final ones that i came up with and no i dont want a macbook,and to talk about my current needs here they are - \n\n* Python programming (pycharm)\n* android studio /android apps dev\n* office apps \n* productivity apps(notion, todoist blah blah)\n* wsl \n* min 10 to 20 tabs open(ryt now im having 12 open and its a 8gb ram laptop)\n* always on the move(library to library to classes and late night study sessions)\n\nand to talk about future or else i should say upcoming usecase its the following \n\n1. internship on data science\n2. getting into the programming part in uni for data science\n3. 1080 davinci resolve slight editing nothing srs just slight cut paste and sync and editing \n\n",
  "I was about to buy \"Framework 13\" BUT why is this YOGA Slim 6 so cheap in comparison? Hi!\n\nAlright, let me explain the title. So i don't get laptop prices, sometimes it's the same main components but the price differs by 3x - my experience buying one for mum. I was very interested in the Framework 13 with ryzen 7840U, in Poland I could have it for ~7700PLN (~1800EUR). I've read a little and people are saying this is a good laptop, just you pay a bit extra for the repairability. So I've compared this laptop to Thinkpads t14s/p14s - and I can't actually get a 7840U thinkpad for less (would be ~8300PLN). I've searched other brands on some popular shops and 1) everything is in the +8000PLN range 2) not a lot of options, most stores don't have such expensive laptops outside of macs and some silly red gaming ones.\n\nBUT then I've found a Lenovo Yoga Slim 6 14APU8 for 4200PLN (970EUR) - just a single outlet offer, yes - but the launch price I've found mentioned in some review of 800-1100 EUR is about comparable. So what's the deal with the yoga? What is the range of prices for a laptop with ryzen 7 7840U, at least 16GB of RAM, 1TB of ssd? Is the yoga a crazy good deal or the framework and all the rest a MEGA overpriced deal?\n\nFor some reference: I was looking for a no-dGPU, decently strong multicore CPU, 1TB drive, about 14\" screen, lightweight laptop. Preferably 32GB of RAM (btw which I get on Framework for few dollars extra, while choosing 32GB of ram skyrockets prices of all the other prebuilt laptops i can find in online stores). After a while I've focused on just the ryzen 7 7840U cpu to simplify the search. From all I can find it's seems to be a good deal of a CPU for what i want. I was actually just deciding between the Framework 13 and a comparable thinkpad t14s/p14s/t14, but I've found this yoga deal and it seems weirdly good.\n\nThanks a lot for helping me crack the pricing and all the general advice in my buyers dillema! Thanks!",
  "You're getting the Framework new, the Yoga open box/refurbished.  That accounts for some price difference.  The Framework is truly a boutique build, in that it's low volume built mostly to order, and it offers features that simply aren't offered on ANY other machine.  You pay extra for that.  The Framework also is known for their high build quality, while the Yoga is a utilitarian consumer level laptop with no better build quality than anything else you'd find on the shelf at WalMart/MicroCenter/Best Buy.  Build quality can cost.\n\nThe Framework, while it's coming with 16GB ram, can be upgraded.  Along with the repairability feature, this is worth something to some.  The Yoga is soldered and you can't upgrade the ram, and repairability is very low with almost everything soldered to the board, so if just about anything fails, it requires a new board.\n\nAdd it all up, and that's why the Yoga is so much cheaper.  They're honestly serving completely different niches, even though they have similar builds.",
  "[removed]",
  "thanks, but im unsure about the explanation. This yoga might be open box, gonna ask, but their lunch price was comparable. And for the other differences - it doesnt explain why thinkpad would also be twice as expensive as yoga.",
  "Diy framework? Aren't these the same price?",
  "Yes, it does.  Build quality of a ThinkPad is MASSIVELY better than that of an IdeaPad.  Repairability of a ThinkPad is MASSIVELY better than that of an IdeaPad.  While ThinkPads dont' often have the upgradability (any more) of the Framework, they're much, much higher end devices than the IdeaPads (which is all the Yoga is, just they left the IdeaPad out of the name).",
  "[removed]",
  "hmm okey thanks, will check that out, though the prices on their ram and ssd didnt seem out of place, I can maybe save idk 40eur seemed like",
  "[removed]",
  "checked and i can save 100 usd on ram + ssd",
  "Thoughts on Lenovo Yoga Slim 7? I wanted to get a new laptop and recently stumbling upon this \n\n[https://psref.lenovo.com/Product/Yoga\\_Slim\\_7\\_14IMH9?tab=spec](https://psref.lenovo.com/Product/Yoga_Slim_7_14IMH9?tab=spec)\n\nI find interesting considering it has an Intel Ultra, an Arc integrated graphics card, and being convertible, but not sure will this have good performance or durability since I haven't found any YouTube or web reviews about this exact model\n\nHave anyone bought this new-released laptop? What do you think of it?",
  "[deleted]",
  "Did you buy it? Im looking to buy a core ultra 5/7 touch laptop. Wanted to know if there are any heating/battery issues with lenovo yoga 7",
  "Lenovo IdeaPad Slim 5i v Lenovo Yoga Pro 7?  \n\nConsidering these two laptops and wondering what people's opinions are on them? Needing a new laptop for work, personal use and, not essential but a bit of light gaming (very occasionally play games like Rome 2 Total War).\n\n[Buy LENOVO IdeaPad Slim 5i 14\" Laptop - Intel® Core™ i7, 1 TB SSD, Abyss Blue | Currys](https://www.currys.co.uk/products/lenovo-ideapad-slim-5i-14-laptop-intel-core-i7-1-tb-ssd-abyss-blue-10250702.html)\n\n[Buy LENOVO Yoga Pro 7 14.5\" Laptop - Intel® Core™ i7, 512 GB SSD, Storm Grey | Currys](https://www.currys.co.uk/products/lenovo-yoga-pro-7-14.5-laptop-intel-core-i7-512-gb-ssd-storm-grey-10249236.html)\n\n&#x200B;\n\nI was also half considering the Dell XPS 13, although the reviews seem mixed and it's slightly above my ideal price range but if it's vastly superior would maybe spend the extra money... \n\n&#x200B;\n\nCheers. \n\n&#x200B;",
  "Lenovo yoga slim 7 proX VS Dell inspiron 14 plus (ryzen 7-6800hs and amd graphics vs i7-13620h with intel graphics) Hey, \n\nlooking for a performing laptop that's not too heavy and has good performance, nice screen for work.\n\ni found these two but couldnt really decide since they both seem great and haven't found a review for exactly these two.\n\nAny help appreciated.",
  "If the graphics is important, then there's not a competition.  The AMD IGP destroys Intel by a large margin.\n\nCPU performance the Intel will lead easily, although both are good performance.\n\nEfficiency neither is amazing (given their high TDP nature), but the AMD is better.",
  "Choosing between a Lenovo Yoga Slim 7 Pro X 14 & Macbook Air M2 So I am shopping around for a laptop due to upcoming travels and I am torn between these two. The specs of each system are as follows:\n\n**Lenovo Yoga Slim 7 Pro X 14**\n\nCPU: AMD Ryzen 9 6900HS CE / 3.3 GHz\n\nRAM: 32 GB (6400Mhz) LPDDR5 SDRAM\n\nHDD: 1 TB SSD M.2 2280 PCIe 4.0 x4 - NVM Express (NVMe)\n\nDisplay: 14.5\" - IPS / 3072 x 1920 (3K) / 120 Hz /400 cd/m²\n\nGPU: NVIDIA GeForce RTX 3050 / 4 GB GDDR6 SDRAM (integrated GPU: AMD Radeon 680M)\n\n[Macbook Air M2](https://www.apple.com/shop/buy-mac/macbook-air/midnight-apple-m2-chip-with-8-core-cpu-and-10-core-gpu-512gb)\n\nThe base version of the more expensive one:\n\n* Apple M2 chip with 8‑core CPU, 10‑core GPU, 16‑core Neural Engine\n* 8GB unified memory\n* 512GB SSD storage\n\nThe price points are roughly the same (buying in Sweden FYI) so it's all down to choosing the rig I want really.I certainly understand that I get \"more\" hardware with the Lenovo option but would like to hear what the better pick would be in your opinion and what you would consider before choosing.\n\nI never owned a laptop before, strictly a desktop guy and I am not looking to replace my desktop. I am happy if I can watch movies (Netflix & downloaded), manage 15+ tabs while browsing and play some lightweight games (like Hearthstone) while traveling, obviously I wouldn't mind playing some more demanding games but it's just a bonus. I don't do any video editing or anything like that. I would use it mostly for the things mentioned and work related tasks which is mostly trading via web browser.\n\nI can not upgrade anything on the Macbook Air version without getting outside of my budget. I would have looked at Macbook pro 14 m1 if I had US prices, alas I do not.\n\nI really like the design/look of the M2 and the fact that it has a long battery life. Since I also handle sensitive data I like that Mac inherently have less malwares going around and being developed to target them (even though that number is steadily increasing). It also feels like less of hassle when on the go, lighter, won't have to always bring a charger if I know I have a full charge when heading somewhere etc. My concern is that 8 gb of ram will be pushing it even for non heavy workload stuff (I heard conflicting things, as a PC user 8gb ram sounds like nothing in 2023 tbh) as well as being shoehorned into not ever doing anything demanding would the need arise (I really can't think of anything myself on the spot though).\n\nThe Lenovo clearly is a stronger machine (not in all, but most areas) and since I am a PC guy it's slightly more intuitive to use (I have a Macbook pro from 2015 and honestly, I never found it very confusing when I used it either). Another positive is that I can simply transfer a lot of the stuff I need from my desktop, mostly a convenience thing though. I have tried my best to find reliable reviews of the Lenovo as specced above but they are rare to find, I am concerned that the battery life would be a disappointment.\n\nI am a Android user so I won't be syncing anything with the Macbook if that is a consideration at all.\n\nAny advice or just ideas that could tip me in either directions would be great. Thanks a bunch!",
  "[deleted]",
  "What did you end up with if you dont mind me asking? Are you happy with the decision?",
  "Thanks a bunch for your input. I think the price is due to Apple being significantly marked up in Sweden and there's no costco/amazon to bail us out either :< The Lenovo is a returned unit so it's marked down about 100 bucks or so which helps as well. I am def. leaning towards the Lenovo at this point.  \n\n\nEdit: I did some research, seems like the Lenovo is on sale for [1099 USD at costco](https://www.costco.com/lenovo-slim-7-pro-x-14.5%22-touchscreen-laptop---amd-ryzen-9-6900hs---geforce-rtx-3050---120hz-3072-x-1920-display---windows-11.product.100976621.html). I wish I had access to US prices lol.",
  "In the end I bought a ROG zephyrus g14 w and Ryzen 6800HS and Radeon gfx. I'm very happy with it, got a lot for the money I spent I feel and it's discreet enough if I turn off the led lights on the lid that I don't mind using it on business trips.\n(I was looking to buy the Lenovo but the one configured as mentioned above had a really long lead time in Sweden, I think it was like 6 weeks, that's why I didn't get that one)",
  "ASUS ROG Zephyrus Gaming vs Lenovo Yoga Slim 7 So I need to get a laptop and I’m between these two:\n\nAsus ROG Zephyrus G14 Gaming Laptop – Ryzen 7 4800HS 2.9GHz 16GB RAM 512GB SSD 4GB FHD NVIDIA GeForce GTX 1650 Ti (No Webcam)  $1,218\n\nLenovo Yoga Slim 7 Laptop – Ryzen 7 4700U 2GHz 16GB RAM 512GB SSD AMD Shared Graphics FHD (Webcam) $1,092\n\nI know they’re different as one is gaming and the other is a normal laptop, however I was wondering whether their performance varied that much differently. I don’t need it for gaming but I might need to use data analysis softwares like SPSS and programming with R and Python. I could also be processing large datasets (rarely). \n\nI also need very minor video editing (just cropping unneeded frames from videos and rendering the final video). Also, the videos I would edit are 720p and max 1080p. \n\nI do need a webcam because I have meetings that require a webcam so if I got the Asus, I would have to buy an external webcam. \n\nMy worries are cooling and the laptops overheating because I heard ASUS laptops overheat. \n\nAny comments or suggestions based on these? Any reviews if you use either laptop would be most welcome. \n\nThanks!",
  "I would choose the ROG. because of the GPU. and laptop webcams sucks so you're better off buying a external one anyways.. \n\n&#x200B;\n\nwhy not try other laptops like acer nitro, legion, tuf. they're cheaper than the rog and has the same specs..",
  "So the GPU makes a lot of difference? Keep in mind I don’t game at all and I’m not sure if a dedicated GPU would make programming and light video editing easier. But at the end of the day their specs are similar except for that so I just wanted a feel of their general performance, cooling and durability as well. \nI heard the ROG was better than the TUF in terms of a lot, so that’s why I picked it. The other laptops you mentioned I’d have availability issues with. Tbh I picked a local supplier to make later interactions with them easier so these are the best they have in terms of my requirements for now. I also don’t mind paying more if the product would last longer. I’m not a fan of changing my laptop very often. \nDo you have any other laptop recommendations?",
  "yes it makes a lot of difference. having a gpu is better than only having an integrated one. in video editing, gpu can lessen the load of your cpu that means it will generate less heat, and it can render your videos faster. If you're worrying on cooling, overheating there is a fix for that, all you have to do is undervolt your laptop. I believe there's a way to undervolt ryzen cpus now.   \n\n\nIm using Predator Triton 300 right now. i5 9th gen with gtx 1650. it works great, and the frame of the laptop is steel not plastic so its faster to pull away the heat from the cpu and the gpu. my only regret was buying this laptop too early because they released a ryzen version of it :(\n\n&#x200B;\n\non the other hand, the downside of owning a gaming laptop is your battery life. on max it can only last up to 3 hours..  \n\n\nHaving a notebook laptop like the lenovo yoga is cool if you want long battery life but for me thats really it. \n\n&#x200B;\n\nIf you have the budget and you dont care about the battery life, choose the rog :D",
  "Hmm, yeah that makes sense. I also just saw that they provided the ASUS ROG Strix G15 (Ryzen 7 3.2GHz 5800H 16GB 1TB 6GB 15.6inch) its significantly more expensive at $1,842 but its newer and the processor is better. It’s more SSD and graphics as well and it’s comparatively bigger. Any thoughts on this laptop? I will say, it is tempting but it’s priced pretty high and I’ve only just started my research on it. Do you think it’s worth it?",
  "Actually, no. The difference on the cpu is not that high, they're both 8 cores and the only difference they have is the base clock. You're not gonna overclock it so the G14 is definitely good for you. As you said, you don't game and you're just gonna use it for programming and video editing, you don't need a higher gpu. gtx 1650 ti can serve you a long time. \n\nYou can just upgrade the SSD of the G14 to 1TB or more and even buy a decent webcam that you need \n\noh! and if you buy the G14 you can even buy yourself a monitor.. that would even  decrease the temps of your laptop",
  "Where can I find a Lenovo Yoga Slim 7 Pro in Canada? I saw a review of the Yoga Slim 7 and it checks off all my boxes, I just don't know where to get it, or how even.\n\nHelp?",
  "Lenovo website and basically all you have to do is google Lenovo Yoga Slim 7 Canada my guy",
  "I honestly can’t find it man I have a feeling it’s not sold here.",
  "well dang, that's weird. I searched for yoga slim 7 canada and got back lenovo's website in CAD idk if it helps or not.\n\nhttps://www.lenovo.com/ca/en/laptops/ideapad/ideapad-700-series/IdeaPad-Slim-7-Pro-16ACH6/p/88IPS701670",
  "My review of Lenovo Yoga Slim 7 Pro 5900HX, provides surprisingly good CPU performance for its slim factor. **Info:**\n&nbsp; \nThe performance is incredible for its thin form factor; read further to understand why.\nThis laptop was bought from a nordic retailer called Elgiganten\n\n\n[Retail store](https://www.elgiganten.se/product/datorer-tillbehor/barbar-dator/windows-laptops/266806/lenovo-yoga-slim-7-pro-14-barbar-dator-r9h161tb)\n\n&nbsp;&nbsp;\n\nHere's a pic of the laptop: \n[Pic here](https://cdn.discordapp.com/attachments/583295616470220811/856933484484362300/IMG_20210622_182621.jpg)\n \n\n&nbsp;&nbsp;\n\n\nThe price is pretty hefty, but this was the one with 8 cores in stock, so I went with this after waiting almost 1 year since the announcement of AMD Lenovo Yoga slim 7 Pro 2020 August.\n\n&nbsp;&nbsp;\n\n\n\nI will be using laptops performance mode called extreme capacity and a third party software called AMD APU Tuning Utility (that allows the cpu to consume higher power in longer run) AATU for short which will be used as comparison reference to see if there's performance difference with and without AATU during benchmark.\n\nhttps://gitlab.com/JamesCJ/amd-apu-tuning-utility\n\n\n&nbsp;&nbsp;\n\n**Cinnebench 20: Extreme capacity mode:**\n\nMulti Score: 4520\n\nPeak Cpu Watt: 64 Watt\n\nSustain Cpu Watt: 45 Watt\n\n[Sensor showing power, cpu frequency](https://i.imgur.com/DvmFls1.png)\n\n&nbsp;&nbsp;\n\n**Cinnebench 20: AATU:**\n\nMulti Score: 4891\n\nPeak Cpu Watt: 72 Watt\n\nSustain Cpu Watt: 60 Watt\n\n[Sensor showing power, cpu frequency](https://i.imgur.com/Dw1aXon.png)\n\n&nbsp;&nbsp;\n\n**Cinebench 23: Extreme capacity mode:**\n\nSingle score: 1470\n\nMulti score: 11442\n\nPeak Cpu Watt: 65 Watt\n\nSustain Cpu Watt: 44 Watt\n\n[Sensor showing power, cpu frequency](https://i.imgur.com/1GeKm4H.png)\n\n&nbsp;&nbsp;\n\n**Cinebench 23: AATU:**\n\nSingle score: 1478\n\nMulti score: 12547\n\nPeak Cpu Watt: 73 Watt\n\nSustain Cpu Watt: 60 Watt\n\n[Sensor showing power, cpu frequency](https://i.imgur.com/UFIqDe8.png)\n\n&nbsp;&nbsp;\n\n**Geekbench 5:**\n\nhttps://browser.geekbench.com/v5/cpu/8527380\n\nEDIT: redid the geekbench putting the laptop under ideal condition this time\n\nhttps://browser.geekbench.com/v5/cpu/8539588\n\n&nbsp;&nbsp;\n\n\n**Aida64 Memory Benchmark:**\n\n[Benchmark](https://i.imgur.com/ZDONu1F.png)\n\n&nbsp;&nbsp;\n\n**LatencyMon:**\n\n[Result](https://i.imgur.com/qXYhvga.png)\n\n\n\n&nbsp;&nbsp;\n\n**Keyboard and trackpad:**\n\nThe key travel is a bit short to my liking, but I get used to it eventually. Lenovo comes with FNlock in escape key, which makes it easier to disable and enable. This is still a better keyboard to type than M1 macbook, though.\n\nTrackpad is a glass surface; while it's not that good compare to macbooks, it is still pretty damn close. Very smooth and enjoyable surface to touch. \nThe trackpad has a quiet click and doesn't rattle at all. The trackpad is firm in its stationary position.\n\n&nbsp;&nbsp;\n\n**Battery:**\n\n6 hours, with 60hz enabled and using multiple battery optimization. The screen itself chugs a lot of watt due to the resolution. Considering I'm primarily at the library with power plugged in, I don't find the low battery performance an issue. \n\n&nbsp;&nbsp;\n\n**Thoughts:**\n\nLenovo has built an excellent cooling solution wherewith restrictions temporarily removed, and it can sustain 60 watts in such a slim form factor that provides fantastic performance. Gaming laptops with 5900hx scored 4912, while my laptop with AATU reached 4872, which is incredibly impressive considering how thin the laptop is. \nSee hardware unboxed score of 5900hx [HERE](https://youtu.be/pdO4u87UCYI?t=229)\n\n&nbsp;&nbsp;\n\nThe build quality is up there with m1, and has a premium quality feel to it. The chassis doesn't budge when twisting the base. The screen hardly wobbles, although you kind of struggle to open the lid with 1 finger. The structure rigidity in this laptop case is excellent.\nCuriously, Lenovo decided to throttle performance, capping the max temp at around 85-89 degrees celsius. Doing this prevents the cpu from consuming more watts, thus resulting in suboptimal performance. \n\nAATU bypasses Lenovo throttle restriction and allows the cpu to get a bit more hotter while still staying within acceptable temperature according to AMD. This removal allowed us to consume higher power consumption which brings us better performance. \n\n&nbsp;&nbsp;\n\n\n\nThe fans are also pretty good at idle, where its very quiet and also very good when it ramps up to faster rpm speed. It's very subtle when the fans adjust the RPM speed. \nThe laptop fans stay very quiet even when watching twitch streams in 1080p streams, which is fantastic.\n\nThis laptop came with a lenovos premium warranty service where they offer live support and send technicians to your home to fix the laptop. I've waited close to 1 year for this laptop ever since lenovo announced the 4800H version of this laptop, and I'm delighted with this laptop.",
  "Lenovo IdeaPad Slim 7 GTX reviews? I notice that the IdeaPad Slim 7 GTX (with 15.6\" FHD display, 16 GB RAM, discrete GTX 1650 graphics) has recently become [available](https://www.lenovo.com/us/en/laptops/ideapad/ideapad-gaming-laptops/IdeaPad-Slim-7-15IMH05/p/88IPS701407) for purchase in the US on Lenovo's website. However, I can't seem to find any reviews online yet, so I'm wondering if anyone has experience with this laptop or similar models available internationally (i.e., Yoga Slim 7 etc.)? I'm particularly interested in the configuration with the 6-core i7-10750H - specifically re thermals and noise.",
  "[https://laptopmedia.com/review/lenovo-yoga-slim-7-15-review-powerful-ultrabook-for-your-content-creating-needs/](https://laptopmedia.com/review/lenovo-yoga-slim-7-15-review-powerful-ultrabook-for-your-content-creating-needs/)",
  "Same here",
  "Looks pretty slick, IMO.  If only it didn't have the number pad and had a centered track pad I would be all over it.  Instead I'm trying to decide between the Slim 7 14\" i7 or waiting a couple more months to see if we get any better AMD or Tiger Lake options.",
  "Lenovo Yoga Slim 7 Review - A 10th Gen Core i7 Windows 10 Laptop ",
  "[Just Josh] Yoga Slim 7 PRO - The BEST Laptop I've Reviewed in 2020 ",
  "Does the community want a review of the Lenovo Yoga Slim 7? I'm getting my hands on the new Lenovo Yoga Slim 7  with the 4700u soon. Should I do an in depth review? Possibly a video one? It would include battery life, gaming performance, productivity scores (Cinebench, PCMark, etc.), build quality, keyboard test, gimmick test (Windows Hello and fingerprint sensor, etc.) and internal temperature tests. I'm unable to do screen and in depth temperature camera tests, since I don't own any equipment for such.\n\n[View Poll](https://www.reddit.com/poll/honh70)",
  "Thanks for all votes and comments. I wouldn't wanna make a review that no one looks at, since tests, especially for battery life require incredible amounts of time.",
  "Opinions? Hi everyone! I'm trying to find a new laptop. My last one was a Microsoft Surface Pro from 2017. I'm having trouble picking something new. I don't like the focus on AI (wouldn't use it and might try to disable it as well) and also don't like what Windows is up to but at the same time don't want a Mac (so have accepted that Windows is here to stay). Please let me know what you think about the laptops that I've attached to the post! I'm also open to any suggestions. My price limit is around $1000 USD. I would mostly use it for usual day-to-day activities, but want to learn how to use software such as Adobe. I'm looking for remote jobs so it has to be able to handle that.",
  "Stay away from plastic, especially the ideapad. I had an ideapad, firstly it arrived with a dead hdmi port and it crumbled in an a little more than 2 years. I saw a post here that had a similar crack starting on an asus. I know you don’t want a Mac but it’s actually the best build quality you can get for 1000$ just consider it",
  "Thinking of Upgrading to HP OmniBook X (Snapdragon X Plus) – Advice Needed! Hi laptop community,\n\nThis is my first post in this community and I could really use your advice!\n\nI’m considering an upgrade and need some advice, especially from those who’ve used the new HP OmniBook X with the Snapdragon X Plus. There’s a deal going on at [Officeworks ](https://www.officeworks.com.au/shop/officeworks/p/hp-14-omnibook-x-snapdragon-x-plus-16-512gb-copilot-pc-hpfe1000qu)in Australia right now for this laptop.\n\n**Current situation:**  \nMy Lenovo Yoga 7 Slim Carbon 13\" (Intel i5-1135G7, 8GB RAM, 257GB SSD) is showing its age. Here are my main problems:\n\n* *Small SSD:* I regularly download and watch movies, but 257GB fills up fast.\n* *Slow performance:* The i5-11th gen feels outdated and sluggish.\n* *Low RAM:* 8GB isn’t enough for my workflow—I keep many job application tabs open and learn coding.\n* *Poor battery life* and unreliable keyboard (some keys need to be pressed VERY hard).\n* *Noise:* The single fan runs constantly and isn’t quiet.\n* After this experience, I’m pretty much done with Lenovo.\n\n**Why I’m considering the HP OmniBook X** Snapdragon X Plus\\*\\*:\\*\\*\n\n* It’s got a Snapdragon X Plus chip, which from what I’ve read should be super snappy and efficient (ARM chips = long battery life).\n* 16GB RAM and 512GB SSD solve my speed and storage issues.\n* Slick design and solid build quality—I’ve only heard good things about HP from friends and Officeworks reviews seem positive.\n* Hoping for much better battery life and a quieter, cooler experience.\n\n**My usage:**\n\n* Watching YouTube/movies\n* Learning coding and applying for jobs\n* Lots of browser tabs (mainly job portals)\n* Want a laptop that’s quiet, with solid battery, good keyboard, and enough power for everyday multitasking.\n\n**Questions:**\n\n* How’s real-world performance on ARM Windows laptops? Any compatibility issues for daily use?\n* Is battery life genuinely as good as advertised?\n* What’s your experience with HP build quality and support?\n* Should I consider anything else before making the switch?\n\nAll thoughts, insights, and experiences are very welcome. Thanks in advance for the help!\n\n\\-------------------------  \nUsed perplexity to organize, gather my thoughts and create this post\n\n[HP OmniBook X Qualcomm Snapdragon X Plus](https://preview.redd.it/jqkb1usvyzhf1.jpg?width=1000&format=pjpg&auto=webp&s=bd6d40bd0a6a248242d1a0fc11db0186f4ba031c)\n\n",
  "These ARM chips are indeed super snappy - as you described. However, if you plan on gaming, I would steer clear as many games are simply not available yet.\n\nIf you don’t game, or know your games work, I would highly recommend. But check everything is compatible, or at the very least, will work via Prism.\n\nI personally have been daily driving a Snapdragon X Elite (but MS Surface) since November and absolutely love it. About 90 - 95% of apps I’ve come across have worked (I’ve tested hundreds for my job). The only ones that have problems are driver related (such as printers). But even then, many print vendors are supporting ARM now. \n\nIn terms of battery life and thermals - they’re sublime. It never gets hot and I’ve never heard the fan spin up (even while working in bed!). Battery lasts 8-10 hours I’m and I have to charge it roughly one every day and a half.\n\nSummary: for a work daily driver, I wouldn’t go back to x64-x86. Hopefully Microsoft can keep up the momentum.",
  "Personally ARM on microsoft is still not where it needs to be. Be prepared to get random compiling errors when coding if the VSC plugin even works to begin with.\n\nFun fact, when these snapdragon chips launched, the windows arm version of chrome just didnt work for two weeks. It was broken and you were relying on a third party vendor (google) to fix their shit.\n\nIf you want an arm device, mac is where it is. If you want x86 linux is where it is. If you want to game, windows is where it is.\n\nWindows on ARM is you running beta testing for software, firmware and hardware while paying for the privilege.\n\nAs for your current device, honestly the big hold back would be the ram. It likely is not enough so you are having to use the page file on your ssd which is slower and if you are running out of space on your ssd it would be even slower. Additionally it is likely not dual channel memory so it is kneecapping the processor's performance. In terms of the fan you could redo the thermal paste yeah that likely is not really fixable.",
  "Did you get omnibook x? Planning to get this one too",
  "Thanks so much for the detailed insight!   \nYour real world experience with snap is helpful, I’m not a gamer, so that side effect isn’t a big issue for me, but I’ll definitely double-check the specific software I need (i use vs code and someone mentioned not all plugins are compatible), and look into Prism compatibility.  \n\n\nI went to Officeworks the other day to try out the laptop, and I was impressed with its sleek aluminium build. The keyboard felt a bit odd to the touch, but that’s fine since I’ll be using an external keyboard anyway. I opened around 30 tabs—YouTube, Reddit, news sites, job portals—and there was a slight lag (which I expected), but it didn’t heat up and the fans never kicked in, which was nice!\n\nThe only letdown was the touchpad. It felt premium, but it didn’t always register my single-tap clicks, which got a bit frustrating. Still, I’ll be using an external mouse most of the time, so it’s not a dealbreaker for me.",
  "hey do u mind if i get ur opinion on a few laptops?",
  "Of course you can go for it",
  "If you had to pick one which would it be\n\n-ASUS ZenBook 14 – Intel I7 12th Gen | 16GB RAM | 512GB SSD | Intel Iris Xe Graphics \nspecs: Model: ASUS ZenBook 14\nProcessor: Intel Core i7-1260P (12th Gen, 12 cores, up to 4.7 GHz)\nGraphics: Integrated Intel Iris Xe Graphics\nRAM: 16GB LPDDR5 (soldered)\nStorage: 512GB PCIe NVMe SSD\nDisplay: 14\" Full HD (1920 x 1080) IPS, Anti-glare, 400 nits\nOperating System: Windows 11 Home\nAudio: Harman/Kardon-certified speakers\nKeyboard: Backlit keyboard with precision touchpad\nPorts:\n2 x Thunderbolt 4 (USB-C)\n1 x USB 3.2 Gen 2 Type-A\n1 x HDMI 2.1\n1 x 3.5mm Combo Audio Jack\nMicroSD card reader\nConnectivity: Wi-Fi 6E, Bluetooth 5.2\nBattery: 75Wh, up to 16 hours of battery life\nWeight: Approx. 1.3 kg (2.87 lbs)\n\nORRRR\n-Lenovo ThinkBook 14 G8 - 21SJS00300 - 14\" - Core Ultra 5 225U - 16GB RAM - 512GB SSD - Intel Graphics\nspecs: Processor: Intel Core Ultra 5 225U, 12C (2P + 8E + 2LPE) / 14T, Max Turbo up to 4.8GHz, 12MB\nMemory: 1x 16GB SO-DIMM DDR5-5600.  \nStorage: 512GB SSD M.2 2242 PCIe® 4.0x4 NVMe. \nDisplay: 14\" WUXGA (1920x1200) IPS 300nits Anti-glare, 45% NTSC, 60Hz. \nGraphics: Intel Graphics.  \nPorts:\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1)\n1x USB-A (USB 5Gbps / USB 3.2 Gen 1), Always On\n1x USB-C® (USB 10Gbps / USB 3.2 Gen 2), with USB PD 3.0 and DisplayPort™ 1.4\n1x USB-C® (Thunderbolt™ 4 / USB4® 40Gbps), with USB PD 3.0 and DisplayPort™ 2.1\n1x HDMI® 2.1, up to 4K/60Hz\n1x Headphone / microphone combo jack (3.5mm)\n1x Ethernet (RJ-45)\n1x SD card reader",
  "Id personally lean towards the Asus",
  "Suggest a good business laptop I'm Looking for a good business laptop, for my work, my budget is 1 Lakh (~1100 dollars)\n\nApple is a no, so macbooks are out of the question\n\nMy Requirements\n\nI'll be travelling a lot, so I need a laptop which is light weight but has long battery life.\n\nMy major use cases are, teams and office, editing signing documents, browsing and a lot of research\n\nFor my personal use case Ill use it for media, so Ill prefer an oled screen\n\nAnd more importantly it has to be extremely durable, because of my travelling, people at airports do not handle laptops properly.\n\nSome Non Negotiable requirements\n\n16gb Ram\n512gb SSD\nWindows 11\nWeight under 1.5 kg\nScreen size 14inch (15 is okay, if weigh is under 1.5kg)\nIntel/AMD processor (No Snapdragon)\n\nSome requirements that would be good to have\nTouch screen\n120hz\nFingerprint sensor\nType C charging.\n\n\nIve looked at Zenbook 14 oled, lenovo thinkbook 2 in 1, lenovo yoga slim 7,\nGalaxy book 4 360 and the Surface Pro 13\"\n\n\nPlease give me a suggestion and people who have any of these your review would be great!",
  "Laptop recommendation Hello all,\n\nCurrently, I'm searching for a laptop that's good for heavy programming work with docker/VMs with a bit of light weight \"not for gaming\".\n\nI have chosen **ASUS Zenbook S16** but then saw some bad reviews which made me confused\n\nAlso, this  \nLenovo Yoga Slim 7 15ILL9 Laptop, 15.3\" 2.8K WQXGA+ 120Hz Touch Display, Intel Core Ultra 7 258V, 32GB RAM, 1TB SSD, Intel Arc 140V, English (US) K/B, Win11, Copilot+ PC, Luna Grey | 83HM002WUS   \nbut I'm concerned about the processor and graphics.\n\nI have also thought about mac laptops, but I never used mac OS and I'm not sure how compatible would it be with my work.\n\n  \nAre there any recommendations?? ",
  "Help me choose with what laptop to buy for school! Need all the help I can get Okay so i think i have decided between these three. Its for going to school(ICT) and depending on wich alptop i get, do some gaming on it but that is not a necessity. I'll paste the specs they put online on the school website i am aming for the recomended specs. I am open to trying mac but i am scared that not all of the software that they use can be used on mac so a bit on the fence with that one.\n\n**What do you need?**\n\n**Laptop**  \nYou’ll need a recent laptop to work on projects, take exams, take notes, communicate, etc.\n\n**Minimum requirements:**\n\n* **Processor:** Intel Core i5 / AMD Ryzen 5 (recommended: Core i7 / AMD Ryzen 7) or equivalent\n* **OS:** Windows, Linux, or Mac *(Note: Not all required software is supported on Mac or Windows ARM devices – you’ll need to find alternatives yourself)*\n* **RAM:** 16GB (recommended: 32GB)\n* **Storage:** 512GB (recommended: 1TB)\n* **Wi-Fi**\n* **Webcam**\n* **Chromebooks are not allowed**\n\n**Software**  \nYou don’t need to buy any software yourself yet.",
  "Dell XPS 15 9530/Precision 5690, Asus Zenbook S16",
  "From the 3 picks i would get the g16 but i think for school and such the g14 is a better pick",
  "The dell XPS is not here in belgium for some reason and the zenbook s16 doesnt have 32gb here its only the 24 gb version with a ryzen ai 9 365.",
  "Yeah? I was thinking 16 inch bcs its bigger and better for reading code quickly.",
  "Intel Lunar Lake Laptops 2025 https://preview.redd.it/qxbxukmb1nbe1.png?width=800&format=png&auto=webp&s=bf6f2653ac55aff204cfa8dd454634a046465fd1\n\n**Intel's Lunar Lake processors benefits (**[**source**](https://www.theverge.com/2024/9/3/24233957/intel-lunar-lake-core-ultra-200v-launch)**):**\n\n* Integrated RAM on package for increased bandwidth and efficiency\n* Enhanced energy efficiency and battery life up to 24 hours (video playback)\n* Improved thermal management for cooler and quieter laptops.\n\nhttps://preview.redd.it/6yo3usac5rbe1.jpg?width=3000&format=pjpg&auto=webp&s=d8e885448fd8b676d14660aa60acc9a1933f14cb\n\n**Post in progress, feel free to add more models and links to specs in the comments.**\n\n*Updated: 28.1.2025 (specs correction)*\n\n**13\" Lunar Lake Laptops**\n\n* [Dell XPS 13 9350](https://www.dell.com/de-de/shop/dell-laptops/xps-13-laptop/spd/xps-13-9350-intel-laptop/cn93904cc), 1.2 kg\n   * IPS FHD 120Hz matte ([review](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html))\n   * IPS QHD 120Hz matte\n   * OLED 3k 60Hz matte touch\n* Dell Pro 13 Plus, 1.2 kg\n   * IPS FHD 60hz 6bit matte\n   * IPS FHD 60Hz 6bit matte touch\n   * IPS FHD 60Hz 8bit matte\n* Dell Pro 13 Plus 2-in-1, 1.2 kg\n   * IPS FHD 60Hz matte 6bit touch stylus\n* [Dell Pro 13 Premium](https://www.dell.com/en-us/shop/dell-laptops/scr/laptops/appref=dell-pro-product-line), 1.1 kg\n   * IPS QHD 60Hz touch\n   * IPS FHD 60Hz matte\n* [MSI Summit 13 AI Evo 2-in-1 (A2VM)](https://de.msi.com/Business-Productivity/Summit-13-AI-Plus-Evo-A2VMX/Specification), 1.35 kg\n   * IPS FHD 60Hz glossy touch stylus\n\n**14\" Lunar Lake Laptops**\n\n* [Acer Swift 14 AI](https://store.acer.com/en-us/swift-14-ai-laptop-sf14-51t-75af), 1.3 kg\n   * IPS FHD 60Hz matte touch[ ](https://www.acer.com/us-en/laptops/swift/swift-14-ai-intel/pdp/NX.J1AAA.004)\n   * OLED 2.8K 60Hz glossy\n* Acer TravelMate p6 14 AI\n* [Asus ExpertBook P5 14](https://www.asus.com/laptops/for-work/expertbook/expertbook-p5-p5405/), 1.2 kg\n   * IPS QHD 144Hz matte ([review](https://www.digitaltrends.com/computing/asus-expertbook-lunar-lake-review/))\n* [Asus Vivobook S 14 (S5406SA)](https://www.asus.com/us/laptops/for-home/vivobook/asus-vivobook-s-14-oled-s5406/techspec/), 1.3 kg\n   * OLED FHD 60Hz glossy ([review](https://www.notebookcheck.net/Asus-Vivobook-S-14-OLED-Review-Affordable-quieter-and-long-lasting-thanks-to-Lunar-Lake.939243.0.html))\n* [Asus Vivobook 14 Flip](https://www.asus.com/laptops/for-home/vivobook/asus-vivobook-14-flip-tp3407/techspec/) (TP3407SA), 1.57 kg\n   * OLED FHD 60Hz glossy touch stylus\n* [Asus Zenbook S 14](https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-s-14-ux5406/) (UX5406), 1.2 kg\n   * OLED 2.8K 120Hz glossy touch ([review](https://www.ultrabookreview.com/69717-asus-zenbook-s14-oled-review/))\n* [Dell Pro 14 Premium](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-premium-laptop/spd/dell-pro-pa14250-laptop/gcto_pa14250_usx?ref=variantstack), 1.14 kg\n   * IPS FHD 60Hz matte\n* [Dell Pro 14 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte\n   * IPS FHD 60Hz matte touch\n   * IPS QHD 90Hz matte\n* [Dell Pro 14 Plus 2-in-1](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-14-plus-laptop-or-2-in-1/spd/dell-pro-pb14250-2-in-1-laptop/gcto_pb14250_usx?ref=variantstack), 1.4 kg\n   * IPS FHD 60Hz matte touch stylus\n* [HP OmniBook Ultra Flip 14 2-in-1](https://www.hp.com/us-en/shop/pdp/HP-OmniBook-Ultra-Flip-14---fh0047nr) (FH0047NR), 1.34kg\n   * OLED 2.8K 120Hz glossy touch stylus ([review](https://www.notebookcheck.net/HP-OmniBook-Ultra-Flip-14-convertible-review-Lighter-than-expected.914608.0.html))\n* [HP EliteBook Ultra G1i 14](https://www.notebookcheck.net/HP-EliteBook-Ultra-G1i-unveiled-with-OLED-screen-and-Intel-Lunar-Lake-CPUs.942040.0.html), 1.1 kg\n   * OLED 2.8K 120Hz matte ([preview](https://www.windowscentral.com/hardware/hp/hp-elitebook-ultra-14-g1i-hands-on))\n   * OLED 2.8K 120Hz matte touch\n* [HP EliteBook X G1i 14](https://www.hp.com/us-en/laptops/business/elitebooks/ultra-ai-pc.html#section=products), 1.2 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits matte\n   * IPS FHD ??Hz 800nits matte\n   * IPS FHD ??Hz 500nits matte touch\n   * IPS FHD ??Hz 800nits matte touch\n   * IPS 2.5K ??Hz 400nits matte 100%AdobeRGB\n* [HP Elitebook X G1i Flip 14 2-in-1](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html), 1.4 kg ([specs](https://www.notebookcheck.net/With-efficient-Lunar-Lake-HP-EliteBook-X-G1i-is-the-successor-of-the-HP-EliteBook-1040-G11.941452.0.html))\n   * IPS FHD ??Hz 400nits glossy touch stylus\n   * IPS FHD ??Hz 400nits matte touch stylus\n   * IPS FHD ??Hz 800nits glossy touch stylus\n   * IPS FHD ??Hz 800nits matte touch stylus\n   * IPS 2.5K 120Hz 400nits matte touch 100%AdobeRGB stylus\n* [Lenovo ThinkPad X1 Gen 10 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/smarter-ai-for-all-comprehensive-devices-solutions-concepts-tech-world-2024/), 1.3 kg\n   * IPS FHD ??Hz 500nits touch stylus\n   * IPS FHD ??Hz 500nits touch stylus eprivacy\n   * OLED 2.8K 120Hz 500nits touch stylus\n* [Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition](https://www.lenovo.com/us/en/p/laptops/thinkpad/thinkpadx1/thinkpad-x1-carbon-gen-13-aura-edition-14-inch-intel/len101t0108), 1 kg\n   * OLED 2.8K 120Hz 400nits matte PWM-240Hz ([review](https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-13-Aura-Edition-laptop-review-The-X1-Carbon-is-finally-back.924998.0.html))\n* [Lenovo ThinkPad X9 14 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.2 kg\n   * OLED FHD 60Hz 400nits matte\n   * OLED 2.8K 120Hz 500nits matte touch\n* [Lenovo Yoga Slim 7i Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.25 kg\n   * OLED 2.8K 120Hz 1100nits glossy 99%AdobeRGB\n* [Lenovo Yoga 9i 2-in-1 Aura Edition](https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/), 1.3 kg\n   * OLED 2.8K 120Hz 1100nits glossy touch stylus\n* [MSI Prestige 14 Ai+ Evo (C2VMG)](https://www.msi.com/Business-Productivity/Prestige-14-AI-plus-Evo-C2VMX), 1.7 kg\n   * IPS 2.8K ??Hz\n   * OLED 2.8K 120Hz\n\n**15\" Lunar Lake Laptops**\n\n* [Lenovo Yoga Slim 7 Gen 9 Aura Edition 15.3](https://www.lenovo.com/de/de/p/laptops/yoga/yoga-slim-series/yoga-slim-7i-gen-9-aura-edition-15-inch-intel/len101y0051) (15ILL9), 1.5 kg\n   * IPS 2.8K 120Hz 500nits glossy touch\n   * OLED 2.8K 120Hz 500nits glossy\n* [Lenovo ThinkPad X9 15 Aura Edition](https://www.notebookcheck.net/Going-straight-for-the-Apple-MacBook-Air-Lenovo-ThinkPad-X9-Aura-Edition-without-TrackPoint-announced.942127.0.html), 1.45 kg\n   * OLED 2.8K 120Hz 1100nits\n   * OLED 2.8K 120Hz 1100nits touch\n\n**16\" Lunar Lake Laptops**\n\n* Acer Swift 16 AI, 1,5kg\n   * [OLED 2.8K 120Hz glossy](https://www.acer.com/us-en/laptops/swift/swift-16-ai-intel/pdp/NX.J42AA.001)\n* Asus Vivobook 16 Flip\n   * OLED\n* [Dell Pro 16 Plus](https://www.dell.com/en-us/shop/dell-laptops/new-dell-pro-16-plus-laptop/spd/dell-pro-pb16250-laptop/gcto_pb16250_usx?ref=variantstack)\n   * IPS FHD 60Hz\n   * IPS FHD 60Hz touch\n   * IPS QHD 120Hz\n* [LG Gram 16 Pro (16Z90TS](https://www.lgnewsroom.com/2024/12/lgs-hybrid-ai-gram-laptops-offer-the-best-of-both-worlds-with-on-device-and-cloud-ai-services/)), 1.2 kg\n   * IPS 2.5K 144Hz 400nits matte?\n* [MSI Prestige 16 EVO (B2VM)](https://www.msi.com/Business-Productivity/Prestige-16-AI-plus-Evo-B2VMX), 1.5 kg\n   * IPS 2.5K\n   * OLED 3.8K\n* [Samsung Galaxy Book5 Pro 360 2-in-1](https://www.samsung.com/de/computers/galaxy-book/galaxy-book5-pro-360-16-inch-ultra-5-16gb-512gb-np960qha-kg5de/), 1.7 kg\n   * OLED 2.8K matte touch stylus\n\nSources:\n\n* [The complete list of Intel Lunar Lake laptops (Core Ultra 9 288V, Ultra 7 258V, Ultra 7 256V)](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/)",
  "I have the Lenovo Yoga Slim 7 Aura 15ILL9 with IPS glossy touch screen. There is no matte screen version. Both IPS and OLED display models are covered by glass and reflective.",
  "Great job! 👍\nThank you.",
  "nice job! I'm also in hunt for intel lunar lake, and your research definitely helps! I hope HP Elitebooks and LG 16 Pro launch soon, I agree, both looks promising!",
  "An update on the Asus ExpertBook P5.\n\nAccording to this Czech review (which gives machine translations a hard time! 😄 )\nhttps://www.czechgamer.com/41586/asus-expertbook-p5-recenze.html\n\nAsus should release a version with Wi-Fi 7 and HDMI 2.2 later this year.",
  "Thanks for writing this down. What are the release dates of these devices?",
  "Just for future reference, the Surface Laptop 7 for business 15, 13.8 and 13 inch laptops have lunar lake cpu options.",
  "Quick question the power draw on the chips is limited to 37 , if i connect a external egpu will the power draw increase to match the gpu or is it calculated separately?",
  "Thanks for the hint, its now corrected.",
  "Thanks, I keep working on it. Overall happy to see more matte screen options than glossy. There were some more lenovos announced at ces 25. For me the new HP Elitebooks and LG 16 pro looks promising. The LG also allows 2 ssds.",
  "Thanks for the info and review link. I ordered a cheap version for 880 Eur and will have a good look at it and test if the screen and performance is good for photo editing using lightroom.",
  "You are welcome. Availability depends on your place in the world. Some are already available for order in Europe, like the Asus, Lenovos and Dells and others like the LGs will be released in Feb. To be sure check the manufacturers online shop, contact sales and let us know if you found it out :)",
  "I see you half corrected it haha\nThe IPS model is glossy and touch.",
  "👍",
  "Any idea about the Vivobook?",
  "Thanks",
  "I tested two p5 models a 226v and 258v.\n\n**Price / Performance:**  \nThe Price difference was 880 to 1300 Eur. The technical difference is 16 to 32 gb, 512gb to 1tb and a bit more cpu / gpu power which according to benchmarks results in only 7%-14% performance increase.\n\n**Screen wobbling:**  \nSome reviewers complained about the screen wobbling and the mouse pad clicking. The screen is a non issue in standard settings like using the laptop on a desk or when sitting in a room.\n\nHowever when typing while resting it on the lap a screen wobble is noticable and gets more intense when hitting the same key several times, for example the delete key.\n\n**Mousepad:**  \nThe glas mousepad is decent and very large with some special swipe on the side functions (loudness, brightness, etc..) by a asus tool .\n\n*Quality variations?* The first model had a unproblematic mouspad. The 2nd showed the follwing issue. When resting a finger on a the lower left or right clickable part of the pad and just raising the finger again, the pad bounces up a tiny bit. This is enough to produce an audible damp sound which I find irritating.\n\n**Keyboard:**  \nThe keyboard sounds a bit loud compared to thinkpad for example. It has not much damping. The press depth is decent and overall the typing feels reassuring and comfortable. The big keys which are not flat but slightly convex help with finger center alignment. I noticed not much flex, only when forcefully pressing on the keys, for me nothing to complain about when typing on the keyb. Minor problems: The small up and down keys are somehow easier to misstype and the delete button is not on the very edge.\n\n**Screen:**  \nThe screen is quite good with 144Mhz with a measured contrast ratio of 1:1800 after calibration with sufficient deep blacks:\n\nscreen report before calibration\n\n[https://ibb.co/WvGz9fX](https://ibb.co/WvGz9fX)\n\nscreen report after calibration\n\n[https://ibb.co/qrGCr8x](https://ibb.co/qrGCr8x)\n\nIn both laptops when looking at a black screen in a dim environment I noticed a several points of backlight bleeding at the bottom screen.\n\n**Speakers:**'  \nThe sound quality is decent and included mid levels and some bass. An wow, the volume can be turned up to a very high level!\n\n**Noise:**  \nThe only point that was initially a minus was the fan, which even in balanced energy and silent fan mode has a tendency to spin up and down when the CPU got anything to do, and the sharp spin up is very audible. I tried a lot of Fan Control tools and the \"[Asus Fan Control V5](https://www.majorgeeks.com/files/details/asus_fan_control.html)\"  allows to set the fan to a constant 2000rpm. This becomes barely audible as background noise and could easily be the default for working with power supply in balanced mode. I still have to test the normal fan behaviour in energy saver mode. Using the Asus Fan Control .dll one could also develop a plugin to work with the much more customizable \"[Fan Control](https://getfancontrol.com/)\" open source software.\n\n**Fingerprints:**  \nFingerprints are a non issue since the overall body is silver.\n\n**Overall:**  \nAs described the lower priced model can be a good price/performance buy for people needing an enduring office laptop for overall media consumption.\n\nHowever when looking for a machine for media editing/creation I would reccommend the 32gb version. At that price point there are offers for similar performance products from manufacturers with higher quality standards.",
  "Thanks for the review, especially regarding the build quality and in particular the infamous \"weakness of the screen hinge\".\nIf I understand correctly, unless perhaps one does an extraordinary number of openings and closings, it is a non-issue.\nAnd once the screen is opened, it does not oscillate during use, i.e. typing.\nIs that right?\n\nAlso interesting is the information on the fan and how to work around it to make it less invasive.\n\nGive us updates when you have tried it even more.\nThanks again and good work, or rather .. have fun! 🙂",
  "Correct, there is no wobbling while typing on a flat surface and not shaking ground. Opening/closing wear ican only be determined over time. Any questions welcome.",
  "I mostly use my laptop on my lap lately (or rather, on a plank on my lap). Would you expect screen wobble to be an issue then? When typing or otherwise.",
  "Yes, I have a question.\nDoes the Asus ExpertBook P5 notebook support Wake-On-Lan in the BIOS?\n\nI ask because the notebook does not have an RJ-45 Ethernet port, but Asus provides an accessory (90XB05WN-MCA010) which is a USB dongle that also has a physical Ethernet connection and is declared to support Wake-On-Lan (WOL).\nI imagine that by connecting it at least to the USB-A port on the left side, which supplies power to external devices even when the PC is off, it should be able to turn on the computer.\n\nAlthough such a feature may seem futile for a notebook, since I will keep it as a second home PC (when not travelling) it can be very convenient to manage it, at home, from the main PC (with TeamViewer or similar software).\nI have already done it for my new GMKtec miniPC, which I use as a multimedia PC connected to a TV, and it is very convenient! 🙂\n\nThank you.",
  "I am currently typing this on my lap using the p5. While typing I look at the edges and notice a wobble. The screen does not stand still. It is especially noticable when hitting the delete key several times to delete more characters, then the wobble is more pronounced and could be irritating. When I just concentrate on the written text field it does not take the concentration too much. Hope it helps.",
  "I have the 258v here. In BIOS you can set Boot to UEDI: PXE IPv4 Network Card. Seems like you are lucky. I updated my P5 Review post.",
  "Ah thanks! I've bought one by now and have about the same experience. Maybe a bit less wobble even.",
  "Thanks! 🙂",
  "Need some perspectives on my final choices of new laptop purchase Hello laptop experts/enthusiasts!\n\n  \nI'm in search of a new laptop and have been using an old desktop for more than 10 years and am not too familiar with the laptop market. I have been doing some homework and trying to get a grasp of the specs and how they pertain to my needs.\n\n  \nI plan to continue using my desktop (which maybe just need an upgraded memory as it only has 8GB and I frequently get \"your computer is low on memory\" messages. The laptop will be used mostly plugged in at home, and occasionally be taken out for some light video editing (I'm an artist and need to edit self tape auditions but nothing fancy in terms of graphics or rendering, just cut and paste filmed footage together, adjust audio levels, crop, and fade transitions), web browsing, and media consumption (YouTube, NetFlix, and video playback of films that I physically own, mostly DVD quality and some Blu-ray). I prefer to keep an equipment long term and don't plan on replacing/upgrading every few years, though I understand tech moves quickly and laptops do become obsolete relatively quickly compared to other electronics.\n\nI live in Canada in the west coast and have a budget of around $1000 \\~ $1200 CAD\n\nNote: I don't need ample storage as I plan to store my data on a 5TB external hard drive, so the lower the onboard storage the better as that would lower the price of the laptop. I also don't need AI.\n\n\n\n(I have added taxes in the prices I've listed below for accuracy)\n\nAsus Zenbook 14\" OLED (i7 13700H, 16GB/512GB SSD)\n\n$1232.49\n\n[https://www.staples.ca/products/3098023-en-asus-14-touchscreen-laptop-intel-core-i7-13700h-512gb-ssd-16gb-ram-windows-11-home-bilingual?listId=search](https://www.staples.ca/products/3098023-en-asus-14-touchscreen-laptop-intel-core-i7-13700h-512gb-ssd-16gb-ram-windows-11-home-bilingual?listId=search)\n\n\n\nLenovo \n\nIdeaPad Slim 5 16\"\n\nRyzen AI 7 350, 16GB/512GB SSD\n\n$895.99\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-ai-7-350-16gb-512gb-ssd/19355524](https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-ai-7-350-16gb-512gb-ssd/19355524)\n\n\n\nYoga 7 14\"\n\nRyzen 5 8640HS, 16GB/512GB SSD\n\n$861.28\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-5-8645hs-16gb-512gb-ssd/17756080?source=search&adSlot=1&slotPos=1](https://www.bestbuy.ca/en-ca/product/lenovo-ideapad-slim-5-laptop-16-ips-60hz-ryzen-5-8645hs-16gb-512gb-ssd/17756080?source=search&adSlot=1&slotPos=1)\n\n\n\nRyzen 7 8840HS, 16GB/1TB SSD\n\n$1006.88\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7-2-in-1-laptop-14-ips-glass-ryzen-7-8840hs-16gb-1tb-ssd/17904929](https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7-2-in-1-laptop-14-ips-glass-ryzen-7-8840hs-16gb-1tb-ssd/17904929)\n\n  \nI was really leaning towards the Asus Zenbook 14 and was set on getting it but I keep hearing negatives about its build quality, battery life and longevity (my brother had a Zenbook from 10+ years go where his SSD failed within one year, and he had it replaced under warranty, and it failed again quickly after that; there's also a ton of negative reviews on it on Taiwanese forums). It is the priciest of all the final options I have probably due to the OLED display which is really nice to look at, but I'm not sure if I'm willing to deal with the trade-offs (if they're true).\n\n  \nThe Lenovo Yoga 7 with Ryzen seems to be a good option for my budget. Though I'm noticing the Yoga 7i with Intel processor is significantly more expensive in my region:\n\nLenovo Yoga 7i 14\" (Ultra 5 125U, 16GB/512GB SSD)\n\n$1343.99\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7i-14-2-in-1-touchscreen-laptop-storm-grey-intel-core-ultra-5-125u-16gb-ram-512gb-ssd/17732148](https://www.bestbuy.ca/en-ca/product/lenovo-yoga-7i-14-2-in-1-touchscreen-laptop-storm-grey-intel-core-ultra-5-125u-16gb-ram-512gb-ssd/17732148)\n\nI'm wodering if there's significant advantage that the Intel Core has over the Ryzen that justifies the price increase? Though the pricing might be the way they are due to the promotions they have at the moment. \n\n  \nI think that's all I have for now. Please help me choose, or offer any insights/knowledge you might have! First hand/real world experience with any of the aforementioned models are always greatly appreciated!\n\n  \nThank you in advance for your time! ",
  "The Dell 14 Plus is a good option to add. They also have a sign up coupon for 10% off: https://www.dell.com/en-ca/shop/laptops-ultrabooks/dell-14-plus-laptop/spd/dell-db14250-laptop/caedb14250hbtshksp\n\n\nThe newer Intel Lunar Lake (256V, etc) CPUs offer good performance with greta battery life and has a great integrated GPU.",
  "Thank you for the rec. Will check it out!",
  "Best Choice? Hello,\n\nI'm in the market for a new computer as I just started grad school ( business, so mostly web browsing and excel) and my [current laptop](https://www.bestbuy.com/site/asus-flip-2-in-1-15-6-touch-screen-laptop-intel-core-i5-8gb-memory-1tb-hard-drive-black/2995123.p?skuId=2995123) is from 2015 when I started undergrad.\n\n\nI narrowed my search to these 3:\n\n[Lenovo Ideapad 5](https://www.costco.com/Lenovo-Ideapad-5-14%22-2-in-1-Touchscreen-Laptop---AMD-Ryzen-7-8840HS---WUXGA-(1920-x-1200)---Windows-11.product.1816898.html?sh=true&nf=true)\n\n[Lenovo Ideapad Slim 5i](https://www.costco.com/Lenovo-IdeaPad-Slim-5i-16%22-Touchscreen-Laptop---Intel-Core-7-Processor-150U---WUXGA---1920-x-1200-Display---Windows-11.product.1816969.html?sh=true&nf=true)\n\n[Lenovo Yoga 7i](https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/lenovo-yoga-7i-2-in-1-gen-9-14-inch-intel/83dj0003us)\n\nAny significant differences between Ideapad, Ideapad Slim, and Yoga?\n\nAny significant differences between AMD Ryzen 7 8840HS, Intel Core 7 150U, and Intel Core Ultra 5 125U?\n\nThank you in advance",
  "First one, the amd two in one is def a good deal especially if you like the two in one feature.",
  "First fosho, that’s a great price and I *love* having a 2 in 1. If you are a student, see if you can get a discount to bring that down even more and that will be a godly deal",
  "In this case choose AMD Ryzen 8000 Series over Intel Meteor Lake U Series. Similar battery efficiency but the AMD has better integrated graphics.",
  "First one, no contest",
  "Lenovo IdeaPad 5 2-in-1 WUXGA IPS AMD Ryzen 7 Octa Core 8845HS - (16 GB/ 512 GB SSD/Windows 11 Home) 14AHP9 2 in 1 Laptop (14 inch, Luna Grey, 1.6 kg, With MS Office) is way better with better GPU",
  "1",
  "Pure garbage. Don't buy this thing, many reported hinge problems including mine. Few months after the 2-year warranty expired, my left plastic hinge cover cracked and crushes the display glass. Thankfully the LCD still works fine, touchscreen is dead 1/3 of the display. \n\nTried to complaint to Lenovo service center and whaddya know, 2 people also had the same problem (they still got their warranty). Unfortunately they couldn't do anything.\n\nThe screen is also dim and muted in colors. The addition of touchscreen is nice, but not as nice when it broke. Do yourself a favor and get a Thinkpad or Ideapad 5 Pro if you're going Lenovo as they are much more robust.",
  "I have the second one, the Slim 5i and I would not recommend it for $700 in 2025 for three reasons.\n\nIt is slim but takes up a lot of surface area with the taller 16:10 screen ratio. Not something you want to carry around. \n\nThe big screen would be great but it isn't color accurate or bright. Has a 45% NTSC rating where everything including YouTube feels washed out with a layer of white colors. Basically the same screen they were using in 2021, and likely just threw it on here because they have a lot of old stock.\n\nThe internals feels underpowered and lacks quality. Trackpad makes a flimsy clicky noise, keyboard isn't as polished with key travel, speakers sound tinny with no bass, webcam feels like a phone camera from 2015, it doesn't have 40 GBps thunderbolt 4 instead just basic 5GBps USB c ports. The Core 7 is a rebranded 2023 processor, not to be confused with the new Core ULTRA 7 processor from 2024.\n\nIf you haven't already you can go to a Costco and see these on display and play around with them. I doubt this lasts anywhere near 10 years like your old laptop, maybe just 3.",
  "duly seconded. the processor is a beast, the laptop itself is a good size, and it's too good of a value",
  "the second one is a bad deal considering the processor......its no way near close to the 8840hs performance...also the IGPU is very good",
  "you're right!",
  "Affordable and Durable Laptop (max $1.000) that has a great GPU and 16GB RAM and is NOT a gamer laptop? Any ideas? I work with marketing, I do alot of image editing on Photoshop and 4K Video Editing on Premiere. I also enjoy playing Sims 4 on high graphics\n\nI dont want a gamer laptop because they are too bulky and I need to take this with me to work everyday\n\nSo I need a thin kind of lightweight laptop that has GPU that stands video editing softwares and playing The Sims on High settings for max of $1.000 is there any? I need it to be durable too, I want one to be with me for years\n\nI like Dell laptops but the ones i've seen either have sucky GPU or are heavier like more than 2kg\n\nThese are the ones I'm considering but I dont know if they are trustable brands or if they are durable dont break down easily\n\nhttps://preview.redd.it/tonx6us8tucf1.png?width=1353&format=png&auto=webp&s=d8c0e4dada17cf4bdd2005c9b51ba9d1b1855c6a\n\nhttps://preview.redd.it/lo4v9msbtucf1.png?width=1343&format=png&auto=webp&s=a78f15ccee8a8e471e49083a72d19b29d2e980cd\n\nThis one sometimes you find deals that makes it around $1.099 too\n\nAny options? recommendations?",
  "I love Best Buy Picking this bad boy up for 481 bucks. Open box good condition. Would have gotten excellent but it was way farther away.\n\nThem open box/clearance deals can be crazy\n\nHaven't had a laptop in so many years this is gonna be a huge change lol ",
  "Second that got my 1000 dollar gaming laptop for 650 couple months ago lol i ran to best buy after work that day to grab it",
  "Help me choose between these laptops # candidates\n\n- Asus vivobook s14: oled screen (FHD 60hz), 16GB/1TB, intel core ultra 7 256V, 70whr battery. \n- lenovo yoga slim 7 AMD: oled screen (FHD 60hz), 32GB/1TB, amd ryzen ai 7 350, 70whr battery.\n- lenovo yoga slim 7 intel: oled screen (2.8K 120hz), 32GB/1TB, intel core ultra 7 258V, 70whr battery.\n- acer aspire 14 AI: oled screen (FHD 60hz), 32GB/1TB, intel core ultra 7 258V, 65whr battery.\n- acer aspire 16 AI: oled screen (3.2K 120hz), 32GB/1TB, intel core ultra 7 258V, 70whr battery. (Just because it's the acer with a bigger battery)\n\n# comments on choices\n\nOnly 1 asus model because any of the zenbooks are 4 to 6 hundred euros more expensive.\n\nReviewers praise zenbooks, and say yoga and vivobook are a little behind\n\nI don't like the 16gb ram of the asus but it's the cheapest so it's ok.\n\nAcers have apparently worse build quality, battery life and screens compared to asus and lenovo according to reviews. But other says it's totally okay for the price.\n\n# my opinion (correct me if wrong)\n\nI'm leaning toward lenovo, but i don't know which. intel had several problems in previous years, everyone said AMD was on top. Now they say lunar lake is smoother than ryzen AI, even though amd can be more powerful at times. Is intel the right choice?\n\nHowever I'm worried that the 3k screen will result in bad battery life.\n\nTherefore I considered the other models. the Acer A14 has 1 more usb port and double the RAM of the asus for only 20€ more. Although the acer has a slightly smaller battery\n\nIs the 256v enough? I want to keep this machine for several years and hopefully have it be smooth.\nOr do you need at least a zenbook with a 255H to have a good laptop? Were the reviewers right?\n\nAll the models are also oled for some reason, i am reasonably worried about burn in so i wouldn't have minded a bright IPS, but it wasn't a choice.\n\n# why i need help\n\nWatched and read several reviews and video comparisons of these chips and laptops. Unfortunately none of the reviewers actually had these exact SKUs (even reviewers in my region), so someone complaining about screen quality while having a worse screen or boasting good battery life with a FHD screen instead of a 3K oled is not really helpful. Also price varies differently and what is perceived cheap/a good deal is very different in different markets.\n\n# what criteria did i use to choose these laptops?\n\nI need windows and i want decent battery life. I avoided ARM for compatibility issues.\n\nI'm leaning heavily to newer lunar lake/ryzen AI chips for declared battery life. I would assume none of them actually reach the ~20h of claimed battery life, but i would hope for at least half. I'm hoping to get 10-12h of usage with several chrome tabs (<10), office programs (word, powerpoint) and video calls. (High school teacher). No gaming. Maybe some occasional very light video editing, meaning putting a presentation together for school.\n\nI need at least 6-700gb of space for my work, so 1tb SSD is a must.\n\n16gb of ram is enough now, but since these new intel chips cannot have the ram upgraded i prefer 32 for future-proofing\n\nI would actually prefer a FullHD screen to get more battery life. Don't really need higher resolution at 14\".\n\nI need a light device, easy to carry, but i don't want it to run HOT and having loud fans because of restricted/poor thermal design\n\nI tried to find models with dark keycaps, because i want them to be easy to read.\n\nHDMI port is a must, so are as many usb ports as possible, and I need at least 1 fast usb C for video+charging so that i can connect to a dock.\n\n# why only these specific models?\n\nI have to buy a laptop because my old windows 10 is slow and i need to upgrade to w11 before w10 is EOL.\n\nI have to to buy it from a retailer because my job gives me up to 1000$ gift card (anything over i pay)\n\nThis gift card format is not supported by laptop manufacturers websites, only physical retailers in my country and Amazon. Therefore i cannot go to a manufacturers website and order a laptop to my desired specifications, i have to find a suitable model between the one available in stores right now.\n\n",
  "Thoughts on Asus Zenbook a14? I just bought it  but originally I was gonna buy a lenovo yoga slim 7 but I wanted to see other laptops and came across the asus zenbook a14 i took my time feeling the laptop on the store i liked it and its lightweight, smooth, fast charging, long battery life and etc so i bought it because the only avail lenovo slim 7 is kinda too small for me so i chose the asus zenbook a14 and after that I started looking reviews online and like 70% of them has some bad reviews. I know this laptop cant download certain games Im ok with that. But from your perspective is asus zenbook a14 laptop good for a computer science student and good for future comp sci related jobs like fullstack engineer, software enginner etc",
  "Zenbook A14 has ARM based CPU (Snapdragon) and therefore also Windows 11 ARM edition. This means it has great battery longetivitiy, but compatibility could sometimes be a weakness - mostly in terms of worse performance. Probably that's why it doesn't have such good reviews.\n\nFor a STEM student it would probably be more suitable to have a \"classic\" x86 based CPU (AMD or Intel). Also, I would definitely pick 16:10 display, preferably with 16-inch or at least 14-inch size, because it's more practical for work.\n\nAny renowned laptop series would be okay - be it Lenovo ThinkPad/ThinkBook/Yoga (Pro), Asus Zenbook, HP Spectre, Dell Pro Max Premium, Microsoft Surface, Acer Swift etc.",
  "Help me choose between Lunar Lake or Arrow Lake Laptop As per the title, Im currently looking to get a new laptop for work and alternative pc usage, google chrome with multiple tabs running with light gaming (as in I work via ingame, hosting lobbies, observing etc etc, so mostly the game is on low - medium settings etc). I mainly game on my main pc so that not an issue.\n\nFor Lunar lake, I identified two options (14inch ease of travel) that I liked\n\nAsus Zenbook S14   \nIntel® Core™ Ultra 7 258V Processor \n\n* 32GB LPDDR5X RAM\n* 1TB M.2 NVMe PCie Gen4 SSD\n* Intel ARC Graphics\n* 14\" 3K(2880x1800) OLED 120Hz 400nits 100% DCI-P3 Pantone Validated Glossy Display\n\nTLDR: Its higher priced but premium look, screen brightness being an issue in variable lighting situation, but nothing major.\n\nYoga Slim 7i Aura Edition (14\", Gen 10)  \nIntel® Core™ Ultra 7 258V Processor \n\n* 32GB LPDDR5X RAM\n* 1TB M.2 NVMe PCie Gen4 SSD\n* Intel ARC Graphics\n* 14\" 2.8K (2880 x 1800), OLED, Glare, Touch, HDR 600 True Black, 100%DCI-P3, 500 nits, 120Hz, Glass\n\nTLDR: the lower price option of the two, but nothing else i would nit pick\n\nI have seen the reviews both on reddit and youtube and concluded that these two are good options for my use case especially the battery life which is a big plus.   \n  \nNow the dilemma, should I wait for arrow lake to release their line of laptops considering news of them being significantly better (although more power would come with lower battery life) or would a equivalent of arrow lake version would appear? \n\nThanks in advance if you could help me.",
  "Lunar lake comes with significantly better battery life, faster Ram thats built on the chip. Also comes with Arc Series B graphics.\n\nUnless youre a programmer and do lots of parallel computing the extra cores on arrow lake wont do you much good. But arrow lake can utilize up to 128GB of ram as long as its not soldered on.",
  "I see no real world comparisons of Arrow Lake efficiency outside from cinebench. What about idle or general use?  If arrow lake borrows half the efficiency and cool temps from lunar lake, I'd like the extra performance.  I'm trying to decide between the following, all similar spec 2in1 with 16\" 3k 32gb.\n\n\n-LG gram pro preorder ..arrow lake with dual fan.  No reviews \n\n\n-Asus lunar lake single fan. No reviews. \n\n\n-Dell meteor lake single fan.  I returned it same day as cool mode couldn't tame that hot oven...fans were loud during web use.\n\n\nThe asus is $1350 and the LG is $2k on sale which is insane...at least it comes with a free USB monitor.  Ignoring the price, I'm undecided.  I'd do light gaming, office work, movies, put it on a piano for sheet music, and use it for basic audio recording and online music lessons. I hate fan noise but the LG is dual fan which should help....Asus is lunar lake single fan.  No idea which would be quieter or if I'd need extra multicore for my use. .",
  "Thanks for the input, im not a programmer or doing anything related so the lack of hyperthreading or lower multicore performance doesnt affect me much. Also 32 gb of ram is sufficient for my usage so far.",
  "Have you already made a decision?",
  "The Asus price went up $50.  I ended up getting a previous lower spec Asus Flip S 16 TP3604 from Walmart for 419.  A grand less!  i5 1335U, 8GB soldered RAM, 512 storage, 1920x1200 IPS.  This happens to have a free ram slot for another 8gb but it accepted 32 for a total 40.  I also replaced the SSD with something bigger.  I was lucky enough to find it local.  It's fairly quiet as the U series is low wattage, but the battery is only like 50watthours.  If you get it, there is a thread on Slickdeals (dot net) for the tp3604 that has z link to the RAM module and I posted about the SSD. I don't plan to game much  on this model aside from emulators.",
  "LG's site kept glitching out as well with the partner pricing and their support was absolutely terrible and wouldn't help.  I'll likely never buy LG again after that.  Asus on the other hand was easy to call and talk to.",
  "Which laptop for engineering studies? Hi, I'm a 3rd year chemical engineering student who needs to buy a new laptop. I need to be able to do programming in Python and Matlab, have multiple programs open: PYmol, Chrome/DuckDuckGo, Slack, Zotero, Word, Excel, Schrödinger Maestro etc. with very often multiple tabs (minimum 10 tabs) open in Chrome/DuckDuckGo due to literature research/general learning.\n\nI'm currently doing the 3rd year/bachelor thesis, which is a literature survey and my current laptop is seriously lagging, freezing etc. I also use the laptop for taking notes during lectures, which can be up to 8h per day. So a good battery is prioritised, as well as good enough power to compile code for programming courses and some maths courses where we use Python to solve some assignments. My budget is around 17000 SEK (Swedish krona), which is equivalent to 1767 USD.\n\nI'm currently pending between these models:\n\nYoga Slim 7i Gen 9 Aura edition (15\")\n\n15 027 SEK (lenovo website), Intel Ultra 7 258v, Integrated graphics, 32GB RAM LPDDR5X 8533MT/s, 15.3\" 2.8k IPS, touchscreen, HDR 400, 100% DCI-P3, 500 nits, 120Hz, Wifi 7, 70Wh battery.\n\nYoga 7i 2-in-1 Gen 9 14\"\n\n12 779 SEK (lenovo website), Intel Ultra 7 155H, Integrated graphics, 32GB RAM LPDDR5X 7467MT/s, 1TB SSD, 14\" 2.8k OLED, touchscreen, HDR 500, 100% DCI-P3, 400 nits, 120Hz, Wifi 6, 71Wh battery, Support for pen.\n\nYoga 9 2-in-1 14\" 14IMH9\n\n15 428 SEK (online store), Intel Ultra 7 155H, Integrated graphics, 32GB RAM LPDDR5X 7467MT/s, 1TB SSD, 14\" 2.8k WQXGA+ OLED, touchscreen, HDR 500, 100% DCI-P3, 400 nits, 120Hz, Wifi 6E, 75Wh battery, Support for pen.\n\nYoga Pro 7 AI 9 14.5\" 14ASP10\n\n15 490 SEK (online store), AMD Ryzen AI 9 365, Integrated graphics Radeon 880M, 32GB RAM LPDDR5X-8000, 1TB SSD, 14.5\" 3K OLED, touchscreen, HDR 600, 100% DCI-P3, 500 nits, 90Hz, Wifi 7, 84Wh battery.\n\nI've also had a look at a Thinkpad T14s Gen 4 (15 927 SEK) which is within budget, but I've read that it has bad battery time (57Wh)...\n\nWhat should I choose? I've been reading so many reviews and can't make up my mind. I like the 2-in-1 for taking notes and anotating articles. But I can continue with writing on paper or buy a cheap tablet for that purpose.\n\nMy priority is multitasking and compiling power with low fan noise as well as lasting a full day of studying/note taking during lectures. And minimum 14\" screen.\n\nThank you in advance! Really appreciate any advice\n\n(Crossposting here and on r/lenovo)",
  "Choice between 4 for office work and basic home use Which would you get?\n\nRefurbished with 2 year warranty - $465\n8845HS, 16GB ram, 1 tb SSD\nhttps://www.ebay.com/itm/235748207972?mkcid=1&mkrid=711-53200-19255-0&siteid=0&campid=5338849293&customid=ALTECH50&toolid=10001&mkevt=1\n\nOpen box fair (true condition unknown) - $529\nOLED,Intel Core Ultra 7 155H, 16gb Ram, 1 TB SSD\nhttps://www.bestbuy.com/site/asus-zenbook-14-oled-14-wuxga-touch-laptop-intel-core-ultra-7-intel-evo-edition-16gb-memory-1tb-ssd-jasper-gray/6568761.p?skuId=6568761\n\nOpen box fair (true condition unknown) - $769\n120hz 2880x1800, Intel Core Ultra 7 295v, 16gb Ram, 1 TB SSD\nhttps://www.bestbuy.com/product/lenovo-yoga-slim-7i-aura-edition-copilot-pc-15-3-3k-touchscreen-laptop-intel-core-ultra-7-16gb-memory-1tb-ssd-luna-gray/6594998/openbox?condition=fair\n\nOpen box fair (true condition unknown) - $769\n120hz 2880x1800 OLED, Intel Core Ultra 7 155H, 16gb Ram, 1 TB SSD\nhttps://www.bestbuy.com/product/lenovo-yoga-9i-2-in-1-14-2-8k-oled-touchscreen-laptop-with-pen-intel-core-ultra-7-155h-with-16gb-memory-1tb-ssd-cosmic-blue/6571371/openbox?condition=fair\n\nI'm kinda leaning toward the 2nd one since it's a cheap OLED. I didn't list all of the good stuff (battery life, build quality, speakers, etc); just the main specs that stood out to me. Hoping to get some help choosing. I know it also hinges on the condition. First one is allegedly like new and haa reviews vouching for the seller. ",
  "I can't edit the post but I meant to write 256v for the 3rd processor, not 295v lol.\n\nAlso, found this deal on the laptopdeals subreddit which seems to be a better value than everything I linked:\n\nhttps://www.ebay.com/itm/276429578117?amdata=enc%3AAQAJAAAAoHoV3kP08IDx%2BKZ9MfhVJKlzUGd1oNcjd3bpRH6ieEAreNmw1YOaMXFjlvgvl%2BF7HO89SR%2B%2BDaRimN87oN5etJAwIiF6bz8CZUTHQuJYQvjnbT5Y%2BMmENmNMmn7R6pt4u8Fi09DAtLEvTOX2pk7ekTgUG7cBlctHKhFd7msTHdToOaUN86RTZnbKEZJBdEL1T7SSlek1f1Azh7sEvzuw9%2Bg%3D&mkcid=1&mkrid=711-53200-19255-0&siteid=0&campid=5338849293&customid=ALTECH50&toolid=10001&mkevt=1",
  "2nd one for cheap OLED, 3rd for gorgeous screen and also says it's excellent condition so like new. Fair warning (lol) fair condition can mean some incredibly bad condition.",
  "yeah I know lmao - I bought a fair 5.2.1 (if im remembering the notation right) soundbar once and they tried to get me out of there with no subwoofer, no satellite speakers and no cables. I had to find them in the store myself LOL. But at the same time, I've had employees tell me that they mark stuff as the lowest condition to game the system and price it to sell.\n\nWhats your opinion on this:\n\n[https://www.ebay.com/itm/276429578117?amdata=enc%3AAQAJAAAAoHoV3kP08IDx%2BKZ9MfhVJKlzUGd1oNcjd3bpRH6ieEAreNmw1YOaMXFjlvgvl%2BF7HO89SR%2B%2BDaRimN87oN5etJAwIiF6bz8CZUTHQuJYQvjnbT5Y%2BMmENmNMmn7R6pt4u8Fi09DAtLEvTOX2pk7ekTgUG7cBlctHKhFd7msTHdToOaUN86RTZnbKEZJBdEL1T7SSlek1f1Azh7sEvzuw9%2Bg%3D&mkcid=1&mkrid=711-53200-19255-0&siteid=0&campid=5338849293&customid=ALTECH50&toolid=10001&mkevt=1](https://www.ebay.com/itm/276429578117?amdata=enc%3AAQAJAAAAoHoV3kP08IDx%2BKZ9MfhVJKlzUGd1oNcjd3bpRH6ieEAreNmw1YOaMXFjlvgvl%2BF7HO89SR%2B%2BDaRimN87oN5etJAwIiF6bz8CZUTHQuJYQvjnbT5Y%2BMmENmNMmn7R6pt4u8Fi09DAtLEvTOX2pk7ekTgUG7cBlctHKhFd7msTHdToOaUN86RTZnbKEZJBdEL1T7SSlek1f1Azh7sEvzuw9%2Bg%3D&mkcid=1&mkrid=711-53200-19255-0&siteid=0&campid=5338849293&customid=ALTECH50&toolid=10001&mkevt=1)\n\n  \nThis actually seems better than all 4 I posted.",
  "Oh yeah - the 3rd one, I can do excellent for $760 or fair for $699. I kinda crossed my wires there. The new chip should be really good on battery life.",
  "Looking for durable, long lasting, quiet, bright laptop. Doesn't have to be really performant. Good day!\n\n**===== Mandatory requirements =====**\n\n**\\* A good battery life**. So CPU+GPU isn't needed, APU should be enough. For communication, light programming, light 3D design, light music production in Ableton with not many VSTs, and similar tasks. Kind of \"a machine for a student\", I guess?\n\n**\\* A good build quality**. Probably full metal then, right? I don't want to deal with broken hinges and similar problems. I'd like to be able to throw it into my backpack and don't worry too much about breaking it (to an adequate limit, of course).\n\n**\\* A silent cooling solution**. I shouldn't hear fans at all in any tasks except heavy ones: VS+VSC in debug + browser with many tabs opened + etc.; Ableton in high quality with many VSTs. If APU is relatively weak, so it's not able to deliver high performance, but it never makes the laptop noisy too -- alright, that's fine too. It doesn't have to be the latest tech.\n\n**\\* A bright, colorful screen**. I have a bad experience with other laptops (some were older models, some were newer) loosing maximum brightness relatively rapidly. So, as for a typical no-brain consumer, my first though is to battle this with the higher maximum brightness, say 500+ nits. What, in most, but not all, cases, automatically means an OLED screen. What lies along the \"colorful\" requirement. I don't have a huge fear of burn-in, I'm using a Steam Deck OLED since launch and an OLED smartphone for a few years; but feel free to warn me if you see a need, you're welcome. IPS is fine too, but OLED is preferable. But overall, if you think that the idea of battling the problem of \"loosing maximum brightness\" with higher maximum brightness is dumb -- I'm all ears.\n\n**===== Optional requirements =====**\n\n\\* Small pleasant touches that everyone wouldn't be against having in their own laptops. Like a **comfortable keyboard** (I type a lot, like really a lot, well, you see yourself), **precise touchpad** (this would be great, to be able to finally efficiently use laptop without mouse), **nice sounding speakers**, **many ports** (especially USB-C), **fingerprint reader**, **low weight**, **fast and stable Wi-Fi/Bluetooth**, etc. Would be nice to be able to charge it with USB-C port, not DC, but probably that's already included in modern laptops, and I'm just not aware. Okayish webcam (if it doesn't have a shutter -- no problem, I'll glue it with a tape myself 😄).\n\n\\* **I have nothing against ARM** APUs (M1, M1 Pro or Snapdragon; I don't see a need in M2 and newer, but we'll see), but I don't want to be a beta-tester and especially pay for it with my own money. I don't want to have VS/NPM/VST/.NET (not .NET Core) and other more common-usage (old software) compatibility problems. May this even cost me a small(!) downgrade in price, performance, or battery life -- reliability is more valuable to me. So **x64 is preferable**. But if you have pleasant personal experience with ARM -- I'll gladly listen to your arguments, why not.\n\n\\* If the laptop doesn't suck air from the bottom (or does, but not only from there), so I **can calmly throw it on any surface including a sofa or a pillow** \\-- that'd be nice.\n\n\\* **A touchscreen, or even a transformer**. Just a nice feature in some apps, say in Internet browsing, but I can live without it. By the way, I just caught myself thinking that, on practice, transformers may actually be even more durable because of those 360-degree-rotating hinges. I wonder if that's true 🤔\n\n\\* Size? Hm... 14\" is probably alright, but I lean more towards **15\", and even 16\"**. Less portable, sure, but it's worth it. I have a moderately performant device with a small screen already -- my smartphone.\n\n\\* I think **16 GB of RAM** should be enough for a device of such performance. As for the **SSD capacity -- the more -- the better**, depending on the price. To the point of also having a quiet but big (few TBs) HDD inside as well (but that may be too old-fashined and so rarely present nowadays, I assume 😄). **I have no problem with opening a laptop** and replacing the SSD, if I feel satisfied, and I'm going to keep it. Same about adding more RAM in the future (if it's not soldered, of course).\n\n\\* **Antiglare screen coating**. Not a matte, but a slightly matte -- antiglare. After using a Steam Deck OLED 1 TB with such a screen coating I've started loving it and would like to have it here too. If can be purchased separately -- no big deal, I can purchase and apply it myself. But, probably, then better the screen be glossy, right? To not end up being too matte, after applying the external antiglare coating.\n\n\\* **If x64 then AMD APU**. I have trust issues towards Intel. But if you see them pointless -- alrighty, I can try Intel too.\n\n\\* **60+ Hz screen, preferably 120 Hz**. Yes, even OS UI animations become more pleasant to look at.\n\n**===== What about examples I've found already in this subreddit and not only =====**\n\n\\* **Macbook Pro 16\" M1 Pro 16/512 or 16/1024**. Yes, ARM, compatibility problems (potential and confirmed). But if x64 alternatives are much worse and/or much pricier -- seems like I'll have to deal with those problems then, spend personal time on relearning a lot of things (never used Mac before).\n\n\\* **Macbook Air 15\" M2 16/512 or 16/1024**. Older 13\" is way too small. And this is at the same price as a Mac Pro higher, so I don't see a point in this one.\n\n\\* **Asus Zenbook 14 OLED UM3402YA**. A lot of complaints on the noise, but an interesting variant.\n\n\\* **Lenovo Yoga 6/7, Yoga Slim 6, Yoga Pro 7, Yoga Slim 7 Pro**. Brightness looks very low (300-400 nits), but except that -- this is the closest I've found. There are complaints about noise too, but, in comparison, there seem to be not as many of them (of complaints).\n\nThank you in advance and take care of yourself 👋 Ready to answer more aiming questions if needed. Will look for it in Europe. Budget: \\~€1000 for something interesting just not performant, \\~€2000 for something both interesting and performant (Mac Pro).\n\n**===== Updates =====**\n\n1. [Asus Zenbook 14 UM3402Y](https://www.notebookcheck.net/Asus-Zenbook-14-UM3402Y-laptop-review-New-Ryzen-7-7730U-name-old-Zen-3-performance.724864.0.html)\n\n*\"Asus advertises a peak brightness of 550 nits which we can confirm only when displaying HDR content. When running* [*this HDR test*](https://www.youtube.com/watch?v=NlAsAuBtmps)*, for example, we're able to record a maximum brightness of 542 nits on our test unit. Otherwise, maximum brightness is limited to just \\~340 nits when displaying SDR content which is still in line with most IPS-based subnotebooks.\"*\n\nWTF Asus? I've been relying on this characteristic so much. Welp, at least taking this into account will now add quite a bunch of other models into the pool of \"interesting\" ones. A lot of IPS screens, for sure.\n\n2. Apple MacBook Pro 16\"\n\nThe same, 1000+ brightness is awailable only in HDR, in SDR its \\~500. WTH?",
  "Yoga Pro 9i vs ThinkPad P16s Gen 2 (AMD) \nReally struggling to decide between the two machines. I am about to start studying product/industrial design at uni. I’ll be using a bit of solid works, rhino, adobe suite, taking notes etc etc. I’ll be carrying it to and from uni each day in my backpack, so I’m considerate of weight. Please note I’m in Australia, so all prices are in AUD. Admittedly, I’m still quite new to the world of PC’s and the intricate differences of CPU, GPU, single cores vs multi core performance etc etc.  I’m learning a lot!\n\nI was pretty convinced by the Thinkpad P16s Gen2 with the AMD processor. Whilst it has an integrated GC, the performance looks great and it’s still accredited by Dassault. I also like that the charger is USB-C. I’m also drawn to an AMD processor.\n\nHowever. I came across the Yoga Pro 9i on the Lenovo outlet store and I was impressed by the specs. Having a Dgpu is tempting, even though it isn’t an accredited piece of kit by Dassault. I just don’t really know a lot about them and their performance. \n\nUnfortunately, I can’t really find any comparison reviews for the two laptops and I just can’t decide. Does anyone have any input or suggestions?\n\nYoga Pro 9i \nWeb Price $4,911.00\nLenovo Outlet Price $3,093.93 (37% off)\n\nSystem specs:\n* Processor - Core ULT9 185H 2.3G 16C 22T\n\n* Operating System - Windows 11 Home 64\n\n* Graphic Card - RTX4060 8GB G6 128b\n\n* Memory - 32GB(4x64Gx32) LP5X 7467\n\n* OnBoard Storage - 1TB SSD M.2 2280 G4 TLC\n\n* Display - 16 3.2K GL 400N 165 MT P3 G\n\n* Camera - 5MP IR Camera w/Dual Mic\n\n* Optical Drive - No Optical Drive\n\n* Battery - 4Cell 84Wh Internal\n\n* AC Adapter / Power Supply - 170W Slim 30%PCC 3P BK ANZ\n\n* Fingerprint Reader - No Fingerprint Reader\n\n* Warranty - N01 1Y Courier/Carryin\n\n* Colour - Luna Grey\n\n\nThinkPad P16s Gen 2 (AMD)\nWeb Price $4,020.50\n$2,915.23 (27% student discount)\n\n* Processor - AMD Ryzen™ 7 PRO 7840U Processor (3.30 GHz up to 5.10 GHz)\n\n* Operating System - Windows 11 Pro 64\n\n* Graphic Card - Integrated Radeon 780M Graphics\n\n* Memory - 64 GB LPDDR5X-6400MHz (Soldered)\n* Solid State Drive - 1 TB SSD M.2 2280 PCIe Gen4 Performance TLC Opal\n\n* Display - 16\" WQUXGA (3840 x 2400), OLED, Anti-Reflection/Anti-Smudge, Dolby Vision™, Non-Touch, HDR 500 True Black, 100%DCI-P3, 400 nits, 60Hz\n* Camera - 5MP RGB+IR with Microphone\n* Battery - 4 Cell Li-Polymer 86Wh\n* Power Cord - 65W USB-C Slim 90% PCC 3pin AC Adapter - ANZ\n\nTIA!",
  "Lenovo Yoga 7i 2-in-1 I am getting a laptop for uni and may use it extracurricularly of course and idk what exactly but i am still young and might explore fields\nI want a high-mid range device\nI like the specs of this yoga for the amd ryzen 7 8840hs and oled\nAlthough i don't really need the 2-in-1 as i have a tablet\nSo i've seen a lot of people questioning the hinge's durability\nSo should that be a dealbreaker or how is that avoidable.\nOther lenovo options are much more pricey ; and i don't need something so high end\nJust a solid quality build\nAnd a great display cause i do long hours due to uni(med)\nSo what are other options\nAnd has any one here had hinge issues ?\n\nEdit: I've also seen the slim 7x\nIt's generally cheaper in some stores and is great but i absolutely hate it's port selection ; really kills it\nSeen some reviews saying the slim 7 pro ain't that good also. So idk what to do at this point",
  "Please help me choose between HP OmniBook Ultra Flip and Asus Duo (UX8406MA) Please help me choose between HP OmniBook Ultra Flip and Asus Duo (UX8406MA). I watched tens of videos, read forums, reviews, etc. and still can’t decide. I understand, that Ultra Flip is probably better for my use case, bet Asus dual monitor setup is so nice.\n\n **My use case:** I (almost) always have my laptop with me (carry it around a lot). ***70% of the time*** I’m using it in the dock, where one additional monitor would be nice, but not really essential.\n\n***25% of the time*** I’m using it on my lap (bed, air planes, cars, buses, staircases, etc.), where second monitor is unpractical.\n\n***Remaining 5%*** I’m using it in meetings, conferences, at the clients etc., where second monitor could be useful.\n\n**My main concern is durability.** In the last 15+ years when I switched to laptops average lifetime span of my laptop is bellow 4 years. My current Yoga Slim 7 is already falling apparat (2 keys cracked and trackpad is failing). In my opinion Duo has considerably more possible points of failure. HP also known for having problems with the 2in1 hinge in the past.\n\nBattery life is important, but I believe I can live with 6-8h of Duo. I do not care match about additional 300g weight. \n\n**Why I’m considering two so different laptops**. When I started looking for the new laptop Duo was really out of my price range, therefore after long considerations I settle with Ultra Flip, but after recent price drop Duo essentially became around 100 Euros cheaper than Flip (with flip I also need to buy pen, and buy/carry HDMI and USB – A dongles).",
  "Lunar Lake / AMD 370 - Dedicated GPU needed or not?? Hi guys,\n\nLooking for a creative laptop that I can do video/motion/graphic design on. \n\nIdeally I would like rather a Lunar Lake process or AMD370. \n\nTrying to find a laptop larger than 14inch with a dedicated graphics card with the new 2024 chips are seeming hard. The [MSI Stealth A16](https://business.currys.co.uk/catalogue/computing/laptops/windows-laptop/msi-stealth-a16-ai-16-gaming-laptop-amd-ryzen-ai-9-rtx-4060-1-tb-ssd/N665021W) has what I am after although seems not to be having great reviews from people who have bought this device. \n\n  \nDo I just go for the [S16 AMD 370](https://www.currys.co.uk/products/asus-zenbook-s-16-oled-16-laptop-amd-ryzen-ai-9-1-tb-ssd-white-10266785.html), 32GB Ram, 1TB without the dedicated graphics card and hope it will be okay with basic video/motion graphics? I do like the fact it has 16inch OLED touchscreen although just scared it wont be able to hack the creative suite. \n\n14inch just is too small or else id go for the S14. \n\nThere is also the [LENOVO Yoga Slim 7](https://www.currys.co.uk/products/lenovo-yoga-slim-7-aura-edition-15.3-laptop-intel-core-ultra-7-1-tb-ssd-grey-10269807.html?istCompanyId=bec25c7e-cbcd-460d-81d5-a25372d2e3d7&istFeedId=4d7eb93e-055f-499d-8ee5-1cdcc50d67d1&istItemId=mailrpmtq&istBid=t&srcid=198&cmpid=ppc~gg~1011+(Shopping+Ads)+Laptops+-+PMAX~~Exact~71700000119370766~&mctag=gg_goog_7904&kwid=GOOGLE&device=c&ds_kids=&tgtid=1011+(Shopping+Ads)+Laptops+-+PMAX&&gad_source=1&gclid=Cj0KCQiA4rK8BhD7ARIsAFe5LXKQsRdJIAXCoeHLLimIcfty-CBR_iHTCVKX6tqQq1x3PM_OCyhSPFUaAjzeEALw_wcB&gclsrc=aw.ds) although it runs the lower Intel  Ultra 7 processor 258V and does not have the OLED screen.\n\n  \nWhat would use recommend, go for the S16 AMD370 or go down the dedicated graphics card route.\n\n"
]