[
  "Vostro 7510 Review/ Advice Request  \n\nI really appreciated this (and other) reddit when I was searching for a laptop, and wanted to return the favor with a quick review of this laptop. I am not a formal laptop reviewer, and don’t have fancy gizmos to check nits or color accuracy, but wanted to share. I have only been using it for about a day or two, and I may or may not post some updates as I use this more. There’s also some chance that I will return it. \n\nModel: [https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/new-vostro-7510-laptop/spd/vostro-15-7510-laptop/smv157w10p1c4005?view=configurations](https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/new-vostro-7510-laptop/spd/vostro-15-7510-laptop/smv157w10p1c4005?view=configurations)\n\n(purchased on sale for $1150 + 10% CB).\n\nI wouldn’t mind some advice from the sub on whether to keep this or return for one of two slightly more gamery computers that will seemingly solve some of the issues I have with this - either the Lenovo Legion 7 Slim or the HP Omen 16.1 AMD (if it gets released on HP’s site soon enough). \n\n**Background:**\n\nI joined a small business and needed a laptop. I purchased my last laptop \\~11 years ago and while it aged gracefully… that's like 85 in laptop years. Business required that the laptop have Windows 10 Pro, and preferred that it have biometric security. I wanted it to be thin, and have good build quality so it will hold up well. I also wanted to be able to play the new AOE when it comes out (i.e., light RTS and 4x type games). Finally, I needed the laptop yesterday so I didn’t have time to wait around for the best deal.\n\n**Weaknesses:**\n\nI think this laptop falls short in a few ways: (1) it spontaneously shut down the first day I was using it. Enough battery, updated Microsoft drivers, and no indication of why when I turned it back on. Not sure what it was, but I updated the Dell drivers and it hasn't happened again in the few hours of use since that. (2) Battery life could be better, once I was down to less than 40% after about 3 hours of (non-gaming) use (downloading and installing some applications, light browsing). As I type this I have 2:56 estimated remaining at 77% of the battery on “better battery” setting. The battery estimate was also all over the place. I don’t think it’s fair to expect much more out of a 56 whr battery, but I think it is fair to expect more than a 56 whr battery in this kind of laptop. (3) The keyboard is ok - typing feels nice enough, although I liked my old Lenovo’s keyboard a little bit better. The backlighting is a joke. (4) Cooling. I ran Offworld Trading Company, which was free from Epic Games at the time I received this computer, and after less than 15 minutes of play I found the palm rest to be warm, and (using a food thermometer) found the temperature to be over 100 fahrenheit on the speakers, and about 127 fahrenheit right underneath the vents. The fans were noticeably loud as well. Task manager says the GPU got up to 65c. That seemed pretty warm for a few minutes of play on a 5 year old game.\n\n**Strengths:**\n\nThe strengths are in the specs: i7 with a 3050ti, aluminum chassis (there is a very thin plastic bezel around the screen, but it's small enough to get over. Pretty good build quality. Touchpad is spacious. It’s relatively heavy for a 2021 laptop, but it has a dGPU and is pretty thin. Screen is pretty nice and color accurate, although I suspect nothing special in 2021. And I will be able to play aoe4 on this (when it comes out). \n\n**Dell Customer Service:**\n\nI also wanted to call out a good experience with Dell Customer Service. Without getting into the details, they made things right quickly and followed up to make sure things ended up ok. \n\n**Request for Advice:**\n\nWhen I was looking at this I was also between the Lenovo Legion 7 slim which is a few hundred dollars more, but has a higher refresh screen and the 3060. I decided that because I am looking to play RTS/4x games that are typically not AAA graphically intensive, a 3050 would be enough and I would be better saving the money. \n\nI was also considering the new HP Omen AMD 16.1, but it still hasn't been released on HP’s website (where they have frequent 10% off gaming PC sales), and given that I need something now, I may not be able to wait until they can ship it.\n\nNow that I have used the Vostro, and have pointed out the above concerns, do you think I’ll get (a) significantly better battery life on one of those other options, and (b) is the cooling significant enough to cause problems with my use of the Dell?",
  "Just 1 question. Does it have 1 or 2 SO-DIMM memory slots??\n\nOne review said 8GB is soldered. One Dell maintenance manual shows 2.\n\nI'm between this and the 15\" LG Ultra with the GTX 1650 Ti. The Dell has the true full size number pad, but the LG's is the crammed version.  For me this is between soldered ram or not. If 1 is soldered, then I'll have a tough decision. \n\nSo, please pop the back cover and let us know?\n\nThanks!!",
  "I reached out to Dell. They confirmed its 2x SO-DIMM slots that support up to 64GB RAM!",
  "You’ll need to consider whether you want a gaming laptop or not. The Vostro is not a gaming laptop and won’t perform like one. It is a premium build quality well rounded business laptop with top specs. It will get hot when gaming over long periods of time. If you want something with more power you should consider the Lenovo legion slim 7 or if you don’t want a gamery feeling laptop the Ideapad 5 pro 16.",
  "Do you know if it has one or two M.2 SSD slots/what the storage upgrade options are like?",
  "Hi there, have you been able to play AoE4 on it since the release of the game and would you recommend this laptop for this game? I am looking for a decent laptop for everiday tasks, with a moderate price, and not especially oriented for gaming but I would love to be able to run AoE4 (but no other AAA games that are massively demanding on GPU, CPU and memory).",
  "I just got this laptop RTX3050 version, and I have to say, I believe the design around the battery life and cooling system is very poor. I thought mine is broken, after reading similar stories from other owners similar experiences are confirmed. I’m frustrated and disappointed with this product from Dell. The battery needing to be bigger and cooling system larger. IMO it’s flawed heavily. You can’t game on it either, the RTX3050 is very weak. The screen is average. Considered returning it for a different model but I’m too busy at work. \n\nWould not go with a dell laptop again. I could of paid slightly more and got a different manufacturer with better specifications and most likely none of these cooling and battery issues.\n\nSorry Dell, but this product is piss poor.\n\nEdit: ram dota2 as a test, can’t even get more than 30fps avg, 1080p max textures details. My desktop with Radeon RX5700XT and an old 6 core sandy bridgy CPU sits just below 200 avg\n\n30fps avg in an esports game isn’t playable.\n\nEdit2:  it sure what dell were targeting with its design, it can’t go anywhere without its charger very nearby. Poor gaming performance, terrible thermals. That leaves users with an always plugged laptop that only runs word processing applications and runs like a volcano doing it.\n\nEdit3: screen is 60hz. 2021 they release a mid range laptop with this? Dell are you high? Reason I bought it? It was 40% off. I almost got my boss one whilst awaiting shipping. Pretty glad I didn’t get my employer an absolute dud laptop, that seems like dell were trying to offload\n\nEdit4: finally. At work we run all dell emc servers. Lost a lot of faith on dell consumer, and as a whole if they are pulling this kind of crap I n 2021. We are due for a major upgrade, HPE looking much more convincing",
  "So good",
  "I would wonder why the GTX card if not gaming... I mean, the type of computing (ML, linear algebra) I use for work with an Nvidia card is more demanding than gaming.  If it can't handle gaming, then it can't handle a work setting that requires a GPU.  Otherwise, most workers don't need a dedicated GPU for work (with Word, browsing, etc).  Just puzzled, what's the point of providing a GPU that can't handle gaming.",
  "I have one, same specs as OP but regular 3050, not Ti. It has 2x m.2 slots. The OEM ssd is a very short m2 2230 drive. The other M2 slot can take a normal full length SSD. The short OEM 2230 ssd drive is in the longer m2 slot with a weird metal arm to anchor it to the screw down hole at the end. So if you buy one of these you need to move the OEM ssd to the other m2 slot, then stick your full length SSD in the m2 slot you just took the OEM out of.\n\nIt's easy, and already inside the case are the two heat sinks for SSDs. One small copper one for the OEM shorter 2230 ssd, and a full size heatsink for a normal m2 ssd. \n\nEdit: As per my reply to the other guy below, the battery life is absolute ass on this.",
  "I can run the new Diablo 2 resurrected/remaster on this at max graphics no problem, as long as it's plugged in. That game is a little heavier that you would expect on resources. My Ryzen 4800u with integrated graphics can only handle about low medium graphics. So this thing's pretty decent.\n\nDepending on what you're doing, keep in mind the **battery life is horrible** on this thing. I'm getting worse life than OP when just doing very basic light tasks. I get 3 1/2 to 4 hours max. This is with screen brightness low, no USB devices, the 3050 dGPU disabled, and just using a webbrowser. No gaming or streaming. I've done all manner of tests to squeeze out better battery life and have had not luck (OS reinstall clean, different drivers, setting max CPU usage to 30%, etc.). Dell support told me 4 hours is good battery life for this laptop and referred to the battery as a ***backup battery***.\n\nAlso, if you plan to dual boot to linux this thing won't sleep properly. You can set it to suspend, which defaults to s2idle and uses about 14% battery per hour. Manually modifying the system to deep sleep doesn't work properly, it will start to sleep, then spin up the fans and turn on the keyboard light. This is with Nvidia proprietary driver software and the dGPU off and iGPU on. After researching it, lot's of dell notebooks are doing thing. Dell's forums show things like \"this model doesn't support being set to suspend/sleep and put in a bookbag\".\n\nHopefully this info helps. I'm in the process of returning mine. It's a nice enough laptop, but averaging 3.5 hours of battery life from extremally light tasks with my mentioned battery saving attempts is bad, the linux sleep thing is bad too.\n\nIf you'll mostly be on AC power all day, you'll be fine. But if you're on battery it will not last. Gaming will kill the battery even faster, and it will lower its performance dropping the frame rate badly on battery.",
  "Hey I think your laptop may be broken or you are using it unplugged, because a 3050 usually runs dota 2 at around 120fps at the 65W. Do you run dota while plugged in? because it only uses the integrated intel graphics when unplugged which could explain the low fps.",
  "I ended up buying the Lenovo Legion 5i Pro with an RTX card, dual DIMM slots, and dual SSD slots.  It's a great laptop as long as you don't need battery life beyond 3-4 hours.  LOL",
  "Hey question, are you using windows 10 or 11? I know windows 11 has hit ALOT of laptops negatively in terms of battery life. I’ve heard some people getting up to 4 hours less than they would in windows 10.",
  "To tell the truth I didn’t run it more than a few hours on win10. I did find turning on battery saver made a difference, but it wasn’t major enough. I did also find apps like the brave browser automatically using the dGPU for no reason, setting windows to force it into the iGPU helped a bit.\n\nI did run manjero Linux and was getting batter battery life than when 11, but maybe just an extra 30 mins of light usage.\n\nOver all, I think the battery capacity (56Wh) is just a bit too low for something with an 11800h and dGPU. I tried buying an 86Wh battery from Dell before sending the Vostro back, but they don’t have them in stock.\n\nI moved to a Lenovo P1 G4. That has a 91wH battery, It’s easy to get 4.5-5 hours on that thing without effort.\n\nEdit: more info.",
  "Oh okay thank you for specifying more! Yeah brave turns on hardware acceleration by default for some reason. It’s quite annoying 😂 had a time I was wondering why my laptop fans were spooling up every time I opened brave and was always at a steady 10-30% usage.",
  "Yeah lol, I happened to be looking at task manager and noticed GPU_1 in use with just an empty downloads tab open. Need max power for that.\n\nOther than the battery life, I did really like that vostro."
]